[
   {
      "time": "2022-10-17",
      "title": "CISA Releases RedEye: Red Team Campaign Visualization and Reporting Tool | CISA",
      "text": " An official website of the United States governmentHere’s how you know\nOfficial websites use .gov\n A .gov website belongs to an official government organization in the United States.\n              \nSecure .gov websites use HTTPS\n A lock (LockA locked padlock) or https:// means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n              SearchCISA has released RedEye, an interactive open-source analytic tool to visualize and report Red Team command and control activities. RedEye allows an operator to quickly assess complex data, evaluate mitigation strategies, and enable effective decision making."
   },
   {
      "time": "2022-10-17",
      "title": "Police tricks DeadBolt ransomware out of 155 decryption keys",
      "text": " The Dutch National Police, in collaboration with cybersecurity firm Responders.NU, tricked the DeadBolt ransomware gang into handing over 155 decryption keys by faking ransom payments.After the ransom is paid, DeadBolt creates a bitcoin transaction to the same bitcoin ransom address containing a decryption key for the victim (the decryption key can be found under the transaction's OP_RETURN output).When the victim enters this key into the ransom note screen, it will be converted into a SHA256 hash and compared to the SHA256 hash of the victim's decryption key and the SHA256 hash of the DeadBolt master decryption key.If the decryption key matches one of the SHA256 hashes, the encrypted files on the NAS hard drives will get decrypted.\"So we made transactions with a minimum fee. And since we knew that the attacker would find out one moment, we had to smash and grab,\" Gevers said.\"The attacker found out within several minutes, but we were able to grab 155 keys. 90% of the victims who reported the deadbolt attack to the police. So most of them got the decryption key for free.When a victim makes a ransom payment to the DeadBolt operation, the operation automatically sends a decryption key when it detects the bitcoin transaction with the correct ransom amount.This tactic effectively allowed them to obtain the 155 decryption keys without paying anything more than the fees to send the transactions.Unfortunately, after realizing they were tricked and won't get paid, the DeadBold ransomware gang switched things up and now require double confirmation before releasing decryption keys.Responders.NU also created a platform (in collaboration with the Dutch Police and Europol) where DeadBolt victims who haven't filed a police report or couldn't be identified can check if their decryption key is among the ones obtained from the ransomware gang. "
   },
   {
      "time": "2022-10-17",
      "title": "Microsoft: New Prestige ransomware targets orgs in Ukraine, Poland",
      "text": " Microsoft says new Prestige ransomware is being used to target transportation and logistics organizations in Ukraine and Poland in ongoing attacks.This new ransomware was first used in the wild on October 11, in attacks detected within an hour of each other.Attackers were seen deploying the ransomware payloads across their victims' enterprise networks, a tactic very rarely seen in attacks targeting Ukrainian organizations.\"The activity shares victimology with recent Russian state-aligned activity, specifically on affected geographies and countries, and overlaps with previous victims of the FoxBlade malware (also known as HermeticWiper),\" the Microsoft Threat Intelligence Center (MSTIC) said.\"This activity was not connected to any of the 94 currently active ransomware activity groups that Microsoft tracks. The Prestige ransomware had not been observed by Microsoft prior to this deployment,\" MSTIC added.At the moment, Microsoft is yet to link the Prestige ransomware attacks to a specific threat actor and is temporarily tracking this activity cluster as DEV-0960.Redmond is working on notifying all customers who have been compromised and had their systems encrypted with this ransomware. The threat group behind these ransomware attacks uses several methods to deploy the payloads across the victims' networks, even though this technique switch is not necessarily prompted by security measures taken by defenders to block them.In the report, MSTIC highlights the following three methods used for Prestige ransomware deployment:Once deployed, Prestige ransomware payloads will drop ransom notes named \"README.txt\" in the root directory of each drive it encrypts.It encrypts files based on extensions matching a predefined list and adds the .enc extension at the end of the files' names after encryption.It uses the CryptoPP C++ library to AES-encrypt each matching file on compromised systems, and it will delete the backup catalog and all volume shadow copies to hinder recovery efforts."
   },
   {
      "time": "2022-10-17",
      "title": "Five Suspects Charged for $2.5 million Worth NFTs Theft,  Targeting Bored Ape NFT Owners - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-17",
      "title": "Venus Ransomware targets publicly exposed Remote Desktop services",
      "text": " Threat actors behind the relatively new Venus Ransomware are hacking into publicly-exposed Remote Desktop services to encrypt Windows devices.Venus Ransomware appears to have begun operating in the middle of August 2022 and has since encrypted victims worldwide. However, there was another ransomware using the same encrypted file extension since 2021, but it is unclear if they are related.Linuxct told BleepingComputer that the threat actors gained access to a victim's corporate network through the Windows Remote Desktop protocol.When executed, the Venus ransomware will attempt to terminate thirty-nine processes associated with database servers and Microsoft Office applications.The ransomware will also delete event logs, Shadow Copy Volumes, and disable Data Execution Prevention using the following command:When encrypting files, the ransomware will append the .venus extension, as shown below. For example, a file called test.jpg would be encrypted and renamed test.jpg.venus.In each encrypted file, the ransomware will add a 'goodgamer' filemarker and other information to the end of the file. It is unclear what this additional information is at this time.The ransomware will create an HTA ransom note in the %Temp% folder that will automatically be displayed when the ransomware is finished encrypting the device.As you can see below, this ransomware calls itself \"Venus\" and shares a TOX address and email address that can be used to contact the attacker to negotiate a ransom payment. At the end of the ransom note is a base64 encoded blob, which is likely the encrypted decryption key.At this time, the Venus ransomware is fairly active, with new submissions uploaded to ID Ransomware daily.As the ransomware appears to be targeting publicly-exposed Remote Desktop services, even those running on non-standard TCP ports, it is vital to put these services behind a firewall.Ideally, no Remote Desktop Services should be publicly exposed on the Internet and only be accessible via a VPN"
   },
   {
      "time": "2022-10-17",
      "title": "UK Issued New Cybersecurity Guidelines on Emerging Supply Chain Attacks - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-10-17",
      "title": "New PHP information-stealing malware targets Facebook accounts",
      "text": " A new Ducktail phishing campaign is spreading a never-before-seen Windows information-stealing malware written in PHP used to steal Facebook accounts, browser data, and cryptocurrency wallets.Those campaigns relied on social engineering attacks through LinkedIn, pushing .NET Core malware masquerading as a PDF document supposedly containing details about a marketing project.Ducktail has now replaced the older NET Core information-stealing malware used in previous campaigns with one written in PHP.Most of the fake lures for this campaign are related to games, subtitle files, adult videos, and cracked MS Office applications. These are hosted in ZIP format on legitimate file hosting services.When executed, the installation takes place in the background while the victim sees fake 'Checking Application Compatibility' pop-ups in the frontend, waiting for a fake application sent by the scammers to install.The malware will ultimately be extracted to the %LocalAppData%\\Packages\\PXT folder, which includes the PHP.exe local interpreter, various scripts used to steal information, and supporting tools, as shown below.The PHP malware achieves persistence by adding scheduled tasks on the host to execute daily and at regular intervals. At the same time, a generated TMP file runs a parallel process to launch the stealer component.The stealer's code is an obfuscated (Base64) PHP script, which is deciphered directly on memory without touching the disk, minimizing the chances of being detected.The targeted data includes extensive Facebook account details, sensitive data stored in browsers, browser cookies, cryptocurrency wallet and account information, and basic system data.The collected information isn't exfiltrated to Telegram anymore but instead stored in a JSON website that also hosts account tokens and data required to perform on-device fraud.In the previous campaign, Ducktail targeted employees of organizations working in the financial or marketing department of companies who would likely have permission to create and run advertising campaigns on the social media platform.The goal was to take control of those accounts and direct payments to their bank accounts or run their own Facebook campaigns to promote Ducktail to more victims.In the latest campaign, however, Zscaler noticed that the targeting scope has been broadened to include regular Facebook users and to siphon whatever valuable information they may have stored in their accounts.Still, if the account type is determined to be a business account, the malware will attempt to fetch additional information about payment methods, cycles, amounts spent, owner details, verification status, owned pages, PayPal address, and more.Ducktail's evolution and attempt to evade subsequent monitoring by security researchers indicates that the threat actors aim to continue their profitable operations.Users are advised to be watchful with instant messages on LinkedIn and treat file download requests with extra caution, especially cracked software, game mods, and cheats."
   },
   {
      "time": "2022-10-17",
      "title": "Over 45,000 VMware ESXi servers just reached end-of-life",
      "text": " Over 45,000 VMware ESXi servers inventoried by Lansweeper just reached end-of-life (EOL), with VMware no longer providing software and security updates unless companies purchase an extended support contract.Lansweeper develops asset management and discovery software that allows customers to track what hardware and software they are running on their network.As of October 15, 2022, VMware ESXi 6.5 and VMware ESXi 6.7 reached end-of-life and will only receive technical support but no security updates, putting the software at risk of vulnerabilities.The company analyzed data from 6,000 customers and found 79,000 installed VMware ESXi servers.Of those servers, 36.5% (28,835) run version 6.7.0, released in April 2018, and 21.3% (16,830) are on version 6.5.0, released in November 2016. In total, there are 45,654 VMware ESXi servers reaching End of Life as of todayThe findings of Lansweeper are alarming because apart from the 57% that enter a period of elevated risk, there are also another 15.8% installations that run even older versions, ranging from 3.5.0 to 5.5.0, which reached EOL quite some time ago.In summary, right now, only about one out of four ESXi servers (26.4%) inventoried by Lansweeper are still supported and will continue to receive regular security updates until April 02, 2025.However, in reality, the number of VMware servers reaching EOL today, is likely far greater, as this report is based only on Lansweeper's customers.The technical guidance for ESXi 6.5 and 6.7 will carry on until November 15, 2023, but this concerns implementation issues, not including security risk mitigation.The only way to ensure you can continue to use older versions securely is to apply for the two-year extended support, which needs to be purchased separately. However, this does not include updates for third-party software packages.When a software product reaches the end-of-life date, it stops receiving regular security updates. This means that admins should have already planned ahead and upgraded all deployments to a newer release.While it’s not unlikely that VMware will still offer some critical security patches for these older versions, it’s not guaranteed and certainly won’t release patches for all new vulnerabilities that are discovered.Once an unsupported ESXi server has carried on for long enough without patches, it will have accumulated so many security vulnerabilities that attackers would have multiple ways to breach it.Due to ESXi hosting virtual machines, attacking the server can potentially cause severe and wide-scale disruption to business operations, which is why ransomware gangs are so focused on targeting it.All that said, ESXi already enjoys ample attention from threat actors, so running outdated and vulnerable versions of the software would no doubt be a terrible idea."
   },
   {
      "time": "2022-10-17",
      "title": "Mainframes are Still Used in 9 Out of 10 Banks, Google Cloud Wishes to Mitigate  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-17",
      "title": "Indian Energy Company Tata Power's IT Infrastructure Hit By Cyber Attack",
      "text": " Tata Power Company Limited, India's largest integrated power company, on Friday confirmed it was targeted by a cyber attack.It further said it has taken steps to retrieve and restore the affected machines, adding it put in place security guardrails for customer-facing portals to prevent unauthorized access.The Mumbai-based electric utility company, part of the Tata Group conglomerate, did not disclose any further details about the nature of the attack, or when it took place.The network intrusions were said to have been aimed at \"at least seven Indian State Load Despatch Centres (SLDCs) responsible for carrying out real-time operations for grid control and electricity dispatch within these respective states.\"The attacks were attributed to an emerging threat cluster Recorded Future is tracking under the name Threat Activity Group 38 (TAG-38).The company further assessed that the targeting is intended to facilitate information gathering related to critical infrastructure assets or is likely a precursor for future activities.China refuted the allegations that it was involved, stating \"many of U.S. allies or countries with which it cooperates on cybersecurity are also victims of U.S. cyber attacks.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]