[
   {
      "time": "2022-09-14",
      "title": "Breach of software maker used to backdoor ecommerce servers | Ars Technica",
      "text": " Front page layoutSite themeFishPig, a UK-based maker of e-commerce software used by as many as 200,000 websites, is urging customers to reinstall or update all existing program extensions after discovering a security breach of its distribution server that allowed criminals to surreptitiously backdoor customer systems.\"We are still investigating how the attacker accessed our systems and are not currently sure whether it was via a server exploit or an application exploit,\" Ben Tideswell, the lead developer at FishPig, wrote in an email. \"As for the attack itself, we are quite used to seeing automated exploits of applications and perhaps that is how the attackers initially gained access to our system. Once inside though, they must have taken a manual approach to select where and how to place their exploit.\"FishPig is a seller of Magento-WordPress integrations. Magento is an open source e-commerce platform used for developing online marketplaces. The supply-chain attack only affects paid Magento 2 modules./usr/sbin/cron -f\n/sbin/udevd -d\ncrond\nauditd\n/usr/sbin/rsyslogd\n/usr/sbin/atd\n/usr/sbin/acpid\ndbus-daemon --system\n/sbin/init\n/usr/sbin/chronyd\n/usr/libexec/postfix/master\n/usr/lib/packagekit/packagekitdThe backdoor then waits for commands from a server located at 46.183.217.2. Sansec said it hadn't detected follow-up abuse from the server yet. The security firm suspects that the threat actors may plan to sell access to the affected stores in bulk on hacking forums.In the email, Tideswell added:The exploit was placed right before the code was encrypted. By placing the malicious code here, it would be instantly obfuscated by our systems and hidden from anyone who looked. If any client then enquired about the obfuscated file, we would reassure them that the file was supposed to be obfuscated and was safe. The file was then undetectable by malware scanners.This is a custom system that we developed. The attackers couldn't have researched this online to find out about it. Once inside, they must have reviewed the code and made a decision about where to deploy their attack. They chose well.This has all been cleaned up now and multiple new defences have been installed to stop this from happening again. We are currently in the process of rebuilding our entire website and code deployment systems anyway and the new systems we already have in place (which aren't live yet) already have defenses against attacks like this.Both Sansec and FishPig said customers should assume that all modules or extensions are infected. FishPig recommends users immediately upgrade all FishPig modules or reinstall them from source to ensure none of the infected code remains. Specific steps include:Run the command below and then restart your server.Sansec advised customers to temporarily disable any paid FishPig extensions, run a server-side malware scanner to detect any installed malware or unauthorized activity, and then restart the server to terminate any unauthorized background processes.The headline of this post has been changed."
   },
   {
      "time": "2022-09-14",
      "title": "Hackers now use ‘sock puppets’ for more realistic phishing attacks",
      "text": " An Iranian-aligned hacking group uses a new, elaborate phishing technique where they use multiple personas and email accounts to lure targets into thinking its a realistic email conversation.The attackers send an email to targets while CCing another email address under their control and then respond from that email, engaging in a fake conversation.Named 'multi-persona impersonation' (MPI) by researchers at Proofpoint who noticed it for the first time, the technique leverages the psychology principle of \"social proof\" to obscure logical thinking and add an element of trustworthiness to the phishing threads.However, the extra effort pays off, as it creates a realistic-looking exchange of emails, which makes the conversation look legitimate.The next day, the impersonated PEW director answered the questions sent by the FRPI director, creating a false sense of an honest conversation that would be enticing for the target to join.In another case seen by Proofpoint, involving scientists specializing in genome research, the CCed persona replied with a OneDrive link that led to downloading a DOCX document laced with malicious macros.In a third MPI phishing attack launched by TA453 against two academics specializing in nuclear arms control, the threat actors CCed three personas, going for an even more intricate attack.In all cases, the threat actors used personal email addresses (Gmail, Outlook, AOL, Hotmail) for both the senders and the CCed persons instead of addresses from the impersonated institutions, which is a clear sign of suspicious activity.The documents that targets were tricked into downloading via OneDrive links in TA453's recent campaign are password-protected files that perform template injection.\"The downloaded template, dubbed Korg by Proofpoint, has three macros: Module1.bas, Module2.bas, and ThisDocument.cls,\" details the report.\"The macros collect information such as username, list of running processes along with the user's public IP from my-ip.io and then exfiltrates that information using the Telegram API.\"The researchers couldn't get past the reconnaissance information beaconing stage but assumed that additional exploitation occurs in subsequent steps to give the remote threat actors code execution capabilities on the hosts."
   },
   {
      "time": "2022-09-14",
      "title": "Buenos Aires legislature announces ransomware attack",
      "text": " The legislature of Argentina’s capital city announced a ransomware attack this week, saying that its internal operating systems were compromised and WiFi connectivity was down. In several tweets, the account for the legislature of Buenos Aires said the attack began on Sunday and took down the building’s WiFi network, among other systems. \"Necessary measures were quickly taken to ensure continuity of work and not to interrupt parliamentary work,” they wrote. On Tuesday, they said, they planned to restore the WiFi network and slowly bring other systems back online.“We are working with the areas involved and with specialists in the field to restore normality to all processes as soon as possible,” the legislature said.The incident has already been reported to several law enforcement agencies in Argentina.Mañana ya estará operativa la red de wi fi y se irán habilitando progresivamente el resto de los sistemas. Estamos trabajando con las áreas involucradas y con especialistas en la materia para restablecer la normalidad de todos los procesos lo antes posible.The legislature’s website is still down as of Tuesday afternoon EST. The affected government agencies did not respond to requests for comment about the state of the restoration effort.No ransomware group has taken credit for the incident, but several gangs have targeted governments across Central and South America over the past year.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-14",
      "title": "Microsoft September 2022 Patch Tuesday fixes zero-day used in attacks, 63 flaws",
      "text": " Today is Microsoft's September 2022 Patch Tuesday, and with it comes fixes for an actively exploited Windows vulnerability and a total of 63 flaws.Five of the 63 vulnerabilities fixed in today's update are classified as 'Critical' as they allow remote code execution, one of the most severe types of vulnerabilities.The number of bugs in each vulnerability category is listed below:The above counts do not include sixteen vulnerabilities fixed in Microsoft Edge before Patch Tuesday.This month's Patch Tuesday fixes two publicly disclosed zero-day vulnerabilities, with one actively exploited in attacks.Microsoft classifies a vulnerability as a zero-day if it is publicly disclosed or actively exploited with no official fix available.\"An attacker who successfully exploited this vulnerability could gain SYSTEM privileges,\" reads Microsoft's advisory.The exploited vulnerability was discovered by researchers at DBAPPSecurity, Mandiant, CrowdStrike, and Zscaler.Mandiant told BleepingComputer that they discovered the zero-day during a proactive Offensive Task Force exploit hunting mission.“We found this 0Day bug during a proactive Offensive Task Force exploit hunting mission. An escalation of privilege (EOP) exploit was found in the wild, exploiting this Common Log File System (CLFS) vulnerability,” explained Dhanesh Kizhakkinan, Senior Principal Vulnerability Engineer at Mandiant.\"The exploit seems to stand-alone and not part of a chain (like browser + EOP).”Other vendors who released updates in September 2022 include:"
   },
   {
      "time": "2022-09-14",
      "title": "PSA: Zero-Day Vulnerability in WPGateway Actively Exploited in the Wild",
      "text": " Sites still running the free version of Wordfence will receive the same protection 30 days later, on October 8, 2022. The Wordfence firewall has successfully blocked over 4.6 million attacks targeting this vulnerability against more than 280,000 sites in the past 30 days.The WPGateway plugin is a premium plugin tied to the WPGateway cloud service, which offers its users a way to setup and manage WordPress sites from a single dashboard. Part of the plugin functionality exposes a vulnerability that allows unauthenticated attackers to insert a malicious administrator.As this is an actively exploited zero-day vulnerability, and attackers are already aware of the mechanism required to exploit it, we are releasing this public service announcement (PSA) to all of our users. We are intentionally withholding certain details to prevent further exploitation. As a reminder, an attacker with administrator privileges has effectively achieved a complete site takeover.If you are working to determine whether a site has been compromised using this vulnerability, the most common indicator of compromise is a malicious administrator with the username of rangex. If you see this user added to your dashboard, it means that your site has been compromised.Additionally, you can check your site’s access logs for requests to //wp-content/plugins/wpgateway/wpgateway-webservice-new.php?wp_new_credentials=1If these requests are present in your logs, they indicate that your site has been attacked using an exploit targeting this vulnerability, but do not necessarily indicate that it has been successfully compromised.In today’s post, we detailed a zero-day vulnerability being actively exploited in the WPGateway plugin.If you have the WPGateway plugin installed, we urge you to remove it immediately until a patch is made available and to check for malicious administrator users in your WordPress dashboard.If you know a friend or colleague who is using this plugin on their site, we highly recommend forwarding this advisory to them to help keep their sites protected, as this is a serious vulnerability that is actively being exploited in the wild. Please help make the WordPress community aware of this issue.Our investigation is ongoing, and we will provide more information in an additional blog post when it becomes available.Special thanks to Threat Intelligence Lead Chloe Chamberland for spotting this exploit in the wild.Did you enjoy this post? Share it!These Cookies are necessary for the Sites and Services to work properly. They include any essential authentication and authorization cookies for the Services.* Cookies of this category are necessary for the site to function and cannot be disabled.These Cookies allow us to collect certain information about how you navigate the Sites or utilize the Services running on your device. They help us understand which areas you use and what we can do to improve them.These Cookies are used to deliver relevant information related to the Services to an identified machine or other device (not a named or otherwise identifiable person) which has previously been used to visit our Sites. Some of these types of Cookies on our Sites are operated by third parties with our permission and are used to identify advertising sources that are effectively driving customers to our Sites."
   },
   {
      "time": "2022-09-14",
      "title": "Tax fraud ring leader jailed for selling children’s stolen identities",
      "text": " The owner of a fraudulent tax preparation business, Ariel Jimenez, was sentenced to 12 years in prison for selling the stolen identities of thousands of children on welfare and helping \"customers\" to falsely claim tax credits, causing tens of millions of dollars in tax loss.His \"customers\" used the stolen identity info (names, dates of birth, and social security numbers) to add the children fraudulently as dependents on their tax returns so they would get a refund when they filed their taxes.Jimenez founded the business behind this tax fraud scheme and identity theft conspiracy in 2007 in Bronx, New York.With the help of his co-conspirators, he began selling the identities of hundreds of vulnerable minors (stolen by a New York City's Human Resources Administration fraud investigator) to thousands of people profiting from this scheme.NYC's HRA is a government department tasked with fighting poverty by providing food and emergency rental assistance to New Yorkers in need.\"The investigation by IRS-CI has revealed that the defendants engaged in large-scale identity theft and tax fraud schemes through which (a) identifying information of minors, including names, dates of birth, and SSNs, was obtained, including through payments to a corrupt New York City employee.\"The defendant's operation charged a cash fee, on top of tax preparation charges, to\" prepare and file tax returns that falsely claimed that the individual taxpayer had one or more minor dependents, to take fraudulent advantage of at least one tax credit, thereby inflating the refund paid to the taxpayer.\"The defendant more than $1 million in some years by selling more than a thousand children's stolen identities he referred to as \"pollitos,\" meaning \"little chickens.\"He also made hundreds of thousands of dollars by preparing fraudulent tax returns for his customers. Millions of these funds were used to buy worldwide real estate, cars, jewelry, or gambling.\"In some cases, the people actually taking care of these children had much-needed tax refunds delayed and were required to prove their actual connection to their own dependent children.\"He was sentenced to 12 years in prison on Monday, ordered to forfeit several Bronx real-estate properties and $14,580,000, and ordered to pay restitution for $44,769,906.\"Ariel Jimenez's tax and identity theft crimes cruelly forced his victims to endure bureaucratic snafus and agonizing delays for their much-needed tax refunds,\" U.S. Attorney Damian Williams said in February.\"Today's sentence holds Jimenez accountable for brazenly selling the identities of children to his customers for his own profit,\" Williams added today."
   },
   {
      "time": "2022-09-14",
      "title": "Documents of Indonesian President Allegedly Leaked on the BreachForums Page  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-09-14",
      "title": "Pro-Ukraine hackers claim attack on Russian TV broadcasts",
      "text": " Pro-Ukrainian hackers on Sunday took credit for breaching Russian TV channels and broadcasting anti-war messages comparing Russia’s attack on Ukraine to the September 11 terrorist attacks in New York. The hacked broadcast over the weekend showed footage of Russian attacks on Ukrainian cities and excerpts from interviews with Ukrainian President Volodymyr Zelensky and other world leaders condemning Russia for the violence in Ukraine.“Once the world saw the face of terrorism but did not recognize its real owner,” the message said. “The world was looking for it in Afghanistan, Iraq… but the terrorist was initially located in Moscow.”“They [Russians] are finally seeing the truth, whether they like it or not.”In June, hackers attacked the Ukrainian streaming service Oll.tv and replaced the broadcast of a football match between Ukraine and Wales with Russian propaganda. In February, Ukraine’s national public broadcaster suffered a distributed denial-of-service attack, according to its general producer Dmytro Khorkin. “Russia has been attacking us all the time since the beginning of the war in Ukraine,” he told The Record in an interview following the incident.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-14",
      "title": "Attackers Compromise Employee Data at PVC-Maker Eurocell - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-09-14",
      "title": "Iranian military using spoofed personas to target nuclear security researchers",
      "text": " Hackers connected to Iran’s Islamic Revolutionary Guard Corps are allegedly using multiple personas in phishing emails to target organizations and people with information on Israel and several Gulf States, the Abraham Accords, and nuclear arms control, according to new research.A report published Tuesday from cybersecurity firm Proofpoint tied the campaign to Iranian state-sponsored threat actor TA453, which is also known to researchers as Charming Kitten, PHOSPHORUS and APT42.The group is using spoofed email addresses from real individuals working at the PEW Research Center, the Foreign Policy Research Institute, the UK’s Chatham House and the scientific journal Nature in spear-phishing attacks that feature emails with multiple fake personas.The multi-person email threads are meant to make the phishing emails seem more legitimate, Proofpoint researchers explained, calling the tactic “Multi-Persona Impersonation.”“State-aligned threat actors are some of the best at crafting well thought-out social engineering campaigns to reach their intended victims,” said Sherrod DeGrippo, vice president of threat research and detection at Proofpoint. “In this case, our researchers have seen the Iran-aligned TA453 actor step up its game by using Multi-Persona Impersonation — capitalizing on social proof to get their target to buy into their cons.”DeGrippo added that the technique is intriguing because it requires more resources to be used per target and may involve potentially burning more personas.The tactic also requires a more coordinated approach among the various personalities in use by TA453, DeGrippo said. The researchers shared multiple examples of the group purporting to be a journalist or policy adjacent individual interested in collaborating with the target of the campaign. “In this first campaign, TA453 started the conversation masquerading as ‘Aaron Stein, Director of Research at FRPI.’ The actor included a variety of questions intended to generate a dialogue about Israel, the Gulf States, and the Abraham Accords,” the researchers explained.  “While these questions are generally meant to establish a pretext for sending a follow-up credential harvesting link or to deliver a malicious document, it is also possible they represent intelligence questions tasked to TA453. In the email, TA453’s ‘Aaron Stein’ launched the threat actor’s use of Multi-Persona Impersonation (MPI) by referring to and including a ‘Richard Wilke, director of global attitudes research at PEW Research Center’ on the CC line.”The fake “Richard Wilke” account responded to the first email in an attempt to make the email chain seem legitimate. Proofpoint found another email in the campaign targeting someone involved in genome research using three different hacker-controlled accounts. When the target replied to the email, the hackers sent a OneDrive link that downloaded a malicious Word doc. Another email targeted a prominent academic involved in nuclear arms control about a “possible U.S. versus Russia clash” using a fake persona. Proofpoint said this email represented an evolution in the tactic because the hackers CC’d other targets that worked at the same university. When the target responded, they were sent a malicious document titled “The possible US-Russia clash.docx.\"The group is already creating variations of the same tactic, now sending blank emails to targets before sending follow-up emails apologizing for the blank message and CCing other compromised identities. DeGrippo said researchers involved in international security, particularly those specializing in Middle Eastern studies or nuclear security, should maintain a heightened sense of awareness when receiving unsolicited emails. “For example, experts that are approached by journalists should check the publication’s website to see if the email address belongs to a legitimate reporter,\" DeGrippo added. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   }
]