[
   {
      "time": "2022-10-18",
      "title": "European gang that sold car hacking tools to thieves arrested",
      "text": " Police have arrested 31 members of an organized crime group in Europe that sold technology allowing thieves to hack and steal keyless entry cars.The arrests include the software developers behind the tools, as well as resellers and the car thieves who used them on the street, according to Europol.France’s gendarmerie, which led the investigation, said the organization had designed and marketed its equipment as an “automotive diagnostic solution,” but was actually intending it to be used by criminals.Investigators said the package sold by the criminals included a tablet, connectors, and software.Raids in 22 locations across Europe last week led to the seizure of this equipment, alongside more than €1,098,000 (about $1.08 million) in criminal assets and dozens of blank vehicle keys.Europol said that the criminals targeted keyless vehicles from two unnamed French car manufacturers.The hacking techniques suggested by the gendarmerie appear to be significantly more sophisticated than the relay thefts which have targeted keyless entry drivers elsewhere. In those thefts, criminals use an amplifier to find the keyfob's signal and relay it to the car. Europol said this gang’s equipment allowed thieves to remotely “replace the original software of the vehicles, allowing the doors to be opened and the ignition to be started without the actual key fob.”The gendarmerie said that an unidentified website selling the equipment has been taken down. According to authorities, it was hosted in France and was connected to several businesses registered in the country.In its statement, the gendarmerie said its investigation uncovered “53,000 connexions,” or connections, to the sales site, and suspects that each of these may correspond to a car theft or an attempt to reprogram keys.The force stated that the criminal enterprise was supported by a network of ten resellers and more than 200 users throughout the country, including in Paris, Marseille, Lyons and Lille, where raids also took place. Alongside the criminal assets, a Lithuanian and a Spanish national were arrested.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-18",
      "title": "Researchers: Wikipedia a front in Russian propaganda war",
      "text": " The analysis, from the Institute for Strategic Dialogue (ISD) and the Centre of the Analysis of Social Media (CSAM) in the U.K., could help develop systems that can detect platform manipulation on one of the world’s most popular websites.Carl Miller, one of the paper's authors, stressed that the research wasn't a smoking gun for state-linked manipulation. \"We haven't attributed suspicious editing activity directly to the Russian state. We were never going to be able to do that,” he said. “The idea was to try to characterize behavior already known to be suspicious to see whether — in time — we can use this as signals for undetected suspicious activity.\"The ISD/CSAM analysis focused on 86 accounts that had been editing the Russo-Ukrainian war page, which were subsequently banned by Wikipedia for violating its rules, including for being operated as “sock-puppet” accounts used to disguise who their real operator was.Although the research \"did not set out to identify unknown suspicious activity, but rather to understand and describe activity that was already known to be suspicious,\" the manipulation of Wikipedia they detailed has not been widely reported and suggests the platform could potentially be exploited similarly to social media platforms.The editors the analysis focused on were behind 681 edits to the page. Miller said the researchers identified 16 links to state-sponsored media introduced by those edits, and acknowledged this was \"probably not the best way of identifying suspicious edits.\" So the researchers then began to analyze each of the edits manually.The manual analysis found the edits exhibited “narratives consistent with Kremlin-sponsored information warfare” and cast doubt on the objectivity of pro-Western narratives while maximizing the objectivity of pro-Kremlin accounts.The edited material also supported Kremlin descriptions of ongoing situations, including introducing historical narratives about the ousting of former Ukrainian president Viktor Yanukovych — an incident preceded by his refusal to sign an association agreement with the European Union and then shortly followed by Russia’s military annexation of Crimea.Other edits added “Kremlin quotations and press releases explicitly into the page to increase the salience of pro-Russian arguments and viewpoints,” the authors wrote.The researchers said their aim was to examine the ways in which Wikipedia could be vulnerable to the same kinds of manipulation that have targeted other social media platforms, including Facebook, Twitter, YouTube and Reddit.“Wikipedia has been famously resilient to vandalism. All edits are open, vandalism can be rolled back quickly, pages can be locked and protected, and the site is patrolled by a combination of bots and editors,” the study states.Describing itself as “a short contribution to the discussions around the threats posed by information warfare” the paper says one question remains: “How vulnerable is Wikipedia to information warfare which might use subtler methodologies and be executed over longer lengths of time?”Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-18",
      "title": "Malware dev claims to sell new BlackLotus Windows UEFI bootkit",
      "text": " A threat actor is selling on hacking forums what they claim to be a new UEFI bootkit named BlackLotus, a malicious tool with capabilities usually linked to state-backed threat groups.UEFI bootkits are planted in the system firmware and are invisible to security software running within the operating system because the malware loads in the initial stage of the booting sequence.While cybercriminals who want a license for this Windows bootkit have to pay $5,000, the threat actor says rebuilds would only set them back $200. The seller says BlackLotus features integrated Secure Boot bypass, has built-in Ring0/Kernel protection against removal, and will start in recovery or safe mode.BlackLotus claims to come with anti-virtual machine (anti-VM), anti-debug, and code obfuscation features to block malware analysis attempts. The seller also claims that security software cannot detect and kill the bootkit as it runs under the SYSTEM account within a legitimate process.Even more, this tiny bootkit with a size of only 80 kb on disk after installation can disable built-in Windows security protection such as Hypervisor-Protected Code Integrity (HVCI) and Windows Defender and bypass User Account Control (UAC).\"The software itself and the Secure Boot bypass work vendor independent. A vulnerable signed bootloader is used to load the bootkit if Secure Boot is used,\" the threat actor explained when a potential \"customer\" asked if it would work with a particular firmware.\"Patching this vulnerability by adding it to the UEFI revocation list is currently impossible, as the vulnerability affects hundreds of bootloaders that are still used today.\"​Kaspersky lead security researcher Sergey Lozhkin also spotted BlackLotus being advertised on criminal forums and warned that this is a significant move since this type of capability has commonly been available only to state-sponsored hacking groups.Other security analysts tagged BlackLotus' wide availability for any cybercriminal with deep enough pockets as a leap toward wider availability of APT-level capabilities in off-the-shelf malware.\"Considering this tradecraft used to be relegated to APTs like the Russian GRU and APT 41 (China nexus), and considering prior criminal discoveries we've made (e.g. Trickbot's Trickboot module), this represents a bit of a 'leap' forward, in terms of ease of use, scalability, accessibility and most importantly, the potential for much more impact in the forms of persistence, evasion and/or destruction.\"However, Scheferman said that until a sample is found, there is no way to determine if the feature-set is complete or if it is even production ready.\"It should be noted, too, that until we or someone obtains a sample of this malware and runs it on a close-to-production box in a lab, there is always the chance it isn't ready for show time yet, or certain aspects of its features aren't working right, or even the chance the entire thing is a scam,\" he added.If confirmed, this would be a worrying trend seeing that BlackLotus can also be used to load unsigned drivers that could be used in Bring Your Own Driver (BYOVD) attacks."
   },
   {
      "time": "2022-10-18",
      "title": "MyDeal data breach impacts 2.2M users, stolen data for sale online",
      "text": " Woolworths' MyDeal subsidiary has disclosed a data breach affecting 2.2 million customers, with the hacker trying to sell the stolen data on a hacker forum.MyDeal is an Australian retail marketplace that connects online shoppers with local retailers.Retail giant Woolworths purchased 80% of the company in September but said their systems are on a completely different platform and unaffected by the incident.Last Friday, MyDeal stated that it suffered a breach after a hacker used compromised user credentials to access the company's Customer Relationship Management (CRM) system, allowing the threat actor to view and export customer information.The company says that 2.2 million customers were impacted by the data breach, with information such as names, email addresses, phone numbers, delivery addresses, and in some cases, birth dates exposed in the attack.For 1.2 million customers, only the email addresses were exposed in the breach.However, MyDeal states that no payment information, government IDs, or account passwords were exposed.MyDeal has already begun to send data breach notifications to affected customers and say that customers who do not receive one were not affected.On Sunday, the hacker behind the MyDeal breach began selling the stolen data on a hacking forum for $600.The hacker claims that the data currently consists of 1 million entries but that the number of exposed customers will increase as they finish parsing the database.As proof of their attack, the threat actor released screenshots of what they claim are the company's Confluence server and a single-sign-on prompt for the company's AWS account.Today, the threat actor released samples of the stolen data, exposing the personal information of 286 alleged MyDeal customers.While MyDeal said that no passwords were exposed in the attack, it is suggested that you err on the side of caution and reset your passwords anyway.As it is common for threat actors to purchase stolen data to use in their own attacks, all MyDeal customers should also be on the lookout for targeted phishing attacks."
   },
   {
      "time": "2022-10-18",
      "title": "Australian insurance firm Medibank confirms ransomware attack",
      "text": " Health insurance provider Medibank has confirmed that a ransomware attack is responsible for last week's cyberattack and disruption of online services.Medibank Private Limited is one of Australia's largest private health insurance providers, covering over 3.7 million people and having 4,000 employees.In a new statement by the company, CEO David Koczkar apologized for the temporary service outage, confirmed they suffered a ransomware attack, and informed customers that normal operations have resumed.\"Our ongoing investigation has found the unusual activity we detected in part of our IT network was consistent with a possible ransomware threat,\" details the statement.While Koczkar states that the company suffered a ransomware attack, they claim that no systems were encrypted during the attack. Furthermore, while they continue to investigate the incident, no evidence has been uncovered that customer data has been stolen by the attackers.The company first detected unusual activity on its network on Wednesday, October 12, and immediately shut down parts of its systems, including customer-facing services, to reduce the chances of data loss.On Friday, Medibank sent out approximately 2.8 million emails and SMS to notify its customers about the security incident and provide an explanation for the outages.The notices provided the first assurances about the safety of sensitive private data but underlined that the investigation was still ongoing.Today's announcement hasn't changed anything on that front, so both customer data and IT system integrity appear unaffected by the cyberattack.Australia has had several high-profile cybersecurity incidents in the past couple of weeks, including:"
   },
   {
      "time": "2022-10-18",
      "title": "Windows Mark of the Web bypass zero-day gets unofficial patch",
      "text": " A free unofficial patch has been released through the 0patch platform to address an actively exploited zero-day flaw in the Windows Mark of the Web (MotW) security mechanism.This flaw enables attackers to prevent Windows from applying (MotW) labels on files extracted from ZIP archives downloaded from the Internet.Windows automatically adds MotW flags to all documents and executables downloaded from untrusted sources, including files extracted from downloaded ZIP archives, using a special 'Zone.Id' alternate data stream.These MotW labels tell Windows, Microsoft Office, web browsers, and other apps that the file should be treated with suspicion and will cause warnings to be displayed to the user that opening the files could lead to dangerous behavior, such as malware being installed on the device. \"An attacker could deliver Word or Excel files in a downloaded ZIP that would not have their macros blocked due to the absence of the MOTW (depending on Office macro security settings), or would escape the inspection by Smart App Control.\"There’s samples going back at least 10 months. Probably longer but i didn’t look back furtherUntil Microsoft releases official updates to address the flaw, 0patch has developed free patches for the following affected Windows versions:They will be applied automatically after launching the agent without requiring a system restart if there are no custom patching policies to block it.You can see 0patch's Windows micropatches in action in the video below."
   },
   {
      "time": "2022-10-18",
      "title": "OpenAI : Students are Using AI Tools to Write Paper for Them - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-18",
      "title": "Ransomware attack halts circulation of some German newspapers",
      "text": " German newspaper ‘Heilbronn Stimme’ published today’s 28-page issue in e-paper form after a Friday ransomware attack crippled its printing systems.On Saturday, the newspaper issued an “emergency” six-page edition while all planned obituaries were posted on the website. Phone and email communication remained offline during the weekend.The regional publication has a circulation of about 75,000 copies, but due to printing issues has temporarily lifted the paywall from its website, which counts approximately 2 million visitors per month.Editor-in-chief Uwe Ralf Heer said that the attack impacted the entire Stimme Mediengruppe media group, which includes the companies ‘Pressedruck’, ‘Echo’, and ‘RegioMail.’Echo, which circulates 254,000 copies, was also affected by the cyberattack, and there were issues accessing its e-paper on the website. The online news portal Echo24.de, however, continues operations as normal.Heer states that the attack was conducted by a well-known cybercriminal group that encrypted their systems on Friday night and left ransom notes behind. However, as of Saturday afternoon, no specific ransom demands have been made.BleepingComputer has contacted Stimme Mediengruppe for more information about the attack, and we will update this post as soon as we know more.The newspaper’s editors were told to work from home on their personal computers, and new email addresses were assigned to them.The media group is working with the police to find a way to resolve the technical issues as soon as possible, as well as to try to identify the perpetrators.Cybersecurity experts from the state of Baden-Württemberg are also assisting in the remediation effort at the request of Interior Minister Thomas Strobl.“However, we cannot currently foresee whether we will deliver a newspaper every day in the coming week.”Until the printing systems return to normal operational status, Heilbronn Stimme will continue to print emergency editions via a third party in Karlsruhe.Because the media group is also a distributor, the circulation of other popular newspapers like ‘Süddeutsche Zeitung’ and ‘Stuttgarter Zeitung’ in the district of Heilbronn (pop. 350,000) will also stop until further notice."
   },
   {
      "time": "2022-10-18",
      "title": "Disinformation Attacks Threaten US Midterm Elections",
      "text": " While traditional cyberattack operations against US government organizations have remained fairly consistent, influence and disinformation attacks by foreign nations have increased in the run-up to the US midterm elections.The attack is a departure from the group's more recent strategy of targeting Southeast Asia, and could mark a shift in strategy, says Dick O'Brien, principal intelligence analyst for the Symantec Threat Hunter team. The group \"has been mounting espionage attacks in other regions, mostly Asia and the Middle East, [and] earlier this year German intelligence warned of attacks on organizations in that country,\" he says. \"We consider Budworm to be one of the more capable APT outfits, and the return to the US could signal a change in strategic priorities.\"However, security experts expect mostly a variety of influence attacks to ramp up against US government agencies and the campaigns of political candidates as the country's midterm elections approach. Cyber-intelligence firm Recorded Future pointed to the US intelligence community's assessment of foreign threats to the 2020 election and concluded that the country should expect more of the same in 2022.Russia is focused on \"sowing discord with regard to US political and societal affairs,\" with a focus on hindering concerted opposition to its invasion of Ukraine, while China conducts both public and private campaigns against its detractors, and Iranian actors aim to create support for a nuclear deal. Domestic extremists have become a significant disinformation threat over the past half decade, the company concluded.Such disruptive attacks and financial hacking are a constant presence, says Adam Meyers, senior vice president of threat intelligence for CrowdStrike.\"There is constantly espionage operations targeting the US — you know, constant, we are tracking it every single day,\" he says.With the US midterm elections less than a month away, much of the disinformation has focused on attempting to change attitudes of undecided voters and energizing supporters to get out and vote.The surge in e-mail messages is a reminder that election security issues affect smaller government agencies, which do not have the deep pockets of larger companies, Trellix researchers stated in the post.\"[S]tates and localities do not operate on an equal cybersecurity footing\" as the federal government, they said. \"Some will be more susceptible to attacks than others and many will continue to require the help of the federal government to not only harden themselves to these and other attacks, but also educate local election employees in cyber hygiene to thwart them at their point of attack.\"\"As of the date of this report, the FBI and CISA have no reporting to suggest cyber activity has ever prevented a registered voter from casting a ballot, compromised the integrity of any ballots cast, or affected the accuracy of voter registration information,\" the agencies stated. \"Any attempts tracked by FBI and CISA have remained localized and were blocked or successfully mitigated with minimal or no disruption to election processes.\"CISA and the FBI did not address any specific claims, but warned voters to be critical of such news.\"Be wary of emails or phone calls from unfamiliar email addresses or phone numbers that make suspicious claims about the elections process or of social media posts that appear to spread inconsistent information about election-related incidents or results,\" the agencies stated.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-10-18",
      "title": "Researchers Say Microsoft Office 365 Uses Broken Email Encryption to Secure Messages",
      "text": " New research has disclosed what's being called a security vulnerability in Microsoft 365 that could be exploited to infer message contents due to the use of a broken cryptographic algorithm.Office 365 Message Encryption (OME) is a security mechanism used to send and receive encrypted email messages between users inside and outside an organization without revealing anything about the communications themselves.A consequence of the newly disclosed issue is that rogue third-parties gaining access to the encrypted email messages may be able to decipher the messages, effectively breaking confidentiality protections.That said, the shortcoming identified by WithSecure doesn't relate to the decryption of a single message per se, but rather banks on analyzing a stash of encrypted stolen mails for such leaky patterns and subsequently decoding the contents.\"An attacker with a large database of messages may infer their content (or parts of it) by analyzing relative locations of repeated sections of the intercepted messages,\" the company said.\"Since Microsoft has no plans to fix this vulnerability the only mitigation is to avoid using Microsoft Office 365 Message Encryption,\" WithSecure said.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]