[
   {
      "time": "2022-12-13",
      "title": "Dark Web Profile: APT42 - Iranian Cyber Espionage Group - SOCRadar",
      "text": " By SOCRadar ResearchAPT42 follows other Iranian state-sponsored cybercriminal groups’ targeting patterns. The group focuses on the Middle East region. They mainly target individuals and organizations particularly interested in the Iranian government or who have opposing ideas from Iran’s regime. Also, the group is targeting a few specific sectors, as follows: The group operates in three main categories: 1. Credential Harvesting 2. Surveillance Operations Group has been observed using Android malware designed to gather information -such as locations, communications, etc.- from Iranian dissidents and individuals interested in the Iranian government. In 2022, from June to August, Mandiant observed that APT42 used PINEFLOWER malware to exfiltrate recorded calls, audio recordings, images, and SMS inboxes from Iran-based people linked to universities, reformist political groups, and human rights activists.3. Malware Deployment Some sources consider APT42 as one of the names of another Iran state-sponsored cyber espionage group APT35. Still, many resources show they are separate groups and correlate with each other. Mandiant considers both APT35 and APT42 to be IRGC-affiliated. The two groups differ regarding missions, contracts, or contractors due to significant differences in their respective targeting patterns, tactics, techniques, and procedures. In addition, their targeting separates into specific points. APT35 targets the U.S., Western Europe, and Middle Eastern military, diplomatic and government personnel and organizations, defense industry, and telecommunications sectors. On the other hand, APT42 focuses on organizations and individuals interested in the Iranian government and opponents of Iran. According to Mandiant, the APT42 and Nemesis Kitten have no relation technically, but allegedly, both may have ties with IRGC-IO. In light of these common points, TAG-56 and the APT42 strongly overlap. Multi-Persona Impersonation (MPI)emails -> The group uses a new phishing technique to dupe their victims. They use multiple impersonated journalists’ profiles and create a realistic-looking fake mail thread. Then they add the victim journalist or researcher to the thread and continue communicating about the topic.After a while, one of the fake personas sends a file link that directs a forged Google Drive or OneDrive website to steal credentials or deliver a malicious file.Mimicking login pages -> APT42 has been observed many times mimicking Google, Yahoo!, and OneDrive’s login page for harvesting credentials. In this way, the group can steal the MFA codes of their victims to access the account. BROKEYOLKGHAMBARPOWERPOSTCHAIRSMACKMAGICDROPSILENTUPLOADERDOSTEALERPINEFLOWERTABBYCATVINETHORNVBREVSHELLTAMECATOnce successfully accessed, the group registers its Authenticator to eliminate the MFA. Also, the group uses various malware -such as GHAMBAR, BROKEYOLK, PINEFLOWER, and so on- to establish its foothold. APT42 usually begins another spearphishing attack using its victims’ compromised emails for the lateral movement part of the path. And during this process cycle, APT42 uses custom malware -CHAIRSMACK and GHAMBAR- to maintain its presence and continue its operations, also gaining more information about its victim. Iranian APT groups are one of the most dangerous threat actors in cyberspace. It is vital to stay more secure and detect before it is too late when they access your organization’s infrastructure. There are to-dos to consider based on Iranian APT groups’ activities: SOCRadar has a Campaign panel that displays all observations about a specific event on a single page.Also, SOCRadar has a panel that holds all Threat actors and Malware information that can be inspected detailed.When it comes to APT42, the group is still a dangerous cyber espionage group. Because of the relations within IRGC, APT42 will continue targeting the organizations or individuals interested in the Iranian government. According to the latest analysis published by HRW (Human Rights Watch) on December 5, 2022, the group used the WhatsApp platform as a different medium in its recent attacks. These incidents indicate that the group has chosen the channels they attack from among the current communication channels. APT42 took the stage using spearphishing, so keep in mind these facts to be safe from spearphishing attacks by APT42: Names:Basic Properties:IOCs of GHAMBAR:Names:Basic Properties:IOCs of BROKEYOLK:Names:Basic Properties:Android InfoCertificate Subject:Permissions:ActivitiesServicesIntent Filters By ActionIntent Filters By CategoryIOCs of PINEFLOWER"
   },
   {
      "time": "2022-12-13",
      "title": "Most of the 10 largest healthcare data breaches in 2022 are tied to vendors | SC Media",
      "text": "  These incidents should serve as a warning to revisit third-party vendor relationships, ensure the entity is at least annually performing a review of vendors, and consider consolidating vendors where possible. In calculating this list, SC Media listed the pixel incidents as single events because the tools were not caused directly by the vendor. Indeed, the pixels operated as intended. The incidents were instead caused by the providers failing to consider possible privacy implications of using tracking tools on patient-facing sites and The Health Insurance Portability and Accountability Act compliance requirements.In a strong example, despite its systems being down across dozens of its care sites for more than a month, the CommonSpirit ransomware attack only resulted in data theft at seven hospitals and for 623,774 patients. However, the patient care impacts are simply not as easy to calculate.SC Media will delve into patient safety impacts from this year in the near-future, as the lessons learned from these outages warrant a separate look.With over 326,278 impacted patients, Aetna ACE was among the hardest hit by the third-party incident.The OTP notice disclosed that a threat actor accessed several servers one day before deploying the ransomware payload. The vendor was unable to determine just what files were accessed during the dwell time and instead reported based on the data contained within the servers, like patient names, member IDs, and information gathered from health assessments.Only one of the affected health plans saw SSNs compromised during the incident.In what is undoubtedly the most complex and headline-grabbing stories in healthcare this year, Eye Care Leaders’ reported ransomware attack and the drama that followed is the second-largest breach reported this year.In a surprising twist, ECL began to report in May that it was, indeed, hit with a ransomware attack — except, the incident was not related to the outages reported in the lawsuit. Summit Eye Associates and EvergreenHealth were the first to report on the incident, caused by the deployment of ransomware on Dec. 4, 2021.The attacker first gained access to the systems weeks before the cyberattack, using their access to databases to delete data and system configuration files. The evidence could not rule out access to provider data, which included patient names, Social Security numbers, dates of birth, medical record numbers, health insurance, and treatment information. Other provider notices showed greater or lesser data impacts. While the initial lawsuit against ECL has since been joined by patient-led lawsuits filed in the wake of the public reports, there is still a lot the public does not know about the 2021 incidents at ECL. What’s clear is that ECL failed to notify providers impacted by the December 2021 incident until at least 30 days after the HIPAA-required timeframe.Reported in late October, Advocate Aurora informed patients that their health information was shared with Google and Facebook as a result of its use of Pixel on its patient portals, websites, applications and scheduling tools. Pixel was used by Advocate Aurora to better understand how patients were interacting with these sites.However, the tech also disclosed protected health information, as well as “certain details about interactions with our websites, particularly for users that are concurrently logged into their Google or Facebook accounts and have shared their identity and other surfing habits with these companies,” officials explained.The pixels have since been removed or disabled, but not before the accidental disclosure of patients’ IP addresses, appointment dates, times, and/or locations, proximity to Advocate Aurora Health locations, provider details, procedure types, communications between the patient and others on the MyChart platform, insurance information, and proxy names.Connexin first discovered a “data anomaly” back on Aug. 26. Two weeks later, they discovered an actor “accessed an offline set of patient data used for data conversion and troubleshooting” and removed it from the network.The stolen data varied by individual and could involve names, contact details, SSNs, guarantor names, parent or guardian names, dates of birth, highly specific health insurance information, treatments, procedures, diagnoses, prescriptions, provider names, medical record numbers, and billing and/or claims data.Connexin stressed that its live EMR system wasn’t hacked during the incident, nor were any systems, EMRs, or databases belonging to physician practice groups. But notably absent from its notice was the cause behind the lengthy delay in notifying patients and their families.Two million patients tied to 60 healthcare providers were told their data was compromised and likely stolen during a two-week hack from March 7 to March 21, but was not discovered by Shields until March 28.“Although Shields identified and investigated a security alert on or around March 18, data theft was not confirmed at that time,” according to the notice. The subsequent investigation confirmed the actors stole a range of data that included SSNs, medical record numbers, patient IDs, treatment information, insurance details, billing information, and diagnoses, among other data.The incident forced Shields to rebuild the entirety of the affected systems. The notice did not explain why it issued its notices far outside the required 60-day HIPAA timeframe.What’s more, the attack was found and stopped on the same day it occurred. Even with only a short amount of dwell time, the attack was able to access patient names, SSNs, contact details, accounts receivable balances, payment information, dates of birth, insurance information, and medical treatments.The incident forced PFC to wipe and rebuild the entirety of the systems impacted by the incident. On April 20, the security detected malicious code installed on certain systems, which was later found to have provided attackers with the ability to remove patient data from the network. The stolen data varied by patient and may have included demographic details, SSNs, insurance data, diagnoses, treatments, reason for visit, claims data, and a host of other information.In fact, CHN only launched its investigation after learning about the alleged pixel data scraping. Their investigation soon confirmed the installed pixels had collected and disclosed user data to the tech giants. CHN has since removed or disabled the pixels from its impacted platforms.The unauthorized disclosure varied by patient and depended on how the configuration of the users’ devices and activities on the CHN website. The more a user interacted with the site, “the greater the disclosure.” The data could include IP addresses, appointment details, provider names, portal communications, appointment or procedure types, and other sensitive data.The breach notice was sent just weeks after the June investigative reports on the Meta Pixel tracking tool, “in an effort to be as transparent as possible.” It remains unclear whether the reports prompted the discovery of the data scraping, or if it was an internal investigation.Calling it an incorrect misconfiguration, the use of Pixel led to Meta receiving patients’ demographic details, contact information, emergency contacts or advanced care planning, appointment types and date, provider names, button or menu selections, “and/or content typed into free text boxes.” The data varied by individual.The threat actor remained on the network for four days and exfiltrated a wide range of patient and employee information from the network, including SSNs, financial or bank account information, medical histories, conditions, treatments, diagnoses, medical record numbers, and driver’s licenses, among other sensitive data.Like several other providers this year, the notice fell outside the 60-day HIPAA requirement. But Broward Health informed individuals the delay was directly caused by a Department of Justice request to hold the breach notice to prevent compromising the ongoing law enforcement investigation.Several lawsuits were filed against Broward Health in the wake of the patient notifications, some of which have been dismissed.*Update: SC Media inadvertently referred to the initial data estimates for the OTP incident. This piece has been updated to reflect the final tally reported to HHS, which shifted the top 10 list.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Okta had 4,961 current and former employees' data, including names, health insurance plan numbers, and Social Security numbers, compromised following a breach at its third-party vendor Rightway Healthcare, reports The Register.Threat actors using private keys and passphrases from LastPass databases stolen in cyberattacks last August and December were reported by ZachXBT and MetaMask developer Taylor Monahan to have been able to exfiltrate $4.4 million worth of cryptocurrency on Oct. 25, BleepingComputer reports.The three companies claim no sensitive customer data was lost despite being targeted after the breach of the identity and access management firm.On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-12-13",
      "title": "\r\n\tHSE Cyber-Attack Costs Ireland $83m So Far - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe figures come from a letter from HSE chief information officer Fran Thompson sent to Aontú leader Peadar Tóibín last Friday.Now, Thompson confirmed that the costs reached €42m ($43.97m) in 2021 and almost €39m ($40.83m) until October of this year.“If the cost does continue to escalate to €100m, we have to look at that in perspective and its equivalent to everyone in the Republic of Ireland having been defrauded by €20.”The cyber-attack, believed to have been conducted by Russia-based state actors, was reportedly caused by a malicious Microsoft Excel file delivered via a phishing email.A total of roughly 100,000 people had their personal data stolen during the cyber-attack.According to the executive, ensuring critical applications, devices and systems are secure should remain the main priority for healthcare security professionals."
   },
   {
      "time": "2022-12-13",
      "title": "IIS modules: The evolution of web shells and how to detect them  | Microsoft Security Blog",
      "text": " Web exploitation and web shells are some of the most common entry points in the current threat landscape. Web servers provide an external avenue directly into your corporate network, which often results in web servers being an initial intrusion vector or mechanism of persistence. Monitoring for exploitation and web shells should be a high priority for all networks, and while these detection techniques are targeted towards malicious IIS modules, a lot of these techniques will also provide general web shell detections.The concept of malicious IIS has been around since at least 2013. Historical malware analysis shows how crimeware groups used IIS modules to intercept client logons and payment details by using the BeginRequest triggers to read user-provided parameters before the webserver processes them.A core part of IIS module functionality is event handling. Event triggers provide opportunities for code to be called when specific actions happen. IIS modules have access to 27 event triggers by default, including:Event handlers, which run when their associated trigger is fired, can allow an actor to essentially setup a proxy on the IIS server. By setting up an event handler on the BeginRequest, EndRequest, and Error event triggers, the actor can intercept all requests before the web service can process them and before the response is sent to the client.Event handlers are given full read and write access to the requests, which allows malicious IIS modules to hide web shell communications within any aspect on the web request, turning every page that does and does not exist into a web shell. This can include hiding web shell communications in the parameters, body, headers, or HTTP methods.These aspects of malicious IIS modules make them very hard to detect in standard IIS logs. You cannot rely on usual web shell detection strategies, such as high frequency page requests or URI patterns. Malicious IIS modules instead require new detection techniques and use of advanced IIS logging.An additional difficulty with malicious IIS modules is that they can tamper with any aspect of the request and/or response. This could include removing web shell commands from parameters or headers and preventing web shell commands from being logged.IIS Modules can also intercept responses before they are sent, which presents the opportunity for an actor to serve malicious payloads into any response from the website, potentially infecting viewers of the website.‘W3wp.exe’, also known as IIS worker processes, is utilized by web applications that run within IIS. Process creation is the most common indication of a web shell on IIS servers. Monitoring for the creation of common shell tooling (cmd, PowerShell, rundll32, mshta) with the parent process w3wp.exe can help detect low-sophistication IIS modules.This should not be considered a strong detection for IIS modules. With full integration with C# and the .NET framework, a large amount of functionality can be integrated to execute directly within the IIS process without relying on creating child processes.As mentioned in the vendor paper earlier, assemblies can be provided arbitrarily to deliver additional functionality. This may be through providing the assembly through the web request or downloading the assembly from an actor-controlled C2. The figure below shows: With access to .NET, malicious actors can add additional layers of evasion to prevent detection of their IIS modules, such as encoding or encryption. In the figure below, we can see:IIS logs are a great place to start hunting for web shells, but advanced IIS logging is recommended because IIS modules can remove malicious traffic from the standard IIS logs. The IIS Service can provide additional advanced logging, such as the Microsoft IIS Configuration Operational log, which can be enabled through the event log tool by using the following commands:The log that we will be focusing on in this blog is the Microsoft IIS Configuration Operational log. When enabled, the default path for this log is `C:\\Windows\\System32\\winevt\\Logs\\Microsoft-IIS-Configuration%4Operational.evtx’ (shown in the figure above).The Microsoft IIS Configuration Operational log captures the additional and removal of IIS modules (Event ID 29).  IIS modules are not commonly added to a production IIS server, so alerting on this event ID should be enabled within your SIEM or security products.Note: This IIS module has no correlation with the Exchange Vulnerability ProxyShell.Modules listed through appcmd will be ordered based on the order of installation. In Figure 9, the two malicious IIS modules, ProxyShell and Malicious IIS Module, were the two most recent IIS modules installed and therefore the last two on the list. The type parameter also shows the class that is called when the module is loaded.The web.config file, which details the settings for a website, can include modules that the website loads and should therefore be monitored when detecting malicious IIS modules. Monitoring of web.config should primarily focus on tracking modifications to the file, and can be done through multiple tools and sources. For example, the Microsoft IIS Configuration Operational event log produces Event ID 50 when a modification is made to a website. Because the content of the modification is not captured, a backup of the web.config should be stored for easy comparison between the modified file and the original.Most EDRs capture file modification events as well. Enabling an alert for the modification of web.config, especially from the w3wp.exe process, will enable detection of unwarranted changes to the config.While loaded IIS modules are standardly loaded DLLs, not all tools list .NET modules that are loaded into w3wp.exe. One tool that does show IIS modules loaded into w3wp.exe is Process Hacker, which if used with administrative privileges, will show them under the Modules tab.In Microsoft Defender for Endpoint, an IIS module that is loaded into w3wp.exe will appear twice: First when loaded from the bin directory from which it resides, then immediately after from the temporary ASP.NET directory.By default, IIS modules are loaded when the w3wp.exe process is created. If an IIS module is loaded while the w3wp.exe process is already executing and at a different time than the rest of the module, it can be an indicator for malicious IIS module loading. Monitoring for abnormal module loads may help detect malicious IIS modules. Using a query like the KQL one below can group together modules loaded into w3wp.exe at the same second. In Figure 12, we can see a large number of modules being loaded within a three second time period, followed by the malicious ProxyShell IIS module three hours later.While IIS modules have the capability to load .NET modules arbitrarily and reflectively within the context of w3wp.exe, the AppDomains are still registered within the hosting process. By listing AppDomain loaded within an assembly through a tool like Process Hacker, you’ll be able to find the loaded IIS module and any .NET modules that have been loaded.In the figure above, the malicious IIS module ProxyShell can be seen alongside the loaded assemblies SharpHound and SweetPotato. Another thing to note is that reflectively loaded modules usually do not have Flags: in Figure 13, all the assemblies without Flags are either loaded through the malicious IIS module or through Visual Studio debugging.The ETW provider Microsoft-Windows-DotNETRuntimeRundown provides a snapshot in time of the loaded .NET modules within active processes. Two events can help detect malicious assemblies loaded within IIS:The ModuleILPath field shows the path of the loaded assembly; however, if this assembly is loaded reflectively, rather than a path to the file, it will instead just list the name of the assembly. The figure below shows how SharpHound and SweetPotato, both with reflectively loaded assemblies, do not have paths while other events do.The Assembly Flags field may also be 0, similar to Figure 13 where Process Hacker shows empty Flags for the assemblies.Processes which contain appcmd or gacutil within the command line and the parent process w3wp.exe should be investigated for potential installation of malicious IIS modules. The following Defender for Endpoint queries can help detect such malicious IIS module installation:Process creation events with the parent process of w3wp.exe should be monitored for abnormal child processes. For IIS servers that require child processes of w3wp.exe, ignore lists should be created for these child processes to prevent false flags.If one of the Potato-sploits are being used to create processes, the AccountName field may also be “System” while the InitiatingProcessAccountName will be the Application Pool.Threat actors use a variety of techniques to conceal their activity when using malicious IIS modules. Enabling additional logging in your environment is recommended to facilitate the detection of these harmful modules. Specifically, IIS servers should enable the optional event log Microsoft IIS Configuration Operational. This log can provide insight into IIS modules being added or removed from the IIS server and track any modifications made to web.config.IIS Servers should have their web.config and IIS modules monitored for malicious modifications being made. For example, Gacutil.exe and appcmd.exe being executed from w3wp.exe should be monitored for potential installation of IIS modules. Additionally, the bin directories of websites and the default GAC path should be monitored and regularly scanned for malicious modules being created.Hunting for malicious IIS modules can be performed through Microsoft Defender for Endpoint or your EDR of choice, and it should be conducted regularly to detect abnormal w3wp.exe interactions. This can include, but is not limited to, process creation, file creation and named pipe creation. Due to the wide flexibility around how IIS modules can execute malicious code, it’s important to look for irregularities in behavior.Detecting web exploitation and malicious IIS modules should be a priority for all organizations, and Microsoft DART believes that following the recommendations provided in this blog and along with the monitoring and detection strategies will assist your organization in the detection and response of these threats.Microsoft is a leader in cybersecurity, and we embrace our responsibility to make the world a safer place."
   },
   {
      "time": "2022-12-13",
      "title": "Fortinet Ships Emergency Patch for Already-Exploited VPN Flaw - SecurityWeek",
      "text": " Hi, what are you looking for?Fortinet on Monday issued an emergency patch to cover a severe vulnerability in its FortiOS SSL-VPN product, warning that hackers have already exploited the flaw in the wild.ByFlipboardRedditWhatsappWhatsappEmailRyan Naraine is Editor-at-Large at SecurityWeek and host of the popular Security Conversations podcast series. He is a security community engagement expert who has built programs at major global brands, including Intel Corp., Bishop Fox and GReAT. Ryan is a founding-director of the Security Tinkerers non-profit, an advisor to early-stage entrepreneurs, and a regular speaker at security conferences around the world.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.Zero trust is not a replacement for identity and access management (IAM), but is the extension of IAM principles from people to everyone and...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...WASHINGTON - Cyberattacks are the most serious threat facing the United States, even more so than terrorism, according to American defense experts. Almost half...The CRYSTALS-Kyber public-key encryption and key encapsulation mechanism recommended by NIST for post-quantum cryptography has been broken using AI combined with side channel attacks.The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-13",
      "title": "Ukrainian railway, state agencies allegedly targeted by DolphinCape malware",
      "text": " The attacks involved an email campaign in which hackers sent out messages purportedly on behalf of Ukraine’s State Emergency Service with tips on how to identify a kamikaze drone, capitalizing on fears over the Russian use of Iranian-made Shahed-136 kamikaze drones to target crucial energy infrastructure in Ukraine. The attackers, tracked by CERT-UA as UAC-0140, used the emails to distribute the DolphinCape malware, developed with the Delphi programming language.This malicious software collects information about the compromised computer, including hostname, username, bitrate, and OS version, runs executable files, extracts other data, and takes screenshots of the targeted device. The report is the first mention among researchers of DolphinCape.The hackers behind phishing attacks often disguise themselves as representatives of government agencies, including the General Staff of the Armed Forces of Ukraine, the Security Service of Ukraine, and even CERT-UA.Among their most popular targets are transport companies, government agencies, and security services, according to the data obtained by The Record. At least one-fifth of the Russian cyberattacks are synchronized with physical attacks, including missile strikes on Ukraine's critical infrastructure, Shchyhol told The Record. According to him, Ukraine expects an increase in the number of cyberattacks in the coming months, in particular on the energy infrastructure, which is already suffering from Russian missile strikes.As of November, Russia has damaged about 40% of Ukraine's energy infrastructure, including all thermal and hydroelectric power plants. These attacks occur daily, prompting the government to impose nationwide blackouts. On Dec. 10, nearly 300,000 people were left without electricity due to Russia's drone attacks on several energy facilities in the port city of Odesa.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-12-13",
      "title": "Twitter confirms recent user data leak is from 2021 breach",
      "text": " Twitter confirmed today that the recent leak of millions of members' profiles, including private phone numbers and email addresses, resulted from the same data breach the company disclosed in August 2022.Twitter says its incident response team analyzed the user data leaked in November 2022 and confirms it was collected using the same vulnerability before it was fixed in January 2022.\"As soon as we became aware of the news, Twitter's Incident Response Team compared the data in the new report to data reported by the media on 21 July 2022. The comparison determined that the exposed data was the same in both cases.\" - Twitter.In January 2022, Twitter received a report through its bug bounty program that an API vulnerability allows an attacker to feed email addresses or phone numbers and get an associated Twitter ID for a registered account.As members' phone numbers and email addresses are not meant to be public, this could pose a significant privacy risk for Twitter users who wish to post anonymously.By the time Twitter remediated the problem, a threat actor had already leveraged the API vulnerability to input millions of email addresses and phone numbers to create 5.4 million user profiles consisting of public and non-public data.This data set is allegedly far more extensive, reportedly containing 17 million records collected using the same API flaw.While BleepingComputer has not been able to confirm the extent of this additional data set, we were able to examine a sample of a data set containing 1.4 million previously undisclosed French Twitter account records. BleepingComputer used this sample to contact listed Twitter users and confirm that the leaked phone number belonged to them, confirming this additional data set was valid.Unfortunately, while Twitter's latest update indicates that the data leaked last month is tied to the previously disclosed vulnerability, the company has not confirmed the exact number of exposed users.Twitter advises that users enable two-factor authentication, use authenticator apps or hardware keys to protect their accounts, and be extra vigilant with incoming emails related to their Twitter accounts.\"We also encourage Twitter users to remain extra vigilant when receiving any kind of communications over email, as threat actors may leverage the leaked information to create very effective phishing campaigns,\" warns Twitter.\"Be wary of emails conveying a sense of urgency and emails requesting your private information, always double check that emails are coming from a legitimate Twitter source.\"Update 12/12/22 - Changed title to reflect that the breach was in 2021 and confirmed in August."
   },
   {
      "time": "2022-12-13",
      "title": "Australia’s Telstra Hit by Data Breach Affected 132,000 Customers - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-12-13",
      "title": "PLAY ransomware group claims responsibility for Antwerp attack as second Belgian city confirms new incident",
      "text": " The PLAY ransomware group has claimed responsibility for a ransomware attack on the Belgian city of Antwerp last week, just as the city of Diest about an hour’s drive east confirmed on Monday that it has been hit by a cyberattack.The PLAY group has threatened to begin leaking Antwerp’s stolen data on December 19. It is not clear what data was stolen.\"The IT systems of all city services are down. At the moment we are trying to map everything out. The damage it has caused is still being investigated. We also don't know who is behind it yet,\" Mayor of Diest, Christophe De Graef, was quoted as saying.The nature of last week’s attack on Antwerp has not yet been confirmed by officials, who said that the most significant impact was on the city’s residential care centers. The Antwerp public prosecutor's office said it has opened an investigation into the incident.Johan de Muynck, the general manager of Zorgbedrijf Antwerpen (Antwerp Healthcare) warned that the software the organization used to “keep track of who should receive which medicines” was not currently working.Patients are currently receiving paper prescriptions signed by doctors rather than typical electronic prescriptions.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   }
]