[
   {
      "time": "2022-08-04",
      "title": "Russian organizations attacked with new Woody RAT malware",
      "text": " Unknown attackers target Russian entities with newly discovered malware that allows them to control and steal information from compromised devices remotely.According to Malwarebytes, one of the Russian organizations that were attacked using this malware is a government-controlled defense corporation.Dubbed Woody RAT, this remote access trojan (RAT) has a wide range of capabilities and has been used in attacks for at least one year.This malware is currently delivered onto targets' computers via phishing emails through two distribution methods: ZIP archive files containing the malicious payload or \"Information security memo\" Microsoft Office documents that exploit the Follina vulnerability to drop the payloads.\"The earliest versions of this Rat was typically archived into a zip file pretending to be a document specific to a Russian group,\" the researchers added.Its list of features includes collecting system information, listing folders and running processes, executing commands and files received from its command-and-control (C2) server, downloading, uploading, and deleting files on infected machines, and taking screenshots.Woody RAT can also execute .NET code and PowerShell commands and scripts received from its C2 server using two DLLs named WoodySharpExecutor and WoodyPowerSession.The RAT encrypts its C2 communication channels using a combination of RSA-4096 and AES-CBC to elude network-based monitoring.Malwarebytes is yet to attribute the malware and the attacks to a known threat group but said that a very short list of possible suspects includes Chinese and North Korean APTs.\"This very capable Rat falls into the category of unknown threat actors we track. Historically, Chinese APTs such as Tonto team as well as North Korea with Konni have targeted Russia,\" the researchers concluded.\"However, based on what we were able to collect, there weren't any solid indicators to attribute this campaign to a specific threat actor.\""
   },
   {
      "time": "2022-08-04",
      "title": "Cloned Atomic Wallet website is pushing Mars Stealer malware",
      "text": " A fake website impersonating the official portal for the Atomic wallet, a popular decentralized wallet that also operates as a cryptocurrency exchange portal, is, in reality, distributing copies of the Mars Stealer information-stealing malware.Seeing the genuine and fake websites side by side reveals that the latter isn’t a faithful copy of the former, but it’s still using the official logos, themes, marketing images, and structure. The fake site even features a contact form, email address, and FAQ section.However, those unfamiliar with the legitimate Atomic wallet site could easily believe that the imposter is authentic.As for how people end up there, it might be through malvertising on social media, direct messages on various platforms, SEO poisoning, or spam email.Visitors attempting to download the software are presented with three buttons for Windows, iOS, and Android versions.Clicking on iOS does nothing, and clicking the Google Play button redirects to the real Atomic Wallet app on the Play Store.However, clicking on the Windows button will download a ZIP file named “Atomic Wallet.zip,” which contains malicious code that installs the Mars Stealer infection.The ZIP contains a batch file (AtomicWallet-Setup.bat) that invokes a PowerShell command to elevate its privileges on the host.Next, the bat file copies the PowerShell executable (powershell.exe) in the directory, renames and hides it, and eventually uses it to execute a base64-encoded PowerShell content.This code decrypts an AES-encrypted and GZip compressed Base64-encoded code which executes the final PowerShell code that acts as the malware loader.The loader downloads a copy of Mars Stealer from a Discord server and drops it on %LOCALAPPDATA% on the host machine. After installation, the malware launches and begins stealing data from the now-infected device.When downloading cryptocurrency wallets, it is vital to make sure you are using the official download portal of the project and never trust links provided on social media or instant messaging platforms.Also, beware of SEO poisoning and malicious Google Ads campaigns that can make malicious websites rank higher than the official sites in Google Search results, so skip all results marked as ads."
   },
   {
      "time": "2022-08-04",
      "title": "U.S. Cyberspace Ambassador nominee lays out ambitious agenda",
      "text": " Cyberspace may not be a physical place, but it’s where the fallout of many international engagements now play out – and it may have a U.S. ambassador soon. Cyberspace is “the next frontier of American diplomacy,” Fick, a former Marine who now leads cybersecurity efforts at software firm Elastic, told the committee. “Our future will be shaped by the infrastructure, standards, norms, and policies that determine how digital technologies are developed, deployed, and used.” Fick laid out prospective policy priorities in opening testimony, plus how he would approach important issues from an operational standpoint.On the policy front, Fick said he would seek to “strengthen adherence to the framework of responsible state behavior” outlined by the United Nations when it comes to malicious behavior online, promoting a norm-based model to deter bad behavior. He also said he would promote a digital economy where U.S. companies and the people that work at them can compete — including protecting the free flow of data across borders while protecting user’s privacy and the integrity of their information. Lastly, Fick said he would “champion a positive vision for digital freedom” that countered a rise in digital authoritarianism.To pursue those policies, he planned to focus first on building a team and culture inside the State Department that views fluency and expertise in technology as a crucial skill set. After that, he would focus on asserting the State Department’s place in cybersecurity policy, as well as other global digital security issues.‘Tool of first resort’Chief among those challenges, according to Fick, are issues raised by the Russian invasion of Ukraine and the U.S.’s ongoing strategic competition with China. Senator Rob Portman (R., Ohio) questioned Fick on how he would carve out the agency’s role in what he suggested was an increasingly crowded federal cybersecurity space — including coordinating with the White House National Cyber Director, Cybersecurity and Infrastructure Security Agency (CISA), and other stakeholders. “I believe diplomacy should be our tool of first resort,” Fick responded, adding that he views the ambassador role as filling “an important gap” by prioritizing a diplomatic approach to cybersecurity and other digital policy challenges.Fick also cited his past experience in the military and the private sector as evidence he would be able negotiate appropriate channels of responsibility. Fick served combat tours with the Marines Corps in Afghanistan and Iraq after graduating college before attending graduate school at Harvard, then working at the think tank the Center for a New American Security and in the cybersecurity industry. “The new ambassador will need the ability to build diverse sets of economic, military, and political coalitions to advance our national interests and help protect our nation in the cyber domain,” the group wrote. “​​We believe [Fick] can bring the right combination of skills to bear on the important work of building bridges across borders, and with private industry as well, and can likewise help our government get tough on its adversaries as we seek to establish real deterrence in cyberspace.”The Committee will vote on whether to advance Fick’s nomination to the full Senate at a future meeting. Andrea Peterson (they/them) is a longtime cybersecurity journalist who cut their teeth covering technology policy at ThinkProgress (RIP) and The Washington Post before doing deep-dive public records investigations at the Project on Government Oversight and American Oversight.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-04",
      "title": "Microsoft accounts targeted with new MFA-bypassing phishing kit",
      "text": " A new large-scale phishing campaign targeting credentials for Microsoft email services use a custom proxy-based phishing kit to bypass multi-factor authentication.Researchers believe the campaign's goal is to breach corporate accounts to conduct BEC (business email compromise) attacks, diverting payments to bank accounts under their control using falsified documents.The phishing campaign's targets include fin-tech, lending, accounting, insurance, and Federal Credit Union organizations in the US, UK, New Zealand, and Australia.The campaign was discovered by Zscaler's ThreatLabz researchers, who report that the operation is still ongoing, and the phishing actors register new phishing domains almost daily.Starting in June 2022, Zscaler's analysts noticed a spike in sophisticated phishing attempts against specific sectors and users of Microsoft email services.Some of the newly registered domains used in the campaign are typo-squatted versions of legitimate Federal Credit Unions in the United States, as shown in the table below.Notably, many phishing emails originated from the accounts of executives working in these organizations, whom the threat actors most likely compromised earlier.Another set of phishing sites used domains names that focus on using password reset lures as part of their email campaigns:The threat actors added the links to the emails either as buttons embedded in the message body or inside attached HTML files that trigger redirections to the phishing pages.The redirections occur via legitimate web resources to help evade email and internet security tools, with the threat actors showing a preference for open redirects on Google Ads, Snapchat, and DoubleClick. Sadly, some platforms do not consider open redirects a vulnerability, leaving them available for abuse by threat actors.CodeSandbox and Glitch are also extensively abused in this campaign to help the hackers create new redirection routes without much effort.Once the victim reaches the phishing page, they are fingerprinted by JavaScript, which evaluates if the target is on a virtual machine or a normal device. This allows the phishing page only to be revealed to valid targets, rather than security software and researchers who may be using virtual machines for analysis.With the enterprise rapidly adopting multi-factor authentication, stealing users' credentials is not enough to gain access to an account if MFA is enabled. To bypass MFA, threat actors are turning to tools like Evilginx2, Muraena, and Modilshka.Using these reverse proxies, the adversaries can sit in the middle between the victim and the server of the email provider, hence why they are called \"AiTM\" (adversary in the middle).The email server requests the MFA code during the login process, and the phishing kit relays that request to the victim, who then enters the OTP on the phishing box. The data is forwarded to the email service, allowing the threat actor to log in to the stolen account.However, the phishing proxy sitting in the middle of this exchange can steal the resulting authentication cookies, allowing the threat actors to use these stolen cookies to login and bypass MFA for the particular account.What makes this campaign stand out is the use of a custom proxy-based phishing kit that has the peculiarity of using the \"Beautiful Soup\" HTML and XML parsing tool.This tool allows the kit to easily modify legitimate login pages pulled from corporate logins and add their own phishing elements. The tool also has the added benefit of beautifying the HTML in the process.The kit isn't perfect, though, as Zscaler found some URL leaks to the requests sent onto the Microsoft server, which can make detection possible on the vendor's side.Zscaler set up a test instance to let the attacker roam and monitor their post-compromise activity and found that the hackers logged into their account eight minutes after the compromise.Apart from logging into the account and evaluating the account and reading some of the messages, the threat actor didn't perform any additional actions."
   },
   {
      "time": "2022-08-04",
      "title": "India withdraws personal data bill that alarmed tech giants",
      "text": " The Indian government has withdrawn its long-awaited Personal Data Protection Bill that drew scrutiny from several privacy advocates and tech giants who feared the legislation could restrict how they managed sensitive information while giving government broad powers to access it.The move comes as a surprise as lawmakers had indicated recently that the bill, unveiled in 2019, could see the “light of the day” soon enough. New Delhi received dozens of amendments and recommendations from a parliamentary panel, which includes lawmakers from Prime Minister Narendra Modi’s ruling party, that “identified many issues that were relevant but beyond the scope of a modern digital privacy law,” said India’s Junior IT Minister Rajeev Chandrasekhar.The government will now work on a “comprehensive legal framework” and present a new bill, he added.The Personal Data Protection Bill sought to empower Indian citizens with rights relating to their data. India, the world’s second-largest internet market, has seen an explosion of personal data in the past decade as hundreds of citizens came online for the first time and started consuming scores of apps. But there has been uncertainty on how much power the individuals, private companies and government agencies have over it.“The Personal Data Protection Bill, 2019 was deliberated in great detail by the Joint Committee of Parliament 81 amendments were proposed and 12 recommendations were made toward comprehensive legal framework on digital ecosystem. Considering the report of the JCP, a comprehensive legal framework is being worked upon. Hence, in the circumstances, it is proposed to withdraw ‘The Personal Data Protection Bill, 2019’ and present a new bill that fits into the comprehensive legal framework,” India’s IT Minister Ashwini Vaishnaw said in a written statement Wednesday.The bill drew criticism from many industry stakeholders. New Delhi-based privacy advocacy group Internet Freedom Foundation said the bill “provides large exemptions to government departments, prioritises the interests of big corporations and does not adequately respect your fundamental right to privacy.”The bill also mandated that companies may only store certain categories of “sensitive” and “critical” data, including financial, health and biometric information in India.“I hope that the bill isn’t junked altogether, given all the work that went into it. Junking the bill altogether will create a limbo of sorts from a privacy protection standpoint. Nobody wants that,” said Nikhil Pahwa, the editor of MediaNama, which covers policy and media, in a series of posts on Twitter."
   },
   {
      "time": "2022-08-04",
      "title": "Cisco fixes critical remote code execution bug in VPN routers",
      "text": " Cisco has fixed critical security vulnerabilities affecting Small Business VPN routers and enabling unauthenticated, remote attackers to execute arbitrary code or commands and trigger denial of service (DoS) conditions on vulnerable devices.The two security flaws tracked as CVE-2022-20842 and CVE-2022-20827 were found in the web-based management interfaces and the web filter database update feature, and are both caused by insufficient input validation.CVE-2022-20827 exploits by submitting crafted input to the web filter database update feature can let threat actors \"execute commands on the underlying operating system with root privileges.\"The complete list of routers affected by these bugs includes Small Business RV160, RV260, RV340, and RV345 series VPN routers (CVE-2022-20842 only impacts the last two).Both flaws are exploitable remotely without requiring authentication in attacks that don't require user interaction.Cisco has released software updates to address both vulnerabilities and says there are no workarounds to remove the attack vectors.These security vulnerabilities were found by security researchers with the IoT Inspector Research Lab, the Chaitin Security Research Lab, and the CLP-team.The company's Product Security Incident Response Team (PSIRT) said Cisco is unaware of active exploitation or publicly available exploits in the wild.Today, Cisco has also patched a third, high severity bug (CVE-2022-20841) in the Open Plug and Play (PnP) module of RV160, RV260, RV340, and RV345 series routers.If unpatched, this flaw can let attackers execute arbitrary commands on the underlying Linux operating system by sending malicious input to unpatched devices.However, it also requires the threat actor to \"leverage a man-in-the-middle position or have an established foothold on a specific network device that is connected to the affected router.\""
   },
   {
      "time": "2022-08-04",
      "title": "Single-Core CPU Cracked Post-Quantum Encryption Candidate Algorithm in Just an Hour",
      "text": " A late-stage candidate encryption algorithm that was meant to withstand decryption by powerful quantum computers in the future has been trivially cracked by using a computer running Intel Xeon CPU in an hour's time.\"A run on the SIKEp434 parameters, previously believed to meet NIST's quantum security level 1, took about 62 minutes, again on a single core.\"\"The security of SIDH and SIKE relies on the hardness of finding a specific isogeny between two such elliptic curves, or equivalently, of finding a path between them in the isogeny graph,\" the tech giant's research team explains.Quantum-resistant cryptography is an attempt to develop encryption systems that are secure against both quantum and traditional computing machines, while also interoperating with existing communications protocols and networks.\"Each of these systems relies on some sort of math problem which is easy to do in one direction but hard in the reverse,\" David Jao, one of the co-inventors of SIKE and chief cryptographer at evolutionQ, told The Hacker News.\"Quantum computers can easily solve the hard problems underlying RSA and ECC, which would affect approximately 100% of encrypted internet traffic if quantum computers were to be built.\"While SIKE was positioned as one of the NIST-designated PQC contenders, the latest research effectively invalidates the algorithm.As for the next steps, Jao said while SIDH can be updated to remediate the new line of the key recovery attack, it's expected to be put off until further examination.\"It is possible that SIDH can be patched or fixed up to avoid the new attack, and we have some ideas for how to do so, but more analysis of the new attack is required before we can confidently make a statement about any possible fixes,\" Jao said.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-08-04",
      "title": "Ukraine takes down 1,000,000 bots used for disinformation",
      "text": " The Ukrainian cyber police (SSU) has shut down a massive bot farm of 1,000,000 bots used to spread disinformation on social networks.The goal of the bot farm was to discredit information coming from official Ukrainian state sources, destabilize the social and political situation in the country, and create internal strife.The messages spread by the bots were in line with Russian propaganda, so the operators of the disinformation machine are believed to be members of the Russian special services.In fact, SSU's investigation led to the criminal group's leader, a Russian \"political expert\" who in the past lived in Kyiv.\"For coordination, he was in contact with the current MP, who is a member of the close circle of our state's former leadership.\"The investigation of the Ukrainian police is still underway to uncover any other participants in the operation who will be charged for violations of Article 361.2 of the country's criminal code.The bot farm dismantled by SSU was located in Kyiv, Kharkiv, and Vinnytsia and relied on 1,000,000 bots to spread disinformation. To create this online army, the threat actors used 5,000 SIM cards to register new social media accounts.Moreover, the operators used 200 proxy servers that spoofed the actual IP addresses and evaded detection of fraudulent activity and blocking by the social media platforms.According to SSU, the bot farm operators developed and deployed custom software to remotely manage the pseudonymous social media accounts, coordinating them to push the required propaganda messages.The power of fake news cannot be underestimated, especially during times of hardship, limited internet access, and general upheaval.Russians have long been involved in disinformation campaigns and have invested in Ukraine-based bot farms targeting the local population.From the start of the war, the SSU has identified and neutralized over 1,200 cyberattacks against the state and other critical entities and has reported and taken down 500 YouTube channels that collectively had 15 million subscribers.Moreover, the agency has reported 1,500 Telegram channels and bots and another 1,500 Facebook, Instagram, and TikTok accounts for spreading Russian propaganda."
   },
   {
      "time": "2022-08-04",
      "title": "Thousands of Solana wallets drained in attack using unknown exploit",
      "text": " An overnight attack on the Solana blockchain platform drained thousands of software wallets of cryptocurrency worth millions of U.S. dollars.The platform has started an investigation and is currently trying to determine how the malicious actors managed to drain the funds.In a statement today, Solana said that at 5 AM UTC the attack impacted more than 7,700 wallets, including Slope and Phantom. According to public reports, Solflare and Trust Wallet users have also been affected.Solana says that wallets impacted in this attack should be considered compromised and should be abandoned for the hardware variant - cold wallets, which appear to remain unaffected. The advice for this move is to not reuse the seed phrase and create a new one for the hardware wallet.For those without a cold wallet, transferring all assets to a trustworthy centralized exchange would be a good alternative to secure the assets from the attackers.While there is no definitive answer at the moment about how the wallets were drained, multiple voices leaning towards a vulnerability in the wallet software.One clue that emerged from the attack is that the money-siphoning transactions are signed by the rightful owners, which points to a private key compromise.This is why revoking third-party approvals will probably not help stop the attack in this case, but it’s still a recommended action.According to various blockchain security experts, the method used to gain access to such a large number of private keys could be a supply chain attack, a browser zero-day flaw, or a faulty random number generator used in the key generation process.This is all speculation for now and users should follow the currently recommended mitigation steps.As such incidents are likely to happen again, it's good practice not to keep the entire cryptocurrency funds in a hot wallet and only use it for storing smaller amounts used in transactions. The better part of the assets should be placed into a cold wallet, which is disconnected from the internet and third-party services."
   },
   {
      "time": "2022-08-04",
      "title": "35,000 code repos not hacked—but clones flood GitHub to serve malware",
      "text": " Thousands of GitHub repositories were copied with their clones altered to include malware, a software engineer discovered today.While cloning open source repositories is a common development practice and even encouraged among developers, this case involves threat actors creating copies of legitimate projects but tainting these with malicious code to target unsuspecting developers with their malicious clones.GitHub has purged most of the malicious repositories after receiving the engineer's report.Today, software developer Stephen Lacy left everyone baffled when he claimed having discovered a \"widespread malware attack\" on GitHub affecting some 35,000 software repositories.Contrary to what the original tweet seems to suggest, however, \"35,000 projects\" on GitHub have not been affected or compromised in any manner.Rather, the thousands of backdoored projects are copies (forks or clones) of legitimate projects purportedly made by threat actors to push malware.Official projects like crypto, golang, python, js, bash, docker, k8s, remain unaffected. But, that is not to say the finding is unimportant, as explained in the following sections.While reviewing an open source project Lacy had \"found off a google search,\" the engineer noticed the following URL in the code that he shared on Twitter:BleepingComputer, like many, observed that when searching GitHub for this URL, there were 35,000+ search results showing files containing the malicious URL. Therefore, the figure represents the number of suspicious files rather than infected repositories:We further discovered, out of the 35,788 code results, more than 13,000 search results were from a single repository called 'redhat-operator-ecosystem.'This repository, seen by BleepingComputer this morning, appears to have now been removed from GitHub, and shows a 404 (Not Found) error.Exfiltration of environment variables by itself can provide threat actors with vital secrets such as your API keys, tokens, Amazon AWS credentials, and crypto keys, where applicable. But, the single-line instruction (line 241 above) further allows remote attackers to execute arbitrary code on systems of all those who install and run these malicious clones.As far as the timeline of this activity goes, we observed deviating results.The vast majority of cloned repositories were altered with the malicious code sometime within the last month—with results ranging from six to thirteen days to twenty days ago. However, we did observe some repositories with malicious commits dated as far back as 2015.GitHub has removed the malicious clones from its platform as of a few hours ago, BleepingComputer can observe. GitHub's Security team also issued a statement:GitHub is investigating the Tweet published Wed, Aug. 3, 2022:\n* No repositories were compromised\n* Malicious code was posted to cloned repositories, not the repositories themselves\n* The clones were quarantined and there was no evident compromise of GitHub or maintainer accountsThis can become more difficult to spot as cloned repositories may continue to retain code commits with usernames and email addresses of the original authors, giving off a misleading impression that even newer commits were made by the original project authors. Open source code commits signed with GPG keys of authentic project authors are one way of verifying the authenticity of code.Aug 3rd, 11:15 PM ET: Updated to include GitHub's statement released hours later."
   }
]