[
   {
      "time": "2022-08-24",
      "title": "Pirated 3DMark benchmark tool delivering info-stealer malware",
      "text": " Cybersecurity researchers have discovered multiple ongoing malware distribution campaigns that target internet users who seek to download copies of pirated software.The campaign uses SEO poisoning and malvertising to push malicious shareware sites high in Google Search results, promoting fake software along with cracks and product activation key generators.The software used for luring victims in the ongoing campaigns, according to Zscaler that discovered them, includes the following:In many cases, the malicious executables masquerading as the promised software installers are hosted on file hosting services, so the landing pages redirect victims to other services to download the files.The redirection sites which deliver the malicious files have less fancy names and stand on “xyz” and “cfd” top-level domains.The downloaded files are archives containing a 1.3MB password-protected ZIP to evade AV scans and a TXT file with the password.The size of the unpacked ZIP balloons to 600MB using byte padding is a common anti-analysis practice followed by many malware authors.The contained executable is a malware loader that spawns an encoded PowerShell command that launches a Windows command prompt (cmd.exe) after a 10 seconds timeout to evade sandbox analysis.The cmd.exe process downloads a JPG file that is, in reality, a DLL file with its contents arranged in reverse.The loader re-arranges the contents in the correct order, derives the final DLL, a RedLine Stealer payload, and loads it into the current thread.In some cases, Zscaler noticed that the threat actors dropped copies of the ‘RecordBreaker’ stealer malware, packed with the Themida tool for obfuscation and detection avoidance.The information targeted by that RecordBreaker is similarly extensive, so the final payload doesn’t make much difference for the victims.To stay safe from either, avoid downloading pirated software, product activators, cracks, serial key generators, and anything that promises access to paid software without paying.Even if the sites that make these false promises appear high on search results, it doesn’t make them legitimate or trustworthy."
   },
   {
      "time": "2022-08-24",
      "title": "VMware Carbon Black causing BSOD crashes on Windows",
      "text": " Windows servers and workstations at dozens of organizations started to crash earlier today because of an issue caused by certain versions of VMware’s Carbon Black endpoint security solution.According to some reports, systems at more than 50 organizations started to display the dreaded blue screen of death (BSOD) a little after 15:00 (GMT+1) today.The root of the problem is a ruleset deployed today to Carbon Black Cloud Sensor 3.6.0.1979 - 3.8.0.398 that causes devices to crash and show a blue screen at startup, denying access to them.Microsoft Windows operating systems impacted by the issue are Windows 10 x64, Server 2012 R2 x64, Server 2016 x64, and Server 2019 x64.On systems impacted by the issue, the stop code may identify the error as \"PFN_LIST_CORRUPT.\"Tim Geschwindt, an incident responder for S-RM Cyber, told BleepingComputer that starting at 15:30 (GMT+1), clients started to complain that their servers and workstations were crashing and suspected Carbon Black to be at fault.After investigating, the researcher determined that all clients running Carbon Black sensor 3.7.0.1253 were affected. “They couldn’t boot into any of their devices at all. Complete no go,” Geschwindt said.It appears that there is a conflict between Carbon Black and AV signature pack 8.19.22.224.An investigation is ongoing right now and the troublesome ruleset is being rolled back, which is expected to eliminate the problem.As a temporary workaround, VMware recommends putting sensors into Bypass mode via Carbon Black Cloud Console. This enables affected devices to boot successfully so the faulty ruleset can be removed.VMware is advising clients experiencing this issue to open a support case and include the following info: Org_Key, Device Name(s), Device ID(s), and Operating System(s).Update [August 23rd, 17:50]: VMware has provided the following statement for BleepingComputer shortly after publishing the article:\"VMware Carbon Black is aware of an issue affecting a limited number of customer endpoints, where certain older sensor versions were impacted by an update of our behavioral preventative capabilities. The issue has been identified and corrected, and VMware Carbon Black is working with impacted customers.\""
   },
   {
      "time": "2022-08-24",
      "title": "Phishing attacks abusing SaaS platforms see a massive 1,100% growth",
      "text": " Threat actors are increasingly abusing legitimate software-as-a-service (SaaS) platforms like website builders and personal branding spaces to create malicious phishing websites that steal login credentials.The advantages of using SaaS for phishing include evading alerts from email security systems, enjoying high availability, and bypassing the need to learn how to code to create websites that appear legitimate.Also, because SaaS platforms simplify and streamline the process of creating new sites, phishing actors can easily switch to different themes, scale up or diversify their operations, and quickly respond to reports and takedowns.Unit 42 has divided the abused platforms into six categories: file sharing and hosting sites, form and survey builders, website builders, note-taking and documentation writing platforms, and personal portfolio spaces.Palo Alto Networks filtering systems recorded a growth in the abuse across all categories, but the most significant were website builders, collaboration platforms, and form builders.Also, the stats indicate a notable rise in October 2021, based mainly on the sudden uptick in the abuse of form builders.Around the same time, another uptick was spotted, augmented by the abuse of a personal branding site the report doesn't name.The Unit 42 report explains that in many cases, the phishing actors host their credential stealing pages directly on the abused services, so they send an email to targets containing a URL leading to the page.In other cases, however, the landing pages hosted on the abused services don't contain the credential-stealing forms themselves. Instead, they take the victim through one more redirection step to another site.The phishing site can be hosted on a bulletproof service provider that doesn't respond to takedown requests, so the phishing actors follow that practice to increase campaign uptime while sacrificing the conversion rate.Even if the phishing page isn't well protected, hiding it behind one more layer reduces the labor required to set everything up again in the case of a takedown.\"In the event that the final credential-stealing page is taken down, the attacker can simply change the link and point to a new credential-stealing page, preserving the effectiveness of the original campaign,\" reads the report.Stopping the abuse of legitimate SaaS platforms will be very hard, as implementing aggressive email filters against those services isn't a choice.That's precisely what makes them so suitable for phishing campaigns and why the rise in its abuse since last year has been so startling.If a message that makes bold claims or requests urgent action from you lands in your inbox, avoid clicking embedded links or buttons, but instead use a search engine to locate the official site of the potentially spoofed platform.Whenever you're requested to enter your account credentials, ensure that you are on the legitimate website URL before you start typing in the form boxes."
   },
   {
      "time": "2022-08-24",
      "title": "Researchers Discovered Counterfeit Phones with Backdoor to Hack WhatsApp Accounts - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-08-24",
      "title": "Google says Iranian group using tool to download Gmail, Yahoo!, Outlook inboxes",
      "text": " An alleged government-backed hacking group from Iran is being accused of using a novel tool to download Gmail, Yahoo!, and Microsoft Outlook inboxes.Bash explained that “Hyperscrape” allowed the group to steal user data from Gmail, Yahoo!, and Microsoft Outlook accounts and download inboxes using previously acquired credentials.“We have seen it deployed against fewer than two dozen accounts located in Iran. The oldest known sample is from 2020, and the tool is still under active development,” Bash said. “We have taken actions to re-secure these accounts and have notified the victims through our Government Backed Attacker Warnings.”Bash added that the group typically targets “high risk users” but did not elaborate further. Google has tracked Charming Kitten – also known as APT35 – for years as it tried to “hijack accounts, deploy malware” and more.The tool requires credentials the attacker has either already stolen or the hijacking of a victim’s session.Once the attacker is able to log in, the tool “changes the account’s language settings to English and iterates through the contents of the mailbox, individually downloading messages as .eml files and marking them unread.”“After the program has finished downloading the inbox, it reverts the language back to its original settings and deletes any security emails from Google,” Bash said. “Earlier versions contained the option to request data from Google Takeout, a feature which allows users to export their data to a downloadable archive file.”It also hacked the website of the School of Oriental and African Studies (SOAS) at the University of London and used it to host a phishing kit last year. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-24",
      "title": "French hospital hit by $10M ransomware attack, sends patients elsewhere",
      "text": " The Center Hospitalier Sud Francilien (CHSF), a 1000-bed hospital located 28km from the center of Paris, suffered a cyberattack on Sunday, which has resulted in the medical center referring patients to other establishments and postponing appointments for surgeries.CHSF serves an area of 600,000 inhabitants, so any disruption in its operations can endanger the health, and even lives, of people in a medical emergency.The hospital's administration has not provided further updates on the situation, and the IT system outage that enforced reduced operations still plagues the establishment.Those in need of emergency care will be evaluated by CHSF's doctors, and if their condition requires medical imaging for treatment, they will be transferred to another medical center.According to Le Monde, which has info from the country's law enforcement agencies, the ransomware actors that hit CHSF demanded the payment of a ransom of $10,000,000 in exchange for a decryption key.If LockBit 3.0 is responsible for the attack on CHSF, it will violate the RaaS program's rules, which prohibit affiliates from encrypting systems of healthcare providers.At this time, the attribution to the particular threat group hasn't been confirmed yet, and LockBit 3.0's extortion site contains no entry for CHSF yet, so their involvement remains a hypothesis."
   },
   {
      "time": "2022-08-24",
      "title": "New 'Donut Leaks' extortion gang linked to recent ransomware attacks",
      "text": " A new data extortion group named 'Donut Leaks' is linked to recent cyberattacks, including those on Greek natural gas company DESFA, UK architectural firm Sheppard Robson, and multinational construction company Sando.Two victims disclosed these attacks without much information regarding who was involved.Finally, Hive Ransomware claimed last month to have attacked Sando but only released a small archive of files as 'proof' of the attack.Strangely, the data for these victims have now appeared on the data leak site for a previously unknown extortion gang known as Donut Leaks. Furthermore, the data shared on the Donut Leaks site is far more extensive than that shared on the ransomware sites, indicating that this new threat actor was involved in the attacks.BleepingComputer first learned of the Donut Leaks extortion group from an employee of one of the victims, who told us that the threat actors breached the corporate network to steal data. Once the threat actors finish stealing data, BleepingComputer was told they emailed URLs of their Tor extortion sites to the victim's business partners and employees.These Tor sites consist of a shaming blog and a data storage site that allows visitors to browse and download all of the stolen, leaked data.The shaming blog currently contains entries for five victims, with all but one containing generic descriptions of the company and a link to their stolen data.However, for one of the entries, the threat actors appeared to take a more aggressive approach, sharing stolen Christmas party photos and a lengthy rant against the company.While there are only five victims listed on the shaming site, the storage server contains what appears to be ten victims.As you can see below, three victims are related to recent attacks disclosed by Sheppard Robson and DESFA, with Sando previously claimed by Hive. BleepingComputer has redacted the names of the other companies as they have not announced they suffered a cyberattack.According to the File Browser stats, the threat actors have leaked approximately 2.8 TB of stolen data from these ten victims.It is unknown whether the threat actors deploy ransomware when breaching networks or are simply a data extortion group.However, Sheppard Robson did disclose that their recent attack was a ransomware attack.\"As is typical with a ransomware attack, the criminals contacted us for purposes of extortion,\" disclosed Sheppard Robson.\"We have refused to pay any money to the attackers as per ICO and NCSC guidance and have reported the incident to the police.\"Furthermore, two different ransomware operations claimed responsibility for DESFA (Ragnar Locker) and SANDO (Hive).This likely means that the threat actor running Donut Leaks is a pen tester or an affiliate for both Hive, Ragnar Locker, and possibly other ransomware operations.In previous conversations with 'pentesters' for Ragnar Locker, the threat actors told us they work for multiple Ransomware-as-a-Service operations to provide affiliates access to internal networks. In some cases, these pentesters will steal the data and keep it for themselves if they feel that the data has value to it.This new extortion group illustrates how stolen data is making it into the hands of multiple groups, with each trying its own methods to extort victims.It also shows that paying a ransom demand may not always prevent your data from being leaked and could still lead to further extortion demands."
   },
   {
      "time": "2022-08-24",
      "title": "Ukraine and Poland agree to jointly counter Russian cyberattacks",
      "text": " Ukraine and Poland signed an agreement on Monday to strengthen cybersecurity collaboration as officials warn of potential cyberattacks from Kremlin-linked hackers. “With Poland, we have not only a common physical border but also a joint problem in cyberspace, where we experience the same kind of attacks,” said Ukraine’s Minister of Digital Transformation Mykhailo Fedorov. “I am sure that together we will become stronger and more effective.”According to the agreement, Ukraine and Poland will jointly participate in cybersecurity conferences and work to prevent the spread of Russian disinformation in the media.During the meeting on Monday, the countries also agreed to exchange digital documents in their e-government apps — Ukrainian Diia app and Polish mObywatel. Now Ukrainians who have moved to Poland will have access to the Ukrainian digital driver's licenses, vehicle registration certificates, and residence permits in the Polish mObywatel app.Ukraine, in turn, will soon recognize some of the Polish digital documents, according to Fedorov.This is not the first time Ukraine is trying to find support from other countries to overcome cyber threats. In July, for instance, it signed an agreement with Slovenia and the U.S. Cybersecurity and Infrastructure Security Agency (CISA).Since the start of the invasion, many of Ukraine’s closest allies have suffered from Russian cyberattacks — mostly without serious consequences.Last week Estonia said that it had repelled the biggest wave of cyberattacks in more than a decade, launched shortly after the Estonian government decided to remove Soviet-era monuments from the country. This attack, attributed to Killnet, “has gone largely unnoticed,” according to Luukas Ilves, Estonia’s undersecretary for digital transformation.In May, Killnet declared “war” against the U.S., the U.K., Germany, Italy, Latvia, Romania, Lithuania, Estonia and Poland for their support of Ukraine.“If you think you are safe because you have EU cyber regulations in place and work together across the Union, the menace will come from outside, as it did,” said Janusz Cieszyński, Poland’s Secretary of State for Digital Affairs, during the meeting with Ukraine’s security officials on Monday.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-24",
      "title": "Suspected Iranian Hackers Targeted Several Israeli Organizations for Espionage",
      "text": " A suspected Iranian threat activity cluster has been linked to attacks aimed at Israeli shipping, government, energy, and healthcare organizations as part of an espionage-focused campaign that commenced in late 2020.Cybersecurity firm Mandiant is tracking the group under its uncategorized moniker UNC3890, which is believed to conduct operations that align with Iranian interests.Intrusions mounted by the group lead to the deployment of two proprietary pieces of malware: a \"small but efficient\" backdoor named SUGARUSH and a browser credential stealer called SUGARDUMP that exfiltrates password information to an email address associated with Gmail, ProtonMail, Yahoo, and Yandex.Also employed is a network of command-and-control (C2) servers that host fake login pages impersonating legitimate platforms such as Office 365, LinkedIn, and Facebook that are designed to communicate with the targets as well as a watering hole that's believed to have singled out the shipping sector.The watering hole, as of November 2021, was hosted on a login page of a legitimate Israeli shipping company, Mandiant pointed out, adding the malware transmitted preliminary data about the logged-in user to an attacker-controlled domain.While the exact methodology for initial access remains unknown, it's suspected to involve a mix of watering holes, credential harvesting by masquerading as legitimate services, and fraudulent job offers for a software developer position at a data analytics firm LexisNexis.\"One of UNC3890's most recent endeavors to target victims includes the usage of a video commercial for AI-based robotic dolls, used as a lure to deliver SUGARDUMP,\" the researchers noted.SUGARUSH, the second bespoke malware, works by establishing a connection with an embedded C2 server to execute arbitrary CMD commands issued by the attacker, granting the adversary full control over the victim's environment upon gaining initial access.Other tools used by UNC3890 include the Metasploit penetration testing software and Unicorn, a publicly available utility for conducting a PowerShell downgrade attack and injecting shellcode into memory.The group's connections to Iran stem from the use of Farsi language artifacts in the newest version of SUGARDUMP, the consistent targeting of Israeli entities that dovetails with other Iranian threat actor clusters, and the usage of the NorthStar C2 Framework.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-08-24",
      "title": "Google: Iranian hackers use new tool to steal email from victims",
      "text": " State-sponsored Iranian hacking group Charming Kitten has been using a new tool to download email messages from targeted Gmail, Yahoo, and Microsoft Outlook accounts.The name of the utility is Hyperscraper and like many of the threat actor’s tools and operations, it is far from sophisticated.But its lack of technical complexity is balanced by effectiveness, allowing the hackers to steal a victim’s inbox without leaving many hints of the intrusion.In a technical report today, researchers from Google's Threat Analysis Group (TAG) share details about Hyperscraper’s functionality and say that it is under active development.Google TAG attributes the tool to Charming Kitten, an Iranian-backed group that is also known as APT35 and Phosphorus, and says that the earliest sample they found dates from 2020.The researchers found Hyperscraper in December 2021 and analyzed it using a test Gmail account. It is not a hacking tool but an instrument that helps the attacker steal email data and store it on their machine after logging into the victim's email account.Getting the credentials (username and password, authentication cookies) for the target inbox is done in a previous step of the attack, typically by stealing them.Hyperscraper has an embedded browser and spoofs the user agent to mimic an outdated web browser, which provides a basic HTML view of the Gmail account’s content.“Once logged in, the tool changes the account’s language settings to English and iterates through the contents of the mailbox, individually downloading messages as .eml files and marking them unread” - Google TAGWhen the exfiltration completes, Hyperscraper changes the language to the original setting and deleted the security alerts from Google for a minimum footprint.When running, Hyperscraper communicates with a command and control (C2) server waiting for confirmation to start the exfiltration process.The operator can configure the tool with the necessary parameters (operation mode, path to a valid cookie file, identifier string) by using command-line arguments or through a minimal user interface.If the path to the cookie file has not been provided over the command line, the operator can drag and drop it into a new form.Once the cookie has been parsed successfully and added to the local cache of the web browser, Hyperscraper creates a “Download” folder where it dumps the contents of the target inbox.The researchers note that if the cookie does not provide access to the account, the operator can log in manually.Hypercraper automates going through all the sections of an email account, opens messages and downloads them in .EML format, and leaves them as originally found.If a message was initially marked as unread, Charming Kitten's tool leaves it in the same state after copying it.Hyperscraper saves all the emails locally, on the operator’s machine, along with logs showing a count of the stolen messages and does not send to the C2 server other data than the status and system information.At the end of the task, Hyperscraper covers its tracks by deleting any emails from Google that could alert the victim of the threat actor’s activity (security notifications, sign-in attempts, access to apps, availability of data archive).Google has observed Hyperscraper being used on a small number of accounts, “fewer than two dozen,” all belonging to users in Iran.Charming Kitten’s targets where Hyperscraper was used have been notified through warnings about government-backed attacks.Google TAG’s report on Hyperscraper today shares indicators of compromise such as two C2 servers and hashes for the tools binaries found."
   }
]