[
   {
      "time": "2022-07-26",
      "title": "\r\n\tIndian Insurance Portal Policybazaar Suffers Breach - Infosecurity Magazine\r\n",
      "text": " Contributing Writer & North America Webinar Moderator“The identified vulnerabilities have been fixed and a thorough audit of the systems has been initiated,” the company said, explaining that its security team is working with external advisors to review the situation.“While we are in the process of undertaking a detailed review, as on date, our review has found that no significant customer data was exposed,” it added.Founded in 2008, Policybazaar uses an online marketplace to connect individuals with insurers offering policies in a range of areas from health to car insurance. The company subverts a traditionally agent-based model, and says that it has sold over 19 million policies since it began.Policybazaar has plans to expand its operating model. It obtained an insurance brokers’ license from India regulator IRDAI in June 2021, enabling it to move into areas including claims assistance and offline services. It will also be able to claim commissions on policy sales rather than mere web aggregation fees.Policybazaar’s owner PB Fintech debuted on the Indian stock exchange in November 2021, boosting its price over 20% above the IPO price on the first day. Its stock price dropped from INR 522 on Friday to close 4.3% down at INR 499.70 on Monday.The breach disclosure letter did not mention which data had been exposed or how many customers were affected."
   },
   {
      "time": "2022-07-26",
      "title": "PrestaShop Confirms Zero Day Attacks Hitting eCommerce Servers - SecurityWeek",
      "text": " Hi, what are you looking for?The team behind the open source PrestaShop ecommerce platform has issued a public advisory to warn of zero day SQL injection attacks hitting merchant servers and planting code capable of stealing customer payment information.ByFlipboardRedditWhatsappWhatsappEmail“To the best of our understanding, this issue seems to concern shops based on versions 1.6.0.10 or greater, subject to SQL injection vulnerabilities. Versions 1.7.8.2 and greater are not vulnerable unless they are running a module or custom code which itself includes an SQL injection vulnerability. Note that versions 2.0.0~2.1.0 of the Wishlist (blockwishlist) module are vulnerable.”\nRyan Naraine is Editor-at-Large at SecurityWeek and host of the popular Security Conversations podcast series. He is a security community engagement expert who has built programs at major global brands, including Intel Corp., Bishop Fox and GReAT. Ryan is a founding-director of the Security Tinkerers non-profit, an advisor to early-stage entrepreneurs, and a regular speaker at security conferences around the world.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...Zero trust is not a replacement for identity and access management (IAM), but is the extension of IAM principles from people to everyone and...A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...WASHINGTON - Cyberattacks are the most serious threat facing the United States, even more so than terrorism, according to American defense experts. Almost half...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-26",
      "title": "Source code for Rust-based info-stealer released on hacker forums",
      "text": " The source code for an information-stealing malware coded in Rust has been released for free on hacking forums, with security analysts already reporting that the malware is actively used in attacks.The malware, which the author claims to have developed in just six hours, is quite stealthy, with VirusTotal returning a detection rate of around 22%.As the info-stealer is written in Rust, a cross-platform language, it allows threat actors to target multiple operating systems. However, in its current form, the new info-stealer only targets Windows operating systems.When executed, the malware attempts to steal data from thirty Chromium-based web browsers, where it will steal stored credit cards, login credentials, and cookies.The stealer also targets a range of \"cold\" cryptocurrency and \"hot\" wallet browser addons, Steam accounts, Discord tokens, Ubisoft Play, and more.Where Luca Stealer stands out against other info-stealers is the focus on password manager browser addons, stealing the locally stored data for 17 applications of this kind.In addition to targeting applications, Luca also captures screenshots and saves them as a .png file, and performs a \"whoami\" to profile the host system and send the details to its operators.One notable capability typically found in other info-stealers but is not available in Luca is a clipper used to modify clipboard contents to hijack cryptocurrency transactions.The exfiltration of the stolen data is done via Discord webhooks or Telegram bots, depending on whether the exfiltrated file is above 50MB or not. The malware will use a Discord webhook to send the data back to the attackers for larger logs of stolen data.The stolen data is packed inside a ZIP archive accompanied by a summary of what's included, so the operator can evaluate the extent of the loot at a single glance.Cyble reports that it has seen at least 25 instances of Luca Stealer used in the wild, so while some cybercriminals took up the free offer, it's unknown if this new malware will see massive deployment.Finally, Luca is written in Rust, which means that porting it to Linux or macOS isn't complicated, so the original author or someone else might perform that conversion in the future."
   },
   {
      "time": "2022-07-26",
      "title": "Ransomware group targets Italian tax agency | CyberScoop",
      "text": " \n\nJuly 25, 2022\n\nEarlier Monday, LockBit 3.0, one of the most active and prolific ransomware groups going, posted a notice to its website claiming it had stolen “100GB: company documents, scans, financial reports, contracts” from the agency, along with six screenshots purporting to show a sample of the files. Update, 7/26/22: to include the modified statement denying an attack occurred."
   },
   {
      "time": "2022-07-26",
      "title": "Hackers exploited PrestaShop zero-day to breach online stores",
      "text": " Hackers are targeting websites using the PrestaShop platform, leveraging a previously unknown vulnerability chain to perform code execution and potentially steal customers' payment information.The PrestaShop team issued an urgent warning last Friday, urging the admins of 300,000 shops using its software to review their security stance after cyberattacks were discovered targeting the platform.The attack appears to impact PrestaShop versions 1.6.0.10 or later and versions 1.7.8.2 or later if they run modules vulnerable to SQL injection, such as the Wishlist 2.0.0 to 2.1.0 module.The attack begins by targeting a module or an older platform version vulnerable to SQL injection exploits. PrestaShop's team has not determined where these flaws exist at this time and warned that the compromise might be caused by a third-party component too.To conduct the attack, hackers send a POST request to a vulnerable endpoint followed by a parameter-less GET request to the homepage that creates a \"blm.php\" file at the root directory.The blm.php file appears to be a web shell that allows the threat actors to execute commands on the server remotely.In many observed cases, the attackers used this web shell to inject a fake payment form on the shop's checkout page and steal customers' payment card details.After the attack, the remote threat actors wiped their tracks to prevent the site owner from realizing they were breached.If the attackers weren't diligent with the cleanup of evidence, compromised site administrators might find entries in the web server's access logs for signs that they were compromised.Other signs of compromise include file modifications to append malicious code and the activation of the MySQL Smarty cache storage, which serves as part of the attack chain.This feature is disabled by default, but PrestaShop has seen evidence of the hackers enabling it independently, so the recommendation is to remove it if not needed.To do that, locate the file \"config/smarty.config.inc.php\" on your shop and delete the following lines:This security fix strengthens the MySQL Smarty cache storage against all code injection attacks, for those who want to continue using the legacy feature.However, it is important to note that if your site has already been compromised, applying the security update won't remediate the problem."
   },
   {
      "time": "2022-07-26",
      "title": "Cisco patches dangerous bug trio in Nexus Dashboard | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondInadequate access control and CSRF protections spawn critical and high severity issuesDiscovered via internal testing, the trio of unauthenticated bugs – one critical, two high severity – have been patched in the data center management platform’s latest software update.The most severe of two high severity issues is the CSRF bug (CVSS 8.8), which exists in the web UI running in the management network.Finally, a flaw with a CVSS rating of 8.2 (CVE-2022-20858) exposes the service that manages container images in both the data and management networks.Arising due to insufficient access controls, the vulnerability can be exploited “by opening a TCP connection to the affected service” and downloading container images or uploading malicious container images to an affected device. “The malicious images would be run after the device has rebooted or a pod has restarted,” added Cisco.Vulnerable versions of Cisco Nexus Dashboard – formerly known as Cisco Application Services Engine – are 1.1, 2.0, 2.1, and 2.2 (although version 1.1 is not affected by CVE-2022-20858). All three flaws have been addressed in version 2.2(1e).Cisco was unable to provide workarounds to mitigate risks.Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2022-07-26",
      "title": "1,000 Organizations Exposed to Remote Attacks by FileWave MDM Vulnerabilities - SecurityWeek",
      "text": " Hi, what are you looking for?Vulnerabilities affecting a mobile device management (MDM) product from FileWave exposed many organizations to remote attacks, according to industrial cybersecurity firm Claroty.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-26",
      "title": "Magecart Hacks Food Ordering Systems to Steal Payment Data from Over 300 Restaurants",
      "text": " Three restaurant ordering platforms MenuDrive, Harbortouch, and InTouchPOS were the target of two Magecart skimming campaigns that resulted in the compromise of at least 311 restaurants.The trio of breaches has led to the theft of more than 50,000 payment card records from these infected restaurants and posted for sale on the dark web.\"InTouchPOS was targeted by a separate, unrelated Magecart campaign, resulting in e-skimmer infections on 157 restaurants using the platform.\"The first set of activities is believed to have started around January 18, 2022, and continued until the malicious domain used in the campaign was blocked on May 26. The InTouchPOS campaign, on the other hand, has remained active since November 12, 2021.The attacks entail inserting malicious PHP code into the businesses' online checkout pages by taking advantage of known security flaws in the services to scrape and transmit the customer data to a server under the attacker's control.The idea is that by targeting online ordering platforms, it can lead to a scenario where when even a single platform is attacked, dozens or even hundreds of restaurants can have their transactions compromised, which enables \"cybercriminals to steal vast amounts of customer payment card data disproportionate to the number of systems they actually hack.\"The development is significant for a number of reasons. First, the intrusions are a departure from the threat actor's traditional targeting of the Magento e-commerce platform, a fact exemplified by the uptick in skimmer attacks aimed at a WordPress plugin named WooCommerce.Furthermore, it serves to highlight how Magecart campaigns are now singling out small, local restaurants that rely on third-party software from lesser-known online ordering services in lieu of designing their own checkout web pages, effectively widening the pool of attack vectors.\"Centralized ordering platforms servicing multiple merchants offer a unique opportunity for Magecart threat actors to collect customer PII and payment card data,\" the researchers said. \"Cybercriminals' increasing interest in targeting online ordering platforms represents a new dimension of risk for restaurants.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]