[
   {
      "time": "2022-11-04",
      "title": "Russian Killnet gang attack crushed by US Treasury • The Register",
      "text": " This article is more than 1 year oldThe US Treasury Department has thwarted a distributed denial of service (DDoS) attack that officials attributed to Russian hacktivist group Killnet.Todd Conklin, cybersecurity counselor to Deputy Treasury Secretary Wally Adeyemo, described the event last month as \"pretty low-level DDoS activity targeting Treasury's critical infrastructure nodes.\"Treasury officials did not immediately respond to The Register's request for comment.Its findings indicate that ransomware continued to pose a significant threat to US critical infrastructure, businesses, and the public, and that a substantial number of ransomware attacks appear to be connected to sources in Russia.In fact, the total of ransomware-related incidents and their monetary value reported in Bank Secrecy Act filings during 2021 far exceeds that of other years, according to the report. The US Treasury's Financial Crimes Enforcement Network said it received 1,489 ransomware-related filings worth nearly $1.2 billion, a 188 percent increase over the $416 million filed in 2020. ®The Register   Biting the hand that feeds IT\n                        Copyright. All rights reserved © 1998–2023\n\n                    "
   },
   {
      "time": "2022-11-04",
      "title": "Cyber incident at Boeing subsidiary causes flight planning disruptions",
      "text": " Jeppesen, a wholly-owned Boeing subsidiary that provides navigation and flight planning tools, confirmed on Thursday that it is dealing with a cybersecurity incident that has caused some flight disruptions.A red banner was added to the company’s website on Wednesday, warning that the Colorado-based firm was experiencing “technical issues with some of our products, services and communication channels.”A spokesperson for Boeing told The Record that the issue was a cybersecurity incident, and the company is still working to restore services.“Our subsidiary, Jeppesen, experienced a cyber incident affecting certain flight planning products and services. There has been some flight planning disruption, but at this time we have no reason to believe that this incident poses a threat to aircraft or flight safety,” the spokesperson said. “We are in communication with customers and regulatory authorities, and working to restore full service as soon as possible.”Although the extent of the disruptions are unclear, the incident is at least impacting the receipt and processing of current and new Notice to Air Missions (NOTAMs) — an industry term for notices filed with aviation authorities to alert pilots of potential hazards along a flight route.Adam Janofsky is the founding editor-in-chief of The Record by Recorded Future. He previously was the cybersecurity and privacy reporter for Protocol, and prior to that covered cybersecurity, AI, and other emerging technology for The Wall Street Journal.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-04",
      "title": "RomCom RAT malware campaign impersonates KeePass, SolarWinds NPM, Veeam",
      "text": " The threat actor behind the RomCom RAT (remote access trojan) has refreshed its attack vector and is now abusing well-known software brands for distribution.Besides copying the HTML code to reproduce the genuine sites, the hackers also registered typo-squat 'lookalike' domains to further add authenticity to the malicious site.The website that impersonates SolarWinds NPM delivers a trojanized version of the free trial and even links to an actual SolarWinds registration form that, if filled out by the victim, leads to being contacted by a real customer support agent.The downloaded app, though, has been modified to include a malicious DLL that downloads and runs a copy of the RomCom RAT from the \"C:\\Users\\user\\AppData\\Local\\Temp\\winver.dll\" folder.Interestingly, the downloaded executable (\"Solarwinds-Orion-NPM-Eval.exe\") is signed with the same digital certificate the RAT’s operators used in the Ukraine campaign, which shows the owner as \"Wechapaisch Consulting & Construction Limited.\"In the case of the cloned site for KeePass, which BlackBerry only discovered on November 1, 2022, the threat actors are distributing an archive named \"KeePass-2.52.zip.\"The ZIP file contains several files, including the \"hlpr.dat,\" which is the RomCom RAT dropper, and \"setup.exe,\" which launches the dropper. Setup.exe is what the user is expected to execute manually after downloading the archive.BlackBerry’s researchers also located a second spoofed KeePass site and a PDF Reader Pro site, both using the Ukrainian language.This indicates that while RomCom is still targeting Ukraine, they have also shifted targets to include English-speaking users.It is unclear at this time how the threat actors are luring potential victims to the sites, but it could be through phishing, SEO poisoning, or forum/social media posts.RomCom RAT was a then-unknown malware supporting ICMP-based communications and offering operators ten commands for file actions, process spawning and spoofing, data exfiltration, and launching a reverse shell.The new report mentions Cuba Ransomware and Industrial Spy as potentially connected to this operation; however, the motivation behind the RomCom operators still remains unclear."
   },
   {
      "time": "2022-11-04",
      "title": "LockBit ransomware claims attack on Continental automotive giant",
      "text": " The LockBit ransomware gang has claimed responsibility for a cyberattack against the German multinational automotive group Continental.LockBit also allegedly stole some data from Continental's systems, and they are threatening to publish it on their data leak site if the company doesn't give in to their demands within the next 22 hours.The gang has yet to make any details available regarding what data it exfiltrated from Continental's network or when the breach occurred.Ransomware gangs commonly publish data on their leak sites as a tactic to scare their victims into negotiating a deal or into returning to the negotiation table.Since LockBit says that it will publish \"all available\" data, this indicates that Continental is yet to negotiate with the ransomware operation or it has already refused to comply with the demands.Continental's VP of Communications & Marketing, Kathryn Blackwell, didn't confirm LockBit's claims and would not share any details regarding the attack when BleepingComputer reached out but, instead, linked to a press release from August 24 regarding a cyberattack that led to a breach of Continental's systems.\"Please see the statement we have issued on this topic. Unfortunately, I cannot provide you with any further details,\" Blackwell told BleepingComputer.\"Immediately after the attack was discovered, Continental took all necessary defensive measures to restore the full integrity of its IT systems,\" Continental said.\"With the support of external cybersecurity experts, the company is conducting an investigation into the incident. The investigation is ongoing.\"The automotive multinational is yet to share its findings. Blackwell also refused to link the August cyberattack to LockBit's claims and told BleepingComputer that she \"cannot provide any further detail at this time.\"Continental reported sales of €33.8 billion in 2021, and it employs more than 190,000 people across 58 countries and markets."
   },
   {
      "time": "2022-11-04",
      "title": "New Crimson Kingsnake gang impersonates law firms in BEC attacks",
      "text": " A business email compromise (BEC) group named 'Crimson Kingsnake' has emerged, impersonating well-known international law firms to trick recipients into approving overdue invoice payments.The threat actors impersonate lawyers who are sending invoices for overdue payment of services supposedly provided to the recipient firm a year ago.This approach creates a solid basis for the BEC attack, as recipients may be intimidated when receiving emails from large law firms like the ones impersonated in the scams.Analysts at Abnormal Security, who first discovered Crimson Kingsnake activity in March 2022, report having identified 92 domains linked to the threat actor, all similar to genuine law firm sites.This typosquatting approach enables the BEC actors to send out emails to victims via an address that appears authentic at first glance.The emails contain the logos and letterheads of the impersonated entities and are crafted professionally, featuring punctual writing.The law firms impersonated by Crimson Kingsnake include:These are major multinational firms with a global footprint, so the threat actors assume the target will recognize them, which adds legitimacy to the email.The phishing emails don't target specific industries or countries but are distributed somewhat randomly in what Abnormal Security calls \"blind BEC attacks.\"If any recipients fall for the bait and request more information about the invoice, Crimson Kingsnake responds by providing a fake description of the provided service.In some cases where the BEC actors meet resistance, they add a false \"reply\" from an executive in the targeted company to approve the transaction.\"When a Crimson Kingsnake actor is questioned about the purpose of an invoice payment, we've observed instances where the attacker sends a new email with a display name mimicking a company executive.\"\"In this email, the actor clarifies the purpose of the invoice, often referencing something that supposedly happened several months before, and “authorizes” the employee to proceed with the payment.\"While the email originates from outside the company, the executive's email address can still trick the recipient, especially if there are no mailbox filters and warning systems to alert the targeted employee.BEC attacks are only a tiny part of all the daily phishing emails circulating in global inboxes, but even in these low volumes, it’s still a multi-billion problem.According to the same report, organizations with over 50,000 employees have a 95% chance of receiving a BEC email weekly."
   },
   {
      "time": "2022-11-04",
      "title": "OPERA1ER hackers steal over $11 million from banks and telcos",
      "text": " A threat group that researchers call OPERA1ER has stolen at least $11 million from banks and telecommunication service providers in Africa using off-the-shelf hacking tools.Between 2018 and 2022, the hackers launched more than 35 successful attacks, about a third of them carried out in 2020.Analysts at Group-IB, working with the CERT-CC department at Orange, have been tracking OPERA1ER since 2019 and noticed that the group changed its techniques, tactics, and procedures (TTPs) last year.Concerned about losing the threat actor's tracks, the cybersecurity company waited for the group to resurface to publish an updated report. This year, Group-IB observed that the hackers were active once again.The hacker group is formed of French-speaking members believed to operate from Africa. Apart from targeting companies in Africa, the gang also hit organizations in Argentina, Paraguay, and Bangladesh.OPERA1ER relies on open-source tools, commodity malware, and frameworks like Metasploit and Cobalt Strike to compromise company servers.They obtain initial access through spear-phishing emails leveraging popular topics like invoices or postal delivery notifications.The emails have attachments that deliver the first-stage malware, among them Netwire, bitrat, venomRAT, AgentTesla, Remcos, Neutrino, BlackNET, and Venom RAT. Group-IB also says that the hackers distributed password sniffers and dumpers.According to the researchers, OPERA1ER can spend between three to twelve months inside the compromised networks, and sometimes they attack the same company twice.The researchers say that after getting access to a victim network, the hackers may also use the infrastructure as a pivot point to other targets.Group-IB says that the threat actor creates “high-quality” spear-phishing emails that are written in French. Most of the times, the messages impersonate either the government tax office or a hiring agent from the Central Bank of West African States (BCEAO).Using stolen credentials, OPERA1ER accesses email accounts and performs lateral phishing, studies internal documentation to understand money transfer procedures and protection mechanisms, and carefully plans the final, cashing out step.Typically, the hackers targeted operator accounts that controlled large amounts of money and used stolen credentials to transfer the funds into Channel User accounts, eventually moving them into subscriber accounts under their control.“In one case studied by the researchers, a network of more than 400 subscriber accounts controlled by money mules hired by OPERA1ER was used to enable the cashing out of the stolen funds, mostly done overnight via ATMs” - Group-IBUsually, the cashing out event took place on a holiday or over the weekend to minimize the chances of the compromised organizations responding to the situation in time.On victimized banks, OPERA1ER targeted the SWIFT messaging interface software that communicates all details for financial transaction, and siphoned key information about the anti-fraud systems they needed to bypass."
   },
   {
      "time": "2022-11-04",
      "title": "ALMA Observatory shuts down operations due to a cyberattack",
      "text": " The Atacama Large Millimeter Array (ALMA) Observatory in Chile has suspended all astronomical observation operations and taken its public website offline following a cyberattack on Saturday, October 29, 2022.Email services at the observatory are currently limited, and IT specialists are working toward restoring the affected systems.The organization informed the public about the security incident on Twitter yesterday, saying that at this time, given the nature of the episode, it is impossible to estimate a date for a return to normal operations.The observatory also clarified that the attack did not compromise the ALMA antennas or any scientific data, indicating that there are no signs of unauthorized data access or exfiltration.BleepingComputer has contacted ALMA Observatory in an attempt to learn more about the security incident, and a spokesperson shared the following comment:\"We cannot further discuss the details as there is an ongoing investigation.Our IT team was prepared to face the situation and had the proper infrastructure, although there is no flawless defense against hackers.We are still working hard on the full recovery of services. Thanks for your understanding.\" - ALMA Observatory.The ALMA observatory is comprised of 66 high-precision radio telescopes of 12 m diameter arranged in two arrays, located at an elevation of 5,000 m (16,400 ft) at the Chajnantor plateau.The project cost $1.4 billion, making it the world’s most expensive ground telescope, and it was developed thanks to a multi-national effort involving the United States, Europe, Canada, Japan, South Korea, Taiwan, and Chile.Since 2013 when ALMA entered normal operational status, it has aided pioneering comet and planetary formation studies, participated in the Event Horizon project to photograph a black hole for the first time in history, and detected the biomarker ‘phosphine’ in the atmosphere of Venus.The observatory is used by scientists of the National Science Foundation, the European Southern Observatory, the National Astronomical Observatory of Japan, and other groups from around the world, so any halt in its operations impacts multiple science teams and ongoing projects."
   },
   {
      "time": "2022-11-04",
      "title": "New clipboard hijacker replaces crypto wallet addresses with lookalikes",
      "text": " A new clipboard stealer called Laplas Clipper spotted in the wild is using cryptocurrency wallet addresses that look like the address of the victim's intended recipient.Laplas is different from other malware of the same kind, which are typically just add-ons of info-stealing malware. The new clipper is a feature-rich tool that gives hackers more granular control and better insight into the efficiency of their operations.The tool is provided under a subscription model, the most expensive tier being $549 for a year's access to the web-based panel that allows operators to monitor and control their attacks.Currently, Laplas is distributed through the Smoke Loader and the Raccoon Stealer 2.0, showing that it has attracted the attention of the cybercrime community.Standard clipboard stealers, also called clippers, monitor the Windows clipboard and activate when they detect a cryptocurrency wallet address that users typically copy as the destination for a payment.When this happens, the clipper changes that address with one belonging to the cybercriminals, thus diverting the payment to the attacker.To counter this risk, many crypto holders today check if the address in the clipboard is the intended one by comparing a few characters, which makes most clippers less effective.The developers of Laplas came up with a new approach to deceive keen-eyed crypto users by using addresses that closely resemble the one the victim copied.It is unclear how the hackers obtain the similar addresses. In tests BleepingComputer made, we were able to generate an address similar to the original input as fast as five seconds.However, this is significantly more than what it takes an average user to copy and paste, which could raise the suspicions.One theory is that the hackers pre-generated a massive number of addresses in advance for Laplas to pick the ones that are similar to what the victim used.Cyble notes that this process happens on the attacker's server so the exact mechanism remains unknown. Identifying an address that is similar to what the victim pasted in the clipboard is done using regular expressions.Cyble shared with BleepingComputer that their research showed that Laplas retrieved a Bitcoin address that matched the first and last few characters of the one pasted in the clipboard.However, in the case of Ethereum the address fetched from the attacker's server looked nothing like the original it tried to spoof. The clipper supports wallet address generation for Bitcoin, Bitcoin Cash, Litecoin, Ethereum, Dogecoin, Monero, Algorand, Ravecoin, Ripple, Zcash, Dash, Ronin, Tron, Tezos, Solana, Cardano, Cosmos, Qtum, and Steam Trade URLs.According to the author’s promotional post on the dark web, the new addresses are generated in less than a second and are added to the web panel along with the balance they currently hold.Generated wallets are stored in the database for three days, but operators can send the access keys to their Telegram accounts to assume control of the wallets later.Users can also use Telegram to receive real-time notifications about any of the clipper’s actions in compromised hosts, like stealing a significant amount.Users should avoid downloading executables from obscure websites or running attachments received over email.It is recommended to spend an extra moment and validate the recipient's address before making a cryptocurrency transaction.Storing wallet seeds in encrypted form should also make it more difficult for cybercriminals to obtain access to the cryptocurrency funds, even if they get the info."
   },
   {
      "time": "2022-11-04",
      "title": "Black Basta ransomware gang linked to the FIN7 hacking group",
      "text": " Security researchers at Sentinel Labs have uncovered evidence that links the Black Basta ransomware gang to the financially motivated hacking group FIN7, also known as \"Carbanak.\"When analyzing tools used by the ransomware gang in attacks, the researchers found signs that a developer for FIN7 has also authored the EDR (Endpoint Detection and Response) evasion tools used exclusively by Black Basta since June 2022.Further evidence linking the two includes IP addresses and specific TTPs (tactics, techniques, and procedures) used by FIN7 in early 2022 and seen months later in actual Black Basta attacks.FIN7 is a Russian-speaking, financially motivated hacking group that has been active since at least 2015, deploying POS malware and launching targeted spear-phishing attacks against hundreds of firms.The new ransomware operation has kept a closed profile, not promoting itself as a ransomware-as-a-service or recruiting affiliates, indicating it may be a private group.Starting from June 2022 and onwards, Black Basta was observed deploying a custom EDR evasion tool used exclusively by its members.By digging deeper into this tool, Sentinel Labs found an executable, \"WindefCheck.exe,\" that displays a fake Windows Security GUI and tray icon that gives users the illusion that Windows Defender is working normally.In the background, though, the malware disables Windows Defender, EDR, and antivirus tools, ensuring that nothing will jeopardize the data exfiltration and encryption process.This tool is illustrated below, where the top image shows the fake Windows Security screen, with various security settings appearing to be enabled and protecting the device. However, the screen underneath shows the actual status of these security settings being disabled.Furthermore, the backdoor connects to a C2 IP address belonging to \"pq.hosting,\" a bulletproof hosting provider FIN7 trusts and uses regularly.Additional evidence of a connection between FIN7 and Black Basta concerns FIN7’s early 2022 experimentation with Cobalt Strike and Meterpreter C2 frameworks in simulated malware-dropping attacks.The same activity using the exact custom tools, plugins, and delivery methods was observed many months later in actual attacks by Black Basta.While these technical similarities point to Fin7 members being part of the Black Basta operation, it is still unclear whether they are just devs for the group, operators, or affiliates using their own tools during attacks."
   }
]