[
   {
      "time": "2023-11-17",
      "title": "\r\n\tCSA Launches First Zero Trust Certification - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe Cloud Security Alliance (CSA) has introduced the Certificate of Competence in Zero Trust (CCZT), the industry’s inaugural authoritative zero trust certification. CSA said the certification responds to the evolving landscape of pervasive technology and the inadequacy of legacy security models. It aims to equip security professionals with the knowledge necessary to develop and implement a zero trust strategy.“Zero Trust ‘never trust, always verify’ principles are clearly the path forward, and we anticipate virtually all organizations to apply this strategy to diverse technological environments in order to protect strategic assets and prevent breaches,” Reavis said.“As firms add CCZT to their list of desired and required certifications, it will drive IT professionals in general to seek the certification as a gateway to future opportunities,” Webb said. “As that happens, firms will adopt more zero-trust practices simply because they have the staff on hand that understand them and want to see them in place.”"
   },
   {
      "time": "2023-11-17",
      "title": "Zimbra zero-day exploited to steal government emails by 4 groups",
      "text": " The experts observed that most of the attacks took place after the public disclosure of the patch for this vulnerability.Google TAG researcher Clément Lecigne discovered the zero-day in June while investigating targeted attacks against Zimbra’s email server.Three of the campaigns observed by Google exploited the vulnerability prior to the release of the fix, while the fourth threat actor launched its campaign a month after the patches were published.A third unidentified group exploited the vulnerability to steal credentials belonging to a government organization in Vietnam.“In this case, the exploit url pointed to a script that displayed a phishing page for users’ webmail credentials and posted stolen credentials to a url hosted on an official government domain that the attackers likely compromised.” continues the report.The fourth campaign was observed in August 2023, threat actors exploited the vulnerability in an attack against a government organization in Pakistan. The exploit was used to steal the Zimbra authentication token. “The discovery of at least four campaigns exploiting CVE-2023-37580, three campaigns after the bug first became public, demonstrates the importance of organizations applying fixes to their mail servers as soon as possible. These campaigns also highlight how attackers monitor open-source repositories to opportunistically exploit vulnerabilities where the fix is in the repository, but not yet released to users.” concludes the report. “The actors behind Campaign #2 began exploiting the bug after the fix was pushed to Github, but before Zimbra publicly released the advisory with remediation advice.”\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-11-17",
      "title": "Toyota confirms breach after Medusa ransomware threatens to leak data",
      "text": " Toyota Financial Services (TFS) has confirmed that it detected unauthorized access on some of its systems in Europe and Africa after Medusa ransomware claimed an attack on the company.Toyota Financial Services, a subsidiary of Toyota Motor Corporation, is a global entity with a presence in 90% of the markets where Toyota sells its cars, providing auto financing to its customers.Earlier today, the Medusa ransomware gang listed TFS to its data leak site on the dark web, demanding a payment of $8,000,000 to delete data allegedly stolen from the Japanese company.The threat actors gave Toyota 10 days to respond, with the option to extend the deadline for $10,000 per day.While Toyota Finance did not confirm if data was stolen in the attack, the threat actors claim to have exfiltrated files and threaten with a data leak if a ransom is not paid.To prove the intrusion, the hackers published sample data that includes financial documents, spreadsheets, purchase invoices, hashed account passwords, cleartext user IDs and passwords, agreements, passport scans, internal organization charts, financial performance reports, staff email addresses, and more.Medusa also provides a .TXT file with the file tree structure of all the data they claim to have stolen from Toyota’s systems.Most of the documents are in German, indicating that the hackers managed to access systems serving Toyota’s operations in Central Europe.BleepingComputer reached out to the Japanese automaker for a comment on the leaked data and a company spokesperson provided the following statement:“Toyota Financial Services Europe & Africa recently identified unauthorized activity on systems in a limited number of its locations.”“We took certain systems offline to investigate this activity and to reduce risk and have also begun working with law enforcement.”“As of now, this incident is limited to Toyota Financial Services Europe & Africa.”Regarding the status of the impacted systems and their estimated return to normal operations, the spokesperson told us that the process of bringing systems back online is already underway in most countries."
   },
   {
      "time": "2023-11-17",
      "title": "Long Beach, California turns off IT systems after cyberattack",
      "text": " The Californian City of Long Beach is warning that they suffered a cyberattack on Tuesday that has led them to shut down portions of their IT network to prevent the attack's spread.Long Beach is the home to approximately 460,000 people and is the seventh most populous city in California.Yesterday, the City of Long Beach warned that it suffered a cyberattack on November 14th and engaged a cybersecurity firm to investigate the incident and notified the FBI.The City says that once it detected the attack, it began to take systems offline immediately, which is done to prevent the spread of the attack to other devices.\"City email and phone systems are generally expected to remain available and City Hall and other public facing City facilities will be open as scheduled. Updates regarding the current operations for specific digital services will be available in the near future.\"\"As the City works to resolve this incident, the public may experience some delays with systems and services, and we appreciate the public's patience and understanding of these inconveniences.\"While some of the City's online services will not be available through the weekend, emergency services remain unaffected.It is unclear what type of cyberattack occurred and if data was stolen. However, it bears the hallmarks of a ransomware attack, which commonly involves data theft.No threat actors have claimed responsibility for the attack, which usually does not occur until a week or more after a security incident when they publicly begin extortion attempts.BleepingComputer contacted the City with further questions, but a response was not immediately available."
   },
   {
      "time": "2023-11-17",
      "title": "MySQL servers targeted by 'Ddostf' DDoS-as-a-Service botnet",
      "text": " MySQL servers are being targeted by the 'Ddostf' malware botnet to enslave them for a DDoS-as-a-Service platform whose firepower is rented to other cybercriminals.This campaign was discovered by researchers at the AhnLab Security Emergency Response Center (ASEC) during their regular monitoring of threats targeting database servers.The attackers are scanning the internet for exposed MySQL servers and, when found, attempt to breach them by brute-forcing administrator credentials.For Windows MySQL servers, the threat actors use a feature called user-defined functions (UDFs) to execute commands on the breached system.UDF is a MySQL feature that allows users to define functions in C or C++ and compile them into a DLL (dynamic link library) file that extends the capabilities of the database server.The attackers, in this case, create their own UDFs and register them with the database server as a DLL file (amd.dll) with the following malicious functions:The UDF abuse facilitates loading the primary payload of this attack, the Ddostf bot client. However, it can also potentially allow other malware installation, data exfiltration, creation of backdoors for persistent access, and more.Ddostf is a malware botnet of Chinese origin, first spotted in the wild roughly seven years ago, and targets both Linux and Windows systems.On Windows, it establishes persistence by registering itself as a system service upon first running and then decrypts its C2 (command and control) configuration to establish a connection.The malware profiles the host system and sends data such as CPU frequency and number of cores, language information, Windows version, network speed, etc., to its C2.The C2 server may send DDoS attack commands to the botnet client, including SYN Flood, UDP Flood, and HTTP GET/POST Flood attack types, request to stop transmitting system status info, switch to a new C2 address, or download and execute a new payload.ASEC comments that Ddostf's ability to connect to a new C2 address makes it stand out from most DDoS botnet malware and is an element that gives it resilience against takedowns.The cybersecurity company suggests that MySQL admins apply the latest updates and pick long, unique passwords to protect admin accounts from brute force and dictionary attacks."
   },
   {
      "time": "2023-11-17",
      "title": "Vietnam Post exposes 1.2TB of data, including email addresses",
      "text": " Vietnam Post Corporation, a Vietnamese government-owned postal service, left its security logs and employee email addresses accessible to outside cyber snoopers, Cybernews researchers have discovered. The exposed sensitive data could spell trouble if accessed by malicious actors.On October 3rd, the Cybernews research team discovered an open Kibana instance belonging to the Vietnam Post Corporation. Kibana is a visualization dashboard for data search and analytics, helping enterprises deal with large quantities of data.At the time of discovery, the data store contained 226 million logged events, resulting in 1.2 Terabytes of data, which was being updated in real-time. The leaked information also had employee names and emails.Those logs were mainly attributable to cybersecurity software such as Extended Detection and Response (XDR) and Security Information and Event Management (SIEM). Some records resembled a modified version of Wazuh, an open-source security information and event management (SIEM) platform.“Event logs can be very valuable for potential attackers, as they can help with network, user, and service enumeration and tracking,” Cybernews researchers explain.The data store was left accessible for at least 87 days, as the internet-scanning IoT search engines indexed the data for the first time on July 8th, 2023.Soon after the discovery on October 6th, Vietnam Post Corporation revoked public access before the Cybernews researchers could contact them. Cybernews has contacted the company but has yet to receive additional comments before publishing this article.While the leak wouldn’t provide attackers with direct access to sensitive systems or user accounts, it contained device usernames with employee names or emails. This information enables potential attackers to identify which employees were working at a given time and which devices they were using.“XDR tools are essential for cyber security personnel to keep track of what is happening in the network, allowing them to detect threats and respond effectively. When such systems fall into the wrong hands, it can give an attacker visibility into the network and monitor the response to potential threats they might unleash on the nodes in the network,” Cybernews researchers explain.Malicious actors, especially state-sponsored advanced persistent threats, monitor potential weaknesses to wreak chaos in targeted systems. And security logs, listing machines, users, and their activity, would be very valuable to them.“This leak is significant, as it could have been used to assist in an attack against a governmental organization, which is often considered critical infrastructure. It could have been used to collect information about its employee’s activities,” Cybernews researchers believe.State-owned corporations are often responsible for critical infrastructure, which is paramount to uninterrupted operations.“Vietnam Postal Corporation leak reveals that the organization was taking security seriously to the extent of using XDR and SIEM software, and they still exposed sensitive information about internal network events and nodes by failing to keep access to the collected information secure. This highlights the importance of ensuring that access to company-wide security tools remains private and only available to authorized personnel,” researchers concluded.The recommendations provided by CyberNews researchers are available here:\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-11-17",
      "title": "FBI shares tactics of notorious Scattered Spider hacker collective",
      "text": " The Federal Bureau of Investigation and the Cybersecurity and Infrastructure Security Agency released an advisory about the evasive threat actor tracked as Scattered Spider, a loosely knit hacking collective that now collaborates with the ALPHV/BlackCat Russian ransomware operation.The group includes young English-speaking members (as young as 16) with diverse skill sets who frequent the same hacker forums and Telegram channels.Contrary to the general belief that it is a cohesive gang, they are a network of individuals, with different threat actors participating in each attack. This fluid structure is what makes it difficult to track them.The researchers' findings about the group's variety of attack methods indicate that its members have knowledge that extends to different areas of cybercrime, from social engineering and hacking, to SIM swapping, phishing, and bypassing login protections.The FBI and CISA alert highlights Scattered Spider’s powerful initial access tactics that involve targeting a company's employees by posing as IT or help-desk staff and tricking them into providing credentials or even direct network access.After establishing a foothold on the network, Scattered Spider uses a range of publicly available software tools for reconnaissance and lateral movement, including:Apart from the above legitimate tools used for malicious purposes, Scattered Spider also conducts phishing attacks to install malware like the WarZone RAT, Raccoon Stealer, and Vidar Stealer, to steal from compromised systems login credentials, cookies, and other data useful in the attack.A new tactic observed in the threat group’s recent attacks is data exfiltration and file encryption using the ALPHV/BlackCat ransomware, followed by communication with the victims via a messaging app, email, or other secure tools to negotiate a ransom payment.Scattered Spider shows particular interest in valuable assets like source code repositories, code-signing certificates, and credential storage.Also, the attackers closely monitor the victim’s Slack channels, Microsoft Teams, and Microsoft Exchange emails for messages containing any indication that their activities have been discovered.The agency adds that the cybercriminals achieve this \"by creating new identities in the environment\" that often have fake social media profiles for a false sense of legitimacy.The FBI and CISA recommend implementing specific mitigations to protect against threats imposed by Scattered Spider.Key recommendations in the advisory propose to:Finally, organizations are advised to test and validate their security controls against MITRE ATT&CK techniques described in the advisory."
   },
   {
      "time": "2023-11-17",
      "title": "\r\n\tBlack Friday: Malwarebytes Warns of Credit Card Skimming Surge - Infosecurity Magazine\r\n",
      "text": " Reporter, Infosecurity MagazineWith Black Friday and Cyber Monday around the corner, anti-malware provider Malwarebytes has warned about the rise of credit card skimming.This type of identity theft, where criminals steal credit card information from ATMs, other payment terminals or even compromised websites, is expected to rise over the next few weeks, Malwarebytes Labs said in a post published on November 14, 2023.One specific credit card skimming campaign, Kritec, picked up the pace drastically in October after a lull during the summer.Kritec is a type of skimmer that was first discovered by Akamai in March 2023 and attributed to Magecart, a nebulous hacking cluster that employs online skimming techniques to steal personal data from websites—most commonly, customer details and credit card information on websites that accept online payments.However, Malwarebytes has noticed several differences from previous Magecart skimming campaigns. They attributed it to a different threat actor named Kritec after one of the domain names used by the perpetrators.Kritec is a malicious JavaScript code injected into legitimate websites, typically those using the Magento e-commerce platform. Once injected, Kritec hides itself within the Google Tag Manager (GTM) script, making it difficult for security solutions to detect. When a customer enters their credit card information on the checkout page, Kritec steals the information and sends it to a remote server controlled by the attackers.The infrastructure is located on the IT WEB LTD network, registered in the British Virgin Islands.The skimming campaign peaked in April before slowing down over the summer. It then returned, increasing to its highest volume in October."
   },
   {
      "time": "2023-11-17",
      "title": "Fortinet warns of critical command injection bug in FortiSIEM",
      "text": " Fortinet is alerting customers of a critical OS command injection vulnerability in FortiSIEM report server that could be exploited by remote, unauthenticated attackers to execute commands through specially crafted API requests.FortiSIEM (Security Information and Event Management) is a comprehensive cybersecurity solution that provides organizations with enhanced visibility and granular control over their security posture.It is used in businesses of all sizes in the healthcare, financial, retail, e-commerce, government, and public sectors.Improper neutralization issues arise when the software fails to sanitize input, such as special characters or control elements, before it is passed through an accepted OS command delivered to an interpreter.In this case, the program takes API requests and passes them to the OS as a command to be executed, leading to dangerous scenarios like unauthorized data access, modification, or deletion.Affected versions include FortiSIEM releases from 4.7 through 5.4. Fortinet urges system administrators to upgrade to versions 6.4.3, 6.5.2, 6.6.4, 6.7.6, 7.0.1, or 7.1.0 and later.Fortinet products include firewalls, endpoint security, and intrusion detection systems. These are often targeted by sophisticated, state-backed hacking groups, for access to an organization's network.UPDATE [November 17]: Article updated to clarify that the critical severity score of 9.8 was calculated by Fortinet without temporal metrics."
   },
   {
      "time": "2023-11-17",
      "title": "FBI and CISA warn of attacks by Rhysida ransomware gang",
      "text": " The report includes IOCs and TTPs identified through investigations as recently as September 2023. The ransomware gang hit organizations in multiple industries, including the education, healthcare, manufacturing, information technology, and government sectors. The victims of the group are “targets of opportunity.”The group relies on living off-the-land techniques such as native (built into the operating system) network administration tools to perform malicious operations. Below is the list of tools used by the group for its activities:The advisory includes mitigations for network defenders along with indicators of compromise (IoCs).\nCopyright@securityaffairs 2023 "
   }
]