[
   {
      "time": "2022-10-11",
      "title": "Harvard Business Publishing licensee hit by ransomware",
      "text": " Crooks left a ransom note, threatening to leak the data and inform authorities of the EU’s General Data Protection Regulation (GDPR) violations.A recent discovery by the Cybernews research team is a stellar example of how open databases pose a great risk to businesses and consumers alike.On September 16, researchers discovered an unprotected MongoDB instance owned by infomag.com.tr – an independently owned and operated licensee of Harvard Business Publishing (HBP), a wholly-owned subsidiary of Harvard University.According to its website, Infomag publishes Bloomberg Businessweek and Harvard Business Review in Turkish.Hosted in Turkey, the database was 3.9GB-strong and had over 19.5 million records, although there were some duplicates and some data wasn’t sensitive.In total, the database leaked over 152,000 pieces of information pertaining to customers, such as emails, names, links to LinkedIn, Twitter, and Facebook profiles, and hashed passwords. Some were protected by a fragile encryption algorithm like MD5, but others were encrypted using bcrypt, considered a strong hash.The instance also contained 15 employee emails, names, and passwords protected by a weak SHA1-128bit hash. Some credential pairs belonged to Harvard Business Review English (@hbr.org) users.The oldest entry goes as far back as 2017, and it is unclear how long this instance had been open prior to the Cybernews discovery.The dataset also contained payment logs with emails, dates, bank names, phone numbers, and internet protocol (IP) addresses. Infomag also stored physical addresses of some companies and private individuals, as well as company tax numbers.Given a considerable portion of the stored passwords were hashed using weak password-hashing functions (MD5 or SHA1), they could easily be decrypted and used for credential-stuffing attacks.SHA1 (Secure Hashing Algorithm 1) has been broken since 2004 and can be breached quickly by criminals at relatively little cost. MD5 is an even weaker algorithm, reportedly first compromised back in 1996.Moreover, the database contained physical addresses – paired with names, email addresses, and phone numbers, this information could be used for identity theft or harassment.The open instance also contained some information that could harm the company itself. For example, the “Admin” indice revealed that some employees had permission to edit the Harvard Business Review Turkey (hbrturkiye.com) website. Employee emails and credentials could be used to modify the website without confirmation, or to access additional resources connected to the internet.In the wrong hands, the database could also harm Infomag’s licensor – Harvard Business Publishing – as it contained some of the credentials belonging to hbr.org addresses.On September 19, Cybernews researchers went back to check whether the database was still open and learned that it had been hit by a ransomware attack, meaning that criminals found the dataset before its owner had a chance to close it.Crooks left a note, asking for a ransom in Bitcoin and threatening to contact authorities that might fine the company for potential GDPR violations.“You must pay 0.01 BTC to [wallet address] 48 hours for recover it. After 48 hours expiration we will leaked and exposed all your data. In case of refusal to pay, we will contact the General Data Protection Regulation, GDPR and notify them that you store user data in an open form and is not safe. Under the rules of the law, you face a heavy fine or arrest and your base dump will be dropped from our server! [sic]” the note reads.It further gives the victim instructions on where and how to buy Bitcoin. Upon further investigation, the Cybernews team found that the wallet address mentioned in the note had nine transactions, with five seemingly being from victims transferring 0.01BTC – precisely the ransom amount demanded by the crooks.However, the last transaction to the criminals’ wallet was made on July 31, suggesting Infomag hasn’t caved in to their demands.We’ve reached out to both Infomag and Harvard Business Publishing for more details about the incident. Harvard Business Publishing reacted instantly, pointing out that, while Infomag is only a licensee, they take these matters seriously and have made the Turkish company aware of the information that Cybernews provided. We’ve repeatedly contacted Infomag, too, but they have yet to respond.Data breach monitoring platform Breachsense has indexed over 25 billion leaked credentials. Its founder Josh Amishav-Zlatin says that when data leaks make the headlines, it’s almost either a misconfigured ElasticSearch, MongoDB, or S3 instance.“The underlying issue is often a combination of a lack of visibility into the company’s assets plus a simple misconfiguration on the server itself,” he told Cybernews.It could also be a simple misconfiguration where, for example, an IT specialist has mistakenly opened up a port to the outside world and unintentionally exposed data.“The second common error is associated with application vulnerabilities existing in a customer’s environment that can expose the backend database and allow hackers access,” Tom Neclerio, VP of Professional Services at cybersecurity company SilverSky told Cybernews.Sensitive data could still stay secure even if unintentionally exposed. However, companies don’t always properly encrypt data, for example using outdated hashing algorithms to protect passwords.“Exposing sensitive data or allowing it to get into the wrong hands can have a cascading effect, leading to regulatory and compliance fines, potential lawsuits and legal fines, reputational damage including lost customer confidence, and a financial impact including lost business,” Neclerio said.[adrotate banner=”5″][adrotate banner=”13″]\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2022-10-11",
      "title": "US airports' sites taken down in DDoS attacks by pro-Russian hackers",
      "text": " Update: Title of story modified to indicate it was the sites taken down.The pro-Russian hacktivist group 'KillNet' is claiming large-scale distributed denial-of-service (DDoS) attacks against websites of several major airports in the U.S., making them unaccessible.The DDoS attacks have overwhelmed the servers hosting these sites with garbage requests, making it impossible for travelers to connect and get updates about their scheduled flights or book airport services.Notable examples of airport websites that are currently unavailable include the Hartsfield-Jackson Atlanta International Airport (ATL), one of the country's larger air traffic hubs, and the Los Angeles International Airport (LAX), which is intermittently offline or very slow to respond.Other airports returning database connection errors include Chicago O'Hare International Airport (ORD), Orlando International Airport (MCO), Denver International Airport (DIA), Phoenix Sky Harbor International Airport (PHX), along with some in Kentucky, Mississippi, and Hawaii.KillNet listed the domains yesterday on its Telegram channel, where members and volunteers of the hacktivist group gather to acquire new targets.They are relying on custom software to generate fake requests and garbage traffic directed at the targets with the goal of depleting their resources and making them unavailable to legitimate users.In this case, the DDoS attacks do not impact flights, but they still have an adverse effect on the function of a crucial economic sector, threatening to disrupt or delay associated services.As the war in Ukraine has entered a new phase, pro-Russian threat actors and hacktivists are trying to ramp up their retaliatory cyberattacks against neuralgic organizations in the western world.The U.S., being the de-facto leader of NATO, which is Russia's main military rival, has supplied Ukraine with intelligence and equipment from early on in the war, but DDoS attacks so far seemed to be focused on EU targets, especially after the announcement of sanctions."
   },
   {
      "time": "2022-10-11",
      "title": "\r\n\tGerman Cybersecurity Chief Faces Sacking Over Possible Russia Ties - Infosecurity Magazine\r\n",
      "text": " Reporter, Infosecurity MagazineAccording to the Policy Network Analytics research network, Protelion née Infotecs was a subsidiary of the Russian firm, operated by a former member of the KGB.German authorities are reportedly hoping to assign Schoenbohm a new role rather than remove him outright, as provisions of the civil service law place limitations on the firing of state employees.Neither Schoenbohm, the Interior Ministry nor the BSI replied to German media requests for comment at the time of writing, and a joint appearance of Faeser and Schoenbohm scheduled for Thursday to present the BSI Situation Report 2022 has reportedly been called off."
   },
   {
      "time": "2022-10-11",
      "title": "Caffeine service lets anyone launch Microsoft 365 phishing attacks",
      "text": " A phishing-as-a-service (PhaaS) platform named 'Caffeine' makes it easy for threat actors to launch attacks, featuring an open registration process allowing anyone to jump in and start their own phishing campaigns.Caffeine doesn't require invites or referrals, nor does it require wannabe threat actors to get approval from an admin on Telegram or a hacking forum. Due to this, it removes much of the friction that characterizes almost all platforms of this kind.Another distinctive characteristic of Caffeine is that its phishing templates target Russian and Chinese platforms, whereas most PhaaS platforms tend to focus on lures for Western services.The cybersecurity firm first spotted Caffeine after investigating a large-scale phishing campaign run through the service, targeting one of Mandiant's clients to steal Microsoft 365 account credentials.Caffeine requires account creation, after which the operator gets immediate access to the \"Store,\" which contains phishing campaign-creation tools and an overview dashboard.Next, the operators must purchase a subscription license, which costs $250 per month, $450 for three months, or $850 for six months, depending on the features.That’s roughly 3-5 times the typical PhaaS subscription cost, and Caffeine attempts to make up for it by offering anti-detection and anti-analysis systems and customer support services.In terms of phishing options, some of the advanced features offered by the platform include:After setting the main phishing campaign parameters, the operators will have to deploy the phishing kit, which is currently limited to a Microsoft 365 login page, and then select a phishing template.Caffeine offers several phishing template options, including Microsoft 365 and various lures for Chinese and Russian platforms. Mandiant believes more will be added soon.The platform also allows operators to use its own Python or PHP-based email management utility to send out phishing emails to their targets, reducing the need for external tools.While Mandiant gives detection guidance for catching Caffeine-backed phishing emails, the analysts highlight the possibility of the crooks adopting new evasion techniques that could render that report's section obsolete.Sadly, Caffeine is yet another option added to the choices available to low-skill cyber criminals on the look for automated platforms, which could become a bigger problem if more templates are added to its collection."
   },
   {
      "time": "2022-10-11",
      "title": "\r\n\tUkraine Enhances Cooperation With EU Cybersecurity Agencies - Infosecurity Magazine\r\n",
      "text": " Editor, Infosecurity MagazineThe working meeting was held during the visit to ENISA HQ in Athens as a part of the Cybersecurity East Project.Viktor Zhora, SSSCIP deputy head, said after the meeting: “Cooperation with the European partners includes two key vectors for our country. On the one hand, Ukrainian experience in cyber-war, confronting cyber-threats from Russia would definitely be beneficial for other democracies.“On the other hand, having gained candidate status for EU membership, our country has to bring its national legislation in conformity with European standards. Intensified collaboration with ENISA will let us make this process much more efficient.”According to an SSSCIP announcement, the visit to ENISA is a key component of the EU4Digital: Cybersecurity East Project. Initiated in 2019, this project aims at supporting the Eastern Partnership countries in building cybersecurity potential and improvement of the legislative framework as well as facilitating compatibility and approximation of their legal frameworks, best practices and cooperation.As the war in Ukraine has pushed the nation further towards its Western counterparts, the SSSCIP said the meeting was also important in European integration, a significant step for which would be ENISA special partner status.Obtaining this status is an important phase within the process of harmonization of the national cybersecurity legislation with the EU law, according to SSSCIP.Apart from Ukrainian experts, cybersecurity agency representatives from Armenia, Azerbaijan, Georgia and Moldova took part in the event."
   },
   {
      "time": "2022-10-11",
      "title": "Researchers Detail Malicious Tools Used by Cyber Espionage Group Earth Aughisky",
      "text": " A new piece of research has detailed the increasingly sophisticated nature of the malware toolset employed by an advanced persistent threat (APT) group named Earth Aughisky.While the Chinese threat actor has been known to primarily target organizations in Taiwan, victimology patterns observed towards late 2017 indicate an expansion to Japan.The most commonly targeted industry verticals include government, telcom, manufacturing, heavy, technology, transportation, and healthcare.The group has also been linked to a variety of malware families, such as GrubbyRAT, K4RAT, LuckDLL, Serkdes, Taikite, and Taleret, as part of its attempts to consistently update its arsenal to evade security software.Some of the other notable backdoors employed by Earth Aughisky over the years are as follows -Trend Micro's attribution of the malware strains to the threat actor is based on the similarities in source code, domains, and naming conventions, with the analysis also uncovering functional overlaps between them.2017, the year when the group set its sights on Japan and Southeast Asia, has also been an inflection point in the way the volume of the attacks has exhibited a significant decline since then.Despite the longevity of the threat actor, the recent shift in targets and activities likely suggests a change in strategic objectives or that the group is actively revamping its malware and infrastructure.\"Groups like Earth Aughisky have sufficient resources at their disposal that allow them the flexibility to match their arsenal for long-term implementations of cyber espionage,\" Trend Micro researcher CH Lei said.\"Organizations should consider this observed downtime from this group's attacks as a period for preparation and vigilance for when it becomes active again.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-10-11",
      "title": "Security Challenges for your Internet Linked Devices - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-11",
      "title": "GitHub: Repositories Selling Fake Microsoft Exchange Exploits - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-11",
      "title": "New Report Uncovers Emotet's Delivery and Evasion Techniques Used in Recent Attacks",
      "text": " Threat actors associated with the notorious Emotet malware are continually shifting their tactics and command-and-control (C2) infrastructure to escape detection, according to new research from VMware.Emotet attack flows are also characterized by the use of different attack vectors in an attempt to stay covert for extended periods of time.These intrusions typically rely on waves of spam messages that deliver malware-laced documents or embedded URLs, which, when opened or clicked, lead to the deployment of the malware.In January 2022 alone, VMware said it observed three different sets of attacks in which the Emotet payload was delivered via an Excel 4.0 (XL4) macro, an XL4 macro with PowerShell, and a Visual Basic Application (VBA) macro with PowerShell.\"Tools such as mshta and PowerShell, which are sometimes referred to as living-off-the-land binaries (LOLBINs), are very popular among threat actors because they are signed by Microsoft and trusted by Windows,\" the researchers said.\"This allows the attacker to perform a confused deputy attack, in which legitimate tools are fooled into executing malicious actions.\"Further analysis of nearly 25,000 unique Emotet DLL artifacts shows that 26.7% of those were dropped by Excel documents. As many as 139 distinctive program chains have been identified.On top of that, 10,235 Emotet payloads detected in the wild between March 15, 2022, and June 18, 2022, reused C2 servers belonging to Epoch 5.The changes to both the execution chains and C2 IP addresses aside, Emotet has also been spotted distributing two new plugins, one which is designed to capture credit card data from Google Chrome browser, and a spreader module that uses the SMB protocol for lateral movement.Other significant components include a spamming module and account stealers for Microsoft Outlook and Thunderbird email clients.A majority of the IP addresses used to host the servers were in the U.S., Germany, and France. In contrast, most of the Emotet modules were hosted in India, Korea, Thailand, Ghana, France, and Singapore.To protect against threats like Emotet, it's recommended to implement network segmentation, enforce a Zero Trust model, and replace default authentication mechanisms in favor of stronger alternatives.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]