[
   {
      "time": "2022-09-29",
      "title": "An In-Depth Look at APT35 aka Charming Kitten",
      "text": " "
   },
   {
      "time": "2022-09-29",
      "title": "Hackers now sharing cracked Brute Ratel post-exploitation kit online",
      "text": " The Brute Ratel post-exploitation toolkit has been cracked and is now being shared for free across Russian-speaking and English-speaking hacking communities.Red teamers are cybersecurity professionals whose job is to try and breach a corporate network to learn its flaws, while those on the blue team attempt to defend against these attacks.After these exercises, both groups discuss what was found to shore up defenses and enhance security.Similar to Cobalt Strike, Brute Ratel is a toolkit used by red teamers to deploy agents, called badgers, on compromised network devices and use them to execute commands remotely and spread further on a network.\"This includes BreachForums, CryptBB, RAMP, Exploit[.]in, and Xss[.]is, as well as various Telegram and Discord groups.\"From a brief search on both the XSS and Breached hacking forums, threat actors have created multiple topics where they have been sharing the cracked version of Brute Ratel C4 version 1.2.2 since the middle of September.In the past, Brute Ratel developer Chetan Nayak told BleepingComputer that he could revoke the licenses for any customers abusing Brute Ratel for malicious purposes.However, Nayak claims that the uncracked version was uploaded to VirusTotal, which was then cracked by the \"Russian group Molecules\" to remove the license check.Regardless of how the software was leaked, it is unfortunately too late.Thomas has told BleepingComputer that the cracked version works and does not appear to be tampered with, meaning we will likely see wide usage of the toolkit shortly.\"Yes, you don't need to enter the license key, and no doesn't look tampered to me or my colleagues in Curated Intel,\" explained Thomas in a conversation with BleepingComputer.In fact, threat actors have already begun sharing screenshots on hacking forums of them testing the toolkit.What is most concerning to Thomas is that Brute Ratel has the ability to generate shellcode that is not easily detected by security software at this time.\"One of the most concerning aspects of the BRC4 tool for many security experts is its ability to generate shellcode that is undetected by many EDR and AV products,\" explained Thomas in his report.\"This extended window of detection evasion can give threat actors enough time to establish initial access, begin lateral movement, and achieve persistence elsewhere.\""
   },
   {
      "time": "2022-09-29",
      "title": "IRS warns Americans of massive rise in SMS phishing attacks",
      "text": " The Internal Revenue Service (IRS) warned Americans of an exponential rise in IRS-themed text message phishing attacks trying to steal their financial and personal information in the last few weeks.\"So far in 2022, the IRS has identified and reported thousands of fraudulent domains tied to multiple MMS/SMS/text scams (known as smishing) targeting taxpayers,\" the IRS warned. \"In recent months, and especially in the last few weeks, IRS-themed smishing has increased exponentially.\"Such scam texts redirect U.S. taxpayers to phishing landing pages designed to collect sensitive information using various baits (e.g., unpaid bills, bank account problems, or law enforcement actions).For instance, the sender of phishing text messages can be spoofed to make it appear that they're someone the targets are more likely to trust, such as U.S. government agencies like the IRS.Some of the most convincing and devious lures in SMS phishing are links that send the targets to pages impersonating bank sites and asking them to verify a purchase or unlock frozen credit cards.While some of the attackers behind these phishing campaigns focus on stealing payment details, others are not picky and will be happy to harvest any personal info they can get to use in various other scams or to sell to others.\"This is phishing on an industrial scale so thousands of people can be at risk of receiving these scam messages,\" said IRS Commissioner Chuck Rettig. \"In recent months, the IRS has reported multiple large-scale smishing campaigns that have delivered thousands – and even hundreds of thousands – of IRS-themed messages in hours or a few days, far exceeding previous levels of activity.\"According to the U.S. communications watchdog's Robocall Response Team, these phishing messages (or robotexts as the FCC calls them) will hit billions of phones every month. The FCC shared the following list of measures to help defend against SMS phishing attacks:\"Taxpayers and tax pros need to remain constantly vigilant with suspicious IRS-related emails and text messages. And if you get one, sending the IRS important details from the text can help us disrupt the scams and protect others.\""
   },
   {
      "time": "2022-09-29",
      "title": "Auth0 warns that some source code repos may have been stolen",
      "text": " Authentication service provider and Okta subsidiary Auth0 has disclosed what it calls a \"security event\" involving some of its code repositories.Auth0's authentication platform is used to authenticate over 42 million logins each day by more than 2,000 enterprise customers from 30 countries, including the likes of AMD, Siemens, Pfizer, Mazda, and Subaru.As the company revealed in a blog post on Monday, multiple code repository archives from 2020 and earlier (pre-dating Okta's May 2021 acquisition) were obtained by unknown means from its environment.\"Our investigation has not revealed any customer impact from this event, and no action is required by our customers.\"The company and a third-party cybersecurity forensics firm investigated how the data was exfiltrated, but, until now, they failed to find any evidence of a breach.\"Both investigations, recently concluded, confirmed that there was no evidence of unauthorized access to our environments, or those of our customers, nor any evidence of any data exfiltration or persistent access,\" Auth0 added.\"We have also notified law enforcement. The Auth0 service remains fully operational and secure.\"For the time being, Auth0 says that it took \"precautionary steps\" to ensure that information bundled with the code could not be used in the future to hack into company and customer systems.While Auth0 said the blog post would be \"sharing context and details\" regarding these findings, it failed to provide any information regarding how the data was exfiltrated from its systems.Additionally, the disclosure lacks info on when this malicious activity might have taken place or what info bundled with the code repos would've allowed access to its environment unless it took \"precautionary steps.\"Update: An Okta spokesperson did not provide additional details when contacted by BleepingComputer earlier today, instead sharing the following statement matching Auth0's blog post:Security is one of our highest priorities, and we take our responsibility to protect and secure customer data and related information very seriously. Last month, we experienced a security event with a third-party individual related solely to the Auth0 platform. We immediately conducted an investigation with a leading cybersecurity forensics firm and we did not identify any evidence of unauthorized access, nor any evidence of a data exfiltration event or persistent access. The Auth0 service is fully operational and secure. This security event does not impact any other Okta products. We have been in communication with our customers about this event. "
   },
   {
      "time": "2022-09-29",
      "title": "30 Million Data Theft Hacktivists Detained in Ukraine - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-09-29",
      "title": "Senate panel approves open-source software bill, though future unclear",
      "text": " The Senate Homeland Security Committee on Wednesday easily approved legislation to better secure open-source software.The bill was prompted by the widespread Log4j vulnerability. The flaw was discovered late last year and sent the private sector, as well as governments around the globe, scrambling to secure their networks before the ubiquitous code could be exploited by hackers. The bipartisan legislation would require the Cybersecurity and Infrastructure Security Agency (CISA) to develop a risk framework within the next year that details how the federal government relies on open-source code. Meanwhile, the Office of Management and Budget would issue guidance for how federal entities secure open-source software.CISA would also have to hire a cadre of open-source security experts to strengthen defenses against future hacks that use such code.Prior to the vote, Portman called the bill “critical to public safety” but noted that one of his Senate colleagues “has some questions about it.”\"That's one I think we should mark up today, but I think we should continue to look at before it goes to the floor,” he added. “The computers, phones and websites we use in our daily lives contain open source software that’s vulnerable to cyber attack.\"The bill now goes to the full Senate for consideration. However, with few legislative days left before the midterm elections the measure likely will be hitched to another piece of legislation, such as the annual defense policy bill, which the Senate will take up next month.The committee also approved the Industrial Control Systems Cybersecurity Training Act – which would require CISA to create a free training program for cybersecurity professionals working with critical infrastructure – and the President’s Cup Cybersecurity Competition Act, a bill that would ensure that the cyber event takes place annually.Martin Matishak is a senior cybersecurity reporter for The Record. He spent the last five years at Politico, where he covered Congress, the Pentagon and the U.S. intelligence community and was a driving force behind the publication's cybersecurity newsletter.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-29",
      "title": "New Chaos malware infects Windows, Linux devices for DDoS attacks",
      "text": " A quickly expanding botnet called Chaos is targeting and infecting Windows and Linux devices to use them for cryptomining and launching DDoS attacks.This Go-based malware can also infect various architectures, including x86, x86-64, AMD64, MIPS, MIPS64, ARMv5-ARMv8, AArch64, and PowerPC, used by a wide range of devices from small office/home office routers and enterprise servers.Even though it mainly propagates by attacking devices unpatched against various security vulnerabilities and SSH brute-forcing, Chaos will also use stolen SSH keys to hijack more devices. It also backdoors hijacked devices by establishing a reverse shell that will allow the attackers to reconnect at any time for further exploitation.While analyzing around 100 samples discovered in the wild, security researchers Danny Adamitis, Steve Rudd, and Stephanie Walkenshaw at Lumen's Black Lotus Labs found that Chaos is written in Chinese and uses China-based command-and-control (C2) infrastructure.They also found that the botnet is targeting an extensive array of industries and has expanded exponentially since it was first spotted in April.\"While the botnet infrastructure today is comparatively smaller than some of the leading DDoS malware families, Chaos has demonstrated rapid growth in the last few months.\"​After the botnet successfully takes over a device, it will establish persistence and reach out to its C2 server, which sends back staging commands prompting the malware to propagate further, start mining for cryptocurrency, or launch a DDoS attack.Black Lotus Labs researchers added that some bots had been seen receiving dozens of commands over just a few days (more than 70 in some cases).The botnet focuses on European targets, but the bots are spread almost everywhere, with hotspots in the Americas and the Asia Pacific. The only exceptions are Australia and New Zealand, where no Chaos bots have been detected so far.\"Based upon our analysis of the functions within the more than 100 samples we analyzed for this report, we assess Chaos is the next iteration of the Kaiji botnet,\" they added.\"Kaiji was originally discovered in 2020, targeting Linux-based AMD and i386 servers by leveraging SSH brute forcing to infect new bots and then launch DDoS attacks.\"​Black Lotus Labs says it has null-routed all Chaos C2 servers on Lumen's global backbone to block them from sending or receiving data from infected devices.Remote workers and router owners should install security updates and patches as soon as possible and change default passwords on all their devices.\"While the shift to Go-based malware has been underway for the last few years, there are few strains that demonstrate the breadth of Chaos in terms of the wide array of architectures and operating systems it was designed to infect,\" they concluded.\"Not only does it target enterprise and large organizations but also devices and systems that aren't routinely monitored as part of an enterprise security model, such as SOHO routers and FreeBSD OS.\"And with a significant evolution from its predecessor, Chaos is achieving rapid growth since the first documented evidence of it in the wild.\""
   },
   {
      "time": "2022-09-29",
      "title": "Ethernet VLAN Stacking flaws let hackers launch DoS, MiTM attacks",
      "text": " Four vulnerabilities in the widely adopted 'Stacked VLAN' Ethernet feature allows attackers to perform denial-of-service (DoS) or man-in-the-middle (MitM) attacks against network targets using custom-crafted packets.Stacked VLANs, also known as VLAN Stacking, is a feature in modern routers and switches that allows companies to encapsulate multiple VLAN IDs into a single VLAN connection shared with an upstream provider. The vulnerabilities affect networking devices such as switches, routers, and operating systems that use Layer-2 (L2) security controls to filter traffic for virtual network isolation.Cisco and Juniper Networks have confirmed that some of their products are impacted by the flaws, but numerous device vendors haven't concluded their investigation; hence the overall impact remains unknown.The vulnerabilities exist in the Ethernet encapsulation protocols that allow the stacking of Virtual Local Area Network (VLAN) headers.An unauthenticated, adjacent attacker can use a combination of VLAN and LLC/SNAP headers to bypass L2 network filtering protections such as IPv6 RA guard, dynamic ARP inspection, IPv6 neighbor discovery protection, and DHCP snooping.The four vulnerabilities are:By exploiting any of these flaws independently, an attacker can deceive the target device to route traffic to arbitrary destinations.\"An attacker can send crafted packets through vulnerable devices to cause Denial-of-service (DoS) or to perform a man-in-the-middle (MitM) attack against a target network,\" warns the CERT Coordination Center.The latter is the more severe scenario, as the attacker could observe network traffic and access sensitive information if the data is not encrypted.One thing to note is that in modern cloud-based virtualization and virtual networking products, the L2 network capability extends beyond LAN, so the exposure of these flaws could be extended to the internet.Juniper Networks confirmed that CVE-2021-27853 and CVE-2021-27854 impact some of its products and released security updates on August 25, 2022.The company hasn't released a security bulletin about the issues, so all customers are advised to apply security updates to their devices.Also, end-of-life products have not been evaluated against the flaws, so they may as well be considered vulnerable and replaced as soon as possible.All network admins are advised to scrutinize and limit the protocol used on access ports, enable all available interface security controls, inspect and block router advertisements, and apply vendor security updates as soon as they become available."
   },
   {
      "time": "2022-09-29",
      "title": "Russia demands answers after Apple kicks VK apps from App Store",
      "text": " Russian telecom watchdog Roskomnadzor demanded explanations today from Apple regarding the removal of all VK apps, including the app for the country's largest social network VKontakte, from its App Store on Monday.Two of the apps removed from the Apple Store, the VKontakte social network application and the Mail.ru mail app, are included on the Russian Ministry of Digital Development's list of apps with mandatory pre-installation on mobile devices in Russia.VKontakte is used by more than 75 million users each month, and, based on the watchdog's stats, it's the most popular social network in Russia.\"The agency believes that such discriminatory restrictions violate the rights of Russian Internet users to freely receive information and communicate, and are unacceptable.\"Russians who want to use the VKontakte social network can still do so via the platform's mobile site and desktop apps.\"Their core functionality will be familiar and stable. There may be difficulties with the work of notifications and payments. VK specialists are working on it,\" VK said.\"In recent months, we have implemented key updates to our main products that will allow applications to stay relevant for a long time.\"Roskomnadzor request for explanations follows another one made by Russia's Ministry of Digital Affairs, which also asked Apple to share the reasons behind its decision to remove VK's apps from the App Store, per Russian state-affiliated news outlet RT.\"In order to comply with these sanctions, Apple terminated the developer accounts associated with these apps, and the apps cannot be downloaded from any App Store, regardless of location. Users who have already downloaded these apps may continue to use them.\"The Russian Internet watchdog also blocked access to multiple foreign news outlets in the country, including Voice of America, BBC, DW, and Radio Free Europe/Radio Liberty, accusing them of allegedly spreading fake news regarding the ongoing invasion of Ukraine."
   },
   {
      "time": "2022-09-29",
      "title": "Cyber Criminals Using Quantum Builder Sold on Dark Web to Deliver Agent Tesla Malware",
      "text": " A recently discovered malware builder called Quantum Builder is being used to deliver the Agent Tesla remote access trojan (RAT).The phishing emails purport to be an order confirmation message from a Chinese supplier of lump and rock sugar, with the LNK file masquerading as a PDF document.The HTA file, in turn, decrypts and executes another PowerShell loader script, which acts as a downloader for fetching the Agent Tesla malware and executing it with administrative privileges.In a second variant of the infection sequence, the GZIP archive is replaced by a ZIP file, while also adopting further obfuscation strategies to camouflage the malicious activity.Quantum Builder has witnessed a surge in usage in recent months, with threat actors using it to distribute a variety of malware, such as RedLine Stealer, IcedID, GuLoader, RemcosRAT, and AsyncRAT.\"Threat actors are continuously evolving their tactics and making use of malware builders sold on the cybercrime marketplace,\" the researchers said.\"This Agent Tesla campaign is the latest in a string of attacks in which Quantum Builder has been used to create malicious payloads in campaigns against various organizations.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-09-29",
      "title": "Leaked LockBit 3.0 builder used by ‘Bl00dy’ ransomware gang in attacks",
      "text": " The relatively new Bl00Dy Ransomware Gang has started to use a recently leaked LockBit ransomware builder in attacks against companies.As the builder includes a configuration file that can easily be customized to use different ransom notes, statistics servers, and features, BleepingComputer predicted that other threat actors would soon use the builder to create their own ransomware.Unfortunately, our predictions have come true, and a relatively new ransomware group named 'Bl00Dy Ransomware Gang' has already utilized the builder in an attack on a Ukrainian entity.Like other human-operated ransomware operations, the threat actors breach a network, steal corporate data, and encrypt devices. However, instead of using a Tor data leak site to extort victims and publish stolen data, the threat actors use a Telegram channel for the same purpose.BleepingComputer gave the Bl00dy Ransomware Gang's encrypter a test and found some differences between this new encryptor and previous ones.In past campaigns, the threat actors added the .bl00dy extension for encrypted files. However, as this is not a customizable option in the LockBit 3.0 builder, the threat actors are left using extensions determined when the encryptor is built.As for the ransom note, the file names are still created in LockBit-style, but the threat actors have customized them to include their own text and contact information, as shown below.Ultimately, though, this is a LockBit 3.0 ransomware encryptor, so it supports all of the features previously reported by security researchers.It would not be surprising to see the Bl00dy Ransomware Gang switch between ransomware families as needed to either evade detection or take advantage of various features.The LockBit operation launched in September 2019 and has since grown into one of the most active, feature-rich Ransomware-as-a-Service operations at this time.As the leaked LockBit 3.0 ransomware builder is easily customizable by other threat actors, we will see other threat actors soon using it in their own attacks."
   }
]