[
   {
      "time": "2022-10-06",
      "title": "BlackByte ransomware abuses legit driver to disable security products",
      "text": " The BlackByte ransomware gang is using a new technique that researchers are calling \"Bring Your Own Driver,\" which enables bypassing protections by disabling more than 1,000 drivers used by various security solutions.The “Bring Your Own Vulnerable Driver” (BYOVD) method is effective because the vulnerable drivers are signed with a valid certificate and run with high privileges on the system.This makes it possible for attackers to read, write, or execute code in kernel memory without using shellcode or an exploit.In the first stage of the attack, BlackByte identifies the kernel version to select the correct offsets that match the kernel ID.Next, RTCore64.sys is dropped in “AppData\\Roaming” and creates a service using a hardcoded name and a randomly selected, not-so-subtle display name.The attackers then exploit the driver’s vulnerability to remove Kernel Notify Routines that correspond to security tool processes.The retrieved callback addresses are used to derive the corresponding driver name and compared to a list of 1,000 targeted drivers that support the function of AV/EDR tools.Any matches found in this stage are removed by overwriting the element that holds the address of the callback function with zeros, so the targeted driver is nullified.Sophos also highlights several methods that BlackByte employs in these attacks to evade analysis from security researchers, like seeking for signs of a debugger running on the target system and quitting.The BlackByte malware also checks for a list of hooking DLLs used by Avast, Sandboxie, Windows DbgHelp Library, and Comodo Internet Security, and terminates its execution if found.System administrators can protect against BlackByte’s new security bypassing trick by adding the particular MSI driver to an active blocklist.Additionally, admins should monitor all driver installation events and scrutinize them frequently to find any rogue injections that don’t have a hardware match."
   },
   {
      "time": "2022-10-06",
      "title": "'IT security issue' impacts multiple hospitals across several states | CyberScoop",
      "text": " \n\nOctober 5, 2022\n\nA healthcare network that includes 140 hospitals and more than 1,000 facilities in 21 states is working through an “IT security issue.”It’s not clear how many of the company’s facilities have been impacted, or whether it was a ransomware attack. A company spokesperson did not immediately respond to a request for comment.Reports online claimed that Epic Systems Corp., a healthcare-related software developer, had been targeted in the attack. CommonSpirit Health is a customer of Epic and the situation does not involve Epic, an Epic spokesperson told CyberScoop Wednesday.“The health sector has been dealing with a barrage of financially motivated cyberattacks for the last few years and, unfortunately, it doesn’t appear that they’ll be ceasing any time soon,” Callow told CyberScoop Wednesday. “While governments and law enforcement agencies are having more successes, I think it’ll be a very long time before the war is close to being won.” "
   },
   {
      "time": "2022-10-06",
      "title": "Ransomware is Now the Top Attack Vector Due to Bug Exploitation - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-06",
      "title": "City of Tucson discloses data breach affecting over 123,000 people",
      "text": " The City of Tucson, Arizona, has disclosed a data breach affecting the personal information of more than 123,000 individuals.As revealed in a notice of data breach sent to affected people, an attacker breached the city's network and exfiltrated an undisclosed number of files containing sensitive information.\"On August 4, 2022, the City learned that certain files may have been copied and taken from the City's network.\"The City began notifying potentially impacted individuals on September 23 that, among the sensitive personal information exposed during the incident, the attacker could have accessed the affected individuals' names and Social Security numbers.\"The information within the potentially accessed files included certain individuals' name, Social Security number, driver's license or state identification number, and passport number.\"Notification letters sent to affected individuals also reveal no evidence was found that this personal info has been misused until now.Those impacted by the data breach are advised to monitor their credit reports for any suspicious activity that could hint at incidents of identity theft and fraud involving their personal information.The City is providing impacted individuals with 12 months of free access to Experian credit monitoring and identity protection services, as well as guidance on defending against identity theft.\"The City treats the security of information in its possession as an utmost priority and apologizes for any inconvenience this event may cause,\" the breach notification letters read.\"As part of its ongoing commitment to the security of information within its care, the City reviewing its existing policies and procedures regarding cybersecurity and evaluating additional measures and safeguards to protect against this type of event in the future.\"Update: Corrected title saying 125K+ individuals were affected instead of 123K+."
   },
   {
      "time": "2022-10-06",
      "title": "Avast releases free decryptor for MafiaWare666 ransomware variants",
      "text": " Update 10/6/22: The article originally referred to this family as Hades based on the reference in Avast's articl​e and confusion with another ransomware family.Avast has released a decryptor for variants of the MafiaWare666 ransomware known as 'Jcrypt', 'RIP Lmao', and 'BrutusptCrypt,' allowing victims to recover their files for free.The security company says it discovered a flaw in the encryption scheme of the MafiaWare666 strain, allowing some of the variants to be unlocked. However, this may not apply to newer or unknown samples that use a different encryption system.Utilizing Avast's tool, victims of the supported ransomware variants can decrypt and access their files again without paying a ransom to the attackers, which ranges between $50 and $300. However, ransom demands reached tens of thousands in some cases.The ransomware family targeted by this encryptor is a lower-level operation that did not perform data theft and double-extortion attacks.The Avast decryptor only supports files encrypted by specific variants of the MafiaWare666 ransomware family. These variants include the following extensions and strings appended/prepended to an encrypted file's name:Those who possess a valid password for decrypting the files but couldn't get the decryptor supplied by MafiaWare666 to work can tick the box and provide it onto Avast's tool.Most victims don't have a password, so they will have to wait for Avast's tool to crack it manually, which may take some time.After the password is found, the users can initiate the decryption process. At this stage, it is highly recommended to tick the boxes to back up the encrypted files and run the tool as an administrator.It is important to stress that you should enable the option to back up encrypted files, as if there is a problem with the decryptor, the encrypted files can become further corrupted."
   },
   {
      "time": "2022-10-06",
      "title": "Pegasus: Spyware Attacks Targets Journalists and Activists - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-06",
      "title": "CommonSpirit US nonprofit health system discloses security incident",
      "text": " CommonSpirit Health, one of the largest nonprofit health systems in the United States, says it took down some of its IT systems because of a security incident that has impacted multiple facilities.The US health system operates 140 hospitals and more than 1,000 care sites in 21 states, and its team of roughly 150,000 employees and 20,000 physicians provides health services to more than 21 million patients.CommonSpirit said in a statement published Tuesday that it's \"managing an IT security issue that is impacting some of our facilities.\"\"As a precautionary step, we have taken certain IT systems offline, which may include electronic health record (EHR) and other systems,\" it added.CommonSpirit also revealed that the incident forced its IT team to follow outage procedures and minimize disruption.\"We take our responsibility to ensure the security of our IT systems very seriously.\"While the nature of the incident is yet to be disclosed, there are hints that link it to a possible ransomware attack that would explain its broad impact.Due to this \"IT security issue,\" CommonSpirit also had to reschedule some patient appointments and said affected patients would be notified by the care facility or their provider.Doctors told patients who called in to make appointments at CommonSpirit locations that they couldn't schedule any new ones because their computers were down.  A CommonSpirit spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today."
   },
   {
      "time": "2022-10-06",
      "title": "Colombia National Food and Drug Surveillance Institute hit with cyberattack",
      "text": " Colombia’s National Food and Drug Surveillance Institute (INVIMA) said it is dealing with a cyberattack that has disrupted operations at the agency.The organization said in a statement on Monday it has disabled its website, as well as connections to its servers while it investigates the attack. As of Wednesday, its website was still offline. “Thanks to the timely response of our technical team, it has been possible to verify that the information, privacy and confidentiality of the data that the entity manages are protected,” the institute said in a statement on Monday. According to INVIMA, the systems used to manage the import authorization of vital medicines is currently unavailable. The regulatory authority was created in 1992, and operates within the country's Ministry of Health. It is in charge of inspecting and supervising the marketing and manufacturing of health products as well as issuing fines for health violations and the import of certain products.Several ransomware gangs and cybercriminal syndicates have targeted governments across Central and South America over the past year.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-06",
      "title": "Hundreds of Microsoft SQL servers backdoored with new malware",
      "text": " Security researchers have found a new piece of malware targeting Microsoft SQL servers. Named Maggie, the backdoor has already infected hundreds of machines all over the world.Maggie is controlled through SQL queries that instruct it to run commands and interact with files. Its capabilities extend to brute-forcing administrator logins to other Microsoft SQL servers and doubling as a bridge head into the server's network environment.The backdoor was discovered by German analysts Johann Aydinbas and Axel Wauer of the DCSO CyTec. Telemetry data shows that Maggie is more prevalent in South Korea, India, Vietnam, China, Russia, Thailand, Germany, and the United States.Extended Stored Procedure files extend the functionality of SQL queries by using an API that accepts remote user arguments and responds with unstructured data.Maggie abuses this technical behavior to enable remote backdoor access with a rich set of 51 commands.A report from DCSO CyTec says that the variety of commands supported by Maggie allow querying for system information, executing programs, interacting with files and folders, enabling remote desktop services (TermService), running a SOCKS5 proxy, and setting up port forwarding.The attackers can append arguments to these commands, and Maggie even offers usage instructions for the supported arguments in some cases.The researchers say that the command list also includes four “Exploit” commands, indicating that the attacker may rely on known vulnerabilities for some actions, such as adding a new user.However, the analysts couldn’t test the exploits as they appear to depend on an additional DLL that is not shipped with Maggie.Brute-forcing admin passwords happens through the commands “SqlScan” and “WinSockScan” after defining a password list file and a thread count. If successful, a hardcoded backdoor user is added to the server.The malware offers simple TCP redirection functionality, which allows remote attackers to connect to any IP address the infected MS-SQL server can reach.“The implementation enables port reuse, making the redirection transparent to authorized users, while any other connecting IP is able to use the server without any interference or knowledge of Maggie,” the researchers added.The malware also features SOCKS5 proxy functionality to route all network packets through a proxy server, making it even stealthier if needed.At this time some details remain unknown, like the post-infection use of Maggie, how the malware is planted in the servers in the first place, and who is behind these attacks."
   }
]