[
   {
      "time": "2022-08-19",
      "title": "UNC3890 | Suspected Iranian Threat Actor Targets Israel",
      "text": " Explore our multi-vendor XDR platform, delivering Mandiant products and integrating with a range of leading security operations technology.Solve your toughest cyber security challenges with combinations of products and services.Mitigate threats, reduce risk, and get back to business with the help of leading experts.Mandiant specializes in cyber threat intelligence, offering products, services, and more to support our mission to defend against cyber crime.Get the latest insights from cyber security experts at the frontlines of threat intelligence and incident responseLearn more about us and our mission to help organizations defend against cyber crime. Over the last year Mandiant has been tracking UNC3890, a cluster of activity targeting Israeli shipping, government, energy and healthcare organizations via social engineering lures and a potential watering hole. Mandiant assesses with moderate confidence this actor is linked to Iran, which is notable given the strong focus on shipping and the ongoing naval conflict between Iran and Israel. While we believe this actor is focused on intelligence collection, the collected data may be leveraged to support various activities, from hack-and-leak, to enabling kinetic warfare attacks like those that have plagued the shipping industry in recent years. Mandiant assesses with moderate confidence that UNC3890 conducts espionage and intelligence collection activity to support multiple Iranian interests and operations. Targeting patterns indicate a strong interest in Israeli entities and organizations of various sectors, including government, shipping, energy and healthcare. We observed several limited technical connections to Iran, such as PDB strings and Farsi language artifacts.This campaign has been active since at least late 2020, and is still ongoing as of mid-2022, and though it is regional in nature, targeted entities include global companies.UNC3890 uses at least two unique tools: a backdoor which we named SUGARUSH, and a browser credential stealer, which exfiltrates stolen data via Gmail, Yahoo and Yandex email services that we’ve named SUGARDUMP. UNC3890 also uses multiple publicly available tools, such as the METASPLOIT framework and NorthStar C2. In addition, Mandiant discovered UNC3890 operates an inter-connected network of Command-and-Control (C2) servers. The C2 servers host domains and fake login pages spoofing legitimate services such as Office 365, social networks such as LinkedIn and Facebook, as well as fake job offers and fake commercials for AI-based robotic dolls. We observed the C2 servers communicating with multiple targets, as well as with a watering hole that we believe was targeting the Israeli shipping sector, in particular entities that handle and ship sensitive components.This blog post details the activity of UNC3890, including their proprietary malware, TTPs we have not previously seen deployed by Iran, and the publicly available tools we identified in our investigation. Mandiant continues to track UNC3890 as well as other potentially related clusters of activity by the same threat actor.In late 2021, Mandiant identified UNC3890 targeting Israeli entities and showing interest in various sectors, including government, shipping, energy, aviation and healthcare. Even though the targeting we observed is focused to Israel, some of the entities targeted by UNC3890, especially in the shipping sector, are global companies. Therefore, the potential impact of UNC3890 activity described in this blog may extend beyond Israel. The activity is consistent with historical Iranian interest in these targets. Targeting patterns and lures used by UNC3890 indicate an attempt to disguise their activity as legitimate login activity, legitimate services and social network applications, and technology-related visual content.Mandiant observed UNC3890 deploy the following malware families.Malware FamilyDescriptionSUGARUSHSUGARUSH is a backdoor written to establish a connection with an embedded C2 and to execute CMD commands.SUGARDUMPSUGARDUMP is a credential harvesting utility, capable of password collection from Chromium-based browsers.SUGARDUMP SMTP-basedA more advanced version of SUGARDUMP, exfiltrating the stolen credentials via Gmail, Yahoo and Yandex email addresses. Uses a commercial for robotic dolls as a lure.SUGARDUMP HTTP-basedThe newest version of SUGARDUMP, exfiltrating the stolen credentials to a dedicated server over HTTP. Uses a fake job offer as a lure.METASPLOITMETASPLOIT is a penetration testing software, often abused by malicious threat actors.UNICORNUNICORN is a publicly available tool for conducting a PowerShell downgrade attack and to inject a shellcode into memory.NORTHSTAR C2NORTHSTAR C2 is an open-source C2 framework developed for penetration testing and red teaming.UNC3890 has been operating since at least late 2020. Their focused targeting poses a threat to Israel-based organizations and entities, particularly those affiliated with the government, shipping, energy, aviation and healthcare sectors. While we are not aware of targeting outside Israel, it is possible such targeting has occurred, or will occur. UNC3890 utilization of legitimate or publicly available tools, in addition to their unique exfiltration method using Gmail, Yahoo and Yandex email addresses, may reflect their efforts to evade detection and to bypass heuristics or network-based security measures.While Mandiant primarily identified post-exploitation implants utilized by UNC3890, there are some findings that shed light about their initial access methodologies. Mandiant identified UNC3890 potentially used the following initial access vectors:The URL structure of the POST request: hxxps[:]//xn--lirkedin-vkb[.]com/object[.]php?browser=<user_browser>&ip=<user_ip>When we inspected the watering hole, it was already inactive, but it was most likely used to target clients and users of that Israeli shipping company, in particular, one’s shipping or handling heat-sensitive cargo (based on the nature of the compromised website). We have an additional indication of an attempted targeting of another major Israeli shipping company by UNC3890, which is consistent with the watering hole.It should be noted that many of these domains were hosted on the same infrastructure used by UNC3890, but date back to late 2020, which is before we can corroborate UNC3890 has been active.UNC3890 DomainLegitimate entity/serviceCommentlirıkedin[.]com (xn--lirkedin-vkb[.]com)LinkedInC2 domain of watering holepfizerpoll[.]comPfizerHosted a fake Citrix login pagernfacebook[.]comFacebook office365update[.]liveOffice 365 fileupload[.]shopn/a celebritylife[.]newsn/a naturaldolls[.]storePart of a robotic dolls commercial which was used to harvest credentials and as a lure to install SUGARDUMPHosts a fake Outlook login pagexxx-doll[.]com In addition, we identified an UNC3890 server that hosted several ZIP files containing scraped contents of Facebook and Instagram accounts of legitimate individuals. It is possible they were targeted by UNC3890, or used as lures in a social engineering effort.Fake job offers, potentially as part of a phishing or watering hole campaign – we observed UNC3890 utilize a .xls lure file designed as a fake job offer (MD5: 639f83fa4265ddbb43e85b763fe3dbac) which installs SUGARDUMP, a credential harvesting tool. The job offer was for a software developer position in LexisNexis, a company offering a data analytics solution. After gaining initial access, UNC3890 utilizes a broad toolset to access and control the victim’s environment. In this sector we will focus on the analysis of two of UNC3890’s proprietary tools we identified in our investigation: the SUGARUSH backdoor, and the SUGARDUMP credential harvesting tool. We will also provide a brief analysis of the public tools utilized by UNC3890.Most of the tools were available for download directly from UNC3890 controlled infrastructure, indicating they may have been served as 1st stage implants. Alternatively, they may have been used as 2nd stages (or later), but UNC3890 may have misconfigured their infrastructure, making it publicly accessible.SUGARUSH Analysis: A Small But Efficient BackdoorSUGARUSH is a small custom backdoor that establishes a reverse shell over TCP to a hardcoded C&C address. Upon first execution, SUGARUSH will create a new service called “Service1”. Subsequently, SUGARUSH creates a logging folder called “Logs”, and stores it under its current execution path. A new folder named“ServiceLog” is created in the “Logs” folder, and a new log file is written with the message “Service is started at <current_date>”. The name of the log files is the current date of the infected machine.SUGARUSH will then check for internet connectivity of the host and will create a log file indicating the result with message “You are online at <current_date>” or “You are offline at <current_date>”. If the attempt for internet connection is successful, SUGARUSH will establish a new TCP connection to an embedded C&C address via port 4585.SUGARUSH then waits to receive an answer from the C2 which will be interpreted as a CMD command for execution.SUGARUSH Samples:SUGARDUMP Analysis: A Browser Credential Harvesting ToolSUGARDUMP is a small custom utility used for harvesting credentials from Chrome, Opera and Edge Chromium browsers. When executed SUGARDUMP will access the following paths:Out of each path SUGARDUMP will attempt collect specific folders:Afterwards, SUGARDUMP will extract all of the available usernames and passwords from these folders.The collected information is subsequently stored in the following format:We observed several versions of SUGARDUMP:SUGARDUMP first known version – dated to early 2021, we observed two variants of this version: the first one saves the stolen credentials under in a .txt file under the path: “C:\\\\Users\\\\User\\\\Desktop\\\\test2.txt”. The second variant prints the stolen credentials as a CMD output.We observed two PDB paths contained in SUGARDUMP samples:SUGARDUMP using SMTP for C2 communication – dated to late 2021-early 2022. This variant was downloaded from a known UNC3890 C2 (URL: hxxp://128.199.6[.]246/3-Video-VLC.exe), and is a slightly more advanced version with similar credential harvesting functionality. The downloaded file “3-Video-VLC.exe” (MD5: ae0a16b6feddd53d1d52ff50d85a42d5) is a Windows installer which, upon execution, drops and executes two files under the path %AppData%\\\\Roaming\\\\:Upon first execution, CrashReporter.exe (SUGARDUMP) attempts to locate the folder: %AppData%\\\\Microsoft\\\\Edge\\\\User Data\\\\CrashPad\\\\If it wasn’t found it will search for folder: %AppData%\\\\Microsoft\\\\Internet Explorer\\\\TabRoaming\\\\If the latter folder is not found as well, the malware proceeds to create it. The malware will then copy itself into “TabRoaming” folder again under the name “CrashReporter.exe”. Subsequently, a scheduled task is created, which ensures the persistence of this version of SUGARDUMP:The scheduled task is configured to execute CrashReporter.exe during user logon.The malware then attempts to connect to “smtp.yandex.com” and “smtp.mail.yahoo.com” via port 587. If the attempt is successful, the malware starts to harvest bowser related information on the host.This version of SUGARDUMP harvest credentials from the following browsers:For each browser the malware attempts to extract login credentials from the following paths:This version of SUGARDUMP also extracts the browser’s version, browsing history, bookmarks, and cookies.The extracted data structure looks as follows:The collected data is subsequently encoded using base64 and stored under: %<malware_execution_folder>%\\\\CrashLog.txtThe malware will then send the file “CrashLog.txt” via email, by connecting and sending it from one of the two following email addresses:The email is sent to one of these four email addresses:The subject for each message would be “VLC Player”, with “CrashLog.txt” attached.If SUGARDUMP fails to send the message, it creates a new file under: %<malware_current_execution_path>%\\\\CrashLogName.txt, and writes to the file the error details. \"CrashLogName.txt\" is also sent via email, using the same method mentioned above. Afterwards, the malware terminates its execution.SUGARDUMP using HTTP for C2 communication – dated to April 2022, this version sends the stolen credentials to an UNC3890 C2 server (144.202.123[.]248:80). We observed this version dropped by a .xls file which contains a fake job offer to a software developer position in NexisLexis, a data analytics platform (MD5: 639f83fa4265ddbb43e85b763fe3dbac).The .xls file contains a Macro, which upon enablement attempts to execute an embedded PE file using RunDLL (MD5: e125ed072fc4529687d98cf4c62e283e). The PE file is the newest version of SUGARDUMP we observed so far.Like previous versions, this version of SUGARDUMP harvests credentials from Chromium-based browsers Chrome, Opera and Edge. The data is saved in a new file under %TEMP%\\\\DebugLogWindowsDefender.txt.The collected data is subsequently encrypted using AES encryption using Cipher Block Chaining (CBC) mode. The encryption key is the Sha256 of an embedded password: “1qazXSW@3edc123456be name KHODA 110 !!)1qazXSW@3edc”. The word “KHODA” means god in Farsi.After the encryption process, the data is also encoded using Base64, and subsequently sent over HTTP to an UNC3890 C2 server: 144.202.123[.]248:80.The .NET project for this version of SUGARDUMP was named \"yaal\", which is the Farsi word for a horse’s mane. This, along with the use of the word “KHODA” in SUGARDUMP’s encryption key, may strengthen the possibility that the developers of SUGARDUMP are Farsi speakers.SUGARDUMP Samples:MITRE ATT&CK TechniquesIndicators of CompromiseTypeValueDescriptionMD5f362a2d9194a09eaca7d2fa04d89e1e5SUGARDUMP early ver.MD508dc5c2af21ecee6f2b25ebdd02a9079SUGARDUMP early ver.MD5ae0a16b6feddd53d1d52ff50d85a42d5SUGARDUMP SMTP dropperMD5084ad50044d6650f9ed314e99351a608SUGARDUMP SMTPMD5d8fb3b6f5681cf5eec2b89be9b632b05SUGARDUMP SMTP lure videoMD5639f83fa4265ddbb43e85b763fe3dbacSUGARDUMP HTTP lure fileMD5e125ed072fc4529687d98cf4c62e283eSUGARDUMP HTTPMD537bdb9ea33b2fe621587c887f6fb2989SUGARUSHMD53f045ebb014d859a4e7d15a4cf827957SUGARUSHMD5a7a2d6a533b913bc50d14e91bcf6c716SUGARUSHMD5d528e96271e791fab5818c01d4bc139fSUGARUSHMD5d5671df2af6478ac108e92ba596d5557PowerShell downloaderMD5fcc09a4262b9ca899ba08150e287caa9METASPLOIT payloadMD5d47bbec805c00a549ab364d20a884519METASPLOIT payloadMD56dbd612bbc7986cf8beb9984b473330aMETASPLOIT payloadMD53b2a719ffb12a291acbfe9056daf52a7METASPLOIT payload MD5f97c0f19e84c79e9423b4420531f5a25METASPLOIT payloadMD5f538cb2e584116a586a50d607d517cfdUNICORNMD5532f5c8a85b706ccc317b9d4158014bfPowerSherll TCP ReverseShellMD59c8788e7ae87ae4f46bfe5ba7b7aa938.NET executable that dropps and executes ReverseShell MD52fe42c52826787e24ea81c17303484f9NORTHSTAR C2 StagerMD52a09c5d85667334d9accbd0e06ae9418PowerShell downloaderMD5c5116a9818dcd48b8e9fb1ddf022df29PowerShell downloaderIP143.110.155[.]195NorthStar C2 serverIP128.199.6[.]246Malware/Tools Hosting, Watering Hole C2, Fake Login Pages HostingIP161.35.123[.]176SUGARUSH C2, Reverse Shell C2, Malicious Domains HostingIP104.237.155[.]129C2 serverIP146.185.219[.]88C2 serverIP159.223.164[.]185C2 serverIP144.202.123[.]248C2 serverIP185.170.215[.]170Malicious Domain HostingDomainlirıkedin[.]com (xn--lirkedin-vkb[.]com)Fake domainDomainpfizerpoll[.]comFake domainDomainoffice365update[.]liveFake domainDomaincelebritylife[.]newsFake domainDomainrnfacebook[.]comFake domainDomainfileupload[.]shopFake domainDomainnaturaldolls[.]storeDomainDomainxxx-doll[.]comDomainDomainaspiremovecentraldays[.]net (suspect)DomainGet the Google Cloud Cyberseurity Forecast 2024 report to explore the latest trends on the horizon.Mandiant experts are ready to answer your questions.© Copyright 2023 Mandiant. All rights reserved."
   },
   {
      "time": "2022-08-19",
      "title": "LockBit claims ransomware attack on security giant Entrust, leaks data",
      "text": " August 21th, 2022 update below. This post was originally published on August 18th.The LockBit ransomware gang has claimed responsibility for the June cyberattack on digital security giant Entrust.Starting in early June, Entrust had begun to tell customers that they suffered a cyberattack where data was stolen from internal systems.\"We have determined that some files were taken from our internal systems,\"  Entrust shared in a security notification to customers.\"As we continue to investigate the issue, we will contact you directly if we learn information that we believe would affect the security of the products and services we provide to your organization.\"While Entrust would not share any details regarding the attack or confirm if it was ransomware, they told BleepingComputer that they were investigating the incident.\"While our investigation is ongoing, we have found no indication to date that the issue has affected the operation or security of our products and services, which are run in separate, air-gapped environments from our internal systems and are fully operational,\" Entrust told BleepingComputer.When ransomware gangs publish data on their data leak sites, they usually leak data over time to scare the victim into returning to the negotiation table.As LockBit states that they will publish all data, it indicates that Entrust has not negotiated with the ransomware operation or refuses to give in to their demands.However, LockBit claiming of the attack supports what sources had previously told BleepingComputer about who was responsible.LockBit is considered one of the most active ransomware operations at this time, with its public-facing operation 'LockBitSupp' actively engaging with threat actors and cybersecurity researchers.Due to its ongoing adoption of new tactics, technology, and payment methods, it is vital for security and network professionals to stay up to date on the evolution of the operation and its TTPs.Update 8/21/22:LockBit began leaking Entrust's data Friday evening, first sharing screenshots of some of the allegedly stolen data, with the threat actors saying they would leak further data later that evening.Alvieri, who has been monitoring the leak, told BleepingComputer that the leaked data consists of accounting and legal documents and marketing spreadsheets.However, soon after they began leaking data, the ransomware gang's Tor data leak sites went offline, with the threat actors claiming that they are being DDoSed due to the Entrust attack.When BleepingComputer contacted Entrust about the leaked data, they told us that they have nothing to add to their original statement from July."
   },
   {
      "time": "2022-08-19",
      "title": "Android malware apps with 2 million installs found on Google Play",
      "text": " A new batch of thirty-five malware Android apps that display unwanted advertisements was found on the Google Play Store, with the apps installed over 2 million times on victims' mobile devices.The apps were found by security researchers at Bitdefender, who employed a real-time behavior-based analysis method to discover the potentially malicious applications.Following standard tactics, the apps lure users into installing them by pretending to offer some specialized functionality but change their name and icon immediately after installation, making them difficult to find and uninstall.From then on, the malicious apps begin to serve intrusive advertisements to the users by abusing WebView, generating fraudulent impressions and ad revenue for their operators.Additionally, because these apps use their own framework to load the ads, it would likely be possible to drop additional payloads on a compromised device.After installation, the apps typically assume a cog icon and rename themselves as ‘Settings,’ to evade detection and deletion.If the user clicks on the icon, the app launches the malware app with a 0 size to hide from view. The malware then launches the legitimate Settings menu to trick users into thinking they launched the correct app.In some cases, the apps assume the appearance of Motorola, Oppo, or Samsung system apps.The malicious apps also feature heavy code obfuscation and encryption to thwart reverse engineering efforts, hiding the main Java payload inside two encrypted DEX files.Another method for the apps to hide from the user is to exclude themselves from the ‘Recent apps’ list, so even if they run in the background, exposing active processes won’t reveal them.The 35 malicious Android applications have download counts ranging from 10,000 to 100,000, totaling over two million downloads.The most popular of these, having 100k downloads each, are the following:Of the above, 'Walls light – Wallpapers Pack', 'Animated Sticker Master', and 'GPS Location Finder' are still available on the Play Store when writing this article.Bleeping Computer has contacted Google on the matter, and we will update this post as soon as we receive a response.The rest of the listed apps are available on multiple third-party app stores like APKSOS, APKAIO, APKCombo, APKPure, and APKsfull, but the presented download counts are from their time on the Play Store.That said, if you have installed any of these apps in the past, you should locate and remove them from your device immediately.Because the apps masquerade themselves as Settings, running a mobile AV tool to locate and remove them might be helpful in this case.Update 8/27/22: A Google spokesperson has confirmed that the apps mention in this post have been removed from the Play Store."
   },
   {
      "time": "2022-08-19",
      "title": "Researchers Detail Evasive DarkTortilla Crypter Used to Deliver Malware",
      "text": " Malware delivered by the crypter includes information steakers and remote access trojans (RATs) such as Agent Tesla, AsyncRat, NanoCore, and RedLine Stealer. \"DarkTortilla has versatility that similar malware does not,\" the researchers noted.The delivery of DarkTortilla occurs via malicious spam emails which contain archives with an executable for an initial loader that's used to decode and launch a core processor module either embedded within itself or fetched from text storage sites such as Pastebin.The core processor is then responsible for establishing persistence and injecting the primary RAT payload into memory without leaving a trail on the file system through an elaborate configuration file that also allows it to drop add-on packages, including keyloggers, clipboard stealers, and cryptocurrency miners.DarkTortilla is further noteworthy for its use of anti-tamper controls that ensure both the processes used to execute the components in memory are immediately rerun upon termination.Specifically, the persistence of the initial loader is achieved by means of a second executable referred to as a WatchDog that's designed to keep tabs on the designated process and rerun it should it be killed.Secureworks said it identified an average of 93 unique DarkTortilla samples being uploaded to the VirusTotal malware database per week over a 17-month period from January 2021 to May 2022. Of all the 10,000 samples tracked during the timeframe, only just about nine of them were used to spread ransomware – seven delivering Babuk and two others administering MedusaLocker.\"DarkTortilla is capable of evading detection, is highly configurable, and delivers a wide range of popular and effective malware,\" the researchers concluded. \"Its capabilities and prevalence make it a formidable threat.\"That said, the exact modus operandi of how the crypter reaches the hands of the threat actors remains unclear, although it's suspected that it may be peddled on the criminal underground as a service.\"Despite scouring underground marketplaces and forums, we've been unable to find where or how DarkTortilla is being sold,\" Rob Pantazopoulos, senior security researcher at Secureworks Counter Threat Unit (CTU), told The Hacker News.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-08-19",
      "title": "Cyber insurers weigh in on latest cybersecurity trends, threats",
      "text": " That increase has given experts at insurance firms unique insight into cybersecurity trends and the vulnerabilities that are plaguing businesses the most — they get a behind-the-scenes look at attacks whenever a customer files a claim.Tommy Johnson is a cybersecurity engineer at cyber insurance firm Coalition, a firm with about 160,000 customers and backing from insurance giants like Allianz, Lloyd's of London, Swiss Re and more.Isabelle Dumont is a vice president at cyber insurance provider Cowbell Cyber, a newer firm focused on serving small and medium-sized businesses. Both chatted recently with The Record to share their key takeaways from recent cyber insurance data as the industry continues to expand. Remote Desktop Protocol (RDP) attacks continue to be a prevalent tool for hackers, and have led to a substantial amount of claims for insurers.  “Technology gets deployed to improve the business without any security consideration,” Dumont said, including RDP. Throughout 2020, Coalition identified a large number of claims arising from threat actors who were able to compromise RDP, which allows remote access to workplace resources. Threat groups quickly exploited the vulnerabilities, with Coalition seeing a 123% increase in claims frequency related to the exploitation of RDP and significant losses among businesses big and small.“Due to the ephemeral nature of the [RDP], it can be difficult to manage the risk from an insurance and scanning standpoint. We have seen companies open RDP intermittently to haphazardly administer machines, and threat actors take advantage. We continue to send the message that exposing RDP comes with critical risks, but sometimes these warnings fall on deaf ears,” Johnson said. Case in point: this March, Coalition saw a claim where a company used RDP for its call center in Southeast Asia, which threat actors exploited in order to deploy ransomware. Ransomware continues to have a dramatic effect on cyber insurance claims, according to Dumont and Johnson, driving costs upwards for companies.Johnson said the average ransom demand made against their policyholders increased by one-fifth in the latter half of 2021, while the number of claims increased 10%. Coalition did not find that any industries in particular stand out as targets of ransomware groups. Rather, Johnson said, threat actors are interested in exploiting insecure technologies organizations use, regardless of sector, or the employees themselves.“With ransomware, cybercriminals are no longer focused only on stealing data that can be sold on the dark web. Ransomware attacks give them a means to target any business sector to receive a ransom payment,” Dumont said.“The key difference is one company was able to restore from offline backups, and the other had to pay the full ransom,” he said. “The difference between the two claims is a stark $460,000 — a substantial sum of money.”While ransomware and business email compromise garner a lot of attention, Coalition found that phishing remains the primary attack vector for nearly half of all claims.The number of attacks that resulted from exploit of internet-facing applications or the supply chain dropped, Johnson explained. Yet even so, certain vulnerabilities remained an issue and dominated the data.Microsoft Exchange especially remains an avenue for exploitation.“Microsoft Exchange has proven to be a long-tail threat because Exchange is more than email — it's tightly coupled with calendar functions, and that's critical for many organizations,” Johnson said.“The initial vulnerability we detected with Exchange impacted roughly 1,000 policyholders,” Johnson said. “Within a week of the March 2021 disclosure, our team at Coalition notified and remediated the vulnerability for 98% of our affected policyholders. However, additional Exchange vulnerabilities continue to surface.”The problem was so severe that Coalition developed a scanning engine that can determine which version of Exchange is running in a system, the exact patch level and which outstanding vulnerabilities remain. The company now notifies policyholders in real-time when there is a new patch.This attack has been devastating to organizations unprepared for it, because companies that employ VMware Horizon expose it on the internet to allow their distributed workforce to connect to their work machines, he added.For 2022, Coalition’s claims data suggests that small- and medium-sized businesses suffer ransomware events far more frequently than larger accounts. The second half of 2021 saw a 40% increase in ransomware attacks on organizations under $25 million in revenue, compared to the start of the year, and a 54% spike in incidents related to the compromise of business email.    This February and March, all but one of Coalition’s reported ransomware claims came from their small- and medium-sized enterprise program.Data shows that the groups behind ransomware attacks have no qualms about attacking any sector.  “Cyber criminals are opportunistic, particularly when it comes to small and midsize organizations, and the technology and processes that organizations use are far more key to their risk than what their industry is,” Johnson said. “No company is too small to be an enticing financial opportunity for attackers.” Still, Johnson said, some industries have experienced notable increases in claims in the past year. There was a 40% increase in claims severity in the second half of 2021, compared to the first, for consumer staples businesses, and nearly a one-quarter spike in claims severity for energy-related firms. He added that small businesses typically lack dedicated IT or security staff, leaving patch management in limbo and incident response plans unfinished.Dumont noted that in recent months, more companies have begun to take a business-like approach to cybersecurity due to processes mandated during the insurance process.Risk assessments are now required by many cyber insurance providers. Dumont said part of what helps lessen the severity of attacks for some companies is preparation, using resources provided by insurance firms.“It is important to keep in mind that immunity against cyber attacks does not exist,” she said. “100% of businesses, regardless of size and industry, can be faced with a cyber incident.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-19",
      "title": "Fortinet: Use of wipers expanding beyond Ukraine to 24 countries",
      "text": " Wiper malware has been used heavily by hacking groups supporting Russia’s invasion of Ukraine. “These wipers were not only related to the Ukraine war,” Révay said, although many were. “We saw significant spillover from attacks against Ukraine. In many cases the main target was probably a Ukrainian organization, but due to the interconnectedness of the world, these attacks can easily affect other countries.” In the report released Wednesday, Fortinet researchers called the evolution in wiper usage “disturbing.”The group found at least seven major new wiper variants in the first six months of 2022 that were used in various campaigns against government, military, and private organizations.That amount nearly equals the total number of variants that were publicly detected between 2012 and 2021.“We are not aware that any of these recent wipers were used by cybercriminals or commercial hackers, but this is also expected,” Révay explained. “The ‘problem’ with wipers is that they are very difficult to monetize, since they are purely destructive and don’t provide any leverage to the attacker over their victims.”Fortinet noted that the war in Ukraine has “fueled a substantial increase in disk wiping malware among threat actors primarily targeting critical infrastructure.”The company said the incidents were part of a broader increase in attacks on operational technology networks, which in 2022 faced several in-the-wild exploits on a wide range of devices and platforms.The company suggested organizations have backups stored off-site and offline as one way to defend against wiper malware attacks. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-19",
      "title": "Estonia Blocks Cyberattacks Claimed by Russian Hackers - SecurityWeek",
      "text": " Hi, what are you looking for?Estonia on Thursday said it had thwarted a major wave of cyber attacks against public and private institutions, as Russian hackers claimed responsibility.“Yesterday, Estonia was subject to the most extensive cyber attacks it has faced since 2007,” Undersecretary for Digital Transformation Luukas Ilves said on Twitter. ByFlipboardRedditWhatsappWhatsappEmailAFP 2023Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailWASHINGTON - Cyberattacks are the most serious threat facing the United States, even more so than terrorism, according to American defense experts. Almost half...Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.Russian espionage group Nomadic Octopus infiltrated a Tajikistani telecoms provider to spy on 18 entities, including government officials and public service infrastructures.On the first anniversary of Russia’s invasion of Ukraine, cybersecurity companies summarize the cyber operations they have seen and their impact.Websites of German airports, administration bodies and banks were hit by DDoS attacks attributed to Russian hacker group KillnetSeveral hacker groups have joined in on the Israel-Hamas war that started over the weekend after the militant group launched a major attack.Ask any three people to define cyberwar and you will get three different answers. But as global geopolitics worsen and aggressive cyberattacks increase, this...The war in Ukraine is the first major conflagration between two technologically advanced powers in the age of cyber. It prompts us to question...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-08-19",
      "title": "Google blocks largest HTTPS DDoS attack 'reported to date'",
      "text": " A Google Cloud Armor customer was hit with a distributed denial-of-service (DDoS) attack over the HTTPS protocol that reached 46 million requests per second (RPS), making it the largest ever recorded of its kind.The attack started on the morning of June 1, at 09:45 Pacific Time, and targeted the victim’s HTTP/S Load Balancer initially with just 10,000 RPS.In eight minutes, the attack intensified to 100,000 RPS and Google’s Cloud Armor Protection kicked in by generating an alert and signatures based on certain data pulled from traffic analysis.Two minutes later, the attack peaked at 46 million requests per second:To put into perspective how massive the attack was at its peak, Google says that it was the equivalent of getting all the daily requests to Wikipedia in just 10 seconds.Luckily, the customer had already deployed the recommended rule from Cloud Armor allowing operations to run normally. The assault ended 69 minutes after it started.“Presumably the attacker likely determined they were not having the desired impact while incurring significant expenses to execute the attack,” reads a report from Google’s Emil Kiner (Senior Product Manager) and Satya Konduru (Technical Lead)Mēris is known for using unsecured proxies to send out bad traffic, in an attempt to hide the origin of the attack.Google researchers say that the attack traffic came from just 5,256 IP addresses spread in 132 countries and leveraged encrypted requests (HTTPS), indicating that the devices sending the requests have rather strong computing resources.“Although terminating the encryption was necessary to inspect the traffic and effectively mitigate the attack, the use of HTTP Pipelining required Google to complete relatively few TLS handshakes.”Another characteristic of the attack is the use of Tor exit nodes to deliver the traffic. Although close to 22% or 1,169 of the sources channeled the requests through the Tor network, they accounted for just 3% of the attack traffic.Despite this, Google researchers believe that Tor exit nodes could be used to deliver “a significant amount of unwelcome traffic to web applications and services.”Starting last year, an era of record-breaking volumetric DDoS attacks started with a few botnets leveraging a small number of powerful devices to hit various targets.Last November, Microsoft's Azure DDoS protection platform mitigated a massive 3.47 terabits per second attack with a packet rate of 340 million packets per second (pps) for a custmer in Asia."
   },
   {
      "time": "2022-08-19",
      "title": "Vulnerability in Amazon Ring app allowed access to private camera recordings - Help Net Security",
      "text": " A vulnerability in the Android version of the Ring app, which is used to remotely manage Amazon Ring outdoor (video doorbell) and indoor surveillance cameras, could have been exploited by attackers to extract users’ personal data and device’s data, including geolocation, address, and recordings.The vulnerability was discovered by Checkmarx researchers, who went one step further and demonstrated how an attacker could later analyze huge numbers of recordings with the help of computer vision technology, to extract additional sensitive information (e.g., from computer screens or paper documents) and material (e.g., video records or images of children).“The vulnerability was found in the com.ringapp/com.ring.nh.deeplink.DeepLinkActivity activity, which was implicitly exported in the Android Manifest and, as such, was accessible to other applications on the same device,” the researchers explained.This would have allowed them to exfiltrate the victims’ personal (name, email, phone number) and Ring device data (geolocation, address, and recordings) stored in the cloud.But that’s not all: the vulnerability could have allowed attackers to harvest millions of recordings from a great number of users and, with the help of machine learning technology, automate the discovery of sensitive information or materials.“[Amazon] Rekognition can be used to automate the analysis of these recordings and extract information that could be useful for malicious actors. Rekognition can scan an unlimited number of videos and detect objects, text, faces, and public figures, among other things,” the researchers noted.The good news is that the researchers have privately reported the vulnerability to the Amazon Ring development team, and they fixed it in version .51 (3.51.0 Android , 5.51.0 iOS) of the Ring mobile app.“Based on our review, no customer information was exposed,” Amazon told the researchers, and added that “this issue would be extremely difficult for anyone to exploit, because it requires an unlikely and complex set of circumstances to execute.”Nevertheless, now that the knowledge is public, Ring users should check whether they’ve already upgraded to a fixed version of the app and, if they haven’t, to do so straight away."
   },
   {
      "time": "2022-08-19",
      "title": "Overview of the Cyber Weapons Used in the Ukraine - Russia War | Trustwave",
      "text": " Get access to immediate incident response assistance.Get access to immediate incident response assistance.Eradicate cyberthreats with world-class intel and expertiseExpand your team’s capabilities and strengthen your security postureTap into our global team of tenured cybersecurity specialistsSubscription- or project-based testing, delivered by global expertsGet ahead of database risk, protect data and exceed compliance requirementsCatch email threats others miss with layered security & maximum controlEliminate alert fatigue, focus your SecOps team, stop threats fast, and reduce cyber riskObserving the ongoing conflict between Russia and Ukraine, we can clearly see that cyberattacks leveraging malware are an important part of modern hybrid war strategy.While conventional warfare is conducted on the battlefield and limited by several factors, cyber warfare continues in cyber space, offering the chance to infiltrate and damage targets far behind the frontlines.Russia utilized cyberattacks during the initial phase of the invasion in February. Reports from Trustwave and other security researchers show that Russian cyberattackers have maintained pressure launching a series of attacks showing how malware has been used against organizations in Ukraine either to destroy or gain control over targeted systems.In this article we will summarize some of the most prominent Russian threat actors involved and the malware tools used in cyberattacks against Ukraine.Despite the high level and technical sophistication of the cyberattacks, and the Russian Special Services’ ability to cover their tracks, several traces remain present after the attacks which leave no doubt of Russia’s involvement in the current attacks against Ukraine.APT29, also known as Cozy Bear or The Dukes   to the Russian Foreign Intelligence Service (SVR).APT28, also known as Fancy Bear or Sofacy was traced to the Main Directorate of the General Staff of the Armed Forces of the Russian Federation (Former GRU) Unit 26165.SANDWORM, also known as Black Energy, was tied to the Main Directorate of the General Staff of the Armed Forces of the Russian Federation (Former GRU) Unit 74455.DRAGONFLY, also known as Energetic Bear or Crouching Yeti was identified as the Russian Federal Security Service (FSB) Unit 71330.Figure 1 – Regular Hackers of the FSBhttps://ssu.gov.ua/en/novyny/sbu-vstanovyla-khakeriv-fsb-yaki-zdiisnyly-ponad-5-tys-kiberatak-na-derzhavni-orhany-ukrainy Figure 2 – Threat Actors and Russian Special Services ConnectionsThe flow timeline below illustrates the pressure placed on Ukrainian organizations and that government infrastructure is the attacker’s primary target of the attackers. The variety of malware used, and involvement of Russian state-sponsored threat actors makes it evident that successful protection measures against attackers would require not only reactive but also a proactive approach.Looking at the type of malware used, we can distinguish between 2 lines of attacks differentiated by the attacker's objectives:Figure 3 – Malware Cyberattacks Targeting Ukraine The flow timeline below illustrates the initial attack vectors used to deploy malware. Spearphishing with malicious attachments or links are used to deliver CobaltStrike and GraphSteel backdoors or exploitation of vulnerabilities in public facing applications such as the VPN appliances compromised in the Viasat cyberattack are some of the most common intrusion methods used. While the initial attack vector of HermeticWiper, HermeticRansom and CaddyWiper are not entirely known, at least one security vendor reported that the attackers appear to have exploited a known vulnerability in Microsoft SQL Server (CVE-2021-1636).Figure 4 - Initial Attack VectorsIt's interesting to note that the compilation timestamp of the HermeticWiper malware was December 28, 2021. This suggests that the February attacks were in preparation since at least that time.APT responsible:Sandworm (Black Energy,UAC-0082)Attacks reported:IOCs for HermeticWiper:The encryption method is rather cumbersome and contains implementation errors making encrypted files recoverable. This flaw, together with political messaging found inside and deployment timing consistent with HermeticWiper, suggests that HermeticRansom was likely used as a distraction rather than a legitimate ransomware extortion attempt.Attacks reported:IOCs for HermeticRansom:APT responsible:Attacks reported:IOCs for IsaacWiper:As indicated by Trustwave SpiderLabs’s analysis, AcidRain overwrites files and symbolic links with random data from the memory buffer in a recursive loop. If the wiper is executed with root permissions certain directories such as: ‘bin,’ ‘dev,’ ‘lib,’ ‘proc,’ ’sbin ’ ’sys,’ and ‘usr’ are avoided. The same random data buffer and write operation are used to wipe disk devices ‘/dev/sdX,’ loop devices ‘/dev/loopX,’ memory block devices ‘/dev/block/mtdblockX’ and multimedia card block devices ‘/dev/block/mmcblkX.’ Memory devices ‘/dev/mtdX’ are wiped using MEMWRITEOOB ioctl instead. After the wiping is done a device reboot is triggered.Figure 5 – Reconstructed AcidRain’s Main Routine On February 24, 2022, the day the war started, a cyber-attack against Viasat’s KA-SAT network impacted several thousand customers in Ukraine and tens of thousands across Europe. Spillover from this attack disabled the remote control of 5,800 Enercon wind turbines in Germany. As reported by Viasat, the attacker exploited Skylogic's VPN appliance gaining remote access to KA-SAT's network management segment. The attacker moved laterally to a specific segment part used to operate the network and executed legitimate, targeted management commands on a large number of residential modems, simultaneously. Specifically, these destructive commands overwrote key data in the flash memory on the SurfBeam modems.AcidRain wiper being discovered shortly after, is a plausible fit for this attack pattern. Analysis of SurfBeam modems’ firmware published in a Reversemode blog revealed the possibility to install arbitrary binaries without requiring either a signature verification or a complete firmware upgrade. Moreover, the first Virustotal submission for AcidRain’s sample aligns with the incident investigation timeframe and Skylogic Mediterraneo infrastructure location.Figure 6 – First AcidRain Sample Submitted to VirusTotal from Italy IOCs for AcidRain:APT responsible:Attacks reported:IOCs for LoadEdge :Attacks reported:IOCs for GraphSteel:IOCs for GrimPlant:DoubleZero is a .NET wiper malware. Our analysis indicated that execution stops immediately if the machine is a domain controller, otherwise it enumerates all the drives mounted to the machine and overwrites files with zero blocks, except for a specific hardcoded list of the system locations. Then the wiper moves on to the destruction of system files. In the end, the “lsass” process responsible for enforcing the security policy on the system is terminated and all the subkeys in the HKLM, HKCU, and HKU registry hives are destroyed. Once all the destructive activity has been completed, the wiper will shut down the system.Attacks reported:IOCs for DoubleZero :APT responsible:Attacks reported:IOCs for CaddyWiper:AwfulShred and SoloShred are malicious shell scripts designed to corrupt Linux systems. Our analysis revealed that the destructive activity of both scripts relies on a shred command with one overwrite pass, chosen to increase the data damage.  AwfulShred is also obfuscated, and its functionality is somewhat sophisticated. Prior to wiping the data, it disables and corrupts Apache, HTTP and SSH services, deactivates the swap file, and clears bash history.  Finally, a system reboot is triggered, rendering the targeted host inoperable.Figure 7 – Deobfuscated Commands Revealing AwfulShred Functionalities APT responsible:Attacks reported:IOCs for AwfulShred:IOCs for SoloShred:Once executed, Industroyer2 attempts to terminate legitimate processes responsible for IEC 104 service communication: PServiceControl.exe and PService_PPD.exe, then renames the original executables by appending the “.MZ” file extension and begins IEC 104 interaction with transmission substations, interrupting the circuit breakers operation. Substations IP addresses and ports were found hard-coded, meaning that the attackers had at least limited knowledge of their target.APT responsible:Attacks reported:IOCs for Industroyer2:CredoMap is a .NET credential stealer used by the threat actor APT28.  CredoMap steals cookies and stored passwords from Chrome, Edge and Firefox browsers.  Depending on the version, stolen data is then exfiltrated via email or HTTP POST requests to the web backend.APT responsible:Attacks reported:IOCs for CredoMap:DarkCrystal RAT or DCRat  is a commercial Russian .NET backdoor that can be purchased in underground forums and is designed primarily to spy on victims and steal data from compromised hosts; DCRat supports surveillance using screen and webcam captures, keylogging as well as files and credentials theft. Other interesting features include persistence using registry, stealing clipboard contents, command execution and DOS attack function. DCRat communicates with the C2 server via HTTP using GET and POST requests.Dark Crystal RAT (DCRat) appeared at the beginning of 2019. During its operation, the RAT got a lot of followers and clients. The malware became widely known for a variety of plugins including Stealer, Hidden Remote Desktop, file manager, and anonymous operation (via TOR proxy). The software was distributed on a subscription basis: two months for 600 RUB (~9.5 USD), one year for 2500 RUB (~39 USD), and a lifelong subscription would cost you 4500 RUB (~70 USD).Figure 8 – DarkCrystal RAT The DCRat code has been available on GitHub since at least March 2021. The versatility of the RAT, its abilities, and its low price make it so popular that even government-affiliated groups were choosing it for their operations.Attacks reported:IOCs for DarkCrystal RAT:APT responsible:Attacks reported:Without a doubt, sophisticated cyber weapons are key tools in the arsenal of a modern military, and the amount of global cyberwarfare will likely increase in the future.First, with the constantly growing number of devices connected to the network, the attack surface is becoming massive, increasing the potential use cases for cyberwarfare.Second, cyberwarfare is not bound by the territorial constraints of conventional warfare, offering the chance to infiltrate and damage targets far behind the frontlines.Finally, compared to traditional warfare, cyberwarfare is invisible to the naked eye, does not risk lives on the side of the aggressor, and is cost effective.With Ukraine being targeted by a variety of cyberattacks, we can see that even legitimate penetration testing tools can be hijacked and used as weapons.  Cobalt Strike, originally created to train network defenders, is being actively abused by attackers in this conflict.Critical infrastructure is vital for the functioning of modern societies and will always be a lucrative target for attackers seeking monetary gain, political or military advantage. Understanding what digital technologies and tools are used in a conflict can help identify and mitigate future threats before the damage happens.Unfortunately, people are usually the weakest link in the cybersecurity chain, as opening malicious attachments or links often leads to a compromise. Effective prevention strategy should include training programs, ensuring that personnel can identify and mitigate threats coupled with use of secure email gateways such as Trustwave MailMarshal, anti-malware and endpoint protection solutions.Internet-facing systems should be always updated, protected by a firewall solution, regularly scanned for vulnerabilities, and audited for changes to the system integrity.Trustwave’s researchers are continuously gathering more information on the latest cyberattacks, helping our customers to stay safe during these turbulent times.The annual holiday shopping season is poised for a surge in spending, a fact well-known to retailers, consumers, and cybercriminals alike. The latter group, however, is poised to exploit any...Overall Analysis of Vulnerability Identification – Default Credentials Leading to Remote Code Execution During internal network testing, a document was discovered titled the “XL Security Site...I was looking at my watch last week and my attention was moved towards the seconds over at the right of the watch face, incrementing nicely along as you’d expect. Now, I don’t know if I’d just spent...Copyright © 2023 Trustwave Holdings, Inc. All rights reserved."
   }
]