[
   {
      "time": "2022-07-27",
      "title": "Researcher finds Russia-based ransomware network with foothold in U.S.",
      "text": " A Russia-based ransomware command and control network has been found to have a foothold in at least one U.S. network, according to researchers from attack surface management firm Censys.Matt Lembright, director of federal applications at Censys, told The Record that he was scanning millions of hosts based in Russia in late June when he discovered two hosts containing a Rapid7 exploitation tool, Metasploit, and a command and control (C2) tool called Deimos C2. One of these hosts also possessed the PoshC2 tool.After even more digging, Lembright discovered that the hosts had connections to the MedusaLocker ransomware as well as the Karma ransomware.“Censys located a host in Ohio also possessing the Deimos C2 tool discovered on the initial Russian host and, leveraging historical analysis, discovered that the Ohio host possessed a malware package with software similarities to the Russian ransomware hosts possessing PoshC2 mentioned above, in October 2021,” Lembright said, noting that the host in Ohio had ties to the Karma ransomware.Lembright noted that the discovery was particularly novel because most ransomware incidents are discovered after an attack, and this was the rare instance of researchers finding evidence of groups setting the stage for an attack. “[Attacks] usually originate from wherever that attacker is accessing the internet and then they usually try to leverage some sort of proxy or intermediary to hide their access and involvement in attacks,” he said. “It gives them an economy of scale. If they have four or five other hosts that they can leverage to attack a certain victim. Certain exploits have to be laid on a victim before they’re able to control those hosts. What we discovered here seems to match that pattern.”Two of the hosts found have malware and two other hosts are connected to Bitcoin, according to Lembright, who said the hosts allowed the group to infect and exploit a victim via ransomware and then a method to be paid. Recorded Future ransomware expert Allan Liska explained that ransomware groups can’t launch an attack from Russian infrastructure because they will get blocked.To get around this, gangs typically compromise hosts in the U.S. “They usually look for large data center providers, universities or other places where there are lots of servers with different levels of security. Those compromised servers are used as redirects,” he said. CISA noted at the time that they have seen MedusaLocker attacks as recently as May 2022.Lembright was unsure of whether other ransomware groups were using the hosts but noted that the Karma ransomware group was tangentially connected to some of the other hosts discovered. He reported his findings to the FBI and is working with them to confirm if the two hosts were used during attacks on a hospital and a library last year. “People can see what we’ve done and exchange whatever their needs or perceived threat actors. If they know their primary attacker leverages another type of tool or software, they can search for those specifically and get even more pointed in their discovery,” Lembright said. “I hope that folks that recognize these hosts or have seen these patterns before can give us a call or work with us to inform some of these folks if this is a predecessor to a larger attack in the near future or if these folks that own these hosts are in danger of being attacked themselves.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-27",
      "title": "https://build.prestashop-project.org/news/2022/prestashop-1-7-8-7-maintenance-release/",
      "text": " "
   },
   {
      "time": "2022-07-27",
      "title": "Hackers steal $6 million from blockchain music platform Audius",
      "text": " The decentralized music platform Audius was hacked over the weekend, with threat actors stealing over 18 million AUDIO tokens worth approximately $6 million.Audius is a decentralized streaming platform hosted on the Ethereum blockchain where artists can earn AUDIO tokens by sharing their music, and users can earn tokens by curating and listening to content.After a hacker stole $6 million worth of AUDIO tokens this weekend, the platform responded within minutes by freezing several services until the developers could deploy fixes to prevent further theft of tokens.According to a post-mortem report published by Audius on Sunday, the hacker exploited a bug in the contract initialization code that allowed them to perform repeated invocations of the initialize functions.This enabled the intruder to transfer 18.5 million AUDIO tokens held by the so-called “community treasury” to their wallet, essentially stealing a significant amount of money and changing the platform's governance dynamics.Next, the actor attempted to execute four governance proposals, three of which failed and one passed, transferring the entirety of the Audius community pool to the attacker's wallet.As Audius concluded in the post-mortem report, no new tokens were minted, and the incident had no impact on the circulation of token supply. All remaining user funds are now safe according to the platform.By late Sunday, the AUDIO token was fully functional again, but the “Staking” and “Delegate Manager” smart contract systems have not resumed operation as the fixes are still being evaluated.In the meantime, the attacker traded their tokens on Uniswap for only $1.07 million, losing 5/6 of their value, and then passed them through the Tornado Cash mixing service to hide the trail of the stolen funds.“These contracts were deployed in October 2020, and this vulnerability has been live in the wild since that time.”This is a teaching moment for Audius and other blockchain-based projects, showing that the required audits do not always find all exploitable bugs.Another point that Audius promised to improve in the future was its incident response, for which several points for improvement were identified.In this case, Audius was lucky that the cyberattack unfolded when most of its team members were awake and could respond quickly to prevent further theft."
   },
   {
      "time": "2022-07-27",
      "title": "New Android malware apps installed 10 million times from Google Play",
      "text": " A new batch of malicious Android apps filled with adware and malware was found on the Google Play Store that have been installed close to 10 million times on mobile devices.The apps pose as image-editing tools, virtual keyboards, system optimizers, wallpaper changers, and more. However, their underlying functionality is to push intrusive ads, subscribe users to premium services, and steal victims' social media accounts.The discovery of these malicious apps comes from the Dr. Web antivirus team, who highlighted the new threats in a report published today.Google has removed the vast majority of the presented applications, but at the time of writing this, three applications remain available for download and installation via the Play Store.Also, if you installed any of these apps before their removal from the Play Store, you will still need to uninstall them from your device manually and run an AV scan to clean any remnants.The adware apps discovered by Dr. Web are modifications of existing families that first appeared on the Google Play Store in May 2022.Upon installation, the apps request permission to overlay windows over any app and can add themselves to the battery saver's exclusion list so they can continue running in the background when the victim closes the app.Additionally, they hide their icons from the app drawer or replace them with something resembling a core system component, like \"SIM Toolkit\".The full list of adware apps can be found at the bottom of the article, but one notable example still on the Play Store is 'Neon Theme Keyboard,' which has over a million downloads despite the 1.8-star score and many negative reviews.\"This app \"killed\" my phone. It keep'd crashing , i couldn't even enter password to unlock phone and uninstall it. Eventually, I had to make a complete wipe out (factory reset), to regain phone. DO NOT , install this app !!!!,\" read a review of the app on the Google Play Store.The second category of malicious apps found on the Play Store is Joker apps, known for incurring fraudulent charges on victims' mobile numbers by subscribing them to premium services.Two of the listed apps, 'Water Reminder' and 'Yoga – For Beginner to Advanced,' are still on the Play Store, having 100,000 and 50,000 downloads, respectively.Both provide the promised functionality, but they also perform malicious actions in the background, interacting with invisible or out-of-focus elements loaded via WebView and burdening the users with charges.These apps are 'YouToon – AI Cartoon Effect' and 'Pista – Cartoon Photo Effect,' which have been collectively downloaded over 1.5 million times via the Play Store.BleepingComputer has contacted Google about the malicious apps remaining on the Play Store but has not heard back at this time.Due to this, it is vital to check user reviews and ratings, visit the developer's website, read the privacy policy, and pay attention to the requested permissions during installation.Additionally, always ask yourself if the promised functionality is necessary to you, as keeping the number of apps on your phone at a minimum is a reliable way to reduce the chances of malware infections.Finally, ensure that Play Protect is active on your device and regularly monitor your internet data and battery consumption to identify any suspicious processes that run in the background.As previously stated, users should also check to see if they have any of the following Android adware apps install on their devices, and if found, manually remove them and scan for viruses."
   },
   {
      "time": "2022-07-27",
      "title": "CosmicStrand rootkit hides in the UEFI firmware | Kaspersky official blog",
      "text": " Solutions for:Complete protection for your devices, online privacy & identityCombines security, performance & privacy features in one appEnhanced protection with device performance boosterOur experts discovered a fresh version of CosmicStrand, a rootkit that hides from researchers in the UEFI firmware.\nJuly 26, 2022\nSince UEFI firmware is embedded in a chip on the motherboard and not written to the hard drive, it is immune to any hard drive manipulations. Therefore, it is very difficult to get rid of UEFI-based malware: even wiping the drive and reinstalling the operating system will not touch UEFI. For this same reason, not all security solutions can detect malware hidden in UEFI. Simply put, once malware has made its way into the firmware, it is there to stay.Of course, infecting UEFI is no simple task: this requires either physical access to the device, or some sophisticated mechanism for remote infection of the firmware. What’s more, to achieve its ultimate goal, whatever that may be, the malware not only has to reside in UEFI, but penetrate the operating system at startup, which is nothing if not tricky. All this requires great effort to pull off, which is why such malware is most often seen in targeted attacks against high-profile individuals or organizations.Oddly enough, the CosmicStrand victims identified by our researchers were ordinary people using our free antivirus. They seemingly had nothing to do with any organization of interest to attackers of this caliber. It also turned out that the motherboards infected in all known cases came from just two manufacturers. Therefore, it is likely that the attackers found some common vulnerability in these motherboards that made UEFI infection possible.How cybercriminals attack companies without using malware.\nHow cybercriminals attack companies without using malware.\nJuly 25, 2022\nFour handy ways to lock your screen on Windows and macOS.\nFour handy ways to lock your screen on Windows and macOS.\nNovember 10, 2023\nMistakes commonly found in almost every large organization. What should the inforsec team look out for, and what protective measures should they take?\nMistakes commonly found in almost every large organization. What should the inforsec team look out for, and what protective measures should they take?\nNovember 8, 2023\nEverything you wanted to know about Google account passkeys: how they work, why they’re needed, where to enable them, how to configure them, and what storage options are available.\nEverything you wanted to know about Google account passkeys: how they work, why they’re needed, where to enable them, how to configure them, and what storage options are available.\nNovember 3, 2023\nReady, set, tech: preparing for your kids’ first device.\nReady, set, tech: preparing for your kids’ first device.\nOctober 31, 2023\nCopyright © 2023 AO Kaspersky Lab. All Rights Reserved.Global"
   },
   {
      "time": "2022-07-27",
      "title": "FileWave patches two vulnerabilities that impacted more than 1,000 orgs",
      "text": " Swiss device management company FileWave confirmed on Tuesday that two vulnerabilities in their platform have been patched after being discovered by researchers from Claroty’s Team82.Noam Mosche, a researcher for Claroty’s Team82, told The Record that it is common for any type of organization to use an MDM solution considering the large number of IoT devices in use today. The tools make it simpler for IT administrators to manage all of an organization’s devices effectively. “In our research we discovered more than 1,100 FileWave MDM instances across multiple organizations, including large corporations, schools and educational institutions, government agencies, and small and medium businesses,” Mosche said. FileWave’s MDM system allows IT departments to manage, monitor, and view all of an organization’s devices, ranging from iOS and Android smartphones, MacOS and Windows tablets to laptops and workstations, and smart devices such as televisions.The vulnerabilities are remotely exploitable and allow an attacker to bypass authentication mechanisms and gain full control over the MDM platform and its managed devices. CVE-2022-34907 is an authentication bypass flaw that exists in FileWave MDM before version 14.6.3 and 14.7.x, prior to 14.7.2. CVE-2022-34906, a hard-coded cryptographic key, exists in FileWave MDM prior to version 14.6.3 and 14.7.x, prior to 14.7.2.“Authentication bypass vulnerabilities, such as CVE-2022-34907, are unfortunately more common than many people realize,” Mosche said. “Furthermore, attackers could abuse legitimate MDM capabilities to install malicious packages or executables, and even gain access to the device directly through remote control protocols,” Claroty explained in its report. Management services like this provide attackers with wide-ranging control over an organization. Claroty said a hacker could use CVE-2022-34907 to not only take over all managed devices but also exfiltrate sensitive data like device serial numbers, user email addresses, geo-location coordinates, IP addresses, device PIN codes and more. The security update released to address the vulnerabilities is included in the patched software upgrades of versions 14.6.3, 14.7.2, as well as in the latest software release 14.8, and all future subsequent versions, FileWave explained. FileWave said it is not aware of any exploitation of the vulnerability, but recommended users to “double-check that the security update is properly installed and up to date to avoid the risk of third-party attacks going forward.”The spokesperson added that all affected software users were first notified of the vulnerabilities by FileWave on 26th April 2022 and were provided with a software upgrade to address the vulnerabilities. “The security vulnerabilities were carefully reviewed and confirmed in close cooperation with Claroty Research,” the company said. “Immediately after the vulnerabilities became known, measures were taken to develop patched versions of the software, following a robust protocol to not only provide FileWave software users with a solution, but also to protect and help them understand the risks and install software upgrades on their servers in a timely manner.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-27",
      "title": "European Lawmaker Targeted With Cytrox Predator Surveillance Spyware - SecurityWeek",
      "text": " Hi, what are you looking for?A security audit by the European Parliament has unearthed attempts to plant high-end surveillance software on the phone of a Greek lawmaker and there are fresh reports linking the hack attempt to a known North Macedonia spyware vendor.ByFlipboardRedditWhatsappWhatsappEmailRyan Naraine is Editor-at-Large at SecurityWeek and host of the popular Security Conversations podcast series. He is a security community engagement expert who has built programs at major global brands, including Intel Corp., Bishop Fox and GReAT. Ryan is a founding-director of the Security Tinkerers non-profit, an advisor to early-stage entrepreneurs, and a regular speaker at security conferences around the world.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...Zero trust is not a replacement for identity and access management (IAM), but is the extension of IAM principles from people to everyone and...A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...WASHINGTON - Cyberattacks are the most serious threat facing the United States, even more so than terrorism, according to American defense experts. Almost half...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-27",
      "title": "Malicious IIS extensions quietly open persistent backdoors into servers | Microsoft Security Blog",
      "text": " Attackers are increasingly leveraging Internet Information Services (IIS) extensions as covert backdoors into servers, which hide deep in target environments and provide a durable persistence mechanism for attackers. While prior research has been published on specific incidents and variants, little is generally known about how attackers leverage the IIS platform as a backdoor.In this blog post, we detail how IIS extensions work and provide insight into how they are being leveraged by attackers as backdoors. We also share some of our observations on the IIS threat landscape over the last year to help defenders identify and protect against this threat and prepare the larger security community for any increased sophistication. More specifically, the blog covers the following topics:IIS is a flexible, general purpose web server that has been a core part of the Windows platform for many years now. As an easy-to-manage, modular, and extensible platform for hosting websites, services, and applications, IIS serves critical business logic for numerous organizations. The modular architecture of IIS allows users to extend and customize web servers according to their needs. These extensions can be in the form of native (C/C++) and managed (C#, VB.NET) code structures, with the latter being our focus on this blog post. The extensions can further be categorized as modules and handlers.The IIS pipeline is a series of extensible objects that are initiated by the ASP.NET runtime to process a request. IIS modules and handlers are .NET components that serve as the main points of extensibility in the pipeline. Each request is processed by multiple IIS modules before being processed by a single IIS handler. Like a set of building blocks, modules and handlers are added to provide the desired functionality for the target application. In addition, handlers can be configured to respond to specific attributes in the request such a URL, file extension, and HTTP method. For example, Aspnet_isapi.dll is a pre-configured IIS handler for common .aspx extensions.To create a managed IIS module, the code must implement the IHttpModule interface. The IHttpModule interface has two methods with the following signatures: Init() and Dispose().Register with global assembly cache (GAC) PowerShell API: Every device with Common Language Runtime (CLR) hosts a device-wide cache called the global assembly cache (GAC). The GAC stores assemblies specifically designated to be shared by several applications on the device. GacInstall() is a PowerShell API to add modules into the global cache. Once installed, the module is available under the path %windir%\\Microsoft.NET\\assembly and is mapped to IIS (w3wp.exe) using appcmd.exe.Register using appcmd.exe: Appcmd.exe is the single command line tool for managing IIS. All critical aspects, such as adding or removing modules and handlers, can be performed using the utility. In this case, the attackers drop the malicious extension in the target application’s /bin folder and map it using the add module command.Register using gacutil.exe: Gacutil.exe is a Visual Studio shipped .NET GAC utility. The tool allows the user to view and manipulate the contents of the GAC, including installing new modules using the -I option.Register using web.config: After dropping the module in the application’s /bin folder, attackers can also edit the web.config of the target application or the global config file, applicationHost.config, to register the module.Upon successful registration, the module is visible inside the IIS manager application.After a period of doing reconnaissance, dumping credentials, and establishing a remote access method, the attackers installed a custom IIS backdoor called FinanceSvcModel.dll in the folder C:\\inetpub\\wwwroot\\bin\\. The backdoor had built-in capability to perform Exchange management operations, such as enumerating installed mailbox accounts and exporting mailboxes for exfiltration, as detailed below.  PowerShDLL toolkit, an open-source project to run PowerShell without invoking powershell.exe, was used to run remote commands. The attacker avoided invoking common living-off-the-land binaries (LOLBins), such as cmd.exe or powershell.exe in the context of the Exchange application pool (MSExchangeOWAAppPool) to evade related detection logic.The attackers used plink.exe, a command-line connection tool like SSH. The tool allowed the attackers to bypass network restrictions and remotely access the server through tunneled RDP traffic.The attacker invoked the IIS backdoor by sending a crafted POST request with a cookie EX_TOKEN. The module extracts the cookie value and initiates a mailbox export request with the supplied filter.The value decodes to: ep,06/21/2022,06/21/2022,C:\\Windows\\Web,Administrator, where ep is the command to initiate the mailbox export request with filters determining the start and end dates followed by the export path. The final command has the following syntax:The table below details all the commands found in the backdoor:Reviewing the malicious managed (.NET) IIS extensions observed over the past year, we grouped these extensions based on various factors such as similar capabilities and sources of origin, as further detailed in the below sections. In the module version, the attacker-initiated POST request contains the code along with the arguments in parameters z1 and z2, like the script-based version.In a different version, the module has the backdoor logic hardcoded inside the DLL and only waits for parameters z1 and z2. The parameter kfaero has the command exposed as sequential alphabets from ‘A-Q’.Like the script version, the IIS module has similar capabilities, such as listing and creating directories, downloading and uploading files, running queries using SQL adaptors, and running commands. To run commands, the attacker-initiated POST request contains the command “M” along with the arguments.Antsword is another popular web shell widely used in various targeted attacks. Custom IIS modules inspired from the web shell’s code have been observed in the wild, which include similar architecture and capabilities. Interesting new features of these malicious modules include fileless execution of C# code and remote access via TCP socket connection.Based on the request, the module can take one of the two code paths. In case of /server-status, a socket connection is initiated from values in the custom header Lhposzrp.For any other URL, the module follows a China Chopper-style architecture of commands, ranging from “A” through “R”. The additional “R” command allows the attackers to run C# code reflectively.GitHub projects on creating backdoors for IIS have been available for some time now. Though mostly shared to educate the red team community, threat actors have also taken interest and lifted code from these projects. Using a public project that has been actively leveraged by attackers as an example, the original code includes the following capabilities:In this case, the in-the-wild variants change the cookie names, keeping the rest of the code intact:On supplying a whoami command to the backdoor, the generated cookie has the following format:Cookie: BDUSS=P6zUsk/1xJyW4PPufWsx5w==The backdoor responds with an AES encrypted blob wrapped in base64. The decoded output has the following format:As mentioned earlier, IIS handlers have the same visibility as modules into the request pipeline. Handlers can be configured to respond to certain extensions or requests. To create a managed IIS handler, the code must implement the IHttpHandler interface. The IHttpHandler interface has one method and one property with the following signatures:Handlers can be registered by directly editing the web.config file or using the appcmd utility. The handler config takes a few important fields like path, which specifies the URL or extensions the handler should respond to, and verb, which specifies the HTTP request type. In the example below, the handler only responds to image requests ending with a .gif extension:The handler is visible in the IIS manager application once successfully installed:Most of the handlers analyzed were relatively simple, only including the capability to run commands:Interestingly, the response Content-Type is set to image/gif or image/jpeg, which presents a default image when browsing the image URL with the output hidden in <pre> tags. A possible reason for this could be to bypass network inspection since image files are generally considered non-malicious and are filtered and identified based on extensions.This subset of modules monitors sign-in patterns in outgoing requests and dumps extracted credentials in an encrypted format. The stolen credentials allow the attackers to remain persistent in the environment, even if the primary backdoor is detected.  The modules monitor for specific requests to determine a sign-in activity, such as /auth.owa default URL for OWA application. On inspecting the request, the module dumps the credentials in a .dat file. The contents are encrypted using XOR with a hardcoded value and wrapped with base64 encoding. The below image depicts a decoded sample output:In another variant, the module looks for common placeholder variables for passing credentials used in different ASP.Net applications. The dumped credentials are AES encrypted and wrapped with Base64 encoding, located in %programdata%\\log.txt.As we expect to observe more attacks using IIS backdoors, organizations must ensure to follow security practices to help defend their servers.The distinctive patterns of server compromise aid in detecting malicious behaviors and inform security operations teams to quickly respond to the initial stages of compromise. Pay attention to and immediately investigate alerts indicating suspicious activities on servers. Catching attacks in the exploratory phase, the period in which attackers spend several days exploring the environment after gaining access, is key. Prioritize alerts related to processes such as net.exe, cmd.exe originating from w3wp.exe in general.Hardik SuriMicrosoft 365 Defender Research TeamMicrosoft Defender Antivirus detects these threats and related behaviors as the following malware: To locate malicious activity related to suspicious IIS module registration, run the following queries:\n\t\t\tMicrosoft has observed ongoing activity from mobile banking trojan campaigns targeting users in India with social media messages and malicious applications designed to impersonate legitimate organizations and steal users’ information for financial fraud scams. \t\t\n\t\t\tMicrosoft has been tracking activity related to the financially motivated threat actor Octo Tempest, whose evolving campaigns represent a growing concern for many organizations across multiple industries.\t\t\n\t\t\tChina-based actor Flax Typhoon is exploiting known vulnerabilities for public-facing servers, legitimate VPN software, and open-source malware to gain access to Taiwanese organizations, but not taking further action.\t\t\n\t\t\tMicrosoft Defender is our toolset for prevention and mitigation of data exfiltration and ransomware attacks. Microsoft Purview data security offers important mitigations as well and should be used as part of a defense-in-depth strategy.\t\tMicrosoft is a leader in cybersecurity, and we embrace our responsibility to make the world a safer place."
   },
   {
      "time": "2022-07-27",
      "title": "Cryptominers & WebAssembly in Website Malware",
      "text": " New Customer?WebAssembly (also referred to as Wasm) is a binary instruction format that runs in the browser to enable high-performance applications on web pages and can be executed much faster than traditional JavaScript. WebAssembly can be executed in a variety of environments, including servers, IoT devices, and mobile or desktop apps — but was originally designed to run on the web.When used in a web browser, Wasm runs in its own sandboxed execution environment. As it is already compiled into an assembly format, the browser can read and execute its operations at a speed JavaScript itself can’t match.However, WebAssembly’s features and functionalities also provide two distinct advantages for attackers. Because WebAssembly code is run so much more efficiently, it increases the return on investment for attackers looking to leverage Wasm for cryptojacking. And since Wasm is in a binary format, it makes detection and analysis by conventional antivirus scanners more challenging to decode.Let’s dive into a recent incident that showcases how attackers are leveraging Wasm to evade detection for their cryptojacking malware.We were recently contacted by a new client who reached out to us for help after noticing that their computer slowed down to a crawl every time they navigated to their own WordPress website.A cursory review of their site files revealed the following snippet of code injected into one of their theme files:This small piece of code grabs hxxps://wm[.]bmwebm[.]org/auto.js and loads it client-side whenever the website’s page loads. We can clearly see a username 6110659 and password auto defined in this code sample, which is used to access an account of some kind.Let’s take a look at what this injection does!Inspecting auto.js reveals CharCode obfuscated contents.Once decoded, the contents of auto.js immediately reveal the functionality of a cryptominer which starts mining when a visitor lands on the compromised site. The credentials found in the original injection are used to access the mining account whenever the JavaScript is run on the page.What’s especially interesting about the decoded content is that we can clearly see it leverages WebAssembly to run low-level binary code directly on the browser.The miner also uses a custom pool, which is also clearly visible within the decoded contents of the auto.js file: wss://pool[.]bmwebm[.]orgThe remaining code provides instructions for mining operations, which run alongside the JavaScript and are executed within the browser.I found a similar variation of the miner on another compromised website — note the naming convention used for the JavaScript file: hxxps://wm[.]bmwebm[.]org/adservicegoogle.js This particular variant tries to disguise itself as a legitimate Google Ads script adservicegoogle.js, but in fact loads the same version of the cryptominer originally found in auto.js. One could ask, why only 207? Why not 5000? Why not go for as many as possible? Well, targeting a significant number of sites would create a lot of unwanted attention from security providers, which could result in service disruption. So instead of trying to infect and mine on the largest number of sites possible, they might have chosen to instead extend their campaign by reducing their footprint.It’s also worth noting that the attacker’s domain contains a particularly interesting feature  — the ability to automatically generate scripts — which allows the attacker to generate any number of seemingly innocent looking JavaScript files by simply modifying the JavaScript file name at the end of hxxps://wm[.]bmwebm[.]org/.For example:By leveraging the names of popular services, attackers can better conceal the malicious contents of their scripts from cursory review. Webmasters may see the .js file with a familiar naming convention and simply assume that it belongs to a legitimate service.This functionality also makes it possible for the bad actor to inject the scripts in multiple locations on the compromised website and still maintain the appearance that injections “belong” within the environment.WebAssembly is meant to be one of the next “evolutions” of website technology due to the advantages it offers and how efficiently it can process data — but, as has always been the case, we anticipate attackers will eventually start to make more use of it to conceal their malware or even tap into a legitimate assembly and wrap their malicious code around it.But what can WebAssembly actually achieve? First thing we need to know is that since Wasm needs to interact with JavaScript to work, it cannot work entirely by itself — nor can it directly connect to the internet on its own — so this dependency will always remain.Let’s imagine a credit card stealer. If an attacker wanted to try to stay under the radar for as long as possible, they could employ WebAssembly, but this would limit how much they can hide. Since WebAssembly by itself cannot properly exfiltrate the data or even collect it, it would still rely on JavaScript to capture said data and send it on its way. The Wasm part would simply be responsible for telling the JavaScript which forms to capture, what exfil domain to use etc.A more troublesome scenario is the browser interaction, because it interacts with JavaScript which runs directly on the visitor’s browser. If a zero-day for a major browser is discovered, attackers could make use of Wasm to exploit that vulnerability and evade detection.Thankfully, hackers want the most amount of profit for the least amount of work, so it may take some time for attackers to resort to such complex methodologies when a simple PHP script still does the work just fine.Infections like these can be tricky to navigate on your own if you don’t have website backups to recover from — and this becomes even worse if your website is already utilizing web-assembly for its daily operations.Webmasters looking to protect themselves from malware that employs WebAssembly should make efforts to prevent infections from occurring in the first place.Our website uses cookies, which help us to improve our site and enables us to deliver the best possible service and customer experience."
   },
   {
      "time": "2022-07-27",
      "title": "Researcher finds Russia-based ransomware network with foothold in U.S.",
      "text": " A Russia-based ransomware command and control network has been found to have a foothold in at least one U.S. network, according to researchers from attack surface management firm Censys.Matt Lembright, director of federal applications at Censys, told The Record that he was scanning millions of hosts based in Russia in late June when he discovered two hosts containing a Rapid7 exploitation tool, Metasploit, and a command and control (C2) tool called Deimos C2. One of these hosts also possessed the PoshC2 tool.After even more digging, Lembright discovered that the hosts had connections to the MedusaLocker ransomware as well as the Karma ransomware.“Censys located a host in Ohio also possessing the Deimos C2 tool discovered on the initial Russian host and, leveraging historical analysis, discovered that the Ohio host possessed a malware package with software similarities to the Russian ransomware hosts possessing PoshC2 mentioned above, in October 2021,” Lembright said, noting that the host in Ohio had ties to the Karma ransomware.Lembright noted that the discovery was particularly novel because most ransomware incidents are discovered after an attack, and this was the rare instance of researchers finding evidence of groups setting the stage for an attack. “[Attacks] usually originate from wherever that attacker is accessing the internet and then they usually try to leverage some sort of proxy or intermediary to hide their access and involvement in attacks,” he said. “It gives them an economy of scale. If they have four or five other hosts that they can leverage to attack a certain victim. Certain exploits have to be laid on a victim before they’re able to control those hosts. What we discovered here seems to match that pattern.”Two of the hosts found have malware and two other hosts are connected to Bitcoin, according to Lembright, who said the hosts allowed the group to infect and exploit a victim via ransomware and then a method to be paid. Recorded Future ransomware expert Allan Liska explained that ransomware groups can’t launch an attack from Russian infrastructure because they will get blocked.To get around this, gangs typically compromise hosts in the U.S. “They usually look for large data center providers, universities or other places where there are lots of servers with different levels of security. Those compromised servers are used as redirects,” he said. CISA noted at the time that they have seen MedusaLocker attacks as recently as May 2022.Lembright was unsure of whether other ransomware groups were using the hosts but noted that the Karma ransomware group was tangentially connected to some of the other hosts discovered. He reported his findings to the FBI and is working with them to confirm if the two hosts were used during attacks on a hospital and a library last year. “People can see what we’ve done and exchange whatever their needs or perceived threat actors. If they know their primary attacker leverages another type of tool or software, they can search for those specifically and get even more pointed in their discovery,” Lembright said. “I hope that folks that recognize these hosts or have seen these patterns before can give us a call or work with us to inform some of these folks if this is a predecessor to a larger attack in the near future or if these folks that own these hosts are in danger of being attacked themselves.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   }
]