[
   {
      "time": "2023-08-17",
      "title": "Major U.S. energy org targeted in QR code phishing attack",
      "text": " A phishing campaign was observed predominantly targeting a notable energy company in the US, employing QR codes to slip malicious emails into inboxes and bypass security.Roughly one-third (29%) of the 1,000 emails attributed to this campaign targeted a large US energy company, while the remaining attempts were made against firms in manufacturing (15%), insurance (9%), technology (7%), and financial services (6%).According to Cofense, who spotted this campaign, this is the first time that QR codes have been used at this scale, indicating that more phishing actors may be testing their effectiveness as an attack vector.Cofense did not name the energy company targeted in this campaign but categorized them as a \"major\" US-based company.The emails carry PNG or PDF attachments featuring a QR code the recipient is prompted to scan to verify their account. The emails also state that the target must complete this step in 2-3 days to add a sense of urgency.The threat actors use QR codes embedded in images to bypass email security tools that scan a message for known malicious links, allowing the phishing messages to reach the target’s inbox.To evade security, the QR codes in this campaign also use redirects in Bing, Salesforce, and Cloudflare’s Web3 services to redirect the targets to a Microsoft 365 phishing page.Hiding the redirection URL in the QR code, abusing legitimate services, and using base64 encoding for the phishing link all help evade detection and get through email protection filters.Despite their effectiveness in bypassing protections, QR codes still require the victim to take action to get compromised, which is a decisive mitigating factor working in favor of well-trained personnel.Also, most QR code scanners on modern smartphones will ask the user to verify the destination URL before launching the browser as a protective step.Apart from training, Cofense also suggests that organizations use image recognition tools as part of their phishing protection measures, although these are not guaranteed to catch all QR code threats."
   },
   {
      "time": "2023-08-17",
      "title": "Google released first quantum-resilient FIDO2 key implementation",
      "text": " Google has announced the first open-source quantum resilient FIDO2 security key implementation, which uses a unique ECC/Dilithium hybrid signature schema co-created with ETH Zurich.FIDO2 is the second major version of the Fast IDentity Online authentication standard, and FIDO2 keys are used for passwordless authentication and as a multi-factor authentication (MFA) element.Google explains that a quantum-resistant FIDO2 security key implementation is a crucial step towards ensuring safety and security as the advent of quantum computing approaches and developments in the field follow an accelerating trajectory.\"In particular, standard public key cryptography, which was designed to protect against traditional computers, will not be able to withstand quantum attacks.\"With quantum computers being actively developed, there is concern that they will soon be used to more efficiently and quickly crack encryption keys, making encrypted information accessible to governments, threat actors, and researchers.To protect against quantum computers, a new hybrid algorithm was created by combining the established ECDSA algorithm with the Dilithium algorithm.This hybrid signature approach that blends classic and quantum-resistant features wasn't simple to manifest, Google says. Designing a Dilithium implementation that's compact enough for security keys was incredibly challenging.Its engineers, however, managed to develop a Rust-based implementation that only needs 20KB of memory, making the endeavor practically possible, while they also noted its high-performance potential.The tech giant hopes that its proposal will be adopted by FIDO2 as a new standard and supported by major web browsers with large user bases.The firm calls the application of next-gen cryptography at the internet scale \"a massive undertaking\" and urges all stakeholders to move quickly to maintain good progress on that front.This move came in anticipation of the risk of future quantum computers having the capacity to decrypt today's data, addressing the \"Harvest Now, Decrypt Later\" threat."
   },
   {
      "time": "2023-08-17",
      "title": "Massive 400,000 proxy botnet built with stealthy malware infections",
      "text": " Researchers have uncovered a massive campaign that delivered proxy server apps to at least 400,000 Windows systems. The devices act as residential exit nodes without users' consent and a company is charging for the proxy traffic running through the machines..Some proxy companies sell access to residential proxies and offer monetary rewards to users who agree to share their bandwidth.In a report today, AT&T Alien Labs says that the 400,000-node proxy network was built by using malicious payloads that delivered the proxy application.Despite the company behind the botnet claiming that users gave their consent, the researchers discovered that the proxy installed silently on the devices.\"In addition, as the proxy application is signed, it has no anti-virus detection, going under the radar of security companies,\" the researchers added.In fact, the two Go-based binaries (for macOS and Windows) appear to originate from the same source code, however, the Windows proxy client evades antivirus detection due to using a valid digital signature.The infection starts with the execution of a loader hidden in cracked software and games, which downloads and installs the proxy application automatically in the background without user interaction.The malware authors use Inno Setup with specific parameters that hide any indicators of the installation process and all typical user prompts.During the installation of the proxy client, the malware sends specific parameters, which are also relayed to the command and control (C2) server so that the new client can be registered and incorporated into the botnet.The proxy client establishes persistence on the infected system by creating a registry key to activate it when the system boots and a by adding a scheduled task that to check for new client updates.\"The proxy then continuously gathers vital information from the machine to ensure optimal performance and responsiveness,\" explains the AT&T report.\"This includes everything from the process list and monitoring CPU to memory utilization and even tracking battery status.\"AT&T recommends looking for a \"Digital Pulse\" executable at \"%AppData%\\\" or a similarly named Registry key on \"HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\.\" If any are present, the researchers recommend removing them.The name of the scheduled task is \"DigitalPulseUpdateTask\" and should also be deleted to eliminate the chance of the client update mechanism re-introducing the infection.Finally, avoid downloading pirated software and running executables sourced from dubious locations like peer-to-peer networks or site offering premium software free of charge.Signs of proxyware infection include performance and internet speed degradation, unexpected network traffic patterns, frequent communication with unknown IPs or domains, and system alerts."
   },
   {
      "time": "2023-08-17",
      "title": "PowerShell Gallery Prone to Typosquatting, Other Supply Chain Attacks",
      "text": " [Editor's Note: This article was updated on 8/18/2023 with a response received from Microsoft]Microsoft's PowerShell Gallery presents a software supply chain risk because of its relatively weak protections against attackers who want to upload malicious packages to the online repository, according to researchers at Aqua Nautilus.They recently tested the repository's policies regarding package names and owners and found that a threat actor could easily abuse them to spoof legitimate packages and make it hard for users to identify the true owner of a package.\"If your organization uses PowerShell modules from the gallery, we suggest only using signed PowerShell modules, utilizing trusted private repositories, and exercising caution when downloading new modules/scripts from registries,\" says Yakir Kadkoda, lead security researcher at Aqua. \"Second, we advise similar platforms to the PowerShell Gallery to take necessary steps to enhance their security measures. For instance, they should implement a mechanism that prevents developers from uploading modules with names too similar to existing ones.\"Kadkoda says Microsoft acknowledged the issues when informed about them and claimed it had addressed two separate issues, once in February 2022 and a second time this past January. \"However, we've continued to check, and these issues still exist\" as of Aug. 16, he says.Microsoft said it added functions to find and eradicate malicious packages. \"We're aware of this report and have determined that it relies on social engineering to be successful. However we've implemented some changes to help identify and remove these packages,\" a Microsoft spokeswoman said in an emailed statement to Dark Reading after this story was published. \"We encourage users to report any packages they suspect are malicious via the \"Report\" link on the package module.\"Microsoft said it will continue to monitor for malicious activity on PowerShell Gallery and take defense-in-depth measures to keep customers protected.PowerShell Gallery is a widely used repository for finding, publishing, and sharing PowerShell code modules and so-called desired state configuration (DSC) resources. Many of the packages on the registry are from trusted entities, such as Microsoft, AWS, and VMware, while many others are from community members. There have been more than 1.6 billion package downloads from the repository so far this year alone.One issue that Aqua discovered was the lack of any kind of protection against typosquatting, a deception technique that threat actors have increasingly used in recent years to trick users into downloading malicious packages from public software repositories. Typosquatters typically use names that are phonetically similar to names of popular and legitimate packages on public repositories, such as npm, PyPI, and Maven. They then rely on users making typos when searching for these packages and downloading their malicious package instead. The technique has become a common software supply chain attack vector.Aqua found PowerShell Gallery's policies did little to protect against such deception. For instance, the names of most Azure packages on the repository followed a specific pattern, namely, \"Az.<package_name>.\" However, some other very popular Azure packages such as \"Aztable\" did not follow the pattern and did not have a dot in the name.  Aqua found that there are no restrictions on the prefixes that package developers can use when naming their packages. For example, when Aqua's researchers crafted a nearly perfect replica of Aztable and labeled it Az.Table, they had no problem uploading the proof-of-concept (PoC) code to PowerShell Gallery. Callback code that Aqua included in the PoC showed that several hosts across various cloud services had downloaded the package in the first few hours alone.\"In our opinion, other registries have more protective measures,\" Kadkoda says. \"For instance, npm, another registry platform by Microsoft, uses 'Moniker' rules specifically designed to combat typosquatting,\" he says. One example: Since a package named \"react-native\" already exists on npm, no one labels their module with variation such as \"reactnative,\" \"react_native,\" or \"react.native.\"Another problem that Aqua uncovered with PowerShell Gallery's policies is how they allowed a threat actor to make a malicious package appear legitimate by faking crucial details such as the Author(s), Description, and Copyright fields.  \"An attacker can freely choose any name when creating a user in the PowerShell Gallery,\" Aqua said in its blog post. \"Therefore, determining the actual author of a PowerShell module in the PowerShell Gallery poses a challenging task.\"Unsuspecting users who find these packages on PowerShell Gallery can easily be deceived into believing that the author of the malicious package is a legitimate entity, such as Microsoft, Aqua said.In addition, Aqua's analysis showed that one API in PowerShell Gallery's basically gave threat actors a way to find unlisted modules on the registry — and potentially any sensitive data associated with those modules. Typically, an unlisted module is private and should not be something that an attacker would be able to find via a search of the repository. Aqua researchers found they could not only pull up such modules, they also found one that contained sensitive secrets that belonged to a large technology company.Kadkoda says there is no evidence to suggested that threat actors have leveraged these weaknesses to sneak malicious package into PowerShell Gallery. However, the threat is real. \"It's important to note that, according to Microsoft, they scan PowerShell modules/scripts uploaded to the gallery,\" Kadkoda says. \"This is a good measure to block malicious uploads. However, it remains a cat-and-mouse game between Microsoft's solution and attackers.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-08-17",
      "title": "\r\n\tClorox Operations Disrupted By Cyber-Attack - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistCleaning product manufacturer Clorox has confirmed significant operational disruption caused by a recent cyber-attack. According to a notice published on the company’s website, the attack was detected on August 14, prompting Clorox’s IT team to take immediate action by halting suspicious activity and shutting down affected systems. As a precautionary measure, the compromised systems have remained offline until today to allow for enhanced security measures.“When it comes to ransomware, a common misconception is that organizations escape unscathed if criminals do not encrypt their data, but this is completely wrong. Even if data isn’t held hostage, organizations can still incur huge financial losses as a result of downtime and recovery,” Schroeder explained.The cyber-attack has disrupted Clorox’s manufacturing and distribution processes, affecting its ability to fulfil orders and maintain normal operations. The company has activated its business continuity plans to mitigate the impact and ensure its products remain available to consumers.“The Clorox Company recently identified unusual activity on our IT systems. Upon detection, we immediately took steps to stop the activity and took certain systems offline. While we are working diligently to respond to and address this issue, these systems will remain offline out of an abundance of caution, as we work to add additional protections and hardening measures to further secure them. As a result, some operations are temporarily impaired. We are following our business continuity plans and implementing workarounds where possible,” the company said in a statement received by Infosecurity.“The investigation into the nature and scope of the incident remains ongoing and is in its very early stages. Our team is working diligently to restore systems safely and quickly, and we will ensure all suppliers and customers are updated as appropriate.”Editorial image credit: calimedia / Shutterstock.com"
   },
   {
      "time": "2023-08-17",
      "title": "\r\n\tMass-Exploitation Campaign Targets Citrix NetScalers With Backdoors - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistA widespread cyber-attack targeting thousands of Citrix NetScalers has been unveiled by cybersecurity firm Fox-IT (part of NCC Group) in collaboration with the Dutch Institute of Vulnerability Disclosure (DIVD).The campaign involved exploiting a critical vulnerability, CVE-2023-3519, which allowed malicious actors to infiltrate and compromise vulnerable NetScalers, even after patches and reboots.Describing the threat in an advisory published on Tuesday, NCC Group said the scale of the attack became evident as over 1900 NetScalers were found to be still backdoored at the time of discovery.The attackers employed automated methods to place web shells onto compromised systems, granting them persistent access and the ability to execute arbitrary commands. Despite efforts to apply patches and updates, only half of the compromised NetScalers had been successfully updated to fix the vulnerability.The vulnerability itself was disclosed on July 18, following reports of limited exploitation by various security organizations. This prompted a joint effort by Fox-IT and DIVD to identify compromised systems and initiate responsible disclosure notifications. The incident highlights the ongoing challenge of securing edge devices such as NetScalers, as attackers exploit vulnerabilities before patches can be applied. "
   },
   {
      "time": "2023-08-17",
      "title": "\r\n\tA Third of UK University Students Targeted By Fraud - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineOne in three students at British universities encountered fraud attempts online last year, according to a new study from NatWest.The high street lender commissioned consulting firm RedBrick to poll over 3000 UK university students from 63 towns and cities back in May.Although a third of respondents said they’d encountered a scam over the previous 12 months, there were no statistics on how many were actually caught out.That said, the most common fraud attempts they came across over the period were delivery scams, which 14% of respondents said they’d seen.These are effectively phishing emails impersonating a well-known courier brand. They claim the recipient has a parcel waiting but needs to click through and enter their personal details, sometimes including financial information, to reschedule the delivery.Social media and HMRC tax scams were also frequently encountered by respondents, NatWest claimed. However, fraud relating to high street banks appeared to drop from 2022 figures, hitting just 10% of those polled for the study.NatWest said that women were “slightly more likely” to have encountered a scam in the past 12 months but over twice as likely to lose money than men. The average amount lost by victims of fraud was around £80 ($102).Students living in Bournemouth were most likely to have been hit by scams, with 44% of respondents living in the south coast city saying they had encountered fraud over the previous year. Next came Edinburgh and Oxford. Students in Bristol and Leicester were least likely to be on the receiving end of a fraud attempt (25%).“It is really important that students remain vigilant and are on their guard when they receive an unexpected text message, email or phone call asking for personal details,” explained head of NatWest student accounts, Jaimala Patel."
   },
   {
      "time": "2023-08-17",
      "title": "File sharing site Anonfiles shuts down due to overwhelming abuse",
      "text": " Anonfiles, a popular service for sharing files anonymously, has shut down after saying it can no longer deal with the overwhelming abuse by its users.Anonfiles is an anonymous file-sharing site that allows people to share files anonymously without their activity being logged.The statement shown on Anonfiles site is reproduced in its entirety below:\"After trying endlessly for two years to run a file sharing site with user anonymity we have been tired of handling the extreme volumes of people abusing it and the headaches it has created for us.\nMaybe it is hard to understand but after tens of million uploads and many petabytes later all work of handling abuse was automated through all available channels to be fast as possible.\nWe have auto banned contents of hundreds of thousands files.\nBanned file names and also banned specific usage patterns connected to abusive material to the point where we did not care if we accidental delete thousands of false positive in this process.\nEven after all this the high volume of abuse will not stop.\nThis is not the kind of work we imagine when acquiring it and recently our proxy provider shut us down.\nThis can not continue.\nDomain 4sale.\ndomain@anonfiles.com\"However, these ISO files contained various malware, including information-stealing malware, remote access trojans, and ad clickers.The Anonfiles operators are now looking for someone to purchase their domain, likely to launch their own file sharing service.However, in the interim, the shutdown will cause many files used by cybersecurity researchers and threat actors alike to no longer be available."
   },
   {
      "time": "2023-08-17",
      "title": "CISA warns of critical Citrix ShareFile flaw exploited in the wild",
      "text": " CISA is warning that a critical Citrix ShareFile secure file transfer vulnerability tracked as CVE-2023-24489 is being targeted by unknown actors and has added the flaw to its catalog of known security flaws exploited in the wild.Citrix ShareFile (also known as Citrix Content Collaboration) is a managed file transfer SaaS cloud storage solution that allows customers and employees to upload and download files securely.The service also offers a 'Storage zones controller' solution that allows enterprise customers to configure their private data storage to host files, whether on-premise or at supported cloud platforms, such as Amazon S3 and Windows Azure.On June 13th, 2023, ShareFile released a security advisory on a new ShareFile storage zones vulnerability tracked as CVE-2023-24489 with a critical severity score of 9.8/10, which could allow unauthenticated attackers to compromise customer-managed storage zones.However, ShareFile told BleepingComputer after publication that a fix for CVE-2023-24489 was released on May 11th, 2023 with version 5.11.24. This fix was released as a private advisory, allowing ShareFile customers to patch their devices before the flaw was made public. The company says that over 83% of these customers had patched their environments before the flaw was publicly disclosed.\"Through our research we were able to achieve unauthenticated arbitrary file upload and full remote code execution by exploiting a seemingly innocuous cryptographic bug,\" AssetNote researchers explain.Using this flaw, a threat actor could upload a web shell to a device to gain full access to the storage and all its files.While CISA shares this same warning on many advisories, flaws impacting managed file transfer (MFT) solutions are of particular concern, as threat actors have heavily exploited them to steal data from companies in extortion attacks.As part of AssetNote's technical writeup, the researchers shared enough information for threat actors to develop exploits for the Citrix ShareFile CVE-2023-24489 flaw. Soon after, other researchers released their own exploits on GitHub.On July 26th, GreyNoise began monitoring for attempts to exploit the vulnerability. After CISA warned about the flaw today, GreyNoise updated its report to say there had been a significant uptick in attempts by different IP addresses.At this time, GreyNoise has seen attempts to exploit or check if a ShareFile server is vulnerable from 72 IP addresses, with the majority from South Korea and others in Finland, the United Kingdom, and the United States.While no publicly known exploitation or data theft has been linked to this flaw, CISA now requires Federal Civilian Executive Branch (FCEB) agencies to apply patches for this bug by September 6th, 2023.However, due to the highly targeted nature of these bugs, it would be strongly advised that all organizations apply the updates as soon as possible.Citrix ShareFile told BleepingComputer that this vulnerability impacted less than 3% of their install base (2800 customers) and that there is no known data theft due to this vulnerability.Update 8/22/23: Added information from Citrix."
   },
   {
      "time": "2023-08-17",
      "title": "\r\n\tScammers Exploit Hacked Websites For Phishing - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistA recent study by cybersecurity firm Kaspersky has revealed the techniques utilized by phishers to evade detection and exploit compromised websites for phishing attacks.According to a technical write-up published by security researchers Tatyana Machneva and Olga Svistunova on Monday, one common strategy is the hacking of abandoned or poorly maintained websites. These sites become vulnerable due to outdated security patches, providing cyber-criminals an easy entry point. Phishers can then embed malicious content within these sites, often going unnoticed for extended periods.Even active but smaller websites are not immune to such attacks, Kaspersky explained. Financial constraints and lack of security expertise make them appealing targets. As links to scam pages are often shared via email or instant messaging, the popularity of a website becomes less relevant to phishers than its susceptibility to compromise.Additionally, the research highlights the prevalence of WordPress-powered websites in these attacks, with 43.1% of all websites on the internet relying on this content management system. Hackers frequently exploit vulnerabilities in plugins and the platform itself.“Otherwise, attackers may set up malicious domains long before launching phishing campaigns so as to trick systems that automatically flag messages from newly created domains. Breaching WordPress sites solves this issue because the domains are not newly registered, and hackers can avoid the risk and hassle of registering a domain they intend to use for their malicious purposes.”Kaspersky’s study also provides insights into the methods employed by these malicious actors to infiltrate and manipulate control panels of hacked websites."
   }
]