[
   {
      "time": "2022-10-28",
      "title": "Australian Clinical Labs says patient data stolen in ransomware attack",
      "text": " Australian Clinical Labs (ACL) has disclosed a February 2022 data breach that impacted its Medlab Pathology business, exposing the medical records and other sensitive information of 223,000 people.ACL is an Australian healthcare company that operates 89 laboratories and performs six million tests annually, offering its services to 92 private and public hospitals across Australia.While the firm says it’s not aware of any misuse of the stolen information, it is notifying all impacted clients individually of what data was exposed in the attack.A data breach incident notification published today gives the following summary of leaked data:Australia’s Cyber Security Center (ACSC) and the Office of the Information Commissioner (OAIC) have already been notified about the incident earlier in the year, with ACSC initially warning MedLab that hackers posted their data to the dark web.All impacted individuals will also be offered free-of-charge credit monitoring and identity theft protection services, while ACL will cover the costs of ID document replacements where needed.The ransomware gang that took responsibility for the attack on Medlab Pathology is Quantum, which uploaded all stolen files on its Tor site on June 14, 2022.The threat actors leaked 86GB of data, including patient and employee details, financial reports, invoices, contracts, forms, subpoenas, and other private documents.According to Quantum ransomware’s website, the data leak page for MedLab has been accessed 130,000 times.The disclosure of a cybersecurity incident nine months after it happened isn’t a rapid response, and ACL’s announcement includes a section that attempts to justify this delay.When MedLab detected unauthorized access to its network in February 2022, the firm conducted a forensic investigation which they say didn’t reveal anything worrying.In March 2022, ACSC contacted ACL after receiving intelligence that the incident they had suffered was a ransomware attack. In June 2022, the ACSC notified MedLab that the ransomware gang posted the stolen data to a data leak site.So, according to the company, it took them roughly five months to even realize someone had exfiltrated files from their systems.As for the four more months from that point until today’s disclosure, ACL says the data set was too complicated to quickly determine what customers were affected."
   },
   {
      "time": "2022-10-28",
      "title": "Microsoft links Raspberry Robin worm to Clop ransomware attacks",
      "text": " Microsoft says a threat group tracked as DEV-0950 used Clop ransomware to encrypt the network of a victim previously infected with the Raspberry Robin worm.DEV-0950 malicious activity overlaps with financially motivated cybercrime groups tracked as FIN11 and TA505, known for deploying Clop payloads ransomware on targets' systems.Besides ransomware, Raspberry Robin has also been used to drop other second-stage payloads onto compromised devices, including IcedID, Bumblebee, and Truebot.\"In October 2022, Microsoft researchers observed Raspberry Robin infections followed by Cobalt Strike activity from DEV-0950. This activity, which in some cases included a Truebot infection, eventually deployed the Clop ransomware.\"This hints at Raspberry Robin's operators selling initial access to compromised enterprise systems to ransomware gangs and affiliates who now have an additional way to get into their targets' networks besides phishing emails and malicious ads.After the USB device is attached and the user clicks the link, the worm will spawn a msiexec process using cmd.exe to launch a second malicious file stored on the infected drive.On compromised Windows devices, it communicates with its command and control servers (C2). It also delivers and executes additional payloads after bypassing User Account Control (UAC) on infected systems using several legitimate Windows utilities (fodhelper, msiexec, and odbcconf).Today, the company revealed that the worm has spread to systems belonging to nearly 1,000 organizations within the past month.\"Microsoft Defender for Endpoint data indicates that nearly 3,000 devices in almost 1,000 organizations have seen at least one Raspberry Robin payload-related alert in the last 30 days,\" Microsoft added."
   },
   {
      "time": "2022-10-28",
      "title": "DeFi platform robbed of nearly $15 million in hack",
      "text": " UPDATE: In a statement, Team Finance said an analysis of the incident showed that it began at 2 a.m. PT on Thursday morning. The exploit allegedly targeted a function on the platform that had been audited by a \"reputable\" security firm and was \"not due to any contract upgrade of Team Finance,\" the company claimed. \"We contacted the affected project teams and are keeping them updated regarding the next steps. We have reached out to the exploiter in an effort to discuss possible resolutions. The exploiter's wallet has been blacklisted on Etherscan, and exchanges have been contacted.\"Team Finance spokesperson Brett Fabian told The Record that the person behind the incident has not responded yet to their messages. Fabian would not say how large of a bug bounty the hacker is being offered and explained that their plan to making victims whole is by \"recovering the funds held by the hacker.\"PREVIOUSLY: Decentralized finance platform Team Finance confirmed on Thursday that hackers exploited a vulnerability and stole $14.5 million worth of cryptocurrency. Several blockchain security companies alerted the company of the hack before it released a statement about the issue.“We have just been alerted of an exploit on Team Finance. We are currently unsure of the details. We urge the exploiter to get in contact with us for a bounty payment. We are working to analyze and remedy the situation at this very moment,” the company said. “$14.5M USD of tokens were exploited through the audited v2 to v3 migration function. We have temporarily paused all activity through team finance until we are certain this exploit has been remedied. All funds currently on Team Finance are not at further risk of this exploit.”$14.5M USD of tokens were exploited through the audited v2 to v3 migration function.We have temporarily paused all activity through team finance until we are certain this exploit has been remedied. All funds currently on Team Finance are not at further risk of this exploit.Team Finance calls itself a \"security toolkit for founders that want to create a token and raise money from a community of investors.\" The platform says it has secured $3 billion in cryptocurrency across 12 different blockchains since it was founded in 2020.“We have multiple audits on each and every smart contract by reputable audit companies, and re-audit all new deployments. Actively looking into the exploit, and hopeful to get the funds back. We'll keep everyone updated by the minute,” they said. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-28",
      "title": "Ransomware Gangs Ramp Up Industrial Attacks in US",
      "text": " Ransomware gangs are hitting the industrial sector hard — and especially manufacturing companies, with significant spikes in cyberattack activity against US organizations spotted in the third quarter. Meanwhile, emerging ransomware groups are bursting onto the scene, threatening to push the rate of attacks up even higher.However, the analysis also found that the rate of attacks globally remained flat quarter over quarter — 128 incidents for Q3 vs. 125 in Q2.Stephen Banda, senior manager of security solutions at Lookout, noted that the manufacturing sector, like everyone else, is moving to the cloud; digitizing manufacturing, inventory tracking, operations, and maintenance increases agility and efficiency, with less production downtime and a greater nimbleness. But it also opens up new attack surfaces.\"To remain competitive, manufacturers are investing in intellectual property and new technologies like digital twins,\" he tells Dark Reading. \"In short, manufacturers are transforming the way they produce and deliver goods - moving toward industrial automation and the flexible factory. This transformation, known as Industry 4.0, puts pressure on mobile devices and cloud solutions.\"Yet for most manufacturers, security solutions still remain on-premises, he adds. \"This creates efficacy and scalability challenges when tasked with protecting productivity solutions that have moved to the cloud,\" he notes. \"Security therefore must also move to the cloud to adequately safeguard manufacturing operations.\"As for other industrial segments, 9% of attacks targeted the food and beverage sector (12 incidents), followed by oil and natural gas (6%, or eight incidents) and the energy and pharmaceuticals sectors (collectively making up 10% of attacks, with seven and six incidents respectively). The chemical, mining, engineering, and water and wastewater systems segments had just one attack each.Different Threat Actors Target Different Industrial SegmentsIn all cases, various groups seemed to have specialties, Dragos noted, including:\"This should spur more industry-level coordination to protect against those threats, specifically between companies that otherwise would compete in the marketplace,\" he says. \"Rather than every organization individually mounting defenses, industry-wide responses are needed (put another way, cybercriminals are attacking an industry which requires industry-level responses). Threat actors don’t exist in silos, so why should the response to them be siloed?\"Broomhead noted that ramped up attacks are likely being driven by twin engines, including the Russia-Ukraine conflict.\"The rise in ransomware attacks against industrial organizations who rely on OT systems is likely coming from threat actors viewing such organizations as easier victims because OT systems and devices are much more vulnerable than traditional IT systems,\" he says. \"While there may be a rise in targeting industrial organizations because of the conflict in Ukraine, those organizations have been targeted for a long time by several foreign adversaries, therefore this increase is a combination of industrial OT systems being easier to exploit and increased activity due to Ukraine.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-10-28",
      "title": "Drinik Android malware now targets users of 18 Indian banks",
      "text": " A new version of the Drinik Android trojan targets 18 Indian banks, masquerading as the country's official tax management app to steal victims' personal information and banking credentials.Drinik has been circulating in India since 2016, operating as an SMS stealer, but in September 2021, it added banking trojan features that target 27 financial institutes by directing victims to phishing pages.The latest version of the malware comes in the form of an APK named 'iAssist,' which is supposedly India's Income Tax Department's official tax management tool.Upon installation, it requests permissions to receive, read, and send SMS, read the user's call log, and read and write to external storage.Next, it requests the user the allow the app to (ab)use the Accessibility Service. If granted, it disables Google Play Protect and uses it to perform navigation gestures, record the screen, and capture key presses.Eventually, the app loads the actual Indian income tax site via WebView instead of phishing pages like past variants and instead steals user credentials by recording the screen and using a keylogger.Drinik will also check if the victim ended up on a URL that indicates a successful login to ensure that the exfiltrated details (user ID, PAN, AADHAR) are valid.At this stage, the victim is served a fake dialogue box saying that the tax agency found they're eligible for a refund of Rs 57,100 ($700) due to previous tax miscalculations and are invited to tap the \"Apply\" button to receive it.This action takes the victims to a phishing page that is a clone of the real Income Tax Department site, where they are directed to enter financial information, including account number, credit card number, CVV, and card PIN.To target the eighteen banks, Drinik constantly monitors the Accessibility Service for events related to the targeted banking apps, such as their apps.The targeted banks include SBI (State Bank of India), one of the largest banks in the world, serving 450,000,000 people via a massive network of 22,000 branches.If there’s a match, the malware collects keylogging data that contain user credentials and siphons them to the C2 server.During this attack, Drinik abuses the “CallScreeningService” to disallow incoming calls that may interrupt the login and, by extension, the data-stealing process.While Drinik isn’t as sophisticated or advanced as other banking trojans, its authors appear determined to make it more powerful, constantly adding features that make it harder to detect.Going after Indian taxpayers and banking customers means that Drinik has a massive targeting pool, so every new successful feature potentially translates to substantial financial gains for the malware’s operators.To avoid this threat, always avoid APK downloads from outside the Play Store and enable biometric authentication, such as 2FA, for logging in to e-banking portals."
   },
   {
      "time": "2022-10-28",
      "title": "Cyberattackers Target Instagram Users With Threats of Copyright Infringement",
      "text": " \"This theme is not new, and we have seen it from time to time over the last year,\" Homer Pacag, Trustwave SpiderLabs security researcher, wrote in the post. \"It’s the same copyright infringement trickery again, but this time, the attackers gain more personal information from their victims and use evasion techniques to hide phishing URLs.\"Instead of attaching a malicious file that a user must click on to reach a phishing page — something that many people already know seems suspicious — URL redirection includes in a message an embedded URL that appears legitimate but which ultimately leads to a malicious page that steals credentials instead. The Instagram campaign that researchers discovered begins with an email to a user notifying him or her that complaints were received about the account infringing upon copyright, and that an appeal to Instagram is necessary if the user doesn't want to lose the account.The phishing emails include a button with a link to an \"appeals form,\" informing users they can click the link to fill out the form and later will be contacted by an Instagram representative.Researchers analyzed the email in a text editor and found that, rather than directing users to the Instagram site to fill out a legitimate report, it employs URL redirection. Specifically, the link uses a URL rewrite or redirector to a site owned by WhatsApp — hxxps://l[.]wl[.]co/l?u= — followed by the true phishing URL — hxxps://helperlivesback[.]ml/5372823 — found in the query part of the URL, Pacag explained.\"This is an increasingly common phishing trick, using legitimate domains to redirect to other URLs in this fashion,\" he wrote.If a user clicks on the button, it opens his or her default browser and redirects the user to the intended phishing page, going through a few steps ultimately to steal user and password data if the victim follows through, the researchers said.First, if the victim enters his or her username, the data is sent to the server via the form \"POST\" parameters, the researchers said. A user is prompted to click a \"Continue\" button, and if this is done, the page displays the typed username, now prefixed with the typical \"@\" symbol used to signify an Instagram username. Then the page asks for a password, which, if entered, also is sent to the attacker-controlled server, the researchers said. It's at this point in the attack where things deviate slightly from a typical phishing page, which is usually satisfied once a person enters their username and password into the appropriate fields, Pacag said.The attackers in the Instagram campaign don't stop at this step; instead, they ask the user to type in his or her password once more and then fill in a question field asking in which city the person lives. This data, like the rest, also is sent back to the server via \"POST,\" Pacag explained.The last step prompts the user to fill in his or her telephone number, which presumably attackers can use to get past two-factor authentication (2FA) if it's enabled on an Instagram account, the researchers said. Attackers also can sell this info on the Dark Web, in which case it can be used for future scams that initiate via telephone calls, they noted.Once all of this personal info is harvested by attackers, the victim is finally redirected to Instagram's actual help page and the beginning of the authentic copyright reporting process used to initiate the scam.\"It can be difficult for most URL detection systems to identify this deceptive practice, as the intended phishing URLs are embedded mostly in the URL query parameters,\" Pacag said.Until technology catches up with the constantly changing tactics of phishers, email users themselves — especially in a corporate setting — need to maintain a higher degree of alert when it comes to messages that appear suspicious in any way to avoid being fooled, the researchers said. Ways users can do this are by checking that URLs included in messages match the legitimate ones of the company or service that claims to be sending them; only clicking on links in emails that come from trusted users with whom people have communicated with previously; and checking with IT support before clicking on any embedded or attached link in an email.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-10-28",
      "title": "NY Post confirms hack after website, Twitter feed flooded with threats toward Biden, AOC",
      "text": " \"The New York Post’s investigation indicates that the unauthorized conduct was committed by an employee, and we are taking appropriate action. This morning, we immediately removed the vile and reprehensible content from our website and social media accounts,\" a spokesperson said. PREVIOUSLY: The New York Post confirmed on Thursday morning that it had been hacked after the newspaper’s Twitter feed and website were inundated with offensive posts about politicians like Rep. Alexandria Ocasio-Cortez, U.S. President Joe Biden and New York Mayor Eric Adams.The newspaper did not respond to requests for comment but quickly removed the posts and wrote on Twitter that it had been hacked and was investigating the incident.The popular tabloid is owned by News Corp and has 2.8 million followers on Twitter. As of 10:30 am ET, the offensive posts had been removed from the company’s Twitter feed and website. In that incident, hackers breached the news outlet’s internal content management systems and sent two offensive push notifications through Apple News to thousands of people. The magazine's website was temporarily shut down, as well as that of Inc. Magazine, which is owned by the same publisher.An incredibly offensive alert was sent by Fast Company, which has been hacked. Apple News has disabled their channel.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-28",
      "title": "Drizly Sued by FTC Over Data Breach Which Affected 2.5 Million Customers - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-10-28",
      "title": "Biden administration unveils cybersecurity goals for critical infrastructure operators",
      "text": " The Homeland Security Department on Thursday unveiled new benchmarks for critical infrastructure operators to strengthen their cybersecurity defenses, the Biden administration’s latest attempt to convince companies to voluntarily adopt better safeguards.“These are really, I think, a watershed moment in providing an easy, accessible, prioritized menu of options for businesses to advance their cybersecurity in an increasingly threatening environment,” Homeland Security Secretary Alejandro Mayorkas said on a press call.He added the suggested steps are identified according to the cost associated with each action, their overall complexity and the “magnitude of the impact that the goal’s implementation would have on advancing one’s cybersecurity.”The goals and their accompanying checklist — broken up into different areas, such as device and data security, vulnerability management and recovery and developing an incident response plan — recommends common tactics that the administration’s top cyber officials have urged in the past, including implementing multi-factor authentication, strong password management and asset inventory.CISA Director Jen Easterly said the goals could be thought of as a “quick-start guide” and might be particularly helpful to “small and medium businesses, especially those in the supply chain” of major corporations that already follow the security measures described in NIST’s Cybersecurity Framework, as well as “target rich, resource poor entities'' like water utilities, school districts and hospitals.President Joe Biden signed a national security memorandum last year that called for the goals after a series of ransomware attacks disrupted the nation's fuel supplies and food distribution.Easterly noted her organization created a GitHub page to receive feedback on the new metrics and would work with individual critical infrastructure operators in the coming months to create sector-specific performance goals.Eric Goldstein, executive assistant director for cybersecurity at CISA, said the agency would use the goals to “really get out there and talk to organizations across the country and, frankly, evangelize the most important steps to take.”\"We are really excited for these performance goals to be a living document,\" he told reporters, adding the goals would be updated every six to 12 months.Martin Matishak is a senior cybersecurity reporter for The Record. He spent the last five years at Politico, where he covered Congress, the Pentagon and the U.S. intelligence community and was a driving force behind the publication's cybersecurity newsletter.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-28",
      "title": "Major German energy supplier hit by cyberattack",
      "text": " Enercity, one of Germany’s largest municipal energy suppliers, confirmed it was targeted by a cyberattack on Wednesday morning.Enercity confirmed that it would continue supplying energy to customers, explaining its operational technology and critical infrastructure was not affected. “Our grids and power plants are stable and the security of supply is guaranteed,” the company stated.However the attack has impacted customer service, which has limited availability. The company added: “Not all IT systems can currently be used to their full extent, which means that they may be minor restrictions.”The energy sector in Germany has been repeatedly targeted by criminals in recent months.Several cyber incidents preceding the Russian invasion of Ukraine in February affected the oil and chemical sector in the country — as well as in Germany’s neighbors — provoking concerns that they were part of a criminal campaign coordinated by Russian intelligence.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   }
]