[
   {
      "time": "2022-11-30",
      "title": "IKEA investigating cyberattacks on outlets in Kuwait, Morocco",
      "text": " Swedish furniture giant IKEA confirmed that its franchises in Kuwait and Morocco are dealing with a cyberattack that caused a disturbance on some operating systems. A spokesperson told The Record that the attack is “being investigated together with the relevant authorities as well as our cyber security partners.”“IKEA Kuwait and IKEA Morocco are independently operated by a franchisee based in Kuwait,” the spokesperson said. “The operations and customer meeting points are independent from any other IKEA retailers.”The outlets in Kuwait and Morocco were added to the leak site of the Vice Society ransomware group on Monday. The file names shared on the leak site indicate the hackers stole business as well as employee data and may have additional information taken from IKEA outlets in Jordan. IKEA has more than 400 stores across about 50 countries, including four in Morocco, three in Kuwait and two in Jordan.Almost exactly one year ago, IKEA faced a reply-chain phishing cyberattack that targeted the internal mailboxes of employees. The hackers used compromised email accounts for certain IKEA organizations and business partners to target employees with malicious Excel documents carrying malware. \"This means that the attack can come via email from someone that you work with, from any external organisation, and as a reply to an already ongoing conversations. It is therefore difficult to detect, for which we ask you to be extra cautious.\"The Vice Society group has been active since at least June 2021, and its latest attacks between July and October 2022 have “heavily impacted the education sector.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-30",
      "title": "The Metaverse Could Become a Top Avenue for Cyberattacks in 2023",
      "text": " A combination of maturing and emerging consumer-facing cyber threats could add to the many challenges that enterprise security teams will need to contend with in 2023.For business admins, the expansion of brands into the world of the metaverse (the theoretical universal and immersive virtual world of the Internet, facilitated by the use of virtual reality and social media) could open them up to attack. And in the era of remote work and bring-your-own-device (BYOD), any consumer threat is potentially an enterprise one, so IT security teams would do well to follow the trends in this space.The security vendor for example expects that cybercriminals will continue to take advantage of the post-pandemic surge in consumer interest around online streaming services to try to distribute malware, steal data, and execute other malicious activity.Many of the attacks will target individuals looking for alternate sources for downloading a legitimate streaming app, or a particular episode of a show. Expect to see cybercriminals use widely anticipated titles and streaming service provider names such as Netflix, Hulu, and Amazon Prime Video as lures to get users to download malware or to direct them to phishing sites, according to Kaspersky.Consumers will also face more gaming subscription fraud and scams that involve online currencies and artifacts. Attackers will primarily target games that use currencies and allow sale of in-game items and boosters because they give threat actors a way to process money obtained from other illegal activities.Kaspersky expects that attackers will also try to exploit a continuing shortage in the availability of popular gaming consoles via fake pre-sale offers as well as fraudulent giveaways and discounts from online stores purporting to sell hard-to-find consoles.Meanwhile, the metaverse, online education platforms, and certain categories of health-related apps will all become new avenues for attack in 2023, Kaspersky said.Privacy will emerge as a major concern in the metaverse, Kaspersky predicted. \"As the metaverse experience is universal and does not obey regional data protection laws, such as GDPR, this might create complex conflicts between the requirements of the regulations regarding data breach notification,\" Kaspersky said.At least some of the attacks in virtual reality and augmented reality environments will involve virtual abuse and sexual assault — such as that involving cases of avatar rape, Kaspersky said.Despite efforts by technology companies to build protection mechanisms into metaverses, \"virtual abuse and sexual assault will spill over into metaverses,\" Kaspersky said. \"As there are no specific regulation or moderation rules, this scary trend is likely to follow us into 2023.\"Certain kinds of apps — such as those related to meditation or those where a consumer might offer a hint of their current emotional state — could become another new attack avenue, Larkina says.\"It is easy enough to imagine a variety of applications for meditation, in which you indicate your current state/emotions, and they select the appropriate course for you,\" she explains. \"Such data can easily be collected and stored in order to track the state of the user and offer them suitable meditation practices.\" An attacker that gains access to such data could execute successful spear-phishing and social engineering scams in a highly targeted manner, she notes.Attacks targeting consumers should matter to enterprise security teams because attacks on companies quite often involve the human factor, Larkina says. \"If the system is technically secure enough, then you can get inside the system by 'hacking' employees of the company.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-11-30",
      "title": "Killnet Gloats About DDoS Attacks Downing Starlink, White House",
      "text": " Killnet and its band of hacker collaborators are claiming they were able to pull off a trio of symbolic distributed denial-of-service (DDoS) attacks aimed at punishing some of the most critical supporters of Ukraine against the Russian invasion — Elon Musk's Starlink satellite broadband service and the websites of the White House in the US and the Prince of Wales in the UK. Researchers at Trustwave were able to find evidence corroborating the Russian-backed threat group's claims. Killnet claimed it took down Starlink service on Nov. 18, which has been critical for providing the Ukraine war effort with Internet connectivity. Indeed, Trustwave found Starlink customers on Reddit on the same day complaining they couldn't log in to their accounts for several hours. \"You've been waiting for this comrades,\" Killnet posted on Telegram, according to Trustwave. \"Collective DDoS attack on Starlink! No one can log into Starlink.\" Other threat groups, and known past Killnet collaborators, also claimed they were involved in the Starlink and other DDoS takedowns, including Anonymous Russian, Msidstress, Radis, Mrai, and Halva. \"Of course, we wanted to take longer, but did not take into account the intensity of the request filtering system,\" Killnet added. \"But!!! The White House was banged up in front of everyone!\" Days later, on Nov. 22, the group launched yet another DDoS attack, this time against the Prince of Wales' site, and warned that the UK healthcare system would be next, the Trustwave team reported. Killnet also threatened future attacks against the London Stock Exchange, the British Army, and more. Along with its claim of the UK DDoS attack, Killnet added ominously, \"today it does not work, perhaps this is due to the supply of high-precision missiles to Ukraine!\" Although the targets are ambitious, Trustwave said Killnet and its cybercrime cohort aren't advanced enough to pull off more than basic DDoS attacks. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-11-30",
      "title": "Vulnerabilities found affecting OT products from German companies Festo and CODESYS",
      "text": " Three vulnerabilities have been disclosed affecting operational technology (OT) products from two German companies: factory automation manufacturer Festo and automation software company CODESYS.These vulnerabilities affect hundreds of industrial devices in the supply chain. The most severe one enables denial of service and is trivially easy to execute – either by visiting a hidden web page by or by using a text-based browser tool.The three vulnerabilities are FSCT-2022-0072 — affecting CODESYS V3 — as well as CVE-2022-3079 and CVE-2022-3270, which affect Festo automation controllers.Forescout’s Head of Security Research Daniel dos Santos said CODESYS’ CVE-2022-4048 stands out because it shows that even in recent and popular implementations of cryptography in OT systems, there are some basic mistakes. “The use of insecure pseudo-random number generators, a null initialization vector and the insecure mode of operation ECB are all well-known cryptographic pitfalls that should have been avoided in a product used by many critical OT devices,” he said.   Dos Santos noted that with the help of Festo, they also discovered that known vulnerabilities CVE-2022-31806 and CVE-2022-22515 affected several Festo programmable logic controllers (PLCs) — industrial computers used to control automation — because they shipped with an unsafe configuration of the CODESYS runtime environment.He suggested IT teams focus on remediating these issues because many other device manufacturers may be integrating CODESYS insecurely in their products and either are not aware of this or have not made their customers aware with a specific security advisory.The most concerning of the bugs, according to dos Santos, is CVE-2022-3270, which allows for sensitive commands to be run without authentication on some Festo PLCs. “This once again shows that there are many proprietary OT protocols out there that allow anybody on the network to take control of a PLC.“In most cases these are legacy protocols designed at a time where security was not a major concern for OT, but they are still used in critical facilities around the world.”CODESYS has sold more than 8 million device licenses – most to manufacturers of programmable automation components and controllers like Festo. Its automation suite runs on some 1,000 models of more than 500 manufacturers, Forescout says.These devices are used in industries such as manufacturing, energy automation and building automation. “Although these devices are typically not supposed to be exposed online, we see almost 3,000 devices running CODESYS when querying the Shodan search engine,” the researchers said. Festo, meanwhile, is a seller of pneumatic and electrical control systems and drive technology for factories and process automation across 61 countries, with billions in annual sale revenue.On the Forescout Device Cloud – a repository of data from 19 million devices monitored by Forescout appliances – the researchers saw close to 1,000 Festo controllers, used overwhelmingly within manufacturing.Forescout disclosed the bugs to the affected companies as well as CERT@VDE, a German security platform for small and medium-sized automation companies. The researchers said that like those disclosures, these new issues “exemplify either an insecure-by-design approach where manufacturers include dangerous functions that can be accessed with no authentication or a subpar implementation of security controls, such as cryptography.”The main issue Forescout found with CODESYS V3 is that session keys are generated using an insecure pseudo-random number generator (PRNG) working off a small and predictable seed.According to the researchers, an attacker can “simply brute force the session key to decrypt the downloaded code for manipulation.”“The code is encrypted in ECB mode without additional cryptographic authentication and integrity over the ciphertext as a whole. This means that both confidentiality and integrity are compromised regardless of session key strength,” the researchers said.“The impact is that an attacker can trivially decrypt and manipulate protected code.”The other issues concerned several ways to reboot Festo programmable logic controllers (PLCs) without authentication.Any one of these methods would allow an attacker with network access to target the device and cause a denial of service condition.An attacker could also use the reboot command in the PLC Browser tool — a text-based monitor for controllers running CODESYS — which allows an operator to issue several commands to the monitored controllers. Tobias Pfeiffer, head of Festo's Product Security Incident Response Team, told The Record that CVE-2022-3079 only concerned the CPX-CEC-C1 and CPX-CMXX products, with the latter being phased out after discontinuation in 2015. Pfeiffer noted that there are replacements available for CPX-CEC-C1.Forescout said protection against these vulnerabilities requires patching devices running the vulnerable firmware (FSCT-2022-0072), replacing them with newer equipment (CVE-2022-3079) or changing default configurations (CVE-2022-31806 and CVE-2022-22515).The researchers also suggested firms create an inventory of vulnerable devices and enforce segmentation controls, isolating tools that cannot be patched immediately.According to dos Santos, the problems may extend beyond what Forescout found on Shodan.“Just like Festo has FGMC and other vendors have other insecure engineering protocols that we reported on the original OT:ICEFALL disclosure, there certainly are many other instances of this that are not yet public knowledge,” he said.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-30",
      "title": "Spanish police dismantle operation that made €12M via investment scams",
      "text": " Spanish National Police have dismantled a cybercrime organization that used fake investment sites to defraud over €12.3 million ($12.8 million) from 300 victims across Europe.The malicious campaigns involved creating fake cryptocurrency investment sites with a similar appearance to well-known, legitimate platforms.The threat actors then laundered money stolen from victims by moving it from Spanish banks to foreign financial entities where the criminals hoped it was away from the authorities' scrutiny or tracing ability.Spain's law enforcement investigation was launched after the legal representative of one of the impersonated financial groups reported the case to the police.During the operation, six members of the cybercrime organization were arrested in Madrid and Barcelona and will face charges of suspected fraud, money laundering, and usurpation of marital status.The cybercriminals created a network of fake bank websites that used the typosquatting technique, which involves registering domains similar to the official sites of real, impersonated banks.By changing a character or swapping the position of two letters, the domains may still appear authentic to careless visitors.Typically, victims end up on these sites by following links embedded in phishing emails, which is how the dismantled Spanish gang also drew traffic to its sites.While the victims of the threat group originate from several countries in Europe, most of the fake websites targeted French people, and hence they impersonated French financial institutions.The victims were made to believe they were investing money on these websites, but in reality, their deposits were sent directly to the crime group's bank accounts.The stolen funds were moved to the scammers' bank accounts in Spain, Portugal, Poland, and France and subsequently moved to foreign entities in a money laundering effort. After bouncing around to obscure the money trace, the funds were eventually returned to Spanish accounts. The police's investigation determined the total amount of money sent to the crime group's final destination was €12,345,731."
   },
   {
      "time": "2022-11-30",
      "title": "Intel disputes seriousness of Data Centre Manager authentication flaw | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondSecurity researcher scores $10K bug bountyA security researcher has released details of how they were able to hack Intel’s Data Center Manager (DCM).“A protection mechanism failure in the Intel DCM software before version 5.0 may allow an unauthenticated user to potentially enable escalation of privilege via adjacent access,” a summary by Mitre Corp explained.Intel’s Data Centre Manager Console offers a real-time monitoring and management dashboard that can be used to manage an array of data center assets. Ahrens uncovered vulnerabilities in the product through a source code review of the decompiled application.Some aspects of the painstaking work that followed and its results may be relevant to other security researchers and technology developers.“It was the first time I discovered this kind of vulnerability, mainly because I barely looked at Active Directory-integrated software,” Ahrens told The Daily Swig.“However, it might be the case that other vendors suffer from the same type of vulnerability if they don’t validate the user-defined authentication domain (which, however, should be done since it’s part of the overall authentication schema).”The freelance penetration tester and security researcher added: “This specific bug also always depends on a configured Active Directory group with a well-known SID [security identifier] – so it does not apply to Active Directory implementations, per se.“You could theoretically also exploit this using single user or custom group objects that don’t have a well-known SIDs, but that would require the attacker to either be able to guess, predict, or leak it somehow else.”According to Ahrens. Intel resolved the vulnerability by enforcing LDAP-based [controls] and performing an additional certificate check against DCM’s internal SSL keystore, where the Active Directory CA certificate needs to be trusted.Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2022-11-30",
      "title": "Sandworm hacking group linked to new ransomware deployed in Ukraine",
      "text": " Malware called RansomBoggs hit several organizations in Ukraine before it was discovered by the Slovakia-based firm last week.The attack carried multiple references to the animated film Monsters, Inc. The ransom note sent to infected computers was purportedly written on behalf of the movie’s main protagonist, the monster James P. Sullivan, whose job in the film was to scare kids.In the ransom note, Sullivan asks for financial help and apologizes for the “inconvenience.” “We are relying on you in these hard times and are crying for help,” the note reads.The executable file and the hackers’ Telegram account are also named Sullivan, and references to the movie are also present in the code. At least five Ukrainian organizations were targeted by RansomBoggs, ESET spokeswoman Yulia Andrienko told The Record. The company hasn't detected attacks of this ransomware family outside of Ukraine.The deployment of RansomBoggs is similar to previous attacks attributed to Sandworm, which was linked to the NotPetya cyberattack in 2017 that disrupted Ukrainian government organizations, banks, media, and electricity suppliers.RansomBoggs appears to be faux ransomware — the authors aren't interested in making money from extorting victims, but are using it primarily to disrupt organizations by locking up their data, according to Andrienko. She also said the ransomware itself is fairly standard, aside from the Monsters Inc. theme.As in the Industroyer2 attack, hackers used the PowerShell script, called POWERGAP, to deploy RansomBoggs payloads from the domain controller on the victims' networks.PowerShell script was also used to deliver destructive CaddyWiper malware in attacks that affected several dozen systems at Ukrainian organizations in March.Every day, Russia carries out about 10 cyberattacks targeting Ukrainian critical infrastructure, Ukrainian cybersecurity official Viktor Zhora said at the ForbesTech conference in November. He did not elaborate on the severity of the attacks or their impact.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-30",
      "title": "Hackers Using Trending TikTok 'Invisible Challenge' to Spread Malware",
      "text": " Threat actors are capitalizing on a popular TikTok challenge to trick users into downloading information-stealing malware, according to new research from Checkmarx.But the fact that individuals filming such videos could be undressed has led to a nefarious scheme wherein the attackers post TikTok videos with links to rogue software dubbed \"unfilter\" that purport to remove the applied filters.The WASP stealer (aka W4SP Stealer) is a malware that's designed to steal users' passwords, Discord accounts, cryptocurrency wallets, and other sensitive information.The TikTok videos posted by the attackers, @learncyber and @kodibtc, on November 11, 2022, are estimated to have reached over a million views. The accounts have been suspended.Also included in the video is an invite link to a Discord server managed by the adversary, which had nearly 32,000 members before it was reported and deleted. Victims joining the Discord server subsequently receive a link to a GitHub repository that hosts the malware.The stealer code is said to have been embedded in various Python packages such as \"tiktok-filter-api,\" \"pyshftuler,\" \"pyiopcs,\" and \"pydesings,\" with the operators swiftly publishing new replacements to the Python Package Index (PyPI) under different names upon getting removed.\"The level of manipulation used by software supply chain attackers is increasing as attackers become increasingly clever,\" Nachshon noted. \"These attacks demonstrate again that cyber attackers have started to focus their attention on the open source package ecosystem.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-30",
      "title": "CISA Warns of Actively Exploited Critical Oracle Fusion Middleware Vulnerability",
      "text": " Successful exploitation of the remote command execution bug could enable an unauthenticated attacker with network access to completely compromise and take over Access Manager instances.Federal agencies are required to apply the vendor patches by December 19, 2022, to secure their networks against potential threats.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]