[
   {
      "time": "2022-09-30",
      "title": "New Microsoft Exchange zero-days actively exploited in attacks",
      "text": " Threat actors are exploiting yet-to-be-disclosed Microsoft Exchange zero-day bugs allowing for remote code execution, according to claims made by security researchers at Vietnamese cybersecurity outfit GTSC, who first spotted and reported the attacks.The attackers are chaining the pair of zero-days to deploy Chinese Chopper web shells on compromised servers for persistence and data theft, as well as move laterally to other systems on the victims' networks.GTSC suspects that a Chinese threat group is responsible for the attacks based on the web shells' code page, a Microsoft character encoding for simplified Chinese.The user agent used to install the web shells also belongs to Antsword, a Chinese-based open-source website admin tool with web shell management support.Microsoft hasn't disclosed any information regarding the two security flaws so far and is yet to assign a CVE ID to track them.\"GTSC submitted the vulnerability to the Zero Day Initiative (ZDI) right away to work with Microsoft so that a patch could be prepared as soon as possible,\" they added. \"ZDI verified and acknowledged 2 bugs, whose CVSS scores are 8.8 and 6.3.\"Trend Micro released a security advisory Thursday evening confirming that they submitted the two new Microsoft Exchange zero-day vulnerabilities discovered by GTSC to Microsoft.The company has already added detections for these zero-days to its IPS N-Platform, NX-Platform, or TPS products.There’s reports emerging that a new zero day exists in Microsoft Exchange, and is being actively exploited in the wild\nI can confirm significant numbers of Exchange servers have been backdoored - including a honeypot.\nThread to track issue follows:The exploit works in two stages:\"The version number of these Exchange servers showed that the latest update had already installed, so an exploitation using Proxyshell vulnerability was impossible,\" the researchers said.\"We recommend all organizations/enterprises around the world that are using Microsoft Exchange Server to check, review, and apply the above temporary remedy as soon as possible to avoid potential serious damages,\" GTSC added.Admins who want to check if their Exchange servers have already been compromised using this exploit can run the following PowerShell command to scan IIS log files for indicators of compromise:Microsoft and ZDI spokespersons were not immediately available for comment when contacted by BleepingComputer earlier today.Update 9/29/22 7:02 PM EST: Added information about Trend Micro's advisory on the two zero-days."
   },
   {
      "time": "2022-09-30",
      "title": "Ex-NSA employee charged with violating Espionage Act, selling U.S. cyber secrets | CyberScoop",
      "text": " \n\nSeptember 29, 2022\n\nA former National Security Agency employee appeared in federal court Thursday on charges that he attempted to transmit classified “national defense information” to an FBI agent he believed was a Russian operative in exchange for $85,000, according to the Justice Department.Dalke was only employed by the NSA for about three weeks before quitting on July 1, but while there he had a top-secret clearance in his role as an “information systems security designer,” according to the FBI.The affidavit alleges that between August and September 2022, Dalke used an encrypted email account to “transmit excerpts of three classified documents he had obtained during his employment to an individual Dalke believed to be working for a foreign government.”The affidavit is cryptic about which government Dalke believed the agent was purporting to work for. But a footnote in the document references the fact that in trying to confirm the person he was speaking with was a Russian agent, Dalke reached out through “multiple published channels to gain a response.” This included “submission to the SVR TOR site,” the affidavit says. The SVR, or Foreign Intelligence Service, is the Russian government’s external intelligence agency.Dalke has been charged with three violations of the Espionage Act, which carries a potential sentence of death or any term of years up to life in prison. A lawyer for Dalke could not be immediately located."
   },
   {
      "time": "2022-09-30",
      "title": "Hacking group hides backdoor malware inside Windows logo image",
      "text": " Security researchers have discovered a malicious campaign by the 'Witchetty' hacking group, which uses steganography to hide a backdoor malware in a Windows logo.Symantec reports that the threat group is operating a new cyberespionage campaign launched in February 2022 that targeted two governments in the Middle East and a stock exchange in Africa and is still ongoing.In this campaign, the hackers refreshed their toolkit to target different vulnerabilities and used steganography to hide their malicious payload from antivirus software.Steganography is the act of hiding data within other non-secret, public information or computer files, such as an image, to evade detection. For example, a hacker can create a working image file that displays correctly on the computer but also includes malicious code that can be extracted from it.In the campaign discovered by Symantec, Witchetty is using steganography to hide an XOR-encrypted backdoor malware in an old Windows logo bitmap image.The file is hosted on a trusted cloud service instead of the threat actor's command and control (C2) server, so the chances of raising security alarms while fetching it are minimized.\"Downloads from trusted hosts such as GitHub are far less likely to raise red flags than downloads from an attacker-controlled command-and-control (C&C) server.\"Next, the threat actors fetch the backdoor hiding in the image file, which enables them to do the following:Witchetty also introduced a custom proxy utility that causes the infected computer to act \"as the server and connects to a C&C server acting as a client, instead of the other way around.\"Other tools include a custom port scanner and a custom persistence utility that adds itself in the registry as \"NVIDIA display core component.\"Along with the custom tools, Witchetty uses standard utilities like Mimikatzand to dump credentials from LSASS and abuses \"lolbins\" on the host, like CMD, WMIC, and PowerShell.TA410 and Witchetty remain active threats to governments and state organizations in Asia, Africa, and around the globe. The best way to prevent its attacks is to apply security updates as they are released.In the campaign discovered by Symantec, the hackers rely on exploiting last year's vulnerabilities to breach the target network, taking advantage of the poor administration of publicly exposed servers."
   },
   {
      "time": "2022-09-30",
      "title": "ZINC weaponizing open-source software | Microsoft Security Blog",
      "text": " April 2023 update – Microsoft Threat Intelligence has shifted to a new threat actor naming taxonomy aligned around the theme of weather. Zinc is now tracked as Diamond Sleet.Beginning in June 2022, ZINC employed traditional social engineering tactics by initially connecting with individuals on LinkedIn to establish a level of trust with their targets. Upon successful connection, ZINC encouraged continued communication over WhatsApp, which acted as the means of delivery for their malicious payloads.Microsoft Defender for Endpoint provides comprehensive protection against tools and custom malware used by ZINC, including ZetaNile. The hunting queries provided at the end of this blog will help customers comprehensively search their environments for relevant indicators. As with any observed nation-state actor activity, Microsoft directly notifies customers that have been targeted or compromised, providing them with the information they need to secure their accounts. ZINC is a highly operational, destructive, and sophisticated nation-state activity group. Active since 2009, the activity group gained further public notoriety in 2014 following their successful attack against Sony Pictures Entertainment. ZINC is known to use a variety of custom remote access tools (RATs) as part of their arsenal, including those detected by Microsoft as FoggyBrass and PhantomStar.  ZINC attacks appear to be motivated by traditional cyberespionage, theft of personal and corporate data, financial gain, and corporate network destruction. ZINC attacks bear many hallmarks of state-sponsored activities, such as heightened operational security, sophisticated malware that evolves over time, and politically motivated targeting.ZINC, tracked by other security companies as Labyrinth Chollima and Black Artemis, has been observed conducting this campaign from late April to mid-September 2022.LinkedIn Threat Prevention and Defense detected ZINC creating fake profiles claiming to be recruiters working at technology, defense, and media entertainment companies, with the goal of moving targets away from LinkedIn and to the encrypted messaging app WhatsApp for the delivery of malware. ZINC primarily targeted engineers and technical support professionals working at media and information technology companies located in the UK, India, and the US. Targets received outreach tailored to their profession or background and were encouraged to apply for an open position at one of several legitimate companies. In accordance with their policies, for accounts identified in these attacks, LinkedIn quickly terminated any accounts associated with inauthentic or fraudulent behavior.Once they have established a connection with their target, ZINC operationalized malicious versions of two SSH clients, PuTTY and KiTTY, that acted as the entry vector for the ZetaNile implant. Both utilities provide terminal emulator support for different networking protocols, making them attractive programs for individuals commonly targeted by ZINC. The weaponized versions were often delivered as compressed ZIP archives or ISO files. Within that archive, the recipient is provided a ReadMe.txt and an executable file to run. As part of the evolution of ZINC’s malware development, and in an effort to evade traditional defenses, running the included executable does not drop the ZetaNile implant. For ZetaNile to be deployed, the SSH utility requires the IP provided in the ReadMe.txt file. An example of the content of that file is provided below:ZINC has been using trojanized PuTTY as part of its attack chain for many years, and this most recent variant establishes persistence on compromised devices by utilizing scheduled tasks. This activity was recently reported by Mandiant. The malicious PUTTY.exe is configured to install the Event Horizon malware in C:\\ProgramData\\colorui.dll and subsequently copy C:\\Windows\\System32\\colorcpl.exe to C:\\ProgramData\\colorcpl.exe.  By using DLL search order hijacking, ZINC can load the second stage malware, colurui.dll, and decode the payload with the key “0CE1241A44557AA438F27BC6D4ACA246” to be used for command and control. Upon successful connection to the C2 server, the attackers can install additional malware on the compromised device for other tasks.Lastly, persistence is established with the creation of a daily scheduled task, PackageColor, as part of the configuration for the weaponized PuTTY. ZINC accomplishes this with the following command:While ZINC has utilized weaponized PuTTY for many years, ZINC has only recently expanded their capabilities to include weaponizing a fork of PuTTY called KiTTY. The executable first collects the username and hostname of the victim system. It then sends that information to a hardcoded IP 172[.]93[.]201[.]253 over TCP/22, which does not use SSH protocol and does not require SSH handshake to establish communication. Upon successful TCP connection to the server at 137[.]184[.]15[.]189, the malicious KiTTY executable then deploys the malware as %AppData%\\mscoree.dll following multiple rounds of decoding. The mscoree.dll file is the embedded payload, detected as EventHorizon, in the ZetaNile malware family. Similar to ZINC’s version of PuTTY, the actor uses DLL search order hijacking to load malicious DLL files that perform tasks within the context of these legitimate Windows processes, specifically through %AppData%KiTTY%PresentationHost.exe -EmbeddingObject.The mscoree.dll malware is modularized in such a way that, upon successful connection to the compromised C2 domain, the attackers can install additional malware on the target system as needed using the existing C2 communication, such as executing C:\\ProgramData\\Cisco\\fixmapi.exe -s AudioEndpointBuilder to load malicious mapistub.dll from the compromised C2 server. The HTTP POST requests contain the hardcoded user agent string with misspelled “Edge”, as detailed below, and contain a unique ID for the field gametype and the hardcoded value for the field type for malware campaign tracking purposes:Beginning in September 2022, ZINC was observed utilizing a trojanized TightVNC Viewer that was delivered to a target alongside a weaponized SSH utility over WhatsApp. This malware has a unique PDBPath:The weaponized versions of TightVNC Viewer often were delivered as compressed ZIP archives or job description-themed ISO files via online platforms such as WhatsApp. Within that archive, the recipient is provided a ReadMe.txt and an executable file to run. The .txt file has the following content:As part of the threat actor’s latest malware technique to evade traditional defenses, the malicious TightVNC Viewer has a pre-populated list of remote hosts, and it’s configured to install the backdoor only when the user selects ec2-aet-tech.w-ada[.]amazonaws from the drop-down menu in the TightVNC Viewer, as shown in Figure 5:The malware was configured to send the username and hostname to IP 44[.]238[.]74[.]84 on TCP/22 as part of the victim check-in with the C2 and establish VNC connections to the same IP on port TCP/5900. Once a successful connection is established to the server IP, the embedded second stage DLL payload from TightVNC.exe is loaded in memory to establish C2 communication to a known compromised domain.ZINC has operationalized malicious versions of two PDF readers, Sumatra PDF and muPDF/Subliminal Recording installer, that act as the entry vector for the ZetaNile implant. This delivery mechanism is often utilized in relation to fraudulent job postings delivered to job-seeking targets in the IT and defense sector. The weaponized versions were often delivered as compressed ZIP archives. Within that archive, the recipient is provided with an executable file to run. While the malicious Sumatra PDF reader is a fully functional PDF reader that can load the malicious implant from a fake PDF, the muPDF/Subliminal Recording installer can set up the backdoor without loading any malicious PDF files.The trojanized version of Sumatra PDF Reader named SecurePDF.exe has been utilized by ZINC since at least 2019 and remains a unique ZINC tradecraft. SecurePDF.exe is a modularized loader that can install the ZetaNile implant by loading a weaponized job application themed file with a .PDF extension. The fake PDF contains a header “SPV005”, a decryption key, encrypted second stage implant payload, and encrypted decoy PDF, which is rendered in the Sumatra PDF Reader when the file is opened.Once loaded in memory, the second stage malware is configured to send the victim’s system hostname and device information using custom encoding algorithms to a C2 communication server as part of the C2 check-in process. The attackers can install additional malware onto the compromised devices using the C2 communication as needed.Within the trojanized version of muPDF/Subliminal Recording installer, setup.exe is configured to check if the file path ISSetupPrerequisites\\Setup64.exe exists and write C:\\colrctl\\colorui.dll on disk after extracting the embedded executable inside setup.exe. It then copies C:\\Windows\\System32\\ColorCpl.exe to C:\\ColorCtrl\\ColorCpl.exe. For the second stage malware, the malicious installer creates a new process C:\\colorctrl\\colorcpl.exe C3A9B30B6A313F289297C9A36730DB6D, and the argument C3A9B30B6A313F289297C9A36730DB6D gets passed on to colorui.dll as a decryption key. The DLL colorui.dll, which Microsoft is tracking as the EventHorizon malware family, is injected into C:\\Windows\\System\\credwiz.exe or iexpress.exe to send C2 HTTP requests as part of the victim check-in process and to get an additional payload.Microsoft will continue to monitor ZINC activity and implement protections for our customers. The current detections and IOCs in place across our security products are detailed below.The techniques used by the actor and described in the “Observed actor activity” section can be mitigated by adopting the security considerations provided below:The below list provides IOCs observed during our investigation. We encourage our customers to investigate these indicators in their environments and implement detections and protections to identify past related activity and prevent future attacks against their systems.NOTE: These indicators should not be considered exhaustive for this observed activity.Microsoft Sentinel customers can use the following queries to look for the related malicious indicators in their environments.Identify ZINC IP/domain/hash IOCThis query identifies a match across various data feeds for IP/Domain IOCs related to the Zinc actor as shared in this blog post.Identify ZINC filename/command line IOCTo locate possible Zinc Filename/command line activity shared in the blog Microsoft Sentinel customers can use the queries below:Identify ZINC AV hits IOCThis query looks for Microsoft Defender AV detections related to Zinc actor as shared in the blog post:To locate related activity, Microsoft 365 Defender customers can run the following advanced hunting queries:Suspicious mapistub.dll file creationLook for PresentationHost.exe creating mapistub.dll, likely for use in DLL search order hijacking attacks.Suspicious mscoree.dll file creationLook instances of mscoree.dll created by PuTTY processes. Suspicious colorcpl.exe image loadSurface instances of the colorcpl.exe process loading colorui.dll not in an expected path, indicative of a DLL search order hijacking attack. \n\t\t\tMicrosoft has observed ongoing activity from mobile banking trojan campaigns targeting users in India with social media messages and malicious applications designed to impersonate legitimate organizations and steal users’ information for financial fraud scams. \t\t\n\t\t\tMicrosoft has been tracking activity related to the financially motivated threat actor Octo Tempest, whose evolving campaigns represent a growing concern for many organizations across multiple industries.\t\t\n\t\t\t Since early October 2023, Microsoft has observed North Korean nation-state threat actors Diamond Sleet and Onyx Sleet exploiting the Jet Brains TeamCity CVE-2023-42793 remote-code execution vulnerability. Given supply chain attacks carried out by these threat actors in the past, Microsoft assesses that this activity poses a particularly high risk to organizations who are affected.\t\t\n\t\t\tMicrosoft Threat Intelligence has identified highly targeted social engineering attacks using credential theft phishing lures sent as Microsoft Teams chats by the threat actor that Microsoft tracks as Midnight Blizzard (previously tracked as NOBELIUM). \t\tMicrosoft is a leader in cybersecurity, and we embrace our responsibility to make the world a safer place."
   },
   {
      "time": "2022-09-30",
      "title": "Finnish intelligence warns Russia ‘highly likely’ to turn to cyber in winter",
      "text": " The head of the Finnish Security Intelligence Service (Suojelupoliisi or SUPO) says it is “highly likely that Russia will turn to the cyber environment over the winter” for espionage due to challenges impacting its human intelligence work.The agency acknowledged that there are still some active intelligence officers working inside the country, but said the Finnish government “has probably severed the connection to their Russian networks, at least for the time being, and little information is available through the usual channels.”The report warns that the Russian security and intelligence services have not abandoned human intelligence and were “increasingly targeting foreigners who reside in or visit Russia” as well as Russians working in the West when they return. SUPO assessed that Russian citizens who occupied critical positions in Finland were particularly at risk of coercion from the Russian authorities.\"The threat of corporate espionage by Russia is also increasing as sanctions necessitate the launch of high-technology manufacturing to replace imports from the West. This places a particular premium on data security in Finnish businesses,\" the public intelligence assessment stated.Finland, which had historically declared itself to be a non-aligned country – in part due to troubled relations with Russia, with whom it shares a 830-mile border – applied to join NATO this year following the invasion of Ukraine.SUPO said that NATO membership would make Finland “a more interesting target for Russian intelligence and influence operations” particularly in regards to its military policy.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-30",
      "title": "New Royal Ransomware emerges in multi-million dollar attacks",
      "text": " A ransomware operation named Royal is quickly ramping up, targeting corporations with ransom demands ranging from $250,000 to over $2 million. Royal is an operation that launched in January 2022 and consists of a group of vetted and experienced ransomware actors from previous operations.Unlike most active ransomware operations, Royal does not operate as a Ransomware-as-a-Service but is instead a private group without affiliates.However, since the middle of September 2022, the ransomware gang has rebranded again to 'Royal' and is using that name in ransom notes generated by a new encryptor.The Royal operation has been operating in the shadows, not using a data leak site and keeping news of their attacks quiet.In conversations with Kremez and a victim, BleepingComputer has created a better picture of how the gang operates.These phishing emails contain phone numbers that the victim can contact to cancel the alleged subscription, but, in reality, it is a number to a service hired by the threat actors.When a victim calls the number, the threat actors use social engineering to convince the victim to install remote access software, which is used to gain initial access to the corporate network.A Royal victim who spoke to BleepingComputer shared that the threat actors breached their network using a vulnerability in their custom web application, showing the threat actors are also being creative in how they gain access to a network.Once they gain access to a network, they perform the same activities commonly used by other human-operated ransomware operations. They deploy Cobalt Strike for persistence, harvest credentials, spread laterally through the Windows domain, steal data, and ultimately encrypt devices.When encrypting files, the Royal encryptor will append the .royal extension to the file names of encrypted files. For example, test.jpg would be encrypted and renamed to test.jpg.royal, as shown below.A Royal victim also told BleepingComputer that they target virtual machines by directly encrypting their virtual disk files (VMDK). The threat actors then print out the ransom notes on network printers or create them on encrypted Windows devices.These ransom notes are named README.TXT and contain a link to the victim's private Tor negotiation page at royal2xthig3ou5hd7zsliqagy6yygk2cdelaxtni2fyad6dpmpxedid.onion. XXX in the ransom note below has been redacted but is unique to the victim.The Tor negotiation site is nothing special, simply containing a chat screen where a victim can communicate with the Royal ransomware operators.As part of these negotiations, the ransomware gang will provide the ransom demand, with ransom demands between $250,000 and over $2 million.The ransomware gang will also commonly decrypt a few files for the victims to prove their decryptor works and share file lists of the stolen data.BleepingComputer is unaware of successful payments and has not seen a decryptor for this ransomware family.While the group claims to steal data for double-extortion attacks, it does not appear that a data leak site has been launched under the Royal brand as of yet.However, it is strongly advised that network, windows, and security admins keep an eye out for this group, as they are quickly ramping up operations and will likely become one of the more significant enterprise-targeting ransomware operations.Update 8/29/22: Article updated with some corrections, including launch date and callback phishing example."
   },
   {
      "time": "2022-09-30",
      "title": "Brazilian Prilex Hackers Resurfaced With Sophisticated Point-of-Sale Malware",
      "text": " A Brazilian threat actor known as Prilex has resurfaced after a year-long operational hiatus with an advanced and complex malware to steal money by means of fraudulent transactions.The cybercrime group emerged on the scene with ATM-focused malware attacks in the South American nation, providing it the ability to break into ATM machines to perform jackpotting – a type of attack aiming to dispense cash illegitimately – and clone thousands of credit cards to steal funds from the targeted bank's customers.Infecting a computer with PoS software installed is a highly-targeted attack incorporating a social engineering element that allows the threat actor to deploy the malware.\"A target business may receive a call from a 'technician' who insists that the company needs to update its PoS software,\" the researchers noted. \"The fake technician may visit the target in person or request the victims to install AnyDesk and provide remote access for the 'technician' to install the malware.\"The latest installments spotted in 2022, however, exhibit one crucial difference in that the replay attacks have been substituted with an alternative technique to illicitly cash out funds using cryptograms generated by the victim card during the in-store payment process.The method, called GHOST transactions, includes a stealer component that grabs all communications between the PoS software and the PIN pad used for reading the card during the transaction with the goal of obtaining the card information.This is subsequently transmitted to a command-and-control (C2) server, permitting the threat actor to make transactions through a fraudulent PoS device registered in the name of a fake company.While previous versions of Prilex circumvented these security measures by monitoring the ongoing transaction to get the cryptogram and conduct a replay attack using the collected \"signature,\" the GHOST attack requests for new EMV cryptograms that are put to use to complete the rogue transactions.Also baked into the malware is a backdoor module that's engineered to debug the PoS software behavior and make changes on the fly. Other backdoor commands authorize it to terminate processes, start and stop screen captures, download arbitrary files from the C2 server, and execute commands using CMD.Prilex is \"dealing directly with the PIN pad hardware protocol instead of using higher level APIs, doing real-time patching in target software, hooking operating system libraries, messing with replies, communications and ports, and switching from a replay-based attack to generate cryptograms for its GHOST transactions even from credit cards protected with CHIP and PIN technology,\" the researchers said.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-09-30",
      "title": "Swachh City Platform Suffers Data Breach Leaking 16 Million User Records",
      "text": " A threat actor by the name of LeakBase has shared a database containing personal information allegedly affecting 16 million users of Swachh City, an Indian complaint redressal platform.The cybersecurity firm said that the breach possibly leveraged compromised credentials belonging to administrator and non-administrator accounts, likely obtained by means of a brute-force attack.An analysis of the dataset also showed that the latest login was observed on May 20, 2022, indicating that the threat actor performed the exfiltration activity on that date.Users of the service are recommended to implement a strong password policy, rotate passwords, and enable two-factor authentication.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-09-30",
      "title": "Hackers Aid Protests Against Iranian Government with Proxies, Leaks and Hacks",
      "text": " The company said it has also witnessed sharing of proxies and open VPN servers to get around censorship and reports on the internet status in the country, with one group helping the anti-government demonstrators access social media sites.Chief among them is a Telegram channel called Official Atlas Intelligence Group (AIG) that's primarily focused on publishing data associated with government officials as well as maps of prominent locations.Calling itself the \"CyberArmy,\" the group is said to have commenced its operations in May and has also advertised a wide range of services in the past, such as data leaks, DDoS attacks, and remote access to organizations. It's also known to voluntarily hunt and dox pedophiles.RedBlue™, a 4,000-member group on Telegram, has also pitched in with similar efforts, in addition to sharing hacking conversations and guides.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-09-30",
      "title": "A technical analysis of Pegasus for Android – Part 2 – CYBER GEEKS",
      "text": " \r\n\t\t\t\tAll Things Infosec\r\n\t\t\tSummaryTechnical analysisSHA256: ade8bef0ac29fa363fc9afd958af0074478aef650adeb0318517b48bd996d5d5Communication Methods1. HTTP CommunicationThe agent constructs the following URL that contains the C2 server, which can be extracted from the initial configuration or a command sent via SMS:The malware adds “SessionId1” and “SessionId2” to the HTTP headers:Figure 3 reveals the following values:The implementation of the AES algorithm is displayed in the figure below.The template of the HTTP request is displayed in figure 5:The HTTP response should be an XML file containing at least the following fields: “response”, “code”, and “message”. The application parses the XML response by overriding the startElement, endElement, and characters methods:The implementation of the overriding functions is shown below:2. SMS/MMS/WAPAs in the case of the iOS version, the package can receive commands in SMS messages that are disguised as Google authentication codes. It searches for “your google verification code” in the message and extracts the index of the “s=” parameter:The malware computes the MD5 hash of the Token + SMS[0, index+2), which is truncated to 8 bytes and compares it with SMS[index+2, final] in order to verify the authenticity of the command:The command structure is “text:[6 digits][Command number]a=[Ack ID]&[Command Arguments]&s=<Message Signature>” and the following regular expression is used to parse it: “.*[:]\\d{6}(\\d)[\\n]?(.*)”.The following function is utilized to extract the fields from the command and to add it to a commands queue:The agent verifies if the phone is Roaming via a function call to isNetworkRoaming:If the  device is Roaming and the “romingSetted” config value is disabled (0), the application can’t accept commands via HTTP, SMS, and MQTT:The commands received via SMS will be described in the following paragraphs (numbers in range 0-8).Command 0The first command is “KILL” and can be used to perform self deletion on the phone:The process sets the intent action to “KILL”, retrieves a PendingIntent that will perform a broadcast, and schedules an alarm, as displayed below.The application creates a HandlerThread that will perform the necessary operations:Command 1This command is used to send a “Ping” message via SMS or HTTP. Depending on the value received in the parameters (“0” or “1”), the spyware chooses between the two communication channels:The Ack ID received in the command and a counter value will be part of the SMS message that is sent:The process logs the phone number to send messages to, the Ack ID, and the counter. It computes the time after the last network communication with C2 in seconds:In the case of HTTP communication, the agent creates a Handler object and calls the postDelayed function with a delay of 5 seconds:The malware creates an XmlSerializer object that will be encrypted using the AES algorithm and then sent to a C2 server via HTTP. Finally, it checks if the data was successfully sent:Command 2In this case, the process tries to compute the index of “&” in the arguments. The resulting two values will be used to modify the “adrate” and “adlocation” configuration options: For example, if the “adrate” value is set to 0 then the malware stops the location monitoring functionality. However, if the “adlocation” value is 0 or “adrate” < “adlocation” then the malware starts the functionality:When stopping the location monitoring functionality, the process  sets the intent action to “finishLocationMonitor” and calls the cancel method:The getSystemService function is utilized to retrieve a handle to the location service. The agent receives data about the location from the network and passive providers (see figure 29).Command 3The process configures the following config options: Command 4The application obtains the index of “&” in the arguments and creates two values representing the camera snapshot number and time, as shown in figure 31.The snapshot source type and the phone camera resolution are logged using the Log.i method:Command 5In this case, the malware specifies a file or a directory listing to be exfiltrated. This information can be transmitted in the “f=” and “p=” parameters:The process changes permissions to 777 for the targeted file using the “superuser binary”. It verifies the existence of the file by calling the File.exists method and expects a non-empty file:The application creates a directory called “/data/data/com.network.android/chnkr/” using the File.mkdirs function. The targeted file is copied to the newly created folder, and the malware broadcasts the “new_chunker_file_event” intent to all BroadcastReceivers in order to exfiltrate data:Command 6This command prepares the phone to accept an audio surveillance call that will be detailed in the “Live Audio Surveillance” section.Command 7The package enables the call recording functionality by setting the “window canada” config value to true:Command 8The agent extracts the configured C2 servers and sends a request to one of them in order to ask for new commands, as shown in the figure below.It sets the intent action to “httpPing”, the intent data to “PING: <Current time in milliseconds>”, retrieves a PendingIntent that will perform a broadcast, and schedules an alarm:Outbound SMSThe malware logs the message “MO sendSmsMO Ping SMS MO Start to number: ” + WindowTargetSms, which is the phone number used in the outbound communication:The agent extracts the following information: the current location of the device, the numeric name (MCC+MNC) of the registered operator, the GSM cell ID, the GSM location area code, the IMEI and IMSI of the device (see figure 43).The application obtains the unique subscriber ID that is validated based on its length:SmsManager.getDefault is utilized to retrieve the SmsManager. The process creates two Intents with the “SMS_SENT” and “SMS_DELIVERED” parameters and then broadcasts them via a call to getBroadcast. Finally, the SMS containing the information extracted above is sent using sentTextMessage:The getResultCode method is used to verify if the message was successfully sent. If that’s not the case, the SMS is re-sent in 1 minute:The application logs the number of times it re-sent the SMS using the Log.i method:Live Audio SurveillanceThe threat actor can enable this functionality only when multiple conditions are met at the same time. The functionality can be activated when the phone receives a call from the attacker’s number, and it will allow capturing the audio via the device’s microphone.The first condition to be met is that the phone’s screen is OFF, which is verified using a variable that should be false. The malware verifies if the screen is ON or OFF by calling the isScreenOn method. The configuration option called “Skypi” should be not null:The process makes sure that the user didn’t cancel the previous live surveillance operation, as displayed in the figure below.The phone should be in the idle state, and the phone’s screen should be locked. The inKeyguardRestrictedInputMode function is used to verify the last condition:The configuration option called “forwarding” indicates whether call forwarding is enabled on the phone. This feature should be disabled for the functionality to work:The agent extracts the value of the “STAY_ON_WHILE_PLUGGED_IN” constant. It expects the device to stay off even if it’s charging:The microphone should not be in use for the functionality to work:isWiredHeadsetOn is utilized to confirm that a wired headset is not connected to the phone:isBluetoothA2dpOn is utilized to confirm that a Bluetooth A2DP audio peripheral is not connected to the phone:The spyware doesn’t expect communications to use Bluetooth SCO at the time of the audio surveillance. It calls the isBluetoothScoOn method for this purpose:The music should not be active during the time of the operation, as highlighted below:The final condition that must be met is that either the phone is not Roaming or the functionality was configured by the TA to be performed even if the device is Roaming:Now we’ll describe the functionality after all of the above conditions are met.Audio recordingThe application creates a MediaRecorder object that can be used to record audio and video:The agent sets the audio mode to 2 (MODE_IN_CALL – a call is established), calls the setStreamSolo function with a True parameter, sets the audio source to be used depending on the phone’s build model, sets the format of the output file to 2 (MPEG4 media file format), and sets the audio encoder to 1 (AMR_NB – narrowband audio codec):The directory “/data/data/com.network.android/network_cache/” is created by the spyware:The output file is “/data/data/com.network.android/network_cache/cache1.dat<Integer>”, and the recording is started by calling the prepare and start functions:The audio files can be exfiltrated by incorporating them into XML files, as displayed in the figure below.Phone CallsThe following columns can be extracted from the Call logs: “number”, “type”, “date”, “duration”, “_id”, and “logtype” (see figure 72).The agent implements a different functionality for calls coming from these two numbers: “*762646466” and “*7626464633”. If the phone receives a call from the first number/second number, then the “romingSetted” configuration option is set to true/false. This option controls how the phone communicates with the C2 server (via SMS, HTTP, MQTT) when it’s Roaming:KeyloggingAs we’ve already seen, the spyware logs relevant messages regarding the activities performed:The malware expects to find the “superuser binary” called “/system/csk” on the device:The files containing the keystrokes will be stored in the “/data/local/tmp/ktmu” folder. The content of these files will be exfiltrated using XmlSerializer objects with specific tags:The application tries to identify the process ID of the keyboard process:It extracts the process ID for the input method service that is currently selected from the “default_input_method” value. The getRunningAppProcesses function is utilized to obtain a list of running processes on the phone, and then the spyware extracts the process ID and name of the keyboard process:The libk binary found in the “/res/raw” directory is copied to a new file called “/data/local/tmp/libuml.so”. The shared object is injected (using the addk binary) in the keyboard process identified above and will be responsible for the keylogging activity:The captured keystrokes will be stored in a file called “/data/local/tmp/ktmu/ulmndd.tmp”, as shown in figure 83.The agent stores the bitwise NOT of every keystroke in the file using the fwrite instruction:The temporary file storing the captured keystrokes is renamed as “/data/local/tmp/ktmu/finidk.<current timestamp>”. The current timestamp is obtained using the time syscall:Great content."
   }
]