[
   {
      "time": "2022-07-28",
      "title": "CERT-UA",
      "text": " "
   },
   {
      "time": "2022-07-28",
      "title": "Nuki Smart Lock Vulnerabilities Allow Hackers to Open Doors - SecurityWeek",
      "text": " Hi, what are you looking for?Security researchers with NCC Group have documented 11 vulnerabilities impacting Nuki smart lock products, including issues that could allow attackers to open doors.Nuki offers smart lock products – Nuki Smart Lock and Nuki Bridge – that allow users to unlock their doors with their smartphones by simply walking in range.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-28",
      "title": "Kansas MSP shuts down cloud services to fend off cyberattack",
      "text": " A US managed service provider NetStandard suffered a cyberattack causing the company to shut down its MyAppsAnywhere cloud services, consisting of hosted Dynamics GP, Exchange, Sharepoint, and CRM services.\"As of approximately 11:30 AM CDT July 26, NetStandard identified signs of a cybersecurity attack within the MyAppsAnywhere environment. Our team of engineers has been engaged on an active incident bridge ever since working to isolate the threat and minimize impact.MyAppsAnywhere services, which include Hosted GP, Hosted CRM, Hosted Exchange, and Hosted Sharepoint, will be offline until further notice.No other services from NetStandard have been impacted at this time.\" - NetStandard.The company says that they have engaged their insurance provider to help identify the source of the attack and bring systems back online.While the company says that only the MyAppsAnywhere services are affected, the attack appears to have had a broader impact, with the company's main site shut down as well.The company has been hosting hourly Zoom calls to update customers about the outages, with BleepingComputer told that the company is now engaged with a third-party cybersecurity firm provided by their insurance carrier.As NetStandard is sharing no further details, it is unclear what type of attack has occurred. However, security researchers believe this is likely a ransomware attack, as we commonly see with cyberattacks like the one on NetStandard.In what may be a coincidence, Huntress Lab's CEO Kyle Hanslovan tweeted a screenshot yesterday of a threat actor's looking for partners to conduct an attack on a managed service provider.According to the post on the Russian-speaking Exploit hacking forum, the threat actor claims to have access to an MSP panel managing over 50 companies, 100 VMware ESXi servers, and 1000+ servers.In the forum post, the threat actor is looking for suggestions from other hackers on how to monetize their access.\"In terms of preparation, there were little things left, so my percentage of profit will definitely be high. For details and suggestions - in private messages,\" reads the translated forum post.While it is unclear if this forum post is linked to the attack on NetStandard, it would not be far-fetched for a ransomware member to have contacted the threat actor to partner with them.MSPs are a high-value target for ransomware gangs as they offer an easy way to encrypt numerous companies at once through a single breach, allowing numerous extortion opportunities for the threat actors. Furthermore, if many companies are encrypted, it may force the MSP to pay a ransom to protect the data and recover the files of their clients.BleepingComputer has reached out to NetStandard with questions about the attack but has not received a reply at this time."
   },
   {
      "time": "2022-07-28",
      "title": "House Intel Chairman vows to put 'greater emphasis' on fighting spyware | CyberScoop",
      "text": " \n\nJuly 27, 2022\n\nThe powerful chairman of the House Intelligence Committee said Wednesday that he will fight foreign commercial surveillance with greater urgency, calling the technology a national security risk and universal threat to individual privacy.Rep. Adam Schiff, D-Calif., said he is alarmed by the proliferation of powerful spyware that “can be used against every member of this committee or in the executive branch, every journalist and political activist, every American citizen, every citizen of the world with an electronic device.”Members from both parties appeared disturbed by the fact that American companies and investment funds support spyware vendors. Schiff said the U.S. must do more to counter the “robust market for powerful spying tools that are sold on the open market, essentially offering sophisticated signals intelligence capabilities as an end-to-end service.”Schiff said spyware poses a serious threat to national security and suggested the extent of the technology’s proliferation may be much larger than is realized. Pointing to a December revelation that spyware had been found on the phones of 11 American officials working in Uganda, Schiff cautioned that he believes “we are very likely looking at the tip of the iceberg.”Google alone tracks more than 30 spyware vendors worldwide and there may be hundreds of government customers working with those vendors, said John Scott-Railton, a researcher at the University of Toronto’s Citizen Lab, which has conducted extensive research on the spyware market and focused much of its work on an Israeli company called NSO Group that sells Pegasus surveillance  technology. Scott-Railton told Schiff and his committee that not enough has been done to date and urged them to act more quickly and decisively moving forward. “It has taken us too long to have this conversation … and now we must make sure it moves at the pace of proliferation.”“The availability of these tools in the hands of governments who previously lacked robust surveillance capabilities was truly a game changer for the US national security … [and] for autocratic regimes that are looking for new means to surveil, intimidate, imprison or even kill dissidents, journalists and others they view as a threat.”More can be done to stop American companies and investors from supporting spyware vendors, Scott-Railton told the committee. He said the majority owner of Pegasus vendor NSO Group is the Oregon Public Employees Retirement System. The Alaska Permanent Fund, which was established in 1976 to invest a portion of the state’s oil revenue for future generations, is also an investor in the Israeli spyware vendor, he said.“This trend should be concerning to the United States and all citizens,” Huntley said. “These vendors are enabling the proliferation of dangerous hacking tools, arming nation state actors that would not otherwise be able to develop these capabilities in-house.”He urged the committee to act, saying it is time for government, industry and civil society to “come together to change the incentive structure which has allowed these technologies to spread in secret.”Huntley warned that we don’t yet even understand the scope of the threat. In addition to grappling with that problem, Huntley said the U.S. should also consider ways to foster greater transparency in the marketplace, including by “setting heightened transparency requirements for the domestic surveillance industry … and by reviewing and disclosing its own historical use of these tools.”The U.S. must consider a full ban on federal procurement of commercial spyware technologies and contemplate imposing further sanctions to limit spyware vendors’ ability to operate in the U.S. and receive U.S. investment, Huntley said.“The harms from this industry are amply evident by this point, and we believe they outweigh any benefit to continued use,” Huntley said.Attacks targeting law firms, banks and strategic consultancies in countries such as Austria, the U.K. and Panama were detected as part of Microsoft’s KNOTWEED investigation. The company has since issued a software update to address the problem.Schiff suggested more action will be coming from the committee, saying he believes the U.S. needs to put a “greater emphasis on this” and “respond to this threat with urgency.”Several committee members from both parties expressed similar concerns, a development that highlights the rapidly evolving understanding of the threat and its magnitude.“There’s little that you can do currently to protect yourself,” Schiff said. “The availability of these tools in the hands of governments who previously lacked robust surveillance capabilities was truly a game changer for the US national security … [and] for autocratic regimes that are looking for new means to surveil, intimidate, imprison or even kill dissidents, journalists and others they view as a threat.”"
   },
   {
      "time": "2022-07-28",
      "title": "How DDoSecrets built the go-to home for Russian leaks",
      "text": " American investigative reporter Emma Best knows how arduous it is to ask for information from government agencies. She made more than 5,000 such requests during her career at MuckRock, a non-profit ​​news site that publishes original government documents and conducts investigations based on them. Best was so persistent that the FBI temporarily banned her from filing any more information requests.She found a way to cut through the government bureaucracy. Together with an anonymous partner known as The Architect, Best founded the whistleblower site Distributed Denial of Secrets (DDoSecrets) in 2018. Since then, it has distributed hacked and leaked data from more than 200 entities, including U.S. law enforcement agencies, fascist groups, shell companies, tax havens, and the far-right social media sites Gab and Parler. Unlike cybercriminals who sell hacked data on the darknet for personal gain, DDoSecrets says it exposes leaked information for the public good. “Secrets can be used for extortion by threatening to make it public, while public information can't,” Best said.Her website has become a go-to place for whistleblowers and hackers, especially given the absence of its most famous predecessor, WikiLeaks, which has been inactive for the last two years.The system reviewed and reported publications critical of Russian President Vladimir Putin and state officials, as well as those supporting LGBTQ+ rights, cannabis legalization and the opposition movement.The Roskomnadzor leak is one of 58 Russian data dumps published on the DDoSecrets website. Over 12 million Russian documents have been leaked to the organization since the start of the war in Ukraine, with more information under embargo, Best told The Record.DDoSecrets has received leaks from Ukraine as well, Best told The Record, “but they've all been identified as likely tied to state-sponsored entities or as active parts of psyops, such as Free Civilian.”Because of their ties to an invading nation, and the lack of a clear and immediate public interest, the organization has decided not to publish them.Among the most active hacktivist groups leaking Russian data is Anonymous, which declared \"cyber war\" on President Vladimir Putin in retaliation for the invasion of Ukraine. Other groups, including the Ukrainian Cyber Alliance and CyberHunta, have been sending Russian leaks to DDoSecrets for years, Best said.It is hard to judge how impactful these leaks are given that Russian citizens don’t have access to them, and one of the few Russian-language media outlets that writes about leaked data, Meduza, has been declared a \"foreign agent\" and banned from the country for \"spreading fakes.”Hackers who steal information from their victims' computers don't have many options for how to use it: they can threaten organizations with a data leak, demanding ransom; bury data on the dark web, in the hopes that someone will buy it; or leak it to journalists or platforms like WikiLeaks and DDoSecrets.DDoSecrets gets most of its materials from private dataset collectors, leakers and hacktivists. It reviews the data and then decides whether it should be published based on the “public interest.” Its members aren’t engaged in hacking.The distribution of some of the information is intentionally limited, according to Best, and only provided to qualified researchers and journalists “because some element of it is sensitive or we feel the risk of abuse outweighs the benefits of making it public,” Best said.Among DDoSecrets’ databases that are not available to the public are 70GB of user data from the platform Gab and an alleged copy of the Hunter Biden laptop. DDoSecrets doesn’t ask for money for any datasets. In fact, until very recently the team worked entirely on a volunteer basis, according to Best. Now its funding comes from individual donors and a handful of grants. According to the open finances platform Open Collective, DDoSecrets has an estimated annual budget of about $24,000; from August 2020 to July this year, it raised a total of $32,489 through the platform.Hackers usually contact DDoSecrets using various secure messengers like Cwtch and Signal or PGP email encryption. The organization uses Tor Onion Services to ensure the anonymity of its users, and reduce legal difficulties. “What went wrong, went wrong early on,” Best said. “The people that remained learned to successfully frame any criticism, no matter how constructive the intent, or any plea for improvement as an attack by outsiders and hostile forces.” “I'd like them to have [a goal ] that is honest and divorced from the destiny of one man,” Best said, referring to WikiLeaks founder Julian Assange, who is now in a British jail awaiting possible extradition to the U.S. to face an array of charges under the Espionage Act. “Clearly they're facing technical challenges I don't understand, or there's just a lot they don't care about,” Best said. “Their silence continues to raise questions and not inspire confidence.”Perhaps more than ever, hacktivists are hungry for a reliable place to forward hacked information, with leaks from Russia flowing at a constant rate since the start of the war in Ukraine. DDoSecrets has been happy to fill the void, and has plenty of material to work with.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-28",
      "title": "New ‘Robin Banks’ phishing service targets BofA, Citi, and Wells Fargo",
      "text": " A new phishing as a service (PhaaS) platform named 'Robin Banks' has been launched, offering ready-made phishing kits targeting the customers of well-known banks and online services.The targeted entities include Citibank, Bank of America, Capital One, Wells Fargo, PNC, U.S. Bank, Lloyds Bank, the Commonwealth Bank in Australia, and Santander.Additionally, Robin Banks offers templates to steal Microsoft, Google, Netflix, and T-Mobile accounts.Robin Banks is the new project of a cybercrime group believed to be active since at least March 2022, created for quickly crafting high-quality phishing pages to target customers of large financial organizations.It is sold in two price tiers, one offering single pages and 24/7 support for $50 per month, and another is giving unlimited access to all templates and 24/7 support for $200 per month.Upon registration, threat actors receive a personal dashboard containing reports about their operations, easy page creation, wallet management, and options to create custom phishing sites.The platform also gives users options like adding reCAPTCHA to thwart bots or checking user agent strings to block specific victims from highly-targeted campaigns.\"The Robin Banks website has a more sophisticated yet user-friendly webGUI than 16Shop and BulletProftLink — two well-known phishing kits that are also notably more expensive than Robin Banks as well,\" comments IronNet in the report.Also, the new PhaaS platform is constantly adding new templates and updating the old ones to reflect the targeted entities' style and color scheme changes.These advantages have made Robin Banks popular in the cybercrime space, and many cybercriminals have adopted it in the past couple of months.In one campaign spotted by IronNet last month, an operator of Robin Banks targeted customers of Citibank via SMS that warned them about \"unusual usage\" of their debit card.The provided link to lift the alleged security limitations takes victims to a phishing page where they are requested to enter their personal details.Upon landing on the phishing site, the victim’s browser is fingerprinted to determine if they’re on desktop or mobile, and the appropriate web page version is loaded.Once the victim enters all the required details on the form fields of the phishing site, a POST request is sent to the Robin Banks API, containing two unique tokens, one for the campaign operator and one for the victim.The phishing site sends one POST request for each web page the victim fills out, which works as a fail-safe to steal as many details as possible since the phishing process may stop at any time due to suspicion or other reasons.All data sent to the Robin Banks API is viewable from the platform’s webGUI for both the operator and the platform administrators.Robin Banks also gives the option to forward stolen details to the operator’s personal Telegram channel for convenience.The emergence of a new high-quality PhaaS platform isn't favorable for internet users, as it promotes phishing to low-skill cybercriminals and augments the bombardment of tricky messages.To keep yourself safe from these malicious attempts, never click on links sent via SMS or email, and always confirm the website you've landed on is the official one.Finally, enable 2FA on all your accounts and use a private phone number to receive the one-time passwords."
   },
   {
      "time": "2022-07-28",
      "title": "Microsoft Catches Austrian Company Exploiting Windows, Adobe Zero-Days - SecurityWeek",
      "text": " Hi, what are you looking for?Malware hunters at Microsoft have caught an Austrian hack-for-hire company exploiting zero-day flaws in Windows and Adobe software products in “limited and targeted attacks” against European and Central American computer users.ByFlipboardRedditWhatsappWhatsappEmail“As part of our investigation into the utility of this malware, Microsoft’s communications with a Subzero victim revealed that they had not commissioned any red teaming or penetration testing, and confirmed that it was unauthorized, malicious activity. Observed victims to date include law firms, banks, and strategic consultancies in countries such as Austria, the United Kingdom, and Panama. \n\nIt’s important to note that the identification of targets in a country doesn’t necessarily mean that a DSIRF customer resides in the same country, as international targeting is common.\n\nMSTIC has found multiple links between DSIRF and the exploits and malware used in these attacks. These include command-and-control infrastructure used by the malware directly linking to DSIRF, a DSIRF-associated GitHub account being used in one attack, a code signing certificate issued to DSIRF being used to sign an exploit, and other open-source news reports attributing Subzero to DSIRF.”\n\nIt’s important to note that the identification of targets in a country doesn’t necessarily mean that a DSIRF customer resides in the same country, as international targeting is common.\n\nMSTIC has found multiple links between DSIRF and the exploits and malware used in these attacks. These include command-and-control infrastructure used by the malware directly linking to DSIRF, a DSIRF-associated GitHub account being used in one attack, a code signing certificate issued to DSIRF being used to sign an exploit, and other open-source news reports attributing Subzero to DSIRF.”\nIt’s important to note that the identification of targets in a country doesn’t necessarily mean that a DSIRF customer resides in the same country, as international targeting is common.\n\nMSTIC has found multiple links between DSIRF and the exploits and malware used in these attacks. These include command-and-control infrastructure used by the malware directly linking to DSIRF, a DSIRF-associated GitHub account being used in one attack, a code signing certificate issued to DSIRF being used to sign an exploit, and other open-source news reports attributing Subzero to DSIRF.”\n\nMSTIC has found multiple links between DSIRF and the exploits and malware used in these attacks. These include command-and-control infrastructure used by the malware directly linking to DSIRF, a DSIRF-associated GitHub account being used in one attack, a code signing certificate issued to DSIRF being used to sign an exploit, and other open-source news reports attributing Subzero to DSIRF.”\nMSTIC has found multiple links between DSIRF and the exploits and malware used in these attacks. These include command-and-control infrastructure used by the malware directly linking to DSIRF, a DSIRF-associated GitHub account being used in one attack, a code signing certificate issued to DSIRF being used to sign an exploit, and other open-source news reports attributing Subzero to DSIRF.”\nRyan Naraine is Editor-at-Large at SecurityWeek and host of the popular Security Conversations podcast series. He is a security community engagement expert who has built programs at major global brands, including Intel Corp., Bishop Fox and GReAT. Ryan is a founding-director of the Security Tinkerers non-profit, an advisor to early-stage entrepreneurs, and a regular speaker at security conferences around the world.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...Zero trust is not a replacement for identity and access management (IAM), but is the extension of IAM principles from people to everyone and...A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...WASHINGTON - Cyberattacks are the most serious threat facing the United States, even more so than terrorism, according to American defense experts. Almost half...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-28",
      "title": "US Offers $10 Million for Information on North Korean Hackers - SecurityWeek",
      "text": " Hi, what are you looking for?The US Department of State has announced that it is offering up to $10 million as a reward for information on individuals associated with notorious North Korean state-sponsored hacking groups.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.WASHINGTON - Cyberattacks are the most serious threat facing the United States, even more so than terrorism, according to American defense experts. Almost half...Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-28",
      "title": "Open-Xchange issues fixes for RCE, SSRF bugs in OX App Suite | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondSecurity release also includes precautionary patches for potential Log4j-like flaw in Logback libraryDiversified technology and infrastructure software provider Open-Xchange has released fixes for several security vulnerabilities impacting OX App Suite.“We provide this update strictly as a precaution to mitigate the possibility of a vulnerability. Exploiting CVE-2021-42550 at this point would require privileged access to alter system configuration.”“In this case, the full impact of a seemingly ‘medium’ issue reported via the bounty program led to a thorough review process and discovery of a potential remote code execution flaw.”Heiland added: “Combining internal reviews with external input makes our program very impactful and helps with continuous learning and challenging of our engineering teams. I have been running the bug bounty program for about six years, and it has been very successful for our web applications.”The vulnerabilities impact OX App Suite versions 7.10.6 and earlier. They have all been fixed by the vendor in various branch updates.“Most users run automated deployment and our own hosted service uses ‘cloud native’ automation/orchestration, which allows very swift updates,” Heiland said. “Of course, we advise updating as soon as possible, regardless of the deployment method.”Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2022-07-28",
      "title": "New Ducktail Infostealer Malware Targeting Facebook Business and Ad Accounts",
      "text": " Facebook business and advertising accounts are at the receiving end of an ongoing campaign dubbed Ducktail designed to seize control as part of a financially driven cybercriminal operation. \"The malware is designed to steal browser cookies and take advantage of authenticated Facebook sessions to steal information from the victim's Facebook account and ultimately hijack any Facebook Business account that the victim has sufficient access to.\"The attacks, attributed to a Vietnamese threat actor, are said to have begun in the latter half of 2021, with primary targets being individuals with managerial, digital marketing, digital media, and human resources roles in companies.The idea is to target employees with high-level access to Facebook Business accounts associated with their organizations, tricking them into downloading supposed Facebook advertising information hosted on Dropbox, Apple iCloud, and MediaFire.In some cases, the archive file containing the malicious payload is also delivered to victims through LinkedIn, ultimately allowing the attacker to take over any Facebook Business account.An information-stealing malware written in .NET Core, the binary is engineered to use Telegram for command-and-control and data exfiltration. WithSecure said it identified eight Telegram channels that were used for this purpose.It works by scanning for installed browsers such as Google Chrome, Microsoft Edge, Brave Browser, and Mozilla Firefox to extract all the stored cookies and access tokens, alongside stealing information from the victim's personal Facebook account such as name, email address, date of birth, and user ID.While users with Admin roles have full control over the Facebook Business account, users with Finance editor permissions can edit business credit card information and financial details like transactions, invoices, account spend, and payment methods.Telemetry data gathered by WithSecure shows a global targeting pattern spanning a number of countries, including the Philippines, India, Saudi Arabia, Italy, Germany, Sweden, and Finland.That said, the company noted it was \"unable to determine the success, or lack thereof\" of the Ducktail campaign, adding it couldn't establish how many users have potentially been affected by the spear-phishing operation.The findings are yet another indicator of how bad actors are increasingly banking on legitimate messaging apps like Discord and Telegram, abusing their automation features to propagate malware or meet their operational goals.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]