[
   {
      "time": "2022-10-12",
      "title": "VMware vCenter Server bug disclosed last year still not patched",
      "text": " VMware informed customers today that vCenter Server 8.0 (the latest version) is still waiting for a patch to address a high-severity privilege escalation vulnerability disclosed in November 2021.This security flaw (CVE-2021-22048) was found by CrowdStrike's Yaron Zinar and Sagi Sheinfeld in vCenter Server's IWA (Integrated Windows Authentication) mechanism, and it also affects VMware's Cloud Foundation hybrid cloud platform deployments.Attackers with non-administrative access can exploit it to elevate privileges to a higher privileged group on unpatched servers.Even though patches are pending for all affected products, VMware provides a workaround allowing admins to remove the attack vector.\"Active Directory over LDAP authentication is not impacted by this vulnerability. However, VMware strongly recommend that customers plan to move to another authentication method,\" the company explains.\"Active Directory over LDAPs does not understand domain trusts, so customers that switch to this method will have to configure a unique identity source for each of their trusted domains. Identity Provider Federation for AD FS does not have this restriction.\""
   },
   {
      "time": "2022-10-12",
      "title": "Android leaks some traffic even when 'Always-on VPN' is enabled",
      "text": " Mullvad VPN has discovered that Android leaks traffic every time the device connects to a WiFi network, even if the \"Block connections without VPN,\" or \"Always-on VPN,\" features is enabled.The data being leaked outside VPN tunnels includes source IP addresses, DNS lookups, HTTPS traffic, and likely also NTP traffic.Mullvad discovered the issue during a security audit that hasn't been published yet, issuing a warning yesterday to raise awareness on the matter and apply additional pressure on Google.VPNs (virtual private networks) are protected network connections that encrypt internet traffic over public networks. When connected to a VPN, all your Internet connections will use the IP address of your VPN service rather than your public IP address.This allows users to bypass censorship and throttling, and maintain privacy and anonymity while browsing the web, as the remote hosts will never see your actual IP address.Android offers a setting under \"Network & Internet\" to block network connections unless you're using a VPN. This feature is designed to prevent accidental leaks of the user's actual IP address if the VPN connection is interrupted or drops suddenly.Unfortunately, this feature is undercut by the need to accommodate special cases like identifying captive portals (like hotel WiFi) that must be checked before the user can log in or when using split-tunnel features.This is why Android is configured to leak some data upon connecting to a new WiFi network, regardless of whether you enabled the \"Block connections without VPN\" setting.Mullvad reported the issue to Google, requesting the addition of an option to disable connectivity checks. \"This option should be added as the current VPN lockdown behavior is to leaks connectivity check traffic (see this issue for incorrect documentation) which is not expected and might impact user privacy.\"Mullvad countered these points and highlighted the significant benefits of adding the option, even if not all issues will be addressed, and the case remains open.The traffic that is leaked outside the VPN connection contains metadata that could be used to derive sensitive de-anonymization information, such as WiFi access point locations.“Even if the content of the message does not reveal anything more than \"some Android device connected\", the metadata (which includes the source IP) can be used to derive further information, especially if combined with data such as WiFi access point locations.”While this isn't easy for unsophisticated threat actors, people who use VPNs to protect themselves from persistent attackers would still find the risk significant.Mullvad is still debating the significance of the data leak with Google, calling them to introduce the ability to disable connectivity checks and minimize liability points.Notably, GrapheneOS, Android-based privacy and security-focused operating system that can run on a limited number of smartphone models, provides this option with the intended functionality."
   },
   {
      "time": "2022-10-12",
      "title": "DeepFakes Are The Cybercriminal Economy’s Latest Business Line",
      "text": " Introduced by Canadian researchers to the public in 2014, Generative Adversarial Networks (GANs), typically imitate people’s faces, speech, and unique facial gestures, they have become known to online communities as DeepFakes.One of the recently identified underground services – “RealDeepFake”, readily available through Telegram groups. For a small fee, the service allows actors to create a deepfake instance with their selected character which they then apply a voice over from a chosen script, they can also include effects and text. The service leverages technologies such as VoiceR and Lipsing to change the voice so it sounds like the chosen character.Examples of these DeepFakes include the impersonation of celebrities such as Elon Musk, Snoop Dog, Donald Trump, and The Rock. The scammers are also using DeepFakes to credibly impersonate C-Suite executives in video chats or phone calls to issue fraudulent wire transfer instructions to their colleagues and personnel.The accelerating rise of deepfake BEC and Phishing Frauds targeting the Web3 community comes amidst the backdrop of Federal Trade Commission reports that American consumers have lost over $1 billion in crypto because of scams since the start of 2021. The experts highlight deepfakes will be likely used by bad actors to provide misleading information about cryptocurrency, as well as Initial Coin Offerings (ICOs), using profiles of celebrities.Resecurity expects to see more hybrid attacks that combine convincing email and social media blasts, fraudulent mints, and expertly rendered deepfakes of high-profile Web3 influencers to deceive both everyday consumers and crypto professionals alike.[adrotate banner=”5″][adrotate banner=”13″]\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2022-10-12",
      "title": "Ukrainian cybersecurity officer killed by Russian missile strike",
      "text": " Yuriy Zaskoka headed the critical infrastructure protection department of the Kyiv National Police. He was driving to work in his car when Russia fired missiles into the center of Ukraine’s capital Kyiv, killing 6 people and injuring 50.Footage from the scene showed burnt-out cars and flames on a normally busy street in central Kyiv. Over a dozen explosions were heard across the city Monday morning, in what were the first large missile strikes in Kyiv since June.The SSSCIP also lost four employees in Monday’s missile strikes who worked with the telecommunications industry and critical infrastructure in the eastern Luhansk and Dnipro regions, which were also heavily attacked by Russia. “Each of you is important, and each loss is painful,” said SSSCIP.Russia fired a total of 84 missiles and launched 24 drone strikes at Ukraine on October 10, damaging 200 sites, including critical infrastructure facilities, residential buildings, schools, cultural institutions, and healthcare facilities. At least 20 people died and 108 were injured as a result of the attack.Russia continued to attack Ukraine on Tuesday, targeting thermal plants and energy facilities. Many Ukrainian cities have been left without electricity.In Kyiv, local energy companies will be switching off electricity in the city every day for 4 hours while they are restoring the destroyed infrastructure.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-12",
      "title": "All Windows versions can now block admin brute-force attacks",
      "text": " Microsoft announced today that IT admins can now configure any Windows system still receiving security updates to automatically block brute force attacks targeting local administrator accounts via a group policy.Microsoft added this policy as they say Windows does not currently apply Account Lockout policies to \"local administrators,\" allowing threat actors to repeatedly brute force passwords for these accounts.\"However, Windows devices currently do not allow local administrators to be locked out.\" - Microsoft.As a result, Windows 11 systems where the policy is toggled on automatically lock user accounts (including Administrator accounts) for 10 minutes after 10 failed sign-in attempts within 10 minutes.\"This technique is very commonly used in Human Operated Ransomware and other attacks - this control will make brute forcing much harder which is awesome!\"Today, almost three months after Weston's announcement, Microsoft revealed that the same account lockout policy is now available on any Windows system where the October 2022 cumulative updates are installed.\"Beginning with the October 11, 2022 or later Windows cumulative updates, a local policy will be available to enable local administrator account lockouts.\"Admins who want to toggle on this additional defense against brute force attacks can find the \"Allow Administrator account lockout\" policy under Local Computer Policy\\Computer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Account Lockout Policies.This group policy will be enabled by default on all new machines running Windows 11 22H2 or those where the October 2022 Windows cumulative updates were installed before the initial setup when the Security Account Manager (SAM) database that stores the users' passwords is first instantiated on the new machine.Microsoft also announced today that it now requires local administrator accounts to use complex passwords that \"must have at least three of the four basic character types (lower case, upper case, numbers, and symbols).\"This decision was taken as an extra defense against brute force attacks which are trivial to pull off using systems with modern CPUs and GPUs if the passwords are not long or complex enough.Update October 12, 10:24 EDT: Made it clearer that Microsoft says Windows didn’t apply lockout policies to “local administrators” before this change. "
   },
   {
      "time": "2022-10-12",
      "title": "Microsoft October 2022 Patch Tuesday fixes zero-day used in attacks, 84 flaws",
      "text": " Today is Microsoft's October 2022 Patch Tuesday, and with it comes fixes for an actively exploited Windows vulnerability and a total of 84 flaws.Thirteen of the 84 vulnerabilities fixed in today's update are classified as 'Critical' as they allow privilege elevation, spoofing, or remote code execution, one of the most severe types of vulnerabilities.The number of bugs in each vulnerability category is listed below:The above counts do not include twelve vulnerabilities fixed in Microsoft Edge on October 3rd.This month's Patch Tuesday fixes two publicly zero-day vulnerabilities, one actively exploited in attacks and one publicly disclosed.Microsoft classifies a vulnerability as a zero-day if it is publicly disclosed or actively exploited with no official fix available.\"An attacker who successfully exploited this vulnerability could gain SYSTEM privileges,\" reads Microsoft's advisory.The exploited vulnerability is listed as discovered by an 'Anonymous' researcher.Microsoft says attackers could use this vulnerability to gain access to users' authentication tokens.These vulnerabilities were disclosed in late September by Vietnamese cybersecurity outfit GTSC, who first spotted and reported the attacks.The vulnerabilities were disclosed to Microsoft through Trend Micro's Zero Day Initiative and were expected to be fixed today.However, today's Microsoft Exchange security bulletin states that the fixes are not ready.Other vendors who released updates in October 2022 include:"
   },
   {
      "time": "2022-10-12",
      "title": "\r\n\tA New Wave of PayPal Invoice Scams Using Crypto Disguise - Infosecurity Magazine\r\n",
      "text": " Reporter, Infosecurity MagazineWhile the scammers use a very common method, impersonating PayPal sellers to send random target invoices via PayPal systems saying users have been charged an amount of money and pushing them to click on malicious links, they use the names of famous companies/tokens on different blockchains to do so.The Japanese vendor also provides some tips to protect yourself against these scams better:"
   },
   {
      "time": "2022-10-12",
      "title": "Internet disruptions, cyberattacks hit Ukraine following Russian missile strikes",
      "text": " Internet and mobile communications in Ukraine were disrupted Monday and Tuesday after Russian missile strikes caused widespread power outages.Mobile communication was disrupted or partially disappeared in some regions, according to Ukrainian state officials.Local authorities asked Ukrainians to limit the use of mobile communications and electricity, as much of the country’s telecommunication infrastructure and energy facilities were damaged following the missile attacks on Ukrainian cities.Russia fired a total of 84 missiles and 24 drones at Ukraine on Monday, damaging critical infrastructure sites, residential buildings, schools, cultural institutions, and healthcare facilities. The Ukrainian energy sector is one of the most vulnerable to Russian attacks, both digital and physical. Even before the full-scale invasion, Ukraine had been anticipating large-scale Russian cyberattacks on its energy systems, which has yet to occur. The missile strikes, however, accomplished similar goals.Following the missile strikes, pro-Russia hackers launched distributed denial-of-service (DDoS) attacks against the Ukrainian mobile bank Monobank, sending 6 million requests per minute.So far, no hacking group has claimed responsibility for the attack.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-12",
      "title": "Coverage of Killnet DDoS attacks plays into attackers\\' hands, experts say",
      "text": " A notorious pro-Russian hacking group drew headlines on Monday after launching distributed denial-of-service (DDoS) attacks on the websites of airports in at least 24 different states and threatening more operations against U.S. entities. Researchers at cybersecurity firm Radware said they tracked brief outages on Chicago's air travel website, flychicago.com, as well as the sites for Los Angeles International Airport (LAX), Hartsfield-Jackson Atlanta International Airport (ATL), and Phoenix Sky Harbor Airport (PHX). Several other website outages were reported later on Monday thanks to the DDoS attacks, which flooded the seldom-used sites with junk traffic.Despite the scope of the attack, cybersecurity experts said the media coverage was disproportionate to the actual damage done.In its Telegram channel on Monday, the group’s leaders boasted of being featured on CNN and other outlets. The goal of the attacks is not necessarily any damage to the websites, McPherson told The Record, but to sow panic and erode a sense of trust that those responsible for ensuring protection can do so adequately.“This is in addition to the positive notoriety which a successful attack will have on the attacker's reputation,” said McPherson, a senior vice president of security operations at ReliaQuest. “These events differ from other general attacks, as their intent is not theft of intellectual property or cyber espionage – it’s to be purely disruptive, and at times used as an extortion method or distraction from a separate attack which has yet to be revealed.” The DDoS incidents on Monday involved the websites of airports in Alabama, Arizona, Arkansas, California, Colorado, Connecticut, Delaware, Florida, Georgia, Hawaii, Idaho, Illinois, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Missouri and more. Nozomi Networks senior director Gary Kinghorn said the DDoS attacks were not particularly damaging or long lasting and noted that most of the major airports appeared to be responding normally to new connection requests without delay as of early to mid-morning on Monday. DDoS attacks, he explained, are not targeted attacks that exploit a specific vulnerability, but generally just overwhelm a site’s ability to respond with an enormous amount of traffic from a large number of distributed clients. Kinghorn said the attacks used against the airports on Monday appeared to be what is called a “SYN flood” – where there are a large number of connection requests that never complete and exhaust the target website's resources on incomplete connections that delay response to legitimate users.“It’s hard to defend against DDoS attacks because every website that is open to all users can be overwhelmed with a traffic spike of valid connection requests until you can identify and filter out a range of IP sources or expand capacity or bandwidth for the target site,” he said. But several experts noted that there was no operational impact on the airports themselves – only minor, brief outages on the airport websites, which typically carry basic information like maps, as well as security line wait times. Critical Insight president Michael Hamilton called the attacks “essentially an annoyance” that was conducted by “reasonably unsophisticated actors.”“However, the Russian volunteers are not without skilled cyber actors and it may only be a question of time before more sophisticated attacks are leveled at infrastructure,” he said. CISA at the time warned that similar attacks were on the horizon and provided a list of the tactics Killnet operators typically use. Sergey Shykevich, threat intelligence group manager at Check Point Software, told The Record that Killnet likes to focus on the most prominent websites of the federal government, “but specifically on those websites where significant downtime cannot be ignored, but on the other hand not protected enough.”“Even though Killnet didn’t use sophisticated capabilities, their DDoS attacks last week on US government and transportation sectors were quite successful,” he said. “We shouldn’t be surprised if we see more from Killnet this week.”On its Telegram channel on Tuesday, Killnet members turned their attention to DDoS attacks on JP Morgan and several related entities. They also urged members to launch attacks against U.S. civilian network infrastructure like marine terminals and logistics facilities, weather monitoring centers, public transportation systems and more. KillMilk, the alleged founder of the group, also suggested they may be planning further attacks involving more serious techniques, including wiper attacks, which are designed to destroy data. “The United States brags about its cyber training, but what it really looks like and how much experience it has in cyber warfare — you will see soon through our actions,” the group’s leader boasted. “We learned and broke Europe for eight months while the United States prepared to confront us. We are just beginning to cause disruption in America's cyberspace.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-12",
      "title": "\r\n\tGoogle Unifies Recent Acquisitions Under New Cloud Security Offering - Infosecurity Magazine\r\n",
      "text": " Editor, Infosecurity MagazineGoogle’s Cloud Next division unveiled the cloud-born software suite on October 11, 2022, which it said can “better enable cybersecurity teams to detect, investigate, and respond to threats with the speed, scale, and intelligence of Google.”Google purchased Israeli security startup Siemplify in early 2022 for $500m and closed its $5.4bn acquisition of Mandiant in September.Moving forward, all security operations software will come under the Chronicle brand, Google said.Chronicle Security Operations \"unifies Chronicle's security information and event management (SIEM) tech, with the security orchestration, automation, and response (SOAR) solutions from our Siemplify acquisition and threat intelligence from Google Cloud.\"The Mandiant acquisition will add more incident and exposure management and threat intelligence capabilities in the future, according to Google.The Siemplify brand will be replaced with Chronicle SOAR, and security analytics capabilities of the suite will be named Chronicle SIEM. Google says the “feel and look” of the SIEM and SOAR capabilities will be unified to deliver an integrated user experience.Chronicle Security Operations will leverage Google Cloud’s data."
   }
]