[
   {
      "time": "2022-12-07",
      "title": "Calisto show interests into entities involved in Ukraine war support",
      "text": " Whoops! You have to login to access the Reading Center functionalities!\nUsername or Email Address\n\n\nPassword\n\n Remember Me\n\n\nCalisto (aka Callisto, COLDRIVER) is suspected to be a Russian-nexus intrusion set active since at least April 2017. Although it was not publicly attributed to any Russian intelligence service, past Calisto operations showed objectives and victimology that align closely with Russian strategic  interests.While Security Service of Ukraine (SBU) publicly associated Calisto with Gamaredon Group, an intrusion set attributed to the Russian Federal Security Service (FSB) that focuses essentially on Ukraine operations since the beginning of the Russian invasion in February 2022, this link is not supported by other security companies or researchers. SEKOIA.IO conducted further technical investigations but did not ﬁnd any overlap between Calisto and Gamaredon activities.Based on SEKOIA.IO EvilNgix trackers, we came across domains, known to us as aligning with past Calisto activities. Further investigations led to a larger infrastructure composed of more than 80 domains, including domains typosquatting entites.In past observed campaigns, Calisto operators sent malicious PDF attachments to their victims. The ﬁrst page of the PDF mimics an error in the PDF renderer engine, inciting the victim to open a link leading to a malicious web page. This webpage aims at gathering the victim’s credentials by using EvilGinx. Here are a few examples of PDF retrieved in this investigation:The last pages of the documents contain blobs of spirals and text, as shown below. SEKOIA.IO analysts still don’t know why such gibberish is used as it appears useless as an anti-detection trick. However, the idea to put the phishing link in a PDF instead of in the email body prevents link analysis from email gateways and is a good tactic to remain undetected from an attacker point of view.SEKOIA.IO conducted open-source research on the typosquatted domains, to identify targets. As we redact this paper, we found six private companies based in the US and Eastern Europe, and four Non-governmental organizations (NGOs), all involved in Ukraine support. SEKOIA.IO contacted the NGOs to get the phishing email or payload.One of them shared the email exchange between the  victim and the attacker using aspoofed email from a “trusted source”, including the malicious PDF payload, a technique previously observed in Calisto campaigns. The email exchange shows that the attacker did not include the malicious payload in the ﬁrst email, but waited to get an answer to build a relationship and avoid suspicion before sending the payload to the victim. That Calisto social engineering technique was already observed by Microsoft.Most of the targeted private organizations are involved in military equipment, military logistics or humanitarian support for Ukraine, including a US company that provides humanitarian logistics and possibly tactical equipment to Kiev. Other sectors include communication technologies and cybersecurity (medium conﬁdence) :Additional potential victims include NGOs and think tanks involved in conﬂict resolution and war crime investigation, including an organization also involved in the Syrian civil war crime  investigation and previously targeted by an Indian hack-for-hire company in June 2020. Most of the NGOs and think tanks targeted are publicly supporting Ukraine.SEKOIA.IO notes that the observed victimology through the investigation matches known Calisto victimology, namely strategic research, civil society and military equipment sectors, as well as entities and individuals involved in Russian matters.Among discovered Calisto malicious domains, three caught SEKOIA.IO analysts’ attention, mvd-redir[.]ru and dns-mvd[.]ru (high conﬁdence) that are highly likely typosquatting the Russian Ministry of Interior, and lk-nalog-gov[.]ru (low conﬁdence) the Russian Federal Taxation Service. Based on the fact that Calisto was observed targeting Russian individuals abroad, SEKOIA.IO assess it is plausible that Calisto conducts domestic surveillance as well. Another less plausible hypothesis would be a false-ﬂag maneuver to raise doubts on the infrastructure’s attribution.Despite the absence of technical evidence associating Calisto activities with a known Russian cyber offensive service, Sekoia.io assess that this intrusion set intelligence collection activities targeting parties involved in Ukraine support, especially those in the tactical equipment logistics, probably contribute to Russian efforts to disrupt Kiev supply-chain for military reinforcements.Based on the targeting of Commission for International Justice and Accountability NGO, Sekoia.io assess that Calisto contributes to Russian intelligence collection about identiﬁed war crime-related evidence and/or international justice procedures, likely to anticipate and build counter narrative on future accusations.External references :[1] https://www.ac21.co.uk/, accessed December 5, 2024Thanks for the reading ! You can also read our articles on:Discover our:Since May 20221,2, Sekoia.io indicators can be integrated into Microsoft Sentinel. In this blogpost, we will cover how to...This blogpost aims at contextualising and analysing trends pertaining to cyber malicious activities associated to the Democratic People’s Republic...This article aims at presenting SEKOIA.IO RisePro information stealer analysis."
   },
   {
      "time": "2022-12-07",
      "title": "Blue Callisto orbits around US Laboratories in 2022\r\n",
      "text": " More Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedGlobal Consumer Insights Pulse Survey - June 2023Achieving net zero infrastructureManufacturing COO Pulse Survey Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedUkraine: Tax, Legal and People considerationsPwC Global Internal Audit Study 2023M&A industry trends report  Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedThe Leadership AgendaPwC’s Global Workforce Hopes and Fears Survey 2023strategy+business — a PwC publication Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedThe New EquationPwC's Global Annual ReviewCommitting to Net Zero by 2030 Menu Menu MenuFeaturedThe New EquationPwC's Global Annual ReviewLoading ResultsNo Match FoundIn this blog post we detail 2022 phishing activity the PwC threat intelligence team attributes to Blue Callisto and list indicators for defenders to query. The activity ranges from February 2022 to October 2022. Some of the domains resolve to IPs which we assess are likely operated by Blue Callisto to service fake webpages and gather credentials as of 24th October 2022.The deobfuscated code contains multiple client side checks, shown in Figure 3, to determine whether the request should be redirected or not. We assess it is likely the threat actor is using this code to identify automated scanners and antivirus technologies, and block them from the final phishing URL. The code queries several browser constants, such as:If the code does not identify any problems with the request the script will redirect to the following URL:hxxps[:]//hypertextteches[.]com/patrified.phpThe phishing page contains an email address that we assess is likely used by Blue Callisto for testing. The page statically sets the email address value to tr333lopex as shown in Figure 5.Blue Callisto often inputs emails of interest statically into form input fields. In one of these instances, we observed phishing activity spoofing US National Laboratories in July 2022. Specifically, on 12th June 2022 we observed the domain registration goo-ink[.]online, which resolved to 89.147.108[.]182 from 25th July 2022 (which we assess is phishing infrastructure used by Blue Callisto). The goo-ink[.]online domain contained a Brookhaven National Laboratory phishing page, statically setting a Brookhaven Lab email in the input form field as shown in Figure 6. The email address of interest observed on the phishing page is linked to non-proliferation and accountability initiatives for nuclear materials in Russia and elsewhere. During this phishing activity we also observed interest by Blue Callisto in Lawrence Livermore National Laboratory based on URLs we observed on goo-ink[.]online.Despite limited observations of broad activity, Blue Callisto is highly likely to remain active. In October 2022, we observed the threat actor is interested in an organisation which investigates war crimes; motives that would broadly align with a Russia-based threat group’s collection objectives. The threat actor’s tools, techniques and procedures (TTPs) contained slight shifts during 2022, such as network provider preferences and use of phishing technologies such as Evilginx. However, the threat actor continues to use some TTPs observed as far back as 2019 and continues to enjoy success from its phishing activity using legacy tradecraft.Phishing: Spearphishing Link - https://attack.mitre.org/techniques/T1566/002/Command andScripting Interpreter: JavaScript - https://attack.mitre.org/techniques/T1059/007/Deobfuscate/Decode Files or Information - https://attack.mitre.org/techniques/T1140/System Information Discovery - https://attack.mitre.org/techniques/T1082/[4] CTO-TIB-20200820-01A - Callisto targets UK Government and Universities[5] CTO-TIB-20220511-01A - Tracking Callisto infrastructure[6] JSFuck, JSFuck, http://www.jsfuck.com/Your request / feedback has been routed to the appropriate person. Should you need to reference this in the future we have assigned it the reference number \"refID\" .Thank you for your comments / suggestions.\r\n\t\t\t\tRequired fields are marked with an asterisk(*)\r\n\t\t\t\r\n\t\t\t   Please correct the errors and send your information again.\r\n\t\t\t\nTick this box to verify you are not a robot\nGlobal Threat Intelligence Lead, Director, PwC United StatesGlobal Threat Intelligence Lead, Director, PwC AustraliaTel: +44 (0)7718 979 308Global Threat Intelligence Lead, Director, PwC United KingdomGlobal Threat Intelligence Lead Partner, PwC United KingdomTel: +44 (0)7725 707360Cyber Threat Intelligence Manager, PwC United KingdomTel: +44 7730 598416"
   },
   {
      "time": "2022-12-07",
      "title": "Samsung Galaxy S22 hacked twice on first day of Pwn2Own Toronto",
      "text": " Contestants have hacked the Samsung Galaxy S22 smartphone twice during the first day of the Pwn2Own Toronto 2022 hacking competition, the 10th edition of the consumer-focused event.\"For the second and subsequent rounds on each target, all other winners will receive 50% of the prize package, however, they will still earn the full Master of Pwn points.\"According to the contest's rules, in both cases, the Galaxy S22 devices ran the latest version of the Android operating system with all available updates installed.During this first day of the competition, contestants have also successfully demoed exploits targeting zero-day bugs in printers and routers from multiple vendors, including Canon, Mikrotik, NETGEAR, TP-Link, Lexmark, Synology, and HP.In all, ZDI awarded $400,000 today for 26 unique and successfully demonstrated zero-day vulnerabilities.They can win the highest rewards in the mobile phone category, with cash prizes of up to $200,000 for hacking Google Pixel 6 and Apple iPhone 13 smartphones.Hacking Google and Apple devices also can provide $50,000 bonuses if the exploits execute with kernel-level privilege, bringing the maximum award for a single challenge to a total of $250,000 for a full exploit chain with kernel-level access.Pwn2Own Toronto's consumer-focused event has been extended to four days (between December 6th and December 8th) after 26 teams and contestants have registered to exploit 66 targets across all categories.On the second day of the competition, the Samsung Galaxy S22 will once again be put to the test by hackers at vulnerability research firm Interrupt Labs."
   },
   {
      "time": "2022-12-07",
      "title": "Amnesty International Canada breached by suspected Chinese hackers",
      "text": " Amnesty International's Canadian branch has disclosed a security breach detected in early October and linked to a threat group likely sponsored by China.The international human rights non-governmental organization (NGO) says it first detected the breach on October 5, when it spotted suspicious activity on its IT infrastructure. After detecting the attack, the NGO hired the services of cybersecurity firm Secureworks to investigate the attack and secure its systems.\"Forensic experts with leading international cyber-security firm Secureworks later established that 'a threat group sponsored or tasked by the Chinese state' was likely behind the attack.\"The attack was linked to a suspected Chinese threat group based on the attackers' tactics, techniques, and procedures (TTPs) and the information they targeted, all consistent with Chinese state hackers' known behavior and tools.We are speaking publicly about the attack to caution other human rights defenders on the rising threat of digital security breaches. We strongly condemn state and non-state actors intent on interfering with the work of human rights and other civil society organizations.Secureworks' investigation is yet to unearth evidence showing whether the attackers exfiltrated donor or membership data.The NGO reported the security breach to relevant law enforcement authorities and notified staff, donors, and other stakeholders about the incident.\"This case of cyberespionage speaks to the increasingly dangerous context which activists, journalists, and civil society alike must navigate today,\" Secretary General of Amnesty International Canada Ketty Nivyabandi said.\"Our work to investigate and denounce these acts has never been more critical and relevant. We will continue to shine a light on human rights violations wherever they occur and to denounce the use of digital surveillance by governments to stifle human rights.\""
   },
   {
      "time": "2022-12-07",
      "title": "Kali Linux 2022.4 adds 6 new tools, Azure images, and desktop updates",
      "text": " Offensive Security has released ​Kali Linux 2022.4, the fourth and final version of 2022, with new Azure and QEMU images, six new tools, and improved desktop experiences.Kali Linux is a distribution designed for ethical hackers to perform penetration testing, security audits, and cybersecurity research against networks.With this release, the Kali Linux Team introduces a variety of new features, including:It's never a new Kali Linux release without new tools to play with.Below are the six new tools added in Kali 2022.4:This release brings numerous desktop updates, including GNOME 43 with a new GTK3 theme, shown below.KDE Plasma has also been updated to version 5.26, with tweaks to various widgets.Kali Nethunter Pro has been officially released, with images available for PinePhone and PinePhonePro.\"The launch of Kali NetHunter Pro is the beginning of a new chapter for Kali Linux and NetHunter, a bare metal installation of Kali Linux with Phosh desktop environment, optimized for mobile devices.\"In addition to NetHunter Pro officially being released, Kali Nethunter has also received improvements.With this release, NetHunter now has internal Bluetooth support, improved Wardriving, audio support for Kex, and fixes for crashes on Android 11 and Android 12.For those updating from a previous version, you can use the following commands to upgrade to the latest version.If you are running Kali on the Windows Subsystem for Linux, make sure to upgrade to WSL2 for a better experience, including support for graphical apps.You can check the WSL version Kali uses with the 'wsl -l -v' command in a Windows command prompt.Once you are done upgrading, you can check if the upgrade was successful by using the following command:"
   },
   {
      "time": "2022-12-07",
      "title": "Suspects arrested for hacking US networks to steal employee data",
      "text": " Four men suspected of hacking into US networks to steal employee data for identity theft and the filing of fraudulent US tax returns have been arrested in London, UK, and Malmo, Sweden, at the request of the U.S. law enforcement authorities.The suspects identified in four recently unsealed U.S. indictments are Akinola Taylor (Nigeria), Olayemi Adafin (United Kingdom), Olakunle Oyebanjo (Nigeria), and Kazeem Olanrewaju Runsewe (Nigeria).The four men are accused of transnational wire fraud and identity theft for filing false tax claims with the United States Internal Revenue Service (IRS) to steal money from the agency through tax refunds.To do this, Taylor and Runsewe breached the servers of U.S. companies and stole personally identifiable information (PII) of U.S. residents.To gain access to these servers, the Department of Justice says the suspects purchased stolen credentials from cybercrime marketplaces, such as the now-shut-down xDedic marketplace.The xDedic marketplace operated between 2014 and 2019 when an International law enforcement operation eventually took it down. The platform had a backdoor verification mechanism that guaranteed the validity of the access sales.The DOJ claims Taylor and Runsewe used the acquired information to fill out fraudulent Form 1040 claims to the IRS, using valid U.S. resident PII but including bank accounts under their control for receiving the funds.Adafin and Oyebanjo allegedly assisted the scammers in the money laundering stage, transferring the proceeds to other conspirators and through a complex network of debit cards and bank accounts, hoping to obscure the trace.An investigation led by the IRS-CI Cyber Crimes Unit and the FBI uncovered the real identities of the four individuals, who will now face extradition proceedings.If convicted of wire fraud, the four individuals face a maximum sentence of up to twenty years in federal prison, not considering additional penalties for identity theft and theft of public money.Also, if found guilty, the four men will have to forfeit all assets linked to the proceeds of the identified offenses."
   },
   {
      "time": "2022-12-07",
      "title": "Russian Actors Use Compromised Healthcare Networks Against Ukrainian Orgs",
      "text": " Russia-affiliated threat actors have compromised systems belonging to multiple organizations in the US, the UK, France, and other countries and are using them to launch attacks against targets in Ukraine.Among those whose networks the threat actors have hijacked are at least 15 healthcare organizations, one Fortune 500 company, and one dam-monitoring system, according to a study by threat intelligence and cyber-deception company Lupovis published Dec. 6.\"Russian criminals are rerouting through their networks to launch cyberattacks on Ukrainian [organizations], which effectively means they are using these organizations to carry out their dirty work,\" Lupovis warned in its report.The company designed the decoys in a manner as to entice Russian actors looking to compromise Ukrainian targets. For instance, Lupovis labeled decoy documents with names related to Ukrainian government officials and the country's Critical National Infrastructure, and its decoy websites spoofed Ukrainian government and political sites. The decoy documents contained information that adversaries would consider useful, such as usernames, passwords, and addresses to purportedly critical assets and databases on the decoy websites. The company deliberately leaked some of these fake documents in key Dark Web forums.Lupovis managed to attract three types of adversaries to its decoy sites. One set comprised of opportunistic attackers, or those constantly scanning the Internet for exploitable CVEs and systems. This was a category of threat actor that Lupovis ignored for the purposes of its study. The second category of adversary was comprised of threat actors who landed directly on the decoy sites without following the breadcrumbs that Lupovis had planted on the Dark Web forums. The third set of threat actors were mostly Russia-based adversaries who took the bait, extracted information from the decoy documents, and used it to attack the decoy websites.In all, between 50 and 60 attackers landed on each of the two decoy sites Lupovis has set up — some of them just minutes after the sites went live. Once on the sites, the attackers carried out a variety of malicious activities, including SQL injection attacks, remote file inclusion tactics, and Docker exploitation attempts. In many cases, threat actors on the decoy sites attempted to make them part of bigger DDoS botnets or to use them to launch attacks against other Ukrainian websites.The largest group of attackers were independent actors, says Xavier Bellekens, CEO of Lupovis. They often appeared to be acting alone and were part of communities on Telegram, he says. \"Some actors were more advanced in their techniques, tactics, and procedures. However, we haven’t yet been able to correlate them against known Russian APTs.\" The primary motivations in many of these attacks appeared to be information stealing, disruption, and using the decoy websites to launch attacks against other Ukrainian targets, he notes.One of the most disconcerting aspects that researchers at Lupovis observed was the number of attacks on its decoys from other, previously compromised websites and systems belonging to healthcare organizations and entities in other industry sectors, from multiple countries. Bellekens says Lupovis was unable to identify the specific groups that were carrying out these attacks, or if any of them were previously known Russian advanced persistent threat groups. \"We identified them as Russian if they used scripts containing Cyrillic, tried to access Russian websites, [or] looked for specific information in Cyrillic,\" he says. \"A large number of these adversaries tried to exploit the decoys further to launch attacks against Ukrainian entities.\"Lupovis' findings suggests that fears earlier this year about Russian cyberattacks in Ukraine impacting organizations in other countries were correct. \"Russian cyberattacks have skyrocketed and any country or business that has allied with Ukraine, or opposed the war, has become a target,\" according to the report.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-07",
      "title": "DEV-0139 launches targeted attacks against the cryptocurrency industry | Microsoft Security Blog",
      "text": " April 2023 update – Microsoft Threat Intelligence has shifted to a new threat actor naming taxonomy aligned around the theme of weather. DEV-0139 is now tracked as Citrine Sleet.We are also seeing more complex attacks wherein the threat actor shows great knowledge and preparation, taking steps to gain their target’s trust before deploying payloads. For example, Microsoft recently investigated an attack where the threat actor, tracked as DEV-0139, took advantage of Telegram chat groups to target cryptocurrency investment companies. DEV-0139 joined Telegram groups used to facilitate communication between VIP clients and cryptocurrency exchange platforms and identified their target from among the members. The threat actor posed as representatives of another cryptocurrency investment company, and in October 2022 invited the target to a different chat group and pretended to ask for feedback on the fee structure used by cryptocurrency exchange platforms. The threat actor had a broader knowledge of this specific part of the industry, indicating that they were well prepared and aware of the current challenge the targeted companies may have.After gaining the target’s trust, DEV-0139 then sent a weaponized Excel file with the name OKX Binance & Huobi VIP fee comparision.xls which contained several tables about fee structures among cryptocurrency exchange companies. The data in the document was likely accurate to increase their credibility. This weaponized Excel file initiates the following series of activities:Further investigation through our telemetry led to the discovery of another file that uses the same DLL proxying technique. But instead of a malicious Excel file, it is delivered in an MSI package for a CryptoDashboardV2 application, dated June 2022. This may suggest other related campaigns are also run by the same threat actor, using the same techniques.As with any observed nation state actor activity, Microsoft directly notifies customers that have been targeted or compromised, providing them with the information they need to secure their accounts. Microsoft uses DEV-#### designations as a temporary name given to an unknown, emerging, or a developing cluster of threat activity, allowing Microsoft Threat Intelligence Center (MSTIC) to track it as a unique set of information until we reach a high confidence about the origin or identity of the actor behind the activity. Once it meets the criteria, a DEV is converted to a named actor.To identify the targets, the threat actor sought out members of cryptocurrency investment groups on Telegram. In the specific attack, DEV-0139 got in touch with their target on October 19, 2022 by creating a secondary Telegram group with the name <NameOfTheTargetedCompany> <> OKX Fee Adjustment and inviting three employees. The threat actor created fake profiles using details from employees of the company OKX. The screenshot below shows the real accounts and the malicious ones for two of the users present in the group.It’s worth noting that the threat actor appears to have a broad knowledge of the cryptocurrency industry and the challenges the targeted company may face. The threat actor asked questions about fee structures, which are the fees used by crypto exchange platforms for trading. The fees are a big challenge for investment funds as they represent a cost and must be optimized to minimize impact on margin and profits. Like many other companies in this industry, the largest costs come from fees charged by exchanges. This is a very specific topic that demonstrates how the threat actor was advanced and well prepared before contacting their target.After gaining the trust of the target, the threat actor sent a weaponized Excel document to the target containing further details on the fees to appear legitimate. The threat actor used the fee structure discussion as an opportunity to ask the target to open the weaponized Excel file and fill in their information.The weaponized Excel file, which has the file name OKX Binance & Huobi VIP fee comparision.xls (Sha256: abca3253c003af67113f83df2242a7078d5224870b619489015e4fde060acad0), is well crafted and contains legitimate information about the current fees used by some crypto exchanges. The metadata extracted showed that the file was created by the user Wolf:The macro is obfuscated and abuses UserForm (a feature used to create windows) to store data and variables. In this case, the name of the UserForm is IFUZYDTTOP, and the macro retrieves the information with the following code IFUZYDTTOP.MgQnQVGb.Caption where MgQnQVGb is the name of the label in the UserForm and .caption allows to retrieve the information stored into the UserForm.The table below shows the data retrieved from the UserForm:The macro retrieves some parameters from the UserForm as well as another XLS file stored in base64. The XLS file is dropped into the directory C:\\ProgramData\\Microsoft Media as VSDB688.tmp and runs in invisible mode.Additionally, the main sheet in the Excel file is protected with the password dragon to encourage the target to enable the macros. The sheet is then unprotected after installing and running the other Excel file stored in Base64. This is likely used to trick the user to enable macros and not raise suspicion.The second Excel file, VSDB688.tmp (Sha256: a2d3c41e6812044573a939a51a22d659ec32aea00c26c1a2fdf7466f5c7e1ee9), is used to retrieve a PNG file that is parsed later by the macro to extract two executable files and the encrypted backdoor. Below is the metadata for the second worksheet:The table below shows the deobfuscated data retrieved from the UserForm:The macro retrieves some parameters from the UserForm then downloads a PNG file from hxxps://od.lk/d/d021d412be456a6f78a0052a1f0e3557dcfa14bf25f9d0f1d0d2d7dcdac86c73/Background.png. The file was no longer available at the time of analysis, indicating that the threat actor likely deployed it only for this specific attack.The PNG is then split into three parts and written in three different files: the legitimate file logagent.exe, a malicious version of wsock32.dll, and the XOR encrypted backdoor with the GUID (56762eb9-411c-4842-9530-9922c46ba2da). The three files are used to load the main payload to the target system.Two of the three files extracted from the PNG file, logagent.exe and wsock32.dll, are used to load the XOR encrypted backdoor. The following sections present our in-depth analysis of both files.Logagent.exe (Hash: 8400f2674892cdfff27b0dfe98a2a77673ce5e76b06438ac6110f0d768459942) is a legitimate system application used to log errors from Windows Media Player and send the information for troubleshooting.The file contains the following metadata, but it is not signed:The logagent.exe imports function from the wsock32.dll which is abused by the threat actor to load malicious code into the targeted system. To trigger and run the malicious wsock32.dll, logagent.exe is run with the following arguments previously retrieved by the macro: 56762eb9-411c-4842-9530-9922c46ba2da /shadow. Both arguments are then retrieved by wsock32.dll. The GUID 56762eb9-411c-4842-9530-9922c46ba2da is the filename for the malicious wsock32.dll to load and /shadow is used as an XOR key to decrypt it. Both parameters are needed for the malware to function, potentially hindering isolated analysis.The legitimate wsock32.dll is the Windows Socket API used by applications to handle network connections. In this attack, the threat actor used a malicious version of wsock32.dll to evade detection. The malicious wsock32.dll is loaded by logagent.exe through DLL side-loading and uses DLL proxying to call the legitimate functions from the real wsock32.dll and avoid detection. DLL proxying is a hijacking technique where a malicious DLL sits in between the application calling the exported function and a legitimate DLL that implements that exported function. In this attack, the malicious wsock32.dll acts as a proxy between logagent.exe and the legitimate wsock32.dll.It is possible to notice that the DLL is forwarding the call to the legitimate functions by looking at the import address table:When the malicious wsock32.dll is loaded, it first retrieves the command line, and checks if the file with the GUID as a filename is present in the same directory using the CreateFile API to retrieve a file handle.The malicious wsock32.dll loads and decodes the final implant into the memory with the GUID name which is used to remote access the infected machine.Once the file is loaded into the memory, it gives remote access to the threat actor. At the time of the analysis, we could not retrieve the final payload. However, we identified another variant of this attack and retrieved the payload, which is discussed in the next section. Identified implants were connecting back to the same command-and-control (C2) server.We identified another file using a similar mechanism as logagent.exe and delivering the same payload. The loader is packaged as an MSI package and as posed an application called CryptoDashboardV2 (Hash: e5980e18319027f0c28cd2f581e75e755a0dace72f10748852ba5f63a0c99487). After installing the MSI, it uses a legitimate application called tplink.exe to sideload the malicious DLL called DUser.dll and uses  DLL proxying as well.Once the package is installed, it runs and side-loads the DLL using the following command: C:\\Users\\user\\AppData\\Roaming\\Dashboard_v2\\TPLink.exe” 27E57D84-4310-4825-AB22-743C78B8F3AA /sven, where it noticeably uses a different GUID.Further analysis of the malicious DUser.dll showed that its original name is also HijackingLib.dll, same as the malicious wsock32.dll. This could indicate the usage of the same tool to create these malicious DLL proxies. Below are the file details of DUser.dll:Once the DLL is running, it loads and decodes the implant in the memory and starts beaconing the same domain. In that case, the implant is using the GUID name 27E57D84-4310-4825-AB22-743C78B8F3AA and the XOR key /sven.The payload decoded in the memory by the malicious DLL is an implant used by the threat actor to remotely access the compromised machine. We were able to get the one from the second variant we uncovered. Below are the details of the payload:First, the sample retrieves some information from the targeted system. It can connect back to a remote server and receive commands from it.It is interesting to notice that the threat actor abused OpenDrive in one of the variants to deliver the payload. The OpenDrive account has been set up quickly for a one shot, indicating that it was created for only one target.We identified one domain used as C2 server, strainservice[.]com and connected back to the two implants. This domain was registered on June 26 on Namecheap, just before the distribution of the first variant. At the time of the attack, the server had port 80, 443, and 2083. The implants were communicated on port 443.In this report we analyzed a targeted attack on cryptocurrency investment fund startups. Such companies are relatively new, but manage hundreds of millions of dollars, raising interest by threat actors.   In this attack we identified that the threat actor has broad knowledge of the cryptocurrency industry as well as the challenges their targets may face, increasing the sophistication of the attack and their chance of success. The threat actor used Telegram, an app widely used in the field, to identify the profile of interest, gained the target’s trust by discussing relevant topics, and finally sent a weaponized document that delivered a backdoor through multiple mechanisms. Additionally, the second attack identified was luring a fake crypto dashboard application.The cryptocurrency market remains a field of interest for threat actors. Targeted users are identified through trusted channels to increase the chance of success. While the biggest companies can be targeted, smaller companies can also be targets of interest. The techniques used by the actor covered in this blog can be mitigated by adopting the security considerations provided below:Microsoft Defender Antivirus detects threat components as the following malware:Alerts with the following titles in the security center can indicate threat activity on your network:The following hunting queries locate relevant activity.Query that looks for Office apps that create a file within one of the known bad directories:Query that looks for Office apps that create a file within an uncommon directory (less that five occurrences), makes a set of each machine this is seen on, and each user that has executed it to help look for how many users/hosts are compromised:Query that summarizes child process of Office apps, looking for less than five occurrences:Query that lists of all executables with Microsoft as ProcessVersionInfoCompanyName, groups them together by path, then looks for uncommon paths, with less than five occurrences:Query that searches for connections to malicious domains and IP addresses:Query that searches for files downloaded from malicious domains and IP addresses.Query that searchers for Office apps downloading files from uncommon domains, groups users, filenames, and devices together:Looks for downloaded files with uncommon file extensions, groups remote IPs, URLs, filenames, users, and devices:Looks for Office apps that have child processes that match the GUID command line, with a check for Microsoft binaries to reduce the results before the regex:To supplement this indicator matching customers can use the Advanced Hunting queries listed above against Microsoft 365 Defender data ingested into their workspaces as well as the following Microsoft Sentinel queries:\n\t\t\t Since early October 2023, Microsoft has observed North Korean nation-state threat actors Diamond Sleet and Onyx Sleet exploiting the Jet Brains TeamCity CVE-2023-42793 remote-code execution vulnerability. Given supply chain attacks carried out by these threat actors in the past, Microsoft assesses that this activity poses a particularly high risk to organizations who are affected.\t\t\n\t\t\tAt Microsoft, we’ve been working on the challenges and opportunities of AI for years. Today we’re sharing some recent developments so that the community can be better informed and better equipped for a new world of AI exploration.\t\t\n\t\t\tAt CyberWarCon 2022, Microsoft and LinkedIn analysts presented several sessions detailing analysis across multiple sets of actors and related activity.\t\t\n\t\t\tMicrosoft Defender Experts for Hunting, our newest managed threat hunting service, delivered top-class results during the inaugural MITRE Engenuity ATT&CK® Evaluations for Managed Services. Defender Experts for Hunting provided a seamless, comprehensive, and rapid response to the simulated attack using expert-led threat hunting and an industry-leading platform—Microsoft 365 Defender.\t\tMicrosoft is a leader in cybersecurity, and we embrace our responsibility to make the world a safer place."
   },
   {
      "time": "2022-12-07",
      "title": "Android December 2022 security updates fix 81 vulnerabilities",
      "text": " Google has released the December 2022 security update for Android, fixing four critical-severity vulnerabilities, including a remote code execution flaw exploitable via Bluetooth.This month’s update addresses 45 vulnerabilities in core Android components with patch level 2022-12-01, and another 36 vulnerabilities impacting third-party components addressed in patch level 2022-12-05.The four critical-severity vulnerabilities addressed in this month’s update are:The rest of the fixed vulnerabilities involve elevation of privileges (EoP), remote code execution, information disclosure, and denial of service problems.The high-severity EoP flaws are typically exploited by malware sneaking into a device via a low-privilege pathway, such as installing malicious software masquerading as an innocuous app.That said, applying the available update as soon as it becomes available for your device is crucial, even if none of the flaws are currently reported as actively exploited.If your device no longer receives monthly Android security updates or uses Android 9 or older, you are officially out of support.In these cases, you are advised to upgrade to a newer device or install a custom ROM based on a later Android version, like LineageOS.Owners of Google Pixel devices have also received an important security update this month, which addresses a total of 16 critical-severity flaws in various components.These critical vulnerabilities enable attackers to elevate privileges or information disclosure on the target devices."
   },
   {
      "time": "2022-12-07",
      "title": "Iranian State Hackers Targeting Key Figures in Activism, Journalism, and Politics",
      "text": " Hackers with ties to the Iranian government have been linked to an ongoing social engineering and credential phishing campaign directed against human rights activists, journalists, researchers, academics, diplomats, and politicians working in the Middle East.The campaign resulted in the compromise of email and other sensitive data belonging to three of the targets. This included a correspondent for a major U.S. newspaper, a women's rights defender based in the Gulf region, and Nicholas Noe, a Lebanon-based advocacy consultant for Refugees International.The infection chain commences with the targets receiving suspicious messages on WhatsApp under the pretext of inviting them to a conference and luring the victims into clicking a rogue URL that's specially crafted to impersonate the login pages of Microsoft, Google, and Yahoo!, and capture the entered credentials.15 of the targeted high-profile individuals are confirmed to have received the same WhatsApp messages between September 15 and November 25, 2022, the international non-governmental organization said.The attribution to APT42 is based on overlaps in the source code of the phishing page with that of another spoofed registration page that, in turn, was associated to a credential theft attack mounted by an Iran-nexus actor (aka TAG-56) against an unnamed U.S. think tank.It's worth pointing out that despite APT35 and APT42's links to Iran's Islamic Revolutionary Guard Corps (IRGC), the latter is geared more towards individuals and entities for \"domestic politics, foreign policy, and regime stability purposes,\" per Mandiant.\"In a Middle East region rife with surveillance threats for activists, it's essential for digital security researchers to not only publish and promote findings, but also prioritize the protection of the region's embattled activists, journalists, and civil society leaders,\" Ghattas said.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-07",
      "title": "Massive DDoS attack takes Russia’s second-largest bank VTB offline",
      "text": " Russia's second-largest financial institution VTB Bank says it is facing the worse cyberattack in its history after its website and mobile apps were taken offline due to an ongoing DDoS (distributed denial of service) attack.\"It is not only the largest cyberattack recorded this year, but in the entire history of the bank.\"The bank says its internal analysis indicates the DDoS attack was planned and orchestrated with the specific purpose of causing inconvenience to its customers by disrupting its banking services.At this time, VTB's online portals are offline, but the institute says all core banking services operate normally. Moreover, VTB says customer data are protected as it's stored in the internal perimeter of its infrastructure, which the attackers have not breached.The bank says it has identified that most malicious DDoS requests originate from outside the country. However, there are several Russian IP addresses involved in the attack too.This means that foreign actors either use local proxies for the attacks or have managed to recruit local dissidents in their DDoS campaign.Information about these IP addresses has been relayed to the Russian law enforcement authorities for criminal investigation.VTB is 61% state-owned, with the Ministry of Finance and Ministry of Economic Development having a share in the group, so these attacks have a political hue, being an indirect blow to the Russian government.The pro-Ukraine hacktivist group, 'IT Army of Ukraine,' has claimed responsibility for the DDoS attacks against VTB, announcing the campaign on Telegram at the end of November.The pro-Ukraine hacktivists have been very active in November, targeting over 900 Russian entities, including stores selling military equipment and drones, the Central Bank of Russia, the National Center for the Development of Artificial Intelligence, and Alfa Bank.The first signs of disruption on VTB came on December 1, 2022, when the hacktivists posted complaints about VTB customers on social media that the bank tried to play down.With the bank's service disruption more evident now, as the websites and mobile apps are no longer available, VTB had to publicly admit it is fighting a DDoS attack."
   }
]