[
   {
      "time": "2022-08-01",
      "title": "Australia charges dev of Imminent Monitor RAT used by domestic abusers",
      "text": " ​An Australian man was charged for developing and selling the Imminent Monitor remote access trojan, used to spy on victims' devices remotely.A remote access trojan is a type of malware that allows full remote access to an infected device, including the ability to execute commands, log keystrokes, steal files and data, install additional software, take screenshots, and even record video from the device's webcam.These types of malware are very popular among hackers due to its cheap price and the unfettered access it provided to infected devices. However, they are also popular with domestic abusers who use them to spy on their victims.Yesterday, the Australian Federal Police (AFP) announced that they had charged an Australian man, age 24, for developing and selling the Imminent Monitor (IM5) software.The AFP alleges that the man sold the software to more than 14,500 people across 128 countries.\"Of the 14 individuals, 11 bought the RAT during the active period of their domestic violence order (DVO) or within two years a DVO was issued.\"Since the operation started in 2013, law enforcement states that the developer made 300,000 to 400,000, which was predominantly used to pay for food deliveries and purchase \"other consumable and disposable items.\"The Australian man faces six charges with a maximum penalty of 20 years.The Imminent Monitor operation started in 2013 when the developer (then 15) began promoting the product on hacking forums and a dedicated website.The program was marketed as a remote administrator tool that could be purchased for as little as $25 for a lifetime license, which included customer support.While the website promoted the product as a legitimate tool, the developer provided customer support and promoted the software under the alias 'ShockWave.'In April 2019, a member of a hacking forum warned that ShockWave had gone missing and that he was likely arrested, warning Imminent Monitor customers that they would probably be facing legal action due to their use of the software.Seven months later, in November, Europol announced a global law enforcement operation that led to the seizure of over 430 devices involved in the Imminent Monitor operation and the imminentmethods.net website used to promote the software."
   },
   {
      "time": "2022-08-01",
      "title": "Данные клиентов «Почты России» утекли в сеть 29 июля 2022 г. - 29 июля 2022 - Фонтанка.Ру",
      "text": " Сейчас-6˚CСейчас в Санкт-ПетербургеПасмурно, Без осадковОщущается как -91 м/с, с-з767мм76%Пробки7/10В Интернете появились данные клиентов «Почты России», о чем сообщили профильные телеграм-каналы 29 июля. В выложенном образце 10 миллионов строк, которые содержат: номер отслеживания (трек-номер отправления), ФИО (или название компании) отправителя/получателя, телефон получателя, город/индекс отправителя/получателя, вес/статус отправления, дата/время отправления.Новость дополняется.08 июня 2023, 11:1905 августа 2023, 16:41Увидели опечатку? Выделите фрагмент и нажмите Ctrl+EnterОтправьте свою новость в редакцию, расскажите о проблеме или подкиньте тему для публикации. Сюда же загружайте ваше видео и фото.Контактные данные для Роскомнадзора и государственных органов«Фонтанка» — петербургская интернет-газета, где можно найти не только новости Петербурга, но и последние новости дня, и все важное и интересное, что происходит в России и в мире. Здесь вы отыщете наиболее значимые происшествия, новости Санкт-Петербурга, последние новости бизнеса, а также события в обществе, культуре, искусстве. Политика и власть, бизнес и недвижимость, дороги и автомобили, финансы и работа, город и развлечения — вот только некоторые из тем, которые освещает ведущее петербургское сетевое общественно-политическое издание. Санкт-Петербург читает «Фонтанку»! Наша аудитория — лидеры бизнеса и политики, чиновники, десятки тысяч горожан.© 2000-2023 Фонтанка.РуСвидетельство Роскомнадзора ЭЛ № ФС 77-66333 от 14.07.2016Разработка — ООО «Интернет Технологии»"
   },
   {
      "time": "2022-08-01",
      "title": "Thai entities continue to fall prey to cyberattacks and leaks",
      "text": " The Office of Inadequate SecurityBut even while DataBreaches was researching and preparing the post on Indonesia, DESORDEN threat actors continued to announce new victims in Thailand and further headaches for earlier Thai victims who had not paid their demands.And then it appeared things might get even worse.DataBreaches has not spotted any media coverage or notice on Fraser’s website. A request sent to Fraser for a copy of any notification or press release, and a question about who has been notified did not receive an immediate reply.DESORDEN isn’t the only source of leaks or breaches affecting Thai entities, of course, with ALTDOS having previously been a significant threat actor in the region. DataBreaches also found other listings by other vendors or threat actors over the past few months on a popular forum where people can sell or acquire data:NOTE: DataBreaches has not attempted to validate any of the claims in the postings described above, and not all of them are even still available. They are presented here merely to demonstrate an interest in the underground for data from Thailand, and people are more than willing to profit by meeting that need.In the past few days, DESORDEN started making ransomware builds freely available to members of a hacking-related forum. Because DataBreaches was unaware of any incidents in which DESORDEN had used ransomware in its attacks on entities, DataBreaches asked them whether they had used it and whether their offer of free ransomware builds by others to forum members signaled that they would also be using ransomware more often in their activities. DataBreaches also asked DESORDEN if they had considered that by making these builds freely available to all, some young and inexperienced people might try to use them to attack hospitals or critical infrastructure.DESORDEN responded that they do not use ransomware in most of their attacks — not even during the Acer India attack. But even when they deploy ransomware, they write, they would not use the types offered on the forum or any type or version already hashed by VirusTotal because those are impossible to deploy on systems that have even basic antivirus protection.As to the two specific ransomware builds they offered freely on a forum, they note that CHAOS Ransomware Builder is a wiper, although it is advertised as ransomware, and it doesn’t work with any properly installed AV system. The other offering, Yashma Ransomware Builder, is an upgraded one that has not been detected often in the wild. And here’s where their answer became particularly interesting:The Yashma was provided to us by a credible source for reverse engineering purposes. We have already submitted to VirusTotal which will be uploaded to majority AV detection. So it is almost impossible for young wannabes to deploy it on basic AV protected systems, as basic as Windows Defender. Also, ransomware is not easily deployed as seen in movies or online news. Deploying it require skills in underlying systems.So that was a bit of a  surprise: DESORDEN offered a free build of others’ ransomware but first uploaded it to virustotal.com so that it will be detected by more systems and be less likely to succeed if entities use basic security hygiene like updated antivirus protection.DataBreaches will continue to try to cover ASEAN breaches, and hopes that the country’s regulator will publish some guidance to entities there if they have not done so already.UPDATE: Hours after posting this, I heard from DESORDEN, who wrote that they were suspicious of the Pruksa Clinic listing mentioned in the post because,  “A leak involving 48 million would be big, considering Thailand population of only 70 million. Also, a clinic of this size is impossible to have such many customer records. So we went on to investigate on the target.”That translated into they hacked in to the clinic, looked around, and reported that the clinic only had a few thousand patients.To prove, we are in their system. We put a message for you on one of their page:And indeed they had. When I checked the url they provided, it took me to a page on Pruksa Clinic, and here is what I saw: So now we know to be suspicious of that listing claiming 48 million. But as DESORDEN subsequently explained, their motive wasn’t totally altruistic:We were only concerned when we saw 48 million records in Thailand being leaked via a private company. As far as we know, Mistine hack is the largest heist in terms of 20 million customers and 10 million sales representatives from a private company in Thailand. And obviously we aim to continue holding the records, as long as we could. =)Whatever their motive, this is a useful reminder not to just believe whatever is posted in forums for sale or tokens.This site doesn’t accept sponsored posts and doesn’t respond to requests about them.Email:Signal: +1 516-776-7756© 2009 – 2023, DataBreaches.net and DataBreaches LLC. All rights reserved.“You translate “Nerd” into understandable “English” — Victor Gevers of GDI Foundation, talking about DataBreaches.net"
   },
   {
      "time": "2022-08-01",
      "title": "Old cat, new tricks, bad habits\r\n",
      "text": " More Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedGlobal Consumer Insights Pulse Survey - June 2023Achieving net zero infrastructureManufacturing COO Pulse Survey Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedUkraine: Tax, Legal and People considerationsPwC Global Internal Audit Study 2023M&A industry trends report  Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedThe Leadership AgendaPwC’s Global Risk Survey 2023strategy+business — a PwC publication Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedThe New EquationPwC's Global Annual ReviewCommitting to Net Zero by 2030 Menu Menu MenuFeaturedThe New EquationPwC's Global Annual ReviewLoading ResultsNo Match FoundAn analysis of Charming Kitten’s new tools and OPSEC errorsBy Krystle ReidYellow Garuda (similar to Charming Kitten, PHOSPHORUS, UNC788) is a threat actor likely to have been active since at least 2012. It is possibly one of the most active and persistent Iran-based threat actors over the last decade and is known primarily for spoofing log-in pages of legitimate webmail services to collect credentials from its targets. The threat actor also has a history of operational security (OPSEC) errors resulting in disclosure of its tools, techniques and procedures (TTPs), including the addition of Android malware to its expanding toolset.OPSEC mistakes associated with Yellow Garuda operations in late 2021 resulted in the discovery of new tool used to enumerate data from targeted Telegram accounts. We also identified an alias tied to early Iran-based operations and a surveillance report likely written by a Yellow Garuda operator.  Additionally, PwC analysts have observed the threat actor’s use of macro-enabled template files as recently as March 2022, a new TTP not previously associated with Yellow Garuda.Through our regular scanning for Yellow Garuda infrastructure, PwC analysts identified an open directory located at 138.201.145[.]183 containing several compressed archives associated with late 2021 Yellow Garuda activity. Each of the RAR archives contained a copy of a tool named NewTelegram.LocalGrabber.Sqlite.UI.Win.exe, together with the tool’s component parts, and exfiltrated victim data. In total there were seven sets of victim data on the server, six of which were outputs of the Telegram ‘grabber’ tool, and one of which was almost certainly the result of data exfiltrated by mobile malware. Although it is unclear what malware was used, we note that the type of data captured is in line with the capabilities of PINEFLOWER, an Android malware previously attributed to Yellow Garuda1. These archives had filenames referencing Solar Hijri calendar dates indicating that the activity took place between 7th September and 11th October 2021, when converted to the Gregorian calendar. The activity suggests domestic targeting as all victim mobile numbers contained the Iranian country code and Farsi was the main language seen in victim databases (as part of Telegram group names or in exfiltrated messages). From the data exfiltrated, it was also apparent that some of victims were associates of each other, where two pairs of victims were contacts of another victim on Telegram. We also observed that two of the victims likely had links to the Iranian music industry.Figure 1 - Contents of 138.201.145[.]183The Telegram grabber tool is written in C++ and uses the open source Telegram Database Library (TDLib), a cross-platform Telegram client typically used to create custom apps for the platform2.  It has been designed to exfiltrate information from a victim’s Telegram account. This includes messages and associated media, group memberships and contact data.SHA-2567709a06467b8a10ccfeed72072a0985e4e459206339adaea3afb0169bace024eFilenameNewTelegram.LocalGrabber.Sqlite.UI.Win.exeFile typeWin32 EXEFile size5,423,104 bytesCompilation timestamp2062-01-30 02:30:48In order to access the victim’s account, the threat actor needs to enter a login code which is issued by Telegram as part of its authentication process. The code is sent either to the victim’s Telegram account, or via SMS to the victim’s phone3. This means that the threat actor needs to have access to a victim’s active Telegram session, either via a phone or desktop, or otherwise be able to access their SMS messages, for example via mobile malware. As can be seen in Figure 2, the victim’s phone number is required upon opening the tool in order to send the authentication code.Figure 2 – GUI to enter victim’s phone numberIf the victim has enabled two-step verification, an additional password is needed. Where this is unknown, it can be reset using a recovery email if one has been previously setup. The tool has options to view the password hint and send an access code via the victim’s recovery email address, which the threat actor would need to access in order to proceed. The existence of this option indicates that the threat actor, at least in some cases, is likely to have access to the victim’s email account. This aligns with Yellow Garuda’s known tactics, which include extensive credential harvesting via dedicated phishing sites.Once authenticated, the operator is presented with multiple options to choose the type of data to download. This includes the ability to select a date range for the download of the different types of Telegram chat messages. For groups, the tool attempts to grab details on the participants as well as whether or not the victim is an administrator. The tool is also able to download data relating to the victim’s profile and their contacts, including their names, phone numbers, usernames and profile pictures. Figure 3 – Metadata accessed for each contactThe exfiltrated data is stored within a SQLite database and also in JSON format. For attachments sent or received through chats, there are options to choose specific file formats to download. These pertain to common video, audio, document, binary and compressed file extensions. In addition to being able to exfiltrate data, the threat actor also has the ability to delete messages from the victim’s account.We found 15 additional samples of the tool on an online multi-antivirus scanner which share the same filename (NewTelegram.LocalGrabber.Sqlite.UI.Win.exe) and TypeLib ID (7bb2c20c-740e-498b-8dd6-9c2ff8ad9572) as the sample we analysed. The TypeLib ID is a unique GUID created by Visual Studio when a new project is created4, thus indicating that all of the samples originated from the same project. The additional samples were all uploaded within a 31 day window between January and February 2021 and contained similar functionality to the one we analysed. The main difference was the presence of a web request function that appeared to be used in a testing capacity. Given the clustered times of submission and the presence of the web request test method, we assess it is likely these samples were submitted by the threat actor itself in a testing capacity.The following Microsoft Word document was found in the directory corresponding to one of the victims whose data was highly likely exfiltrated via mobile malware and not through the Telegram ‘grabber’ tool. Its filename translates to ‘01Report’ and its contents detail the status of the surveillance on that victim.  گزارش01.docx36c12ff1b62f4579d64926f5a26c4a1806235859a8f71c8754d5b257716be538File typeDOCXFigure 4 – Threat actor report (left) and translation from Farsi to English (right)The report gives us insight into the threat actor’s specific data collection objectives. It references the surveillance of audio and video conversations of the victim’s phone and confirms the victim’s name, national identity number, mobile number and phone model. It indicates the surveillance was completed on 11th October 2021 and is being sent for review by the ‘relevant expert’ on the orders of the manager of ‘2000’ and ‘2300’, numbers which could represent individual operators or departments within Yellow Garuda’s operations. The report ends with a warning that if the surveillance is detected, it will not be possible to re-access the phone.These numbers align with additional observations from the output log files of the Telegram ‘grabber’ tool which contained local file paths likely belonging to the threat actor. An example is as follows:Figure 5 – Example of file path found in output log files. The date converts to 22nd September 2021 in the Gregorian calendarWe observed values of 1500, 2700 and 3500 being used as part of the local directory structure. This indicates that at least three operators or teams may have contributed to the Telegram ‘grabber’ activity observed and a further two separate operators or teams worked on the victim referenced in the report.A previously leaked organisational chart associated with Iran’s Islamic Revolutionary Guard Corps (IRGC) shows individual departments with similar numerical referencing (Figure 6)5. From the English translation in Table 1, we can see that several of the observed values are present, overlapping with departments related to cyber, security and counterintelligence. Although we are unable to independently verify the validity of this chart, the overlap in naming convention, and our understanding that Yellow Garuda is likely associated with the IRGC6, aligns with our assessment that these are operator/team names.The author name of the threat actor report, “ll_invisible_ll” is fairly unique and gives us insight into a potential individual operator. This alias was also in use between 2010 and 2016 on the Ashiyane forum, a now defunct Iranian hacking forum originally started by the Ashiyane Digital Security Team. The Ashiyane Digital Security Team has previously been linked to IRGC activity7 and several of its members appeared in a US Department of Justice (DOJ) indictment for distributed denial of service (DDoS) attacks against organisations in the US financial sector and other US-based companies between 2011 and 20138.Figure 6 – Diagram purportedly showing IRGC-related departments and leads (Farsi language) [9]Table 1 – English translation of Figure 6 showing IRGC-related departments and leads; numbers overlapping with those observed in our analysis have been highlighted in bold Between January and March 2022, we observed Yellow Garuda using Microsoft Word document droppers which use remote template injection to obtain and execute a malicious macro. This is the first time we have observed the threat actor deploying macros or using remote template injection as part of its attack sequence.SHA-256Filename41b37de3256a5d1577bbed4a04a61bd7bc119258266d2b8f10a9bb7ae7c0d4ecTurkey_inj.docx10725bdf594baa21edf1f3820b0daf393267066717832452598c617552a004e5daTurkey.docx01ca3f6dc5da4b98915dd8d6c19289dcb21b0691df1bb320650c3eb0db3f214cIran- Taliban relations.docx57cc5e44fd84d98942c45799f367db78adc36a5424b7f8d9319346f945f64a72NY.docxa8c062846411d3fb8ceb0b2fe34389c4910a4887cd39552d30e6a03a02f4cc78Details-of-Complaint.docxTable 2 – Details of Microsoft Word document droppers (DOCX)The document lures we observed covered a variety of themes including nuclear energy and weapons related to Turkey, US shipping ports and Iran’s relationship to the Taliban and as such, we assess they were likely used to target a variety of unrelated entities. Many of these lures, used material sourced from legitimate English-language websites, including news and media sites. It is not unusual for threat actors to make use of current affairs as a means to catch the attention of potential victims and the themes are not necessarily indicative of specific targeting. Figure 7 – Example of lure contentThe initial Microsoft Word document (DOCX) is hosted on a third party service such as Dropbox or Amazon Web Services (AWS). Yellow Garuda is known to extensively employ social engineering as part of its attacks, therefore it is highly likely phishing was used to coerce a potential victim to download and open the document.Once opened, a form of remote template injection takes place where the document reaches out to a URL to download a file with a DOTM extension (a macro-enabled template file). The URL is specified within the relationship component word/_rels/settings.xml.rels of the initial document as indicated by the ‘Target’ value in Figure 8. The documents we analysed reached out to files hosted on either Microsoft OneDrive or on dedicated threat actor-controlled infrastructure, as can be seen below.Figure 8 – URL visible in word/_rels/settings.xml.relsWe were able to access several examples of this second stage macro-enabled template file. These differed in functionality and form, however they all maintained persistence by replacing the victim’s default Microsoft Word template, meaning that the malicious template (and macro) will open whenever Microsoft Word is opened by the victim. SHA-256Filenamec45bffb5fe7056075b966608e6b6bf82102f722b5c5d8a9c55631e155819d995DocTemplate.dotmdd28806d63f628dbc670caaa67379da368e62fa9edfbdfd37d3a91354df08e1cDocTemplate.dotmc0d5043b57a96ec00debd3f24e09612bcbc38a7fb5255ff905411459e70a6bb4Details.dotm28de2ccff30a4f198670b66b6f9a0ce5f5f9b7f889c2f5e6a4e365dea1c89d53Arabic.dotmTable 3 – Details of malicious template files (DOTM)In some cases11, we observed the macro code creating a reverse shell using code almost identical to that found in open source on a GitHub repository12. In other cases13, the template files were password protected meaning that the victim is required to specify the password in order for the attack sequence to proceed. This would need to be passed over to the victim via a phishing email or some other form of social engineering. The template files also contained RC4-encrypted strings (both within the macro and lure document) for which the decryption key needed to be obtained as the response to a HTTP GET request to an Amazon S3 bucket. These steps were likely designed to thwart analysis attempts if the password cannot be obtained to open the document, or the infrastructure hosting the decryption key is no longer active.Files dropped by the macros shared similar filenames to recent Yellow Garuda activity observed by Check Point14. The PowerShell backdoor known as CharmPower was observed to read data from a file called ni.txt, located in %AppData%, whose contents are sent to the command and control server along with basic information about the victim’s machine. This aligns with our observations that ni.txt is used to house a hardcoded identifier and could indicate that a version of CharmPower is deployed at a later stage of the attack sequence.Over the past year, we have seen Yellow Garuda continue to add tools to its arsenal. In its use of macro-enabled template files, we can see that the threat actor has made efforts to stage various parts of the infection chain remotely, disrupting analysis efforts where these are not accessible. The threat actor has also continued to make OPSEC mistakes exposing its tools and targeting through open servers. The Telegram ‘grabber’ tool we observed appears to be a tool that the threat actor has had access to since at least January 2021, and used against domestic targets to obtain specific access to Telegram messages and contacts alongside mobile malware.The threat actor’s operational report has given us further insight into its analysis process, indicating that there is an internal structure to its operations denoted by numerical call signs. It also highlights the alias of an individual which has previously been linked to Iran-based activity over several years.More detailed information on each of the techniques used in this blog, along with mitigations, can be found on the following MITRE pages:Valid Accounts - https://attack.mitre.org/techniques/T1078/Two-Factor Authentication Interception - https://attack.mitre.org/techniques/T1111/Obfuscated Files or Information - https://attack.mitre.org/techniques/T1027/System Information Discovery - https://attack.mitre.org/techniques/T1082/System Network Configuration Discovery - https://attack.mitre.org/techniques/T1016/Data Staged - https://attack.mitre.org/techniques/T1074/Exfiltration Over Web Service - https://attack.mitre.org/techniques/T1567/Acquire Infrastructure: Web Services - https://attack.mitre.org/techniques/T1583/006/Acquire Infrastructure: Domains - https://attack.mitre.org/techniques/T1583/001/Phishing: Spearphishing Link - https://attack.mitre.org/techniques/T1566/002/Telegram ‘grabber’ tool:Type7709a06467b8a10ccfeed72072a0985e4e459206339adaea3afb0169bace024eSHA-256f09fa790f8b3bf59f44093ae18e8c9ec95b54fb8dab5039e9bfd09b12b815950SHA-2566710d037801471826817596fa71637eecda4f58cddf47bbb48b3984b21582721SHA-256141ae6d29118b099d5ef8ee0daa7a4714447d5aa13ce43563e21900014f1db7dSHA-256ada1e14da19338f2fa009254a993c6b6607e9a328499c3a762d6652ca8edee5eSHA-25649218f19e3dc89ab2698f9e23f37d16a97b410de91226bb24e65c8392b74de93SHA-2564cddb6a4fbf8771ee3180b974fc12c8261880a213a4bf36b1e910e1c1df847cfSHA-2565987f958d758866ccea33437c53276382f9c362fc33e81d342b616dc70aeb78fSHA-2567ea6cb74238d3f0099d4b9c42dd7301b9fb903b62f1f2e06ef73ade533691a69SHA-2566e4e195c2d60aec5a75f287f2b27ade3204390ace9ad4dec07753234fb148b57SHA-2566b84eebded654d29b63f931a28e5fc4318aaf32604d1ad2f14e4a87b7a499206SHA-256f1651ffda0d45e6c37cd31c0ed83d9bd08c33acbd3647cbdd8b22b804ce8d6a3SHA-256009df256bce5971edaab72c19c4ebcc9296e203a2ef447557c0796d86217d1d3SHA-2565a9b1bf53e47cbecf41259f31d06f86dcf62b7858debd680c0a232de3577669aSHA-2564f85a533e6d25fb281639f9fb4b4f817faab2b291a7835c267f29c27728247f9SHA-256435f61ad26b729e1d7813454ff8279c52ebd928a3d1dd824cb9267189991565dSHA-256a81d2c633e938a04f486dea3b245e87dc498bc02SHA-19f9a5e7c24f8f2ab030ce875736d80e541156003SHA-185f1e02cb5f5c38b848c282187c3ceee7d544e13SHA-1b3adc3d81853185f65dbd278fbba7f795e4a3259SHA-1914a8da21feaab56fecbdc997710566775850617SHA-1affe20def567eb63447f2a3aad3927d52384db59SHA-126ed903a997d8f9dfee10435e8930a9b24bd46f9SHA-12b5056c31ca2a54e6bccc1912eee522dcf16cd94SHA-171028a08ec0d64dff36cf5405997501278b949f9SHA-178b4ba41d2de822061d1f3e0c43d13d564f10871SHA-1b785169c5fbaff8e205d6d58783706fc07208d59SHA-148b110b088d4fd8381990dbd6cbb23abeb87b422SHA-16df60e871d14996c4826a8c2355d64d3aabbfab6SHA-182a0d684a1e144a7f9f874e652597155bb12ae92SHA-1a8e7784df801cea9cb6278762437314bb42d1966SHA-172c4fe68520c0307367b0865b29215d1fc6e2c32SHA-11d64ddd5a2c0fae5817235ab9ddf334fMD5e66136da3bb11795da64f038ec4610b8MD5eb51402e73a86800cdce3a50c9c804feMD5f7b0da0dca597f3e61f53000814f8148MD596be653e085046ed518ad3ce48fc4190MD5d16f4bf877445e9fca422dc736db64cfMD5949cc35be1b366eaad94ea03cf862d6eMD588fd6260d23f01213d3e2abee74db4a2MD55816f687ce49588aae2584bb5e9f652fMD512a172b74d0c080217bf0b883c109a6bMD5b78483179f85d3c8e23733ebd114e10eMD5bddebaea4bf45f6b464d68a7b8e07b92MD5aba932b87072f479445a323b183cc29bMD5381bb58655a194e75763fb01a36e5c7bMD5b8045bebc39a8fff666803a5163173d8MD56a1dca07dafd2eebd99aba7c31ace928MD5NewTelegram.LocalGrabber.Sqlite.UI.Win.exeFilename138.201.145[.]183IPv4 addressMacro-enabled template activity:IndicatorType57cc5e44fd84d98942c45799f367db78adc36a5424b7f8d9319346f945f64a72SHA-256725bdf594baa21edf1f3820b0daf393267066717832452598c617552a004e5daSHA-25641b37de3256a5d1577bbed4a04a61bd7bc119258266d2b8f10a9bb7ae7c0d4ecSHA-25601ca3f6dc5da4b98915dd8d6c19289dcb21b0691df1bb320650c3eb0db3f214cSHA-256c45bffb5fe7056075b966608e6b6bf82102f722b5c5d8a9c55631e155819d995SHA-256dd28806d63f628dbc670caaa67379da368e62fa9edfbdfd37d3a91354df08e1cSHA-256a8c062846411d3fb8ceb0b2fe34389c4910a4887cd39552d30e6a03a02f4cc78SHA-256c0d5043b57a96ec00debd3f24e09612bcbc38a7fb5255ff905411459e70a6bb4SHA-25628de2ccff30a4f198670b66b6f9a0ce5f5f9b7f889c2f5e6a4e365dea1c89d53SHA-256b98a24144067ec3605e84158e12d6498222295aeSHA-1f39c5689887f5b94741e285cd867e1475111499eSHA-15c0e8bd70e2dd49d45937ccc3f38de61d356384cSHA-140dc7101e1991672b5f60523e69ed5787a9dc4faSHA-1cc9f460e593522e57b66fed9a34d3ba332391165SHA-1930e4757740aaefd9cb567faf301816fbe37c1c3SHA-1e3712e3d818e63060e30aec2a6db3598cbf0db92SHA-1e45aeccb798f5cf6cb5d877821d1f4aa7f55cf6fSHA-1aba938bf8dc5445df3d5b77a42db4d6643db4383SHA-145b50d42e8d827ca0373c12533211c33MD555748b22a52823a3ccb5d8b106826cecMD54ae177a37658c82adad3265ad3cce662MD514c095de9da5fbba5548d9fea65c8b2dMD5db998d8182f4afd9f42bb289c508a1f3MD5c711036ef1805fea9dc2c8e633b961fdMD5b7bc6a853f160df2cc64371467ed866dMD5651d72776c0394693c25b1e3c9ec55d0MD5bdf188b3d0939ec837987b4936b19570MD5official-updates[.]infoDomainoffice-updates[.]infoDomain51.38.87[.]253IPv4 addresshxxp://official-updates[.]info/office/Default.dotmURLhxxps://dl[.]dropboxusercontent[.]com/s/psmt483ybusajvy/Turkey.docx?dl=0URLhxxps://u1ndk6f4nf[.]execute-api[.]us-east-1[.]amazonaws[.]com/page/EdPEtAGapngkNtLLFCeeURLhxxps://u1ndk6f4nf[.]execute-api[.]us-east-1[.]amazonaws[.]com/page/zhUezQeFqaDRmxWaHfVzURLhxxps://s3[.]amazonaws[.]com/2v63r9egi46/mvhg5dhdbsolshpqURLhxxps://s3[.]amazonaws[.]com/2v63r9egi46/hgn8fdsf512fsc5URLhxxps://drive[.]google[.]com/uc?export=download&id=13_PT71n8Ujl2lSTcQcyFJ4TNetI-wvDf&dID=1645099370036&linkName=Download%20FileURLhxxp://office-updates[.]info/2022/Details.dotmURLhxxp://office-updates[.]info/static/admin/storage/Arabic.dotmURLhxxp://office-updates[.]info/static/admin/storage/Details.dotmURL[1] ‘UNC788: IRAN’S DECADE OF CREDENTIAL HARVESTING AND SURVEILLANCE OPERATIONS’, VB2021 localhost, https://vblocalhost.com/uploads/VB2021-Haeghebaert.pdf (October 2021)[2] Telegram, ‘Telegram Database Library’, https://core.telegram.org/tdlib[3] Telegram, ‘FAQ’, https://telegram.org/faq#login-and-sms[4] ‘Using .NET GUIDs to help hunt for malware’, Virus Bulletin, https://www.virusbulletin.com/virusbulletin/2015/06/using-net-guids-help-hunt-malware/ (25th June 2015)[8] ‘Indictment 834996’, US Department of Justice, https://www.justice.gov/opa/file/834996/download[10] It is likely this is not the original file name and it has been altered by the submitter.[11] SHA-256: 28de2ccff30a4f198670b66b6f9a0ce5f5f9b7f889c2f5e6a4e365dea1c89d53 and c0d5043b57a96ec00debd3f24e09612bcbc38a7fb5255ff905411459e70a6bb4[13] SHA-256: c45bffb5fe7056075b966608e6b6bf82102f722b5c5d8a9c55631e155819d995 and dd28806d63f628dbc670caaa67379da368e62fa9edfbdfd37d3a91354df08e1c\n{{item.publishDate}}\n{{item.text}}\n{{item.publishDate}}\n{{item.text}}Global Threat Intelligence Lead Partner, PwC United KingdomTel: +44 (0)7725 707360Global Threat Intelligence Lead, Director, PwC United KingdomCyber Threat Intelligence Manager, PwC United KingdomGlobal Threat Intelligence Lead, Director, PwC AustraliaTel: +44 (0)7718 979 308Global Threat Intelligence Lead, Director, PwC United StatesYour request / feedback has been routed to the appropriate person. Should you need to reference this in the future we have assigned it the reference number \"refID\" .Thank you for your comments / suggestions.\r\n\t\t\t\tRequired fields are marked with an asterisk(*)\r\n\t\t\t\r\n\t\t\t   Please correct the errors and send your information again.\r\n\t\t\t\nTick this box to verify you are not a robot\nCyber Threat Operations Lead Partner, PwC United KingdomTel: +44 (0)7725 707360"
   },
   {
      "time": "2022-08-01",
      "title": "US Government Alerts Americans of Rising SMS Phishing Attacks - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-08-01",
      "title": "Meta, US hospitals sued for using healthcare data to target ads",
      "text": " A class action lawsuit has been filed in the Northern District of California against Meta (Facebook), the UCSF Medical Center, and the Dignity Health Medical Foundation, alleging that the organizations are unlawfully collecting sensitive healthcare data about patients for targeted advertising.This tracking and data collection allegedly takes place in medical portals beyond login walls, where patients enter highly sensitive information about themselves, their conditions, doctors, prescribed medication, and more.According to the lawsuit, neither the hospitals nor Meta informs the patients about the data collection, no user consents are requested, and there is no visible indication of this process.The plaintiffs realized the violation of their privacy when Facebook, the social media platform belonging to Meta, began targeting them with advertisements tailored explicitly for their medical condition.The Meta Pixel is a piece of code that can be injected into any website to aid with visitor profiling, data collection, and targeted advertising.It takes up the space of a single pixel, hence the name and stealthiness, and helps collect data such as button clicks, scrolling patterns, data entered in forms, IP addresses, and more.This data collection takes place for all users even if they don't have a Facebook account. However, for Facebook users the collected data is linked to their account for deeper correlation.Because the Meta Pixel is installed on numerous sites, users will be tracked and targeted with specific ads on multiple internet locations.The lawsuit claims that Meta’s tracking code is present on 33 websites of the top 100 hospitals in the United States, and in seven cases, the code runs beyond password-protected patient portals.According to the complaint, the 33 hospitals found to have the Meta Pixel collectively admitted over 26 million patients and outpatient visits in 2020 alone.In examples in court documents, patients received targeted advertisements on Facebook and also over email, promoting ailments and medical services with no scientific support.Most importantly, the plaintiffs felt violated as they had never agreed to the collection of sensitive medical data, let alone for it to be used in targeted advertising.Meta even contains a provision for this in its data privacy policy, stating that its partners (hosts of the Meta Pixel) must have lawful rights to collect, use and share users’ data before handing it over to the advertising giant.As such, both Meta and the healthcare providers are accused of knowing that their data collection operation was unlawful, yet they continued to do it and concealed it from the tracked individuals.In conclusion, the plaintiffs, on behalf of anyone in a similar situation, seek claims for relief relevant to the invasion of privacy, violation of medical information confidentiality, unjust enrichment, breach of contract, Computer Data Access and Fraud Act (CDAFA), and also the Federal Wiretap Act."
   },
   {
      "time": "2022-08-01",
      "title": "OneTouchPoint Discloses Data Breach Impacting Over 30 Healthcare Firms - SecurityWeek",
      "text": " Hi, what are you looking for?Mailing and printing services vendor OneTouchPoint has disclosed a data breach impacting more than 30 healthcare providers and health insurance carriers.Headquartered in Hartland, Wisconsin, OneTouchPoint offers print, marketing execution and supply chain management services to organizations in the healthcare sector.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-08-01",
      "title": "CISA Warns of Atlassian Confluence Hard-Coded Credential Bug Exploited in Attacks",
      "text": " Depending on the page restrictions and the information a company has in Confluence, successful exploitation of the shortcoming could lead to the disclosure of sensitive information.\"Exploitation efforts at this point do not seem to be very widespread, though we expect that to change,\" Erick Galinkin, principal AI researcher at Rapid7, told The Hacker News.\"The good news is that the vulnerability is in the Questions for Confluence app and not in Confluence itself, which reduces the attack surface significantly.\"With the flaw now added to the catalog, Federal Civilian Executive Branch (FCEB) in the U.S. are mandated to apply patches by August 19, 2022, to reduce their exposure to cyberattacks.\"At this point, the vulnerability has been public for a relatively short amount of time,\" Galinkin noted. \"Coupled with the absence of meaningful post-exploitation activity, we don't yet have any threat actors attributed to the attacks.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-08-01",
      "title": "911 Proxy Service Implodes After Disclosing Breach – Krebs on Security",
      "text": " The 911 service as it existed until July 28, 2022.911[.]re, a proxy service that since 2015 has sold access to hundreds of thousands of Microsoft Windows computers daily, announced this week that it is shutting down in the wake of a data breach that destroyed key components of its business operations. The abrupt closure comes ten days after KrebsOnSecurity published an in-depth look at 911 and its connections to shady pay-per-install affiliate programs that secretly bundled 911’s proxy software with other titles, including “free” utilities and pirated software.911[.]re is was one of the original “residential proxy” networks, which allow someone to rent a residential IP address to use as a relay for his/her Internet communications, providing anonymity and the advantage of being perceived as a residential user surfing the web.Residential proxy services are often marketed to people seeking the ability to evade country-specific blocking by the major movie and media streaming providers. But some of them — like 911 — build their networks in part by offering “free VPN” or “free proxy” services that are powered by software which turns the user’s PC into a traffic relay for other users. In this scenario, users indeed get to use a free VPN service, but they are often unaware that doing so will turn their computer into a proxy that lets others use their Internet address to transact online.From a website’s perspective, the IP traffic of a residential proxy network user appears to originate from the rented residential IP address, not from the proxy service customer. These services can be used in a legitimate manner for several business purposes — such as price comparisons or sales intelligence — but they are massively abused for hiding cybercrime activity because they can make it difficult to trace malicious traffic to its original source.A cached copy of flashupdate[.]net circa 2016, which shows it was the homepage of a pay-per-install affiliate program that incentivized the silent installation of 911’s proxy software.Within hours of that story, 911 posted a notice at the top of its site, saying, “We are reviewing our network and adding a series of security measures to prevent misuse of our services. Proxy balance top-up and new user registration are closed. We are reviewing every existing user, to ensure their usage is legit and [in] compliance with our Terms of Service.”At this announcement, all hell broke loose on various cybercrime forums, where many longtime 911 customers reported they were unable to use the service. Others affected by the outage said it seemed 911 was trying to implement some sort of “know your customer” rules — that maybe 911 was just trying to weed out those customers using the service for high volumes of cybercriminal activity.Then on July 28, the 911 website began redirecting to a notice saying, “We regret to inform you that we permanently shut down 911 and all its services on July 28th.”According to 911, the service was hacked in early July, and it was discovered that someone manipulated the balances of a large number of user accounts. 911 said the intruders abused an application programming interface (API) that handles the topping up of accounts when users make financial deposits with the service.“Not sure how did the hacker get in,” the 911 message reads. “Therefore, we urgently shut down the recharge system, new user registration, and an investigation started.”The parting message from 911 to its users, posted to the homepage July 28, 2022.However the intruders got in, 911 said, they managed to also overwrite critical 911[.]re servers, data and backups of that data.“On July 28th, a large number of users reported that they could not log in the system,” the statement continues. “We found that the data on the server was maliciously damaged by the hacker, resulting in the loss of data and backups. Its [sic] confirmed that the recharge system was also hacked the same way. We were forced to make this difficult decision due to the loss of important data that made the service unrecoverable.”Now, many on the crime forums who relied on 911 for their operations are wondering aloud whether there are any alternatives that match the scale and utility that 911 offered. The consensus seems to be a resounding “no.”I’m guessing we may soon learn more about the security incidents that caused 911 to implode. And perhaps other proxy services will spring up to meet what appears to be a burgeoning demand for such services at the moment, with comparatively little supply.In the meantime, 911’s absence may coincide with a measurable (if only short-lived) reprieve in unwanted traffic to top Internet destinations, including banks, retailers and cryptocurrency platforms, as many former customers of the proxy service scramble to make alternative arrangements.“My speculation is [911’s remaining competitors] are going to get a major boost in the short term, but a new player will eventually come along,” Kilmer said. “None of those are good replacements for LuxSocks or 911. However, they will all allow anyone to use them. For fraud rates, the attempts will continue but through these replacement services which should be easier to monitor and stop. 911 had some very clean IP addresses.”\r\n         This entry was posted on Friday 29th of July 2022 03:34 PM \r\n         Could this be a case of /actual/ hactivism?  I would love to see the post-mortem of what happened.Congrats again, Brian; keep up the good fight!“None of those are good replacements for L*s or 9*. However, (!) they will _all_ allow anyone to use them(!) For fraud rates, the attempts _will_ continue but through these replacement services which _should_ (?) be easier to monitor and stop. 911 had some very clean IP addresses.”  Clean IP addresses come and go all the time.  Like MS switching off macros makes malware go %more into containers that circumvent MOTW it’s 6 of one half dozen of another.  There will be a proportional %dip in overall throughput – until the next crest.  “eventually” = 30-90 days?Perhaps a rival gang or even a nation state did this to take over 911’s infrastructure for their own purposes?  What happens to all the personal computers still running 911’s software?Well, I do not believe the service was unrecoverable. They just looked for an easy way out before things get difficult. So a “we were hacked – all data lost – not our fault, sorry” makes total sense. They get out clean. But seriously, I highly doubt that they had no means in recovering the services.Exactly.Where can we get a similar proxy?Have you checked the prisons?Are you able to get any help ??Any similar to 911 s5?Prob of future will be daily proxies“The cost is far beyond our ability.” They just bailed out on us and took the easy way out, nothing else. I also had some credits in my account, but I doubt they’ll refund anyone.Refund what? That which does not exist?That’s really sad. They should pay the money which they took for services they didn’t provide.So they tricked people into installing malware that would add their computers to what was basically an IP address laundering ring, leaving those people vulnerable to criminal charges when the company’s customers use the people’s computers for cybercrime? Then good riddance.I don’t care if some boomer installed malware on their PC. they are not going to get charged for cybercrime because someone was posting memes from 911.re service.I’ve noticed a SIGNIFICANT reduction in spam since these proxy services have shut down.I haven’t gotten a spam email in 4 years.Less volume but higher quality.My computer has been working smoothly with less humming and heat-up for the past week.\nCan one be an unwilling proxy?Windows was trying to install an update the entire time.If you’re using any service operated from within territory ruled by the CCP just know that it’s 99% likely to be SPYWARE, and it’s also highly probable that the data was routed directly to CCP Intelligence collection services. When I saw the words “surreptitious install” and “China” in the same article, I knew right away what was going on. MITM data harvesting op.If you’re using any service operated from within territory ruled by Russia just know that it’s 99% likely to be MALWARE, and it’s also highly probable that the data was routed directly to SVR Intelligence collection services.The problem is in knowing where things are actually operated.  If you know it’s easy.And by easy I mean feasible, maybe.  Not easy.  Wrong word.Comments are closed.Mailing ListSearch KrebsOnSecurityRecent PostsStory CategoriesWhy So Many Top Hackers Hail from Russia"
   },
   {
      "time": "2022-08-01",
      "title": "The commercial satellite boom is leaving space vulnerable to hackers",
      "text": " Humanity’s imagination turned toward the heavens this month as the James Webb Space Telescope revealed images of distant galaxies.But John Crassidis, who worked on initial designs for the telescope at NASA during the 1990s, is focused on something closer to home: securing the thousands of human-made satellites orbiting the Earth — many of which are now controlled by the private sector. And Crassidis, now the director of the Center for Space Cyber Strategy and Cyber Security at the University of Buffalo, is waiting for one of them to be wiped out by a cyberattack.“I don’t think it’s a question of if, I think it’s a question of when,” he told The Record.He’s not the only one who is worried: U.S. lawmakers and other researchers are seeking solutions for securing our increasingly crowded skies. “We need to make every effort to understand what further actions can be and should be taken to strengthen cybersecurity for civil and commercial space systems, including commercial space systems that provide mission-critical government data and services,“ said Subcommittee on Space and Aeronautics Chairman Rep. Don Beyer (D-VA) in a Thursday hearing. Many are private communications satellites now being used to provide internet access that can be a lifeline to isolated areas or when local infrastructure is disrupted in conflict. “For commercial vendors, they are driven by the consumers of the services that are being used — so they may not be as willing to pay for security as a [Defense Department] or civil agency would because they are required to do so,” Theresa Suloway, Space Cybersecurity Engineer at MITRE Corporation, testified. But even while some U.S. agencies work to provide guidance for how to secure commercial satellites, many remain vulnerable to attacks that could interfere with communications capabilities on Earth or put them on a crash course with other space objects. Such an attack could have long-term consequences for humanity’s navigation of local space. “A collision between satellites would not only destroy the satellites involved, but the resulting debris would permanently remove that orbit or region from use by any other satellite,” said Suloway. “This risk requires pre-emptive rather than reactive action.” Protecting a satellite involves securing both the object in orbit as well as the ground control station used to communicate with it. The ground stations are generally easier targets for digital attackers, but both can be vulnerable, Suloway testified to the space and aeronautics subcommittee. For example, satellites rely on solar panels that must be carefully positioned to stay powered — so losing control of the systems that angle them may cause them to be knocked permanently offline in a matter of days, according to Crassidis.“It doesn’t take too much to hack into a satellite, turn it — and if we can’t get control back, it’s dead,” he said. “The power is very limited on satellites.” Crassidis is especially concerned that channels used to transmit commands to commercial satellites may be known and open. “The communication bands are pretty standard bands,” Crassidis said. “Adding encryption to the groundspace link would mitigate some of the vulnerabilities by making it harder for malicious sources to send commands to the satellites,” she said. “It’s a big concern and the FCC keeps punting,” said Crassidis. But it’s not the only concern about digitally securing satellites. “Monitoring and situational awareness need to be built in now as part of the fabric of commercial space,” Suloway said, including best practices for digitally securing ground stations as well as satellites.Developing guides that can lower the entry for using commercially available cybersecurity products can help the commercial space sector improve security without forcing them to do their own experimentation, she added.However, these efforts represent best practices — not rules that the government can compel companies to follow. And with more satellites going up every year, the threat of attacks is only on the rise. “Right now in space, it’s the wild, wild west – it’s kind of scary when you think about it,” Crassidis said.Andrea Peterson (they/them) is a longtime cybersecurity journalist who cut their teeth covering technology policy at ThinkProgress (RIP) and The Washington Post before doing deep-dive public records investigations at the Project on Government Oversight and American Oversight.© Copyright 2023 | The Record from Recorded Future News"
   }
]