[
   {
      "time": "2022-10-31",
      "title": "Student arrested for running one of Germany’s largest dark web markets",
      "text": " Germany's Federal Criminal Police Office (BKA) has arrested a 22-year-old student in Bavaria, who is suspected of being the administrator of 'Deutschland im Deep Web' (DiDW), one of the largest darknet markets in the country.The platform had already gone offline in March 2022, with 16,000 registered users, 28,000 posts, and 72 high-volume sellers of prohibited goods, including weapons and drugs.The suspect now faces criminal charges for operating an illicit trading platform, which incurs up to ten years of imprisonment.The original DiDW platform was launched in 2013 as a forum to discuss IT security and anonymization. At its peak in 2017, it reached 23,000 registered users and 6 million monthly hits.However, the site was also used for selling illegal items such as weapons and drugs, using an escrow system for payments to protect members from fraudulent listings. This essentially made DiDW a darknet market under the guise of a forum.In 2017, soon after that incident, the website was shut down by law enforcement, and its operator was arrested and sentenced to seven years in prison.In 2018, two new versions of the platform appeared on the dark web, using the motto \"No control, everything allowed,\" implying the new operators no longer cared about masking illegal activities on the site.This second iteration of DiDW shut down on its own in 2019 without giving any reason, and only ten days later, a third version of the site appeared online as the official successor of the darknet market brand.Eventually, after five years of investigation, the federal police managed to identify the alleged admin of the third version of DiDW, arresting him on October 25, 2022.Identifying the operators of darknet platforms that have gone defunct for several years isn't uncommon, as cybercrime investigators work on these cases for extended periods."
   },
   {
      "time": "2022-10-31",
      "title": "New Azov data wiper tries to frame researchers and BleepingComputer",
      "text": " A new and destructive 'Azov Ransomware' data wiper is being heavily distributed through pirated software, key generators, and adware bundles, trying to frame well-known security researchers by claiming they are behind the attack.The Azov Ransomware falsely claims to have been created by a well-known security researcher named Hasherazade and lists other researchers, myself, and BleepingComputer, as involved in the operation.The ransom note tells victims to contact me, BleepingComputer, Hasherazade, MalwareHunterTeam, Michael Gillespie, or Vitali Kremez on Twitter to recover files, falsely implying that we are part of the ransomware operation.To be clear, those listed in the ransom note are not associated with this ransomware and are being framed by the threat actor. Therefore, we, unfortunately, do not have the decryption keys and cannot help.Furthermore, as there is no way to contact the threat actors to pay a ransom, this malware should be treated as a destructive data wiper rather than ransomware.Unfortunately, victims have already started contacting BleepingComputer for help recovering files, and as much as we would like to help, there is no known way of helping at this time.While the threat actors claim they are doing this in support of Ukraine, BleepingComputer knows of a Ukrainian organization affected by this data wiper.This is not the first time threat actors attempted to frame security researchers for their malware.In a new campaign started over the past two days, a threat actor appears to have purchased 'installs' through the SmokeLoader malware botnet to deliver the new destructive Azov wiper.SmokeLoader is a malware botnet that other threat actors can rent or buy 'installs,' to distribute their own malware on infected devices. SmokeLoader is commonly distributed through websites pushing fake software cracks, game modifications, cheats, and key generators.BleepingComputer is aware of victims being double-encrypted, first with Azov and then with STOP ransomware, as SmokeLoader delivered both simultaneously.[HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run\\]\n\"Bandera\" = \"C:\\ProgramData\\rdpclient.exe\"The wiper will now scan all the drives on the computer and encrypt any file that does not have the .ini, .dll, and .exe extensions.When encrypting files, it will append the .azov file extension to the names of encrypted files. For example, 1.doc is encrypted and renamed to 1.doc.azov, as shown below.A previous version of the wiper found by MalwareHunterTeam used a different ransom note with a much darker message.While the ransomware will be analyzed by researchers for weaknesses in the encryption, at this time, the ransomware should be considered destructive, as there is no way to contact the threat actors and recover decryption keys.We will update this article if a method is discovered to recover files for free.However, if this data wiper encrypted your data, you were likely also infected with other malware, such as information-stealing trojans.Therefore, you should immediately change the passwords on your online accounts, especially those sensitive in nature, such as online banking, password managers, and email accounts."
   },
   {
      "time": "2022-10-31",
      "title": "Metaverse Opens Up New World of Cybercrime, Says Interpol  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-31",
      "title": "Google Cloud Delivers Web3 Developers for Blockchain Node Engine - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-10-31",
      "title": "Hong Kong Will Legalize Retail Crypto Trading to Establish a Cryptocurrency Hub - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-31",
      "title": "Actively exploited Windows MoTW zero-day gets unofficial patch",
      "text": " A free unofficial patch has been released for an actively exploited zero-day that allows files signed with malformed signatures to bypass Mark-of-the-Web security warnings in Windows 10 and Windows 11.When a user downloads a file from the Internet, Microsoft adds a Mark-of-the-Web flag to the file, causing the operating system to display security warnings when the file is launched, as shown below.What made these Magniber JavaScript files stand out was that even though they contained a Mark-of-a-Web, Windows did not display any security warnings when they were launched.When a malicious file with one of these malformed signatures is opened, instead of being flagged by Microsoft SmartScreen and showing a security warning, Windows would automatically allow the program to run.The image below demonstrates how the vulnerability allows a file ('calc-othersig.js') with a malformed signature to bypass the Mark-of-the-Web security warning.Microsoft told BleepingComputer that they were aware of the issue and investigating it.As this zero-day vulnerability is actively exploited in ransomware attacks, the 0patch micro-patching service decided to release an unofficial fix that can be used until Microsoft releases an official security update.When SmartScreen can't parse the signature, Windows will incorrectly allow the program to run rather than displaying an error.\"The malformed signature discovered by Patrick and Will caused SmartScreen.exe to throw an exception when the signature could not be parsed, resulting in SmartScreen returning an error,\" explains Kolsek.\"Which we now know means \"Run\".\"Kolsek warned that though their patch fixes the majority of attack scenarios, there could also be situations that bypass his patch.\"While our patch fixes the most obvious flaw, its utility depends on the application opening the file using function DoSafeOpenPromptForShellExe in shdocvw.dll and not some other mechanism,\" warns Kolsek.\"We're not aware of another such mechanism in Windows, but it could technically exist.\"Until Microsoft releases official updates to address the flaw, 0patch has developed free patches for the following affected Windows versions:Once the agent is installed, the patches will be applied automatically without requiring a system restart if there are no custom patching policies to block it.You can see 0patch's Windows micropatches in action in the video below."
   },
   {
      "time": "2022-10-31",
      "title": "Slovak Parliament Suspends Voting Due to Suspected Cyberattack",
      "text": " SectionsResourcesResourcesResourcesSlovak Parliament Suspends Voting Due to Suspected CyberattackA general view of the Slovak Parliament in Bratislava, Slovakia, January 26, 2016. REUTERS/David W CernyReuters(Reuters) - The Slovak parliament suspended its session on Thursday after a suspected cyberattack brought down its IT systems, parliament speaker Boris Kollar said.\"We have identified a cyber security incident... There is a signal coming from some point which jams our systems, computers, we cannot even serve the lawmakers in our cafeteria,\" Kollar told reporters in a televised briefing.\"We won't be voting today... (We have to) find out where is it hit, or if it is some malfunction,\" he said.Local media reported that the parliament session, with 75 bills on the agenda, should reconvene on Nov. 8.In neighbouring Poland, the website of the upper house of the parliament, the Senate, was down on Thursday due to an attack by hackers.The European Commission last week proposed stepping up measures to protect its critical infrastructure, including digital and energy networks, as European Union countries help Ukraine defend itself against Russia's invasion.(Reporting by Robert Muller in Prague; Editing by Hugh Lawson)Copyright 2022 Thomson Reuters.Read MoreHealth News BulletinStay informed on the latest news on health and COVID-19 from the editors at U.S. News & World Report.U.S. News StaffJuly 6, 2021Feb. 1, 2017, at 1:24 p.m. April 8, 2022March 11, 2020Tim SmartNov. 21, 2023Kaia HubbardNov. 21, 2023Tim SmartNov. 21, 2023Nov. 21, 2023, at 4:06 p.m. Tim SmartNov. 20, 2023Tim SmartNov. 20, 2023"
   },
   {
      "time": "2022-10-31",
      "title": "Iran’s Secret Manual for Controlling Protesters’ Mobile Phones",
      "text": " © THE INTERCEPTALL RIGHTS RESERVED\n            The documents provide an inside look at an Iranian government program that lets authorities monitor and manipulate people’s phones.          As furious anti-government protests swept Iran, the authorities retaliated with both brute force and digital repression. Iranian mobile and internet users reported rolling network blackouts, mobile app restrictions, and other disruptions. Many expressed fears that the government can track their activities through their indispensable and ubiquitous smartphones.Iran’s tight grip on the country’s connection to the global internet has proven an effective tool for suppressing unrest. The lack of clarity about what technological powers are held by the Iranian government — one of the most opaque and isolated in the world — has engendered its own form of quiet terror for prospective dissidents. Protesters have often been left wondering how the government was able to track down their locations or gain access to their private communications — tactics that are frighteningly pervasive but whose mechanisms are virtually unknown.While disconnecting broad swaths of the population from the web remains a favored blunt instrument of Iranian state censorship, the government has far more precise, sophisticated tools available as well. Part of Iran’s data clampdown may be explained through the use of a system called “SIAM,” a web program for remotely manipulating cellular connections made available to the Iranian Communications Regulatory Authority. The existence of SIAM and details of how the system works, reported here for the first time, are laid out in a series of internal documents from an Iranian cellular carrier that were obtained by The Intercept.According to these internal documents, SIAM is a computer system that works behind the scenes of Iranian cellular networks, providing its operators a broad menu of remote commands to alter, disrupt, and monitor how customers use their phones. The tools can slow their data connections to a crawl, break the encryption of phone calls, track the movements of individuals or large groups, and produce detailed metadata summaries of who spoke to whom, when, and where. Such a system could help the government invisibly quash the ongoing protests — or those of tomorrow — an expert who reviewed the SIAM documents told The Intercept.“SIAM can control if, where, when, and how users can communicate,” explained Gary Miller, a mobile security researcher and fellow at the University of Toronto’s Citizen Lab. “In this respect, this is not a surveillance system but rather a repression and control system to limit the capability of users to dissent or protest.”SIAM gives the government’s Communications Regulatory Authority — Iran’s telecommunications regulator — turnkey access to the activities and capabilities of the country’s mobile users. “Based on CRA rules and regulations all telecom operators must provide CRA direct access to their system for query customers information and change their services via web service,” reads an English-language document obtained by The Intercept. (Neither the CRA nor Iran’s mission to the United Nations responded to a requests for comment.)The SIAM documents are drawn from a trove of internal materials from the Iranian cellular carrier Ariantel, including years of email correspondence and a variety of documents shared between Ariantel employees, outside contractors, and Iranian government personnel. The cache of materials was shared with The Intercept by an individual who claimed to have hacked Ariantel, and believed the documents were in the public interest given the ongoing protests in Iran and the threat SIAM might pose to demonstrators. (Ariantel did not respond to a request for comment.)Experts on mobile security and Iranian government censorship say the functionality revealed by the SIAM program poses a clear threat to protesters demonstrating against the government over the past month.“These functions can lead to life-and-death situations in a country like Iran, where there is no fair judicial process, no accountability, and we have a huge pattern of violations of people’s rights,” said Amir Rashidi, an internet security and digital rights expert focused on Iran. “Using the tools outlined in this manual could not only lead to mass surveillance and violations of privacy — it can also easily be used to identify the location of protesters who are literally risking their lives to fight for their basic rights.”\n\n\nA sticker that reads “Iran: The internet is down and they are killing the people” is seen on the back of a road sign during a demonstration where hundreds gathered to honor Mahsa Amini and to protest against the Iranian government, on Sept. 23, 2022, in Toronto.\nPhoto: Katherine Cheng/SOPA/LightRocket via Getty Images\nIranians regularly complain of slowed internet access on mobile devices during periods of protest — an abrupt dip in service that makes smartphone usage difficult if not impossible at moments when such a device could be crucial. Based on the manuals, SIAM offers an effortless way to throttle a phone’s data speeds, one of roughly 40 features included in the program. This ability to downgrade users’ speed and network quality is particularly pernicious because it can not only obstruct one’s ability to use their phone, but also make whatever communication is still possible vulnerable to interception.A sticker that reads “Iran: The internet is down and they are killing the people” is seen on the back of a road sign during a demonstration where hundreds gathered to honor Mahsa Amini and to protest against the Iranian government, on Sept. 23, 2022, in Toronto.Referred to within SIAM as “Force2GNumber,” the command allows a cellular carrier to kick a given phone off substantially faster, more secure 3G and 4G networks and onto an obsolete and extremely vulnerable 2G connection. Such a network downgrade would simultaneously render a modern smartphone largely useless and open its calls and texts to interception — both of obvious utility to a government clamping down on public gatherings and speech.“Generally speaking, forcing a phone to use the 2G network would still allow the phone to receive a two-factor SMS authentication message because SMS is sent over the mobile signaling network,” explained Miller. “However, the effect of forcing a user onto the 2G network, more importantly, would essentially render the corresponding real-time application services such as P2P communication, social media, and internet useless.”Miller pointed out that the target of a 2G downgrade might experience the attack as little more than spotty cell reception. “It can be viewed as a method to appear as if the network is congested and severely limit a user’s data services,” Miller said.Slowing connectivity is only one of many telecom tools available to Ariantel — and the CRA — that could be used to monitor political dissent. SIAM also provides a range of tools to track the physical locations of cell users, allowing authorities to both follow an individual’s movements and identify everyone present at a given spot. Using the “LocationCustomerList” command allows SIAM operators to see what phone numbers have connected to specified cell towers along with their corresponding IMEI number, a unique string of numbers assigned to every mobile phone in the world. “For example,” Miller said, “if there is a location where a protest is occurring, SIAM can provide all of the phone numbers currently at that location.”SIAM’s tracking of unique device identifiers means that swapping SIM cards, a common privacy-preserving tactic, may be ineffective in Iran since IMEI numbers persist even with a new SIM, explained a network security researcher who reviewed the manuals and spoke on the condition of anonymity, citing their safety.SIAM’s location-tracking power is particularly alarming given the high-stakes protests taking place across Iran. The Intercept reviewed undated text messages sent to Iranian mobile phone users from local police in the city of Isfahan informing them that they had been confirmed to have been in a location of “unrest” and warning them not to attend in the future. Many Iranian social media users have reported receiving similar messages in recent weeks, warning them to stay away from the scene of protests or from associating with “anti-revolutionary” opponents of the government online.Armed with a list of offending phone numbers, SIAM would make it easy for the Iranian government to rapidly drill down to the individual level and pull a vast amount of personal information about a given mobile customer, including where they’ve been and with whom they’ve communicated. According to the manuals, user data accessible through SIAM includes the customer’s father’s name, birth certificate number, nationality, address, employer, billing information, and location history, including a record of Wi-Fi networks and IP addresses from which the user has connected to the internet.While much of Iran’s surveillance capacity remains shrouded in mystery, details about the SIAM program contained in the Ariantel archive provide a critical window into the types of tools the Iranian government has at its disposal to monitor and control the internet, as it confronts what may be the greatest threat to its rule in decades.“These documents prove something that we have long suspected, which is that even devices that use encryption for messaging are still vulnerable because of the nature of internet infrastructure in Iran,” said Mahsa Alimardani, a senior researcher with the internet freedom organization Article 19. “Security measures like two-factor identification using text messages still depend on telecommunications companies connected to the state. Average internet users are forced to connect through nodes controlled by these companies, and their centralization of authority with the government makes users vulnerable to insidious types of surveillance and control.”\n\n\nPeople gather during a protest for Mahsa Amini, who died after being arrested by morality police for allegedly not complying with strict dress code, in Tehran, Iran, on Sept. 19, 2022.\nPhoto: Stringer/Anadolu Agency via Getty Images\nThe latest round of protests in Iran kicked off in mid-September, after a young woman named Mahsa Jina Amini was killed while in the custody of the country’s notorious morality police, following her arrest for wearing her mandatory head covering improperly. While the movement originated with women opposing the brutality of hijab enforcement, anti-government outrage quickly spread among Iran’s youth, from universities to secondary schools across the country. The government’s crackdown took a variety of shapes, including brute force, with security services in riot gear squaring off with demonstrators in the street and a quieter effort to shut down civilian communications.People gather during a protest for Mahsa Amini, who died after being arrested by morality police for allegedly not complying with strict dress code, in Tehran, Iran, on Sept. 19, 2022.The Iranian government has long viewed internet freedom as a national security issue and has taken steps to securitize Iranians’ online access. As in the United States, where the National Security Agency has used government secrecy and legal coercion to turn the telecom and data sectors into intelligence-gathering tools, the Iranian state compels communications networks to give the government access through required hardware and software. In Iran, where the autocratic reach of central government leadership touches nearly every aspect of the state without even superficial democratic oversight, the powers afforded by this integration are far greater and far more draconian in consequence.Part of this effort has included directly assigning Iranian intelligence personnel to government bodies tasked with internet regulation, like the CRA. The Article 19 report notes the close personnel relationship between the CRA’s OSCS division and Iran’s Ministry of Intelligence.Though Iranians have complained of slowed data connections and total internet blackouts at times, the telecom crackdown has consequences beyond losing one’s connection. Demonstrators have reported visits from government authorities at their homes, where the agents were armed with specific knowledge of their whereabouts and activities, such as when they were using their phones to record video.While some of what SIAM does is benign and required for administrating any cellular network, Miller, the Citizen Lab researcher, explained that the scope of the system and the Iranian government’s access to it is not. While most countries allow law enforcement and security agencies to legally obtain, intercept, and analyze cellular communications, the surveillance and control powers afforded by SIAM are notable in their scale and degree, said Miller: “The requests by CRA go well beyond traditional lawful intercept requirements, at least in non-repressive countries.”SIAM allows its operators to learn a great deal not just about where a customer has been, but also what they’ve been up to, a bounty of personal data that, Miller said, “can enable CRA to create a social network/profile of the user based on his/her communication with other people.”By entering a particular phone number and the command “GetCDR” into SIAM, a system user can generate a comprehensive Call Detail Record, including the date, time, duration, location, and recipients of a customer’s phone calls during a given time period. A similar rundown can be conducted for internet usage as well using the “GetIPDR” command, which prompts SIAM to list the websites and other IP addresses a customer has connected to, the time and date these connections took place, the customer’s location, and potentially the apps they opened. Such a detailed record of internet usage could also reveal users running virtual private networks, which are used to cover a person’s internet trail by routing their traffic through an encrypted connection to an outside server. VPNs — including some banned by the government — have become tremendously popular in Iran as a means of evading domestic web censorship.Though significantly less subtle than being forced onto a 2G network, SIAM can also be used to entirely pull the plug on a customer’s device at will. Through the “ApplySuspIp” command, the system can entirely disconnect any mobile phone on the network from the internet for predetermined lengths of time or permanently. Similar commands would let SIAM block a user from placing or receiving calls.Rashidi, the internet security expert, said participants in the recent demonstrations, as well as Iranians living near scenes of protest, have reported internet shutdowns targeting their mobile devices that have downgraded phones to 2G access, particularly during the late afternoons and evenings when many demonstrations occur.Rashidi said the widespread use of VPNs in Iran represents another vulnerability the SIAM system could exploit. The program makes it possible to check particular IP addresses against particular VPNs and thereby deduce the identities and locations of the users accessing them. “The government can easily identify IP addresses in use by a particular VPN provider, pass the addresses to this location function, and then see where the people are who are using this VPN,” said Rashidi.Although the documents don’t mention SIAM’s use against protesters or any other specific target, Miller said the functionality matches what he’s observed in this and other digital crackdowns in Iran. “CRA has defined rules and regulations to provide direct access to mobile operators’ system, and SIAM is a means to this end,” he said. “If all telecom operators in Iran are required to provide the CRA with SIAM or similar direct access, they could, in effect have complete control over all user mobile communications throughout the country. Controlling user communications is a massive violation of basic and fundamental human rights.”Simona FoltynIsrael’s war on Gaza unites Hezbollah, Hamas, the Syrian government, the Houthis in Yemen, and armed groups in Iraq and Syria.\n              Intercepted Podcast            InterceptedA look back at the wars on Palestine, from 1948 to today.Natasha LennardThe article on the Gaza war and the Nakba was commissioned, edited, fact checked, and prepared for publication — but was then blocked amid a climate of fear.\n            © The Intercept. All rights reserved          "
   },
   {
      "time": "2022-10-31",
      "title": "Latvia’s cyberspace faces new challenges amid war in Ukraine",
      "text": " Russian cyberattacks may be a global threat, but Ukraine's allies have been especially at risk. Among them is Latvia, which was one of the first to declare Russia a \"state sponsor of terrorism” and stopped issuing entry visas to Russian citizens in August.Before Russia invaded Ukraine in late February, most cyberattacks targeting Latvian organizations were financially motivated, but now the country’s cybersecurity agencies have to deal with more serious threats — pro-Russian hacktivists and nation-state hackers targeting the government, critical infrastructure, and private businesses. Since the beginning of the war in Ukraine, the number of cyberattacks in Latvia has increased by more than 30%, Varis Teivans, the deputy manager of Latvia’s Computer Emergency Readiness Team (CERT), told The Record. What hackers are actually achieving, however, is less clear. Cyberattacks by pro-Kremlin hacktivist groups like Killnet usually achieve nothing more than publicity, although Teivans does admit the activity of state-backed hackers is “a cause for concern.” The Record visited Teivans at CERT's office in the Latvian capital of Riga this month to talk about the new challenges Russia’s war with Ukraine poses for Baltic cyberspace.The cyberattacks that attract the most media attention in Latvia are usually carried out by pro-Kremlin hacktivists, including Killnet and its affiliates (like XakNet and FuckNet), according to Teivans. They usually conduct distributed denial-of-service (DDoS) attacks, flooding websites with junk traffic to knock them offline, or post threatening messages on the main page of the websites, in what’s known as defacement attacks.Most of these are successfully countered by Latvian cybersecurity specialists, and those that hit the targets have no lasting impact, according to Teivans.Hacktivists often attack in response to specific events, according to Teivans — Latvia designated Russia a “state sponsor of terrorism” shortly before the DDoS attack on the parliament website.In July, pro-Kremlin hacktivists attacked Latvian computer systems almost daily, outraged by the Latvian government's decision to demolish nearly 300 Soviet monuments.\"What they've achieved was to disrupt some of the public transport ticketing services,” and a charity that collects donations for people in need, Teivans said. “This is a very bad performance.”According to Teivans, Russian hacktivists have a \"poor understanding\" of what they are targeting. Once, they attacked the website of a now-closed Latvian airport, and mistakenly hacked the Latvian agency responsible for parks and recreation, confusing it with the Ministry of the Interior.“Russian hacktivists are a PR project, not talented hackers,” Teivans said. “Every time they claim to have hacked some of our websites and leaked information, it’s a lie, sometimes a very pathetic one.”FuckNet, for example, once claimed to have hacked the website of President Egils Levits and stolen data, which, it turned out, was publicly-available procurement information. There are, however, more sophisticated cyber operations conducted by capable Russian hackers — the so-called advanced persistent threat (APT) groups. \"These are the attacks we are most concerned about,\" Teivans said.Among APT’s most common targets are state services, critical infrastructure facilities, and businesses that work with the government. “Private businesses are compromised to gain access to more secure government networks,” Teivans said.The same hacker groups that have targeted Ukraine have tried to compromise Latvia's telecommunication and energy infrastructure, Teivans added, though he said he couldn’t disclose the names of the groups or the impact these attacks had due to security reasons.In September, the Ukrainian government warned that Russia plans to increase the intensity of DDoS attacks on the critical infrastructure of Ukraine’s closest allies, including the Baltic countries.Carefully-planned cyberattacks on the right targets could increase the effect of missile strikes on electrical supply facilities, according to Ukrainian intelligence. Teivans agreed that Russian hackers could intensify their attacks on Europe's energy sector and some critical infrastructure. In fact, they may have been preparing for these attacks for months.“APT operations are not opportunistic,” Teivans said. “Nation-state hackers usually ‘sit’ in critical networks for a while, waiting for a perfect moment to attack.”Latvia was a common target for Russian hackers even before the start of the war in Ukraine, said Teivans, who has worked at CERT since its inception in 2007.With the beginning of the war in Ukraine, Estonia and Lithuania were also increasingly attacked by Russian hackers.Like its Baltic neighbors, Latvia was formerly part of the Soviet Union and still has a large Russian-speaking minority.  But its government actively supported Ukraine in the war against Russia, sending weapons, sheltering Ukrainian refugees and supporting sanctions against the Kremlin. Since extending that support, the number of cyberattacks on Latvia has increased significantly. To counter these threats, the country has two CERTs — one responsible for Latvia's cyberspace with a focus on government computer systems and critical infrastructure, and the other for the protection of military networks.Both of them are subordinate to Latvia's Ministry of Defense, which Teivans says is a big advantage. \"The MOD is committed to cybersecurity and heavily supports it legislatively and with funding,\" he said.Although Latvia is preparing for Russian attacks, Teivans doesn’t think that they will be struck in the same way as Ukrainian targets.“We are still at a stage where kinetic warfare is a priority for the attacking nation, while cyber is only a tool for threat actors to gain some economic and political advantage or a means to support kinetic operations,” he told The Record.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-31",
      "title": "Largest EU copper producer Aurubis suffers cyberattack, IT outage",
      "text": " German copper producer Aurubis has announced that it suffered a cyberattack that forced it to shut down IT systems to prevent the attack's spread.Aurubis is Europe's largest copper producer and the second largest in the world, with 6,900 employees worldwide, and produces one million tonnes of copper cathodes yearly.In an announcement published on their website, Aurubis says they shut down various systems at their locations but that it has not impacted production.At this time, the company is still assessing the impact of the cyberattack, and is working closely with the authorities to speed up the process.The priority now is to maintain the production volumes at normal levels and keep the raw material supply and the delivery of finished goods unruffled.For this reason, some operations have turned to manual mode to keep the flow of incoming and outgoing goods adequate for as long as required until computer-assisted automation returns at the smelters.Aurubis states that it's impossible to estimate how long it will take for all its systems to return to normal operations.Until that happens, there's a plan to establish transitional solutions that will give the company and its customers an alternative communication channel. For now, the only way to reach Aurubis is via the phone.While all the above carry the typical signs of a ransomware attack, Aurubis has not provided any details on its cyberattack.However, Aurubis states that the attack \"part of a larger attack on the metals and mining industry.\"BleepingComputer has contacted the company to learn more about the incident, and we will update this post as soon as we receive a response."
   }
]