[
   {
      "time": "2022-08-22",
      "title": "Spanish Banking Trojan Attacks Various Industry Verticals - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-08-22",
      "title": "An encrypted ZIP file can have two correct passwords — here's why",
      "text": " Password-protected ZIP archives are common means of compressing and sharing sets of files—from sensitive documents to malware samples to even malicious files (i.e. phishing \"invoices\" in emails).But, did you know it is possible for an encrypted ZIP file to have two correct passwords, with both producing the same outcome when the ZIP is extracted?In fact, using the different password resulted in successful extraction of the ZIP, with original contents intact:While the ZIP was encrypted with the longer password, using either password extracted the archive successfully.Twitter user Unblvr seems to have figured out the mystery:ZIP uses PBKDF2, which hashes the input if it's too big. That hash (as raw bytes) becomes the actual password. Try to hash the first password with SHA1 and decode the hexdigest to ASCII... :)Instead of the user's chosen password (in this case \"Nev1r-G0nna-G2ve-...\") this newly calculated hash becomes the actual password to the file.When the user attempts to extract the file, and enters a password that is longer than 64 bytes (\"Nev1r-G0nna-G2ve-... \"), the user's input will once again be hashed by the ZIP application and compared against the correct password (which is now itself a hash). A match would lead to a successful file extraction.SHA-1 checksum of \"Nev1r-G0nna-G2ve-...\" = 706b4838613041714e62486364773847726d5370.Note, however, that when encrypting or decrypting a file, the hashing process only occurs if the length of the password is greater than 64 characters.In other words, shorter passwords will not be hashed at either stage of compressing or decompressing the ZIP.This is why when picking the long \"Nev1r-G0nna-G2ve-... \" string as the password at the encryption stage, the actual password being set by the ZIP program is effectively the (SHA1) hash of this string.At the decryption stage, if you were to enter \"Nev1r-G0nna-G2ve-...,\" it will be hashed and compared against the previously stored password (which is the SHA1 hash). However, entering the shorter \"pkH8a0AqNbHcdw8GrmSp\" password at the decryption stage will have the application directly compare this value to the stored password (which is, again the SHA1 hash).\"PBKDF2 has an interesting property when using HMAC as its pseudo-random function. It is possible to trivially construct any number of different password pairs with collisions within each pair,\" notes the entry.\"If a supplied password is longer than the block size of the underlying HMAC hash function, the password is first pre-hashed into a digest, and that digest is instead used as the password.\"But, the fact that there are now two possible passwords to the same ZIP does not represent a security vulnerability, \"as one still must know the original password in order to generate the hash of the password,\" the entry further explains.An interesting key aspect to note here is, ASCII representations of every SHA-1 hash need not be alphanumeric.In other words, let's assume we had chosen the following password for our ZIP file during this experiment. The password is longer than 64 bytes:Its SHA-1 checksum comes out to be: bd0b8c7ab2bf5934574474fb403e3c0a7e789b61And the ASCII representation of this checksum looks like a gibberish set of bytes—not nearly elegant as the alternative password generated by the researcher for his experiment:BleepingComputer asked Sharoglazov how was he able to pick a password whose SHA-1 checksum would be such that its ASCII representation yields a clean, alphanumeric string.\"That's why hashcat was used,\" the researcher tells BleepingComputer.\"I tested Nev0r, Nev1r, Nev2r and so on... And I found the password I need.\"And, that's how Sharoglazov arrived at a password that roughly reads like \"Never Gonna Give You Up...,\" but the ASCII representation of its SHA-1 checksum is one neat alphanumeric string.For most users, creating a password-protected ZIP file with a choice of their password should be sufficient and that is all they would need to know.But should you decide to get adventurous, this experiment provides a peek into one of the many mysteries surrounding encrypted ZIPs, like having two passwords to your guarded secret."
   },
   {
      "time": "2022-08-22",
      "title": "Hackers target hotel and travel companies with fake reservations",
      "text": " A hacker tracked as TA558 has upped their activity this year, running phishing campaigns that target multiple hotels and firms in the hospitality and travel space.The threat actor uses a set of 15 distinct malware families, usually remote access trojans (RATs), to gain access to the target systems, perform surveillance, steal key data, and eventually siphon money from customers.In 2022, TA558 switched from using macro-laced documents in its phishing emails and adopted RAR and ISO file attachments or embedded URLs in the messages.The phishing emails that initiate the infection chain are written in English, Spanish, and Portuguese, targeting companies in North America, Western Europe, and Latin America.The email topics revolve around making a booking on the target organization, pretending to come from conference organizers, tourist office agents, and other sources that the recipients can't easily dismiss.Victims who click on the URL in the message body, which is purported to be a reservation link, will receive an ISO file from a remote resource.The archive contains a batch file that launches a PowerShell script which eventually drops the RAT payload onto the victim's computer and creates a scheduled task for persistence.In most of the cases Proofpoint observed this year, the payload was AsyncRAT or Loda, while Revenge RAT, XtremeRAT, CaptureTela, and BluStealer were also deployed on a smaller scale.For example, one 2022 campaign used QuickBooks invoice lures instead of room reservations and dropped Revenge RAT exclusively.Having compromised hotel systems with RAT malware, TA558 moves deeper into the network to steal customer data, stored credit card details, and modify the client-facing websites to divert reservation payments.While the involvement of TA558, in that case, wasn't proven, it matches the threat actor's TTPs and targeting scope and at least gives an example of how they could monetize their access to hotel systems.Other ways for TA558 to make money would be to sell or use the stolen credit card details, sell client PII, blackmail high-interest individuals, or sell access to the compromised hotel's network to ransomware gangs."
   },
   {
      "time": "2022-08-22",
      "title": "Hackers steal crypto from Bitcoin ATMs by exploiting zero-day bug",
      "text": " Hackers have exploited a zero-day vulnerability in General Bytes Bitcoin ATM servers to steal cryptocurrency from customers.When customers would deposit or purchase cryptocurrency via the ATM, the funds would instead be siphoned off by the hackersGeneral Bytes is the manufacturer of Bitcoin ATMs that, depending on the product, allow people to purchase or sell over 40 different cryptocurrencies.Yesterday, BleepingComputer was contacted by a General Bytes customer who told us that hackers were stealing bitcoin from their ATMs.According to a General Bytes security advisory published on August 18th, the attacks were conducted using a zero-day vulnerability in the company's Crypto Application Server (CAS).\"The attacker was able to create an admin user remotely via CAS administrative interface via a URL call on the page that is used for the default installation on the server and creating the first administration user,\" reads the General Bytes advisory.\"This vulnerability has been present in CAS software since version 20201208.\"General Bytes believes that the threat actors scanned the internet for exposed servers running on TCP ports 7777 or 443, including servers hosted at Digital Ocean and General Bytes' own cloud service.The threat actors then exploited the bug to add a default admin user named 'gb' to the CAS and modified the 'buy' and 'sell' crypto settings and 'invalid payment address' to use a cryptocurrency wallet under the hacker's control.Once the threat actos modified these settings, any cryptocurrency received by CAS was forwarded to the hackers instead.\"Two-way ATMs started to forward coins to the attacker's wallet when customers sent coins to ATM,\" explains the security advisory.General Bytes is warning customers not to operate their Bitcoin ATMs until they have applied two server patch releases, 20220531.38 and 20220725.22, on their servers.It is important to remember that the threat actors would not have been able to perform these attacks if the servers were firewalled only to allow connections from trusted IP addresses.According to information provided by BinaryEdge, there are currently eighteen General Bytes Crypto Application Servers still exposed to the Internet, with the majority located in Canada.It is unclear how many servers were breached using this vulnerability and how much cryptocurrency was stolen.BleepingComputer contacted General Bytes yesterday with further questions about the attack but did not receive a response. "
   },
   {
      "time": "2022-08-22",
      "title": "Lazarus Attacks Apple's M1 Chip, Lures Victims Via Fake Job Offers  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " Advanced Persistent Threat (APT) Lazarus linked to North Korea is increasing its attack base with current operation In(ter)caption campaign, which targets Macs with M1 chip of Apple. The state-sponsored group continues to launch phishing attacks under the disguise of fake job opportunities. Threat experts at ESET (endpoint detection provider) alerted this week that they found a Mac executable disguised as a job details for an engineering manager position at the famous cryptocurrency exchange operator Coinbase. ESET's warning on twitter says that Lazarus posted the fake job offer to Virus total from Brazil. \"The ongoing campaign and others from North Korea remain frustrating for government officials. The FBI blamed Lazarus for stealing $625 million in cryptocurrency from Ronin Network, which operates a blockchain platform for the popular NFT game Axie Infinity,\" reports DarkReadingLazarus made the latest rebuild of the malware, Interception.dll, to deploy on Macs via loading three files- FinderFontsUpdater.app and safarifontsagent, fake Coinbase job offers and two executables. The binary can exploit Macs packed with Intel processors and with Apple's new M1 chipset. ESET experts began researching Operation In(ter)ception around three years back when the experts found attacks against military and aerospace companies. They observed that the operation's main goal was surveillance, but it also found incidents of the threat actors using a target's email account through a business email compromise (BEC) to finalize the operation. The interception.dll malware posts fake job offers to bait innocent victims, usually via LinkedIn. The Mac attack is the most recent one in a continuing aggressive front by Lazarus group to promote operation In(ter)ception, which has aggravated recently. ESET released a detailed white paper on the technique incorporated by Lazarus in 2020. It's an irony that the fake Coinbase job posting targets technically oriented people. The experts think that the threat actors were in direct contact, which means the victim was prompted to open whatever pop-up windows showed up on the screen to see the \"dream job\" offer from Coinbase. Apple revoked the certificate that would enable the malware to execute late last week after ESET alerted the company of the campaign. So now, computers with macOS Catalina v10.15 or later are protected, presuming the user has basic security awareness, saysPeter Kalnai, a senior malware researcher for ESET.your nameYour Emailyour message"
   },
   {
      "time": "2022-08-22",
      "title": "Russia's 'Oculus' to use AI to scan sites for banned information",
      "text": " Russia’s internet watchdog Roskomnadzor is developing a neural network that will use artificial intelligence to scan websites for prohibited information.Called “Oculus,” the automatic scanner will analyze URLs, images, videos, and chats on websites, forums, social media, and even chat/messenger channels to locate material that should be redacted or taken down.Examples of information targeted by Oculus include homosexuality “propaganda,” instructions on manufacturing weapons or drugs, and misinformation that discredits official state and army sources.The system will also look for calls of mass protests, expressions of disrespect for the state, and even “signs” of extremism and terrorism.The real-time scanning capacity of Oculus will be 200,000 images per day, or about 2.3 images per second, for which the vendor, Eksikyushn RDC LLC, will use 48 servers with powerful GPUs.Oculus will be integrated onto the Unified Analysis Module, a network of monitoring systems currently under development, aiming to give the government a firm grip on controlling information flow.However, experts in the field comment that this amount is unlikely to cover the cost of developing such an aspiring project, and it’s likely that Roskomnadzor will have to allocate additional funds along the way.Moreover, training the machine learning algorithm for such a complex task in just four months is a very tight time frame, and the result isn’t expected to have detection accuracy above 90%.This means that Oculus is likely to raise many false flags in the first months of its operation, which could put Russian internet users at risk of unfair prosecution.That said, having an imperfect “all-seeing eye” putting innocent people in immense legal trouble is quite intimidating for all internet users in the country.The natural result of introducing Oculus will be for users to either give up taking part in online discussions or use anonymization tools like VPNs, the Tor network, and chat apps that don’t require PII when registering and don’t log user data."
   },
   {
      "time": "2022-08-22",
      "title": "New tool checks if a mobile app's browser is a privacy risk",
      "text": " A new online tool named 'InAppBrowser' lets you analyze the behavior of in-app browsers embedded within mobile apps and determine if they inject privacy-threatening JavaScript into websites you visit.The potential of these injections includes accessing browsing history, logging behavior characteristics to derive interests, log taps and key presses, monitoring screenshot actions, and even capturing passwords you enter into login forms.To find if an app demonstrates potentially suspicious behavior, open the tool's website (inappbrowser.com) through the app's built-in browser.For social media apps, post the link to https://InAppBrowser.com publicly and try to open it with the in-app browser. For messenger apps, send the link to yourself via DM and open it through the app's browser.These simple steps are enough to generate a report on JavaScript injections added to the websites by the app's browser. However, it is essential to clarify that reports of no detections don't mean that code injection can be excluded with certainty.Similarly, reports of code injection don't necessarily mean that the app is performing tracking activities but merely that the potential for abuse is present.\"Just because an app injects JavaScript into external websites doesn't mean the app is doing anything malicious.\" clarifies the report.\"There is no way for us to know the full details on what kind of data each in-app browser collects, or how or if the data is being transferred or used.\"Further tests by BleepingComputer also showed that you could use the tool to find risky code injections created by extensions in desktop browsers.When testing the tool with Chrome extensions installed, like the Phantom or Metamask cryptocurrency wallets, the InAppBrowser site detected various privacy-related code injections, shown below.The last alert in red in the image above was caused by the Phantom extension and not by MetaMask.Furthermore, browser extensions work by injecting JavaScript into websites you visit, so detections for many extensions would not be unusual. However, our tests showed that many extensions did not generate any warnings with the tool.As the tool was not designed to analyze browser extensions, BleepingComputer reached out to Krause to learn if these results were reliable.The researcher claims to have found risky behavior on TikTok, Instagram, Facebook, and Messenger, while Snapchat and Robinhood came out clean in the tests.For TikTok in particular, Krause found scripts that monitor keyboard input and screen taps. While there is no indication that TikTok abuses this ability, the researcher warns that it could be abused to gather sensitive information like passwords and credit card inputs.A TikTok spokesperson shared the following statement with Bleeping Computer stating that they do not use these scripts to collect keystroke or text inputs.\"The report's conclusions about TikTok are incorrect and misleading.The researcher specifically says the JavaScript code does not mean our app is doing anything malicious, and admits they have no way to know what kind of data our in-app browser collects.Contrary to the report's claims, we do not collect keystroke or text inputs through this code, which is solely used for debugging, troubleshooting, and performance monitoring.\" - TikTok.Hence, TikTok admits that the code is there but underscores that it's used solely to improve the user experience, not to track or breach users' privacy.Additionally, TikTok told Bleeping Computer that it does not track users everywhere they go on the web, but the company may receive limited data from advertisers about what its users do on third-party apps and websites for providing effective advertising solutions.Bleeping Computer has also requested a comment from Facebook/Meta on the reported findings, but we have not received a response yet."
   },
   {
      "time": "2022-08-22",
      "title": "Russian APT29 hackers abuse Azure services to hack Microsoft 365 users",
      "text": " The state-backed Russian cyberespionage group Cozy Bear has been particularly prolific in 2022, targeting Microsoft 365 accounts in NATO countries and attempting to access foreign policy information.Microsoft 365 is a cloud-based productivity suite predominately used by business and enterprise entities, facilitating collaboration, communication, data storage, email, office, and more.Mandiant, who has been tracking the activities of Cozy Bear (aka APT29 and Nobelium), reports that the Russian hackers have been vigorously targeting Microsoft 365 accounts in espionage campaigns.The researchers warn that the Russian group continues to demonstrate exceptional operational security to prevent analysts from discovering and exposing their attack methods.Microsoft 365 users on a higher-grade E5 license enjoy a security feature named \"Purview Audit\" (formerly Advanced Audit). When enabled, this feature logs user agents, IP addresses, timestamps, and usernames each time an email is accessed independently of the program (Outlook, browser, Graph API).Stealthy network intruders like APT29 would rather not have their movements traced and logged. So to evade audits on compromised accounts, the hackers disable the Purview Audit feature on a targeted user before they even touch their mail folders.\"It is the only way to effectively determine access to a particular mailbox when the threat actor is using techniques like Application Impersonation or the Graph API.\"Mandiant's second interesting finding is APT29 taking advantage of the self-enrollment process for multi-factor authentication (MFA) in Azure Active Directory (AD).When users attempt to log in to a domain with self-enrollment policies for the first time, Windows will prompt them to enable MFA on the account.The Russian hackers performed brute force attacks on usernames and passwords of accounts that had never logged into the domain and enrolled their devices in MFA.Activating MFA fulfills the relevant security prerequisite for using the compromised organization's VPN infrastructure, so APT29 is free to roam on the breached network.Finally, Mandiant observed the threat group using Azure Virtual Machines via compromised accounts or by purchasing the service to hide their trace.Azure VMs \"contaminate\" logs with Microsoft IP addresses, and since Microsoft 365 runs on Azure, it is tough for defenders to discern regular traffic from malicious actions.APT29 further obfuscates its Azure AD admin activity by mixing malicious actions like backdooring services to collect emails with the addition of benign Application Address URLs.APT29 is one of Russia's most skillful hacking groups, and Mandiant's recent findings underscore its high level of preparation and deep knowledge of the functions of targeted software."
   },
   {
      "time": "2022-08-22",
      "title": "DoNot Team Hackers Updated its Malware Toolkit with Improved Capabilities",
      "text": " The Donot Team threat actor has updated its Jaca Windows malware toolkit with improved capabilities, including a revamped stealer module designed to plunder information from Google Chrome and Mozilla Firefox browsers.Also known as APT-C-35 and Viceroy Tiger, the Donot Team is known for setting its sights on defense, diplomatic, government, and military entities in India, Pakistan, Sri Lanka, and Bangladesh, among others at least since 2016.Spear-phishing campaigns containing malicious Microsoft Office documents are the preferred delivery pathway for malware, followed by taking advantage of macros and other known vulnerabilities in the productivity software to launch the backdoor.This entails the use of RTF documents that trick users into enabling macros, resulting in the execution of a piece of shellcode injected into memory that, in turn, is orchestrated to download a second-stage shellcode from its command-and-control (C2) server.The second-stage then acts as a channel to retrieve a DLL file (\"pgixedfxglmjirdc.dll\") from another remote server, which kick-starts the actual infection by beaconing system information to the C2 server, establishing persistence via a Scheduled Task, and fetching the next-stage DLL (\"WavemsMp.dll\"). \"The main purpose of this stage is to download and execute the modules used to steal the user's information,\" the researchers noted. \"To understand which modules are used in the current infection, the malware communicates with another C2 server.\"The C2 domain, for its part, is obtained by accessing an embedded link that points to a Google Drive document, allowing the malware to access a configuration that dictates the modules to be downloaded and executed.These modules expand on the malware's features and harvest a wide range of data such as keystrokes, screenshots, files, and information stored in web browsers. Also part of the toolset is a reverse shell module that grants the actor remote access to the victim machine.The development is yet another sign that threat actors are actively adapting their tactics and techniques that are most effective in gaining initial infection and maintaining remote access for extended periods of time.\"Defending against APTs like the Donot team requires a Defense-in-Depth strategy that uses multiple layers of security to ensure redundancy if any given layers are breached,\" the researchers said.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-08-22",
      "title": "\r\n\tEstonia Repels Biggest Cyber-Attack Since 2007 - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineThe Estonian government has revealed that the country was on the receiving end of the “most extensive” DDoS attacks in 15 years this week after angering Moscow.“The attacks were ineffective. E-Estonia is up and running. Services were not disrupted. With some brief and minor exceptions, websites remained fully available throughout the day. The attack has gone largely unnoticed in Estonia,” he said. “As Government CIO, I slept well.”Interestingly, reports suggest that the DDoS attempts came alongside a fake news blitz from Russian media suggesting Soviet war graves were being destroyed by the Estonian government. This apparently resulted in rioting by ethnic Russians in the country.However, the incident also spurred the government to double down on cybersecurity, and now it is regarded as having one of the strongest defensive postures of any global government."
   }
]