[
   {
      "time": "2022-09-05",
      "title": "Anonymous Attacks Russian Taxi Company, Causes Traffic Jam - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " Russia has been one of the main targets of hackers since the country launched a war against Ukraine. The most recent attack was targeted against Yandex Taxi, a ride hailing service. The news first came out on reddit.com. Yandex Taxi belongs to Yandex, Russia's leading IT corporation, also known as Russian Google. One should note that the EU sanctioned the company's co-founder Arkady Volozh for “de-ranking and removing,” any info related to Russian attacks against Ukraine.Once Yandex Taxi app was hacked, the anonymous threat actors made a massive traffic jam in Moscow, Russia. On 1st September 2022, the drivers complained after they saw an unusual gathering of Taxis in Moscow's western area. It happened because the hackers booked all the available taxis to a same address, and a massive traffic jam happened as various Yandex Taxi drivers got stuck due to being trapped in a particular location. The cabs were directed towards Kutuzovsky Prospekt, one of the main avenues in Moscow, it is also famous for the Stalinist-era building known as Hotel Ukraina (Hotel Ukraine).The traffic jam was there for three hours. Yandex's security team immediately looked into the issue and promised to better the algorithm to avoid such incidents from happening again in the future. The online hacktivist group Anonymous claims responsibility for the attack. Someone compromised the Yandex app and did a frustrating mix-up of taxis. The hackers avoided the company's security mechanisms and made multiple fake orders, directing all the drivers to a single location. In a similar incident that happened last year, Yandex in its blog post said:\"This is just one of many attacks aimed not only at Yandex but also at many other companies in the world. The attacks have been going on for several weeks, their scale is unprecedented, and their source is a new botnet about which little is known so far.\"your nameYour Emailyour message"
   },
   {
      "time": "2022-09-05",
      "title": "Державна служба спеціального зв’язку та захисту інформації України",
      "text": " "
   },
   {
      "time": "2022-09-05",
      "title": "Feds, npm Issue Supply Chain Security Alert to Avoid Another SolarWinds - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-09-05",
      "title": "SharkBot malware sneaks back on Google Play to steal your logins",
      "text": " A new and upgraded version of the SharkBot malware has returned to Google's Play Store, targeting banking logins of Android users through apps that have tens of thousands of installations.The malware was present in two Android apps that did not feature any malicious code when submitted to Google's automatic review.However, SharkBot is added in an update occurring after the user installs and launches the dropper apps.According to a blog post by Fox IT, part of the NCC Group, the two malicious apps are “Mister Phone Cleaner” and “Kylhavy Mobile Security,” collectively counting  60,000 installations.The two applications have been removed from Google Play, but users who installed them are still at risk and should remove them manually.At that time, the malware could perform overlay attacks, steal data through keylogging, intercept SMS messages, or give threat actors complete remote control of the host device by abusing the Accessibility Services.Researchers at Fox IT discovered a new version of the malware (2.25) on August 22, which adds the capability to steal cookies from bank account logins.Additionally, the new dropper apps don’t abuse the Accessibility Services as they did before.“The dropper instead will make a request to the C2 server to directly receive the APK file of Sharkbot. It won’t receive a download link alongside the steps to install the malware using the ‘Automatic Transfer Systems’ (ATS) features, which it normally did,” Fox IT says.Once installed the dropper app contacts the command and control (C2) server requesting the malicious SharkBot APK file. The dropper then alerts the user that an update is available and asks them to install the APK and grant all required permissions.To make automated detection more difficult, SharkBot stores its hard-coded configuration in encrypted form using the RC4 algorithm.The overlay, SMS intercept, remote control, and keylogging systems are still present on SharkBot 2.25, but a cookie logger has been added on top of them.When the victim logs into their bank account, SharkBot snatches their valid session cookie using a new command (“logsCookie”) and sends it to the C2.Cookies are valuable for taking over accounts because they contain software and location parameters that help bypass fingerprinting checks or, in some cases, the user authentication token itself.During the investigation, Fox IT's observed new SharkBot campaigns in Europe (Spain, Austria, Germany, Poland, Austria) and the U.S. The researchers noticed that the malware uses in these attacks the keylogging feature and steals the sensitive info straight from the official app it targets.With an improved version of the malware available, Fox IT expects SharkBot campaigns to continue and an evolution of the malware."
   },
   {
      "time": "2022-09-05",
      "title": "Samsung Announces Second Customer Data Breach  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-09-05",
      "title": "IRS data leak exposes personal info of 120,000 taxpayers",
      "text": " The Internal Revenue Service has accidentally leaked confidential information for approximately 120,000 taxpayers who filed a form 990-T as part of their tax returns.IRS Form 990T is used to report 'unrelated business income' paid to a tax-exempt entity, such as nonprofits (charities) or IRA and SEP retirement accounts.This income is commonly derived from sales unrelated to a nonprofit's core purpose or real estate investments that pay income into an individual retirement account.For regular taxpayers, these forms are meant to be confidential and seen only by the IRS. However, for nonprofits, a Form 990-T must be available for public inspection for three years.On Friday, the IRS disclosed that in addition to sharing Form 990-T data for charities, they also accidentally included data for taxpayers' IRAs that was not meant to be public. \"This section is primarily used by those with the ability to use machine-readable data; other more widely used sections of TEOS are unaffected.\"According to the Wall Street Journal, an IRS research employee discovered the data leak, which triggered a report to Congress on Friday.The IRS states that the data has been removed and that they will send notifications to affected taxpayers in the coming weeks."
   },
   {
      "time": "2022-09-05",
      "title": "Malware dev open-sources CodeRAT after being exposed",
      "text": " The source code of a remote access trojan (RAT) dubbed 'CodeRAT' has been leaked on GitHub after malware analysts confronted the developer about attacks that used the tool.The exploit downloads and executes CodeRAT from the threat actor's GitHub repository, giving the remote operator a broad range of post-infection capabilities.More specifically, CodeRAT supports about 50 commands and comes with extensive monitoring capabilities targeting webmail, Microsoft Office documents, databases, social network platforms, integrated development environment (IDEs) for Windows Android, and even individual websites like PayPal.To communicate with its operator and to exfiltrate stolen data, CodeRAT uses a Telegram-based mechanism that relies on a public anonymous file upload API instead of the more common command and control server infrastructure.Although the campaign stopped abruptly when the researchers contacted the malware developer, CodeRAT is likely to become more prevalent now that its author made the source code public,The malware supports  around 50 commands that include taking screenshots, copying clipboard content, getting a list of running processes, terminating processes, checking GPU usage, downloading, uploading, deleting files, executing programs.The attacker can generate the commands through a UI tool that builds and obfuscates them and then uses one of the following three methods to transmit them to the malware:The same three methods can also be used for data exfiltration, including single files, entire folders, or targeting specific file extensions.If the victim's country has banned Telegram, CodeRAT offers an anti-filter functionality that establishes a separate request routing channel that can help bypass the blocks.The author also claims that the malware can persist between reboots without making any changes to the Windows registry, but SafeBreach doesn't provide any details about this feature.CodeRAT comes with strong capabilities that are likely to attract other cybercriminals. Malware developers are always looking for malware code that can be easily turned into a new \"product\" that would increase their profits."
   },
   {
      "time": "2022-09-05",
      "title": "Damart clothing store hit by Hive ransomware, $2 million demanded",
      "text": " Damart, a French clothing company with over 130 stores across the world, is being extorted for $2 million after a cyberattack from the Hive ransomware gang.Some of the company's systems have been encrypted and operations have been disrupted since August 15.The threat actors haven't posted the victim on their extortion site, opting to keep negotiations private.Marchive shared additional information with BleepingComputer, which helped us confirm the attack and extortion.Damart has not engaged in negotiations with the cybercriminals yet but informed the national police of the incident, which makes it unlikely that Hive would receive a payment.The first signs of trouble appeared on August 15, when Damart published a message about an unscheduled maintenance on the homepage of its online store.At that time, following a request for comment from BleepingComputer, Damart stated the following:\"Damart, the mail order clothing brand, based in Bingley, West Yorkshire, has confirmed that there was an attempt to intrude into their IT systems, which they were rapidly able to intercept with strong security protocols.\"As a precaution, they have temporarily restricted some services available to customers, which is why the website is currently offline. Data and system security is a top priority for the business and reassuringly there is no evidence to-date that any customer data has been impacted in any way.\"The company clarified that the hackers had successfully reached the Active Directory and launched a rushed attack that resulted in encrypting some of the systems.According to Damart, the reason for degraded services was due to the company's proactive actions by shutting down systems to protect them from being encrypted.At this time, it is unknown if Hive managed to steal any data during the network intrusion. However, the gang has adopted the double-extortion tactic and exfiltrates data before the encryption stage.This enables the cybercriminals to put more pressure on the victim to pay a ransom by threatening with a data leak.Hive ransomware has not listed Damart on their data leak site and the company has repeatedly denied that the hackers stole any data."
   },
   {
      "time": "2022-09-05",
      "title": "https://www.databreaches.net/customer-data-from-hundreds-of-indonesian-and-malaysian-restaurants-hacked-by-desorden/",
      "text": " "
   },
   {
      "time": "2022-09-05",
      "title": "New Evidence Links Raspberry Robin Malware to Dridex and Russian Evil Corp Hackers",
      "text": " Researchers have identified functional similarities between a malicious component used in the Raspberry Robin infection chain and a Dridex malware loader, further strengthening the operators' connections to the Russia-based Evil Corp group.The malware is known to be delivered from a compromised system via infected USB devices containing a malicious .LNK file to other devices in the target network. The Windows Shortcut files are designed to retrieve a malicious DLL from a remote server.\"The Raspberry Robin loaders are DLLs that decode and execute an intermediate loader,\" Henson said. \"The intermediate loader performs hook detection as an anti-analysis technique, decodes its strings at runtime and then decodes a highly obfuscated DLL whose purpose has not been determined.\"Furthermore, IBM Security X-Force's comparative analysis of a 32-bit Raspberry Robin loader and a 64-bit Dridex loader uncovered overlaps in functionality and structure, with both components incorporating similar anti-analysis code and decoding the final payload in an analogous manner.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]