[
   {
      "time": "2022-12-21",
      "title": "Clop ransomware group targeting provider-patient trust, infecting medical images | SC Media",
      "text": "  The healthcare sector has long been warned they’re not keeping pace with evolving threats, creating an untenable situation resulting in serious impacts. New insights from Hold Security shows Clop ransomware actors are upping the ante, targeting the trusted relationships between providers and patients to deliver their payload.The risk to healthcare is greater than before. Hold Security Founder Alex Holden warns that “the message is simple: all medical professionals need to get better because the bad guys are stepping up. We need to speed up.” To get a sense of these new tactics and the possible impacts on providers, SC Media spoke with Hold Security Founder Alex Holden and found the outlook looks relatively bleak. The group is using highly original tactics to better understand workflows within medical systems to hide their attacks for a greater impact.Clop is known to target medical facilities that meet a revenue of more than $10 million and other facilities with more than $5 million a year. Holden notes that among these targets are groups of dentists, doctors offices, or other smaller providers that operate as part of bigger healthcare systems.The second component is that they’ve learned the nuances of the healthcare system workflows and how certain processes work for various healthcare issues, particularly around telemedicine and other remote care platforms. Before COVID-19, Holden believes these tactics would not be finding as much success.But with the rapid expansion of telemedicine and its evolution as a standard of care for many, particularly in rural areas, Clop is finding it easier to exploit these targeted workflows.On the whole, there are “huge vulnerabilities” in the ways medical records are being stored, from gaps in the in-house security or how “some medical professionals present their profiles on corporate or medical sites.” The trouble with these new tactics is that Clop isn’t “doing anything innovative process-wise.”“If they understand the process, if they understand all these intricacies of our process, they can insert themselves into the areas where we would expect them less,” or with weakened defenses when a doctor has a primary duty to the patient and “not cybersecurity,” said Holden.“Doctors don't think about cybersecurity when they are operating,” he continued.Practitioners might not even think about cybersecurity when looking at patient data, Holden said, so if a doctor receives an email not from a patient, but from different doctors, it’s likely they won’t consider whether something isn’t right about the email.In short, Clop is preying on trusted relationships to build a backdoor for their nefarious activities. Holden has even seen CD-ROMs and image files infected with malware.In one example, a cardiovascular issue discussed remotely would require certain tests that might not be possible over the phone. The doctor may refer the individual to another system, which requires medical insurance information. Holden explained that Clop actors are procuring medical records for this particular purpose, rather than just shifting the data into their hands.“They’re basically registered as the patient themselves,” said Holden. “They are taking medical records from the victim and no one is looking.” The actor will register for a service using the acquired patient data, and the doctor’s office will likely not notice as they have the required information.“They don't have to fib because it's telehealth, and it's believable. So the insurance may actually get stuck with a small bill,” said Holden. But the bigger issue is the follow-up: banking on urgency, the doctors will likely quickly look at test results before the next appointment and end up with an infected file doctored by the Clop actors instead.“This is not the first type of abuse that we’ve seen,” said Holden, who finds it interesting that Clop is targeting medical professionals rather than others. Holden Security has also seen similar scams with the restaurant industry and suppliers. “But this hits a bit differently because of the sense of duty.”This involves “much, much deeper human interaction.” The actors have to “discuss actually showing up for the appointment and make sure that they force a doctor to open the infected files,” he added.Clop is well funded and extremely well motivated: they can keep attacking. Holden stressed that it’s imperative that the medical industry keeps getting better “because there will be times when bad guys will go to the next step. They will be blackmailing over the life of a person.”The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.After admitting responsibility for compromising Sony, a Colonial Pipeline supplier, and a Hawai'i government site, the RansomedVC group has claimed that it will be ending operations due to the arrests of six of its affiliates, reports The Record, a news site by cybersecurity firm Recorded Future.U.S. advanced electronic components manufacturer Kyocera AVX Components Corporation has disclosed that 39,111 individuals around the world had their data compromised following a ransomware attack earlier this year, which has been claimed by the LockBit ransomware operation, reports BleepingComputer.Attack on the U.S. subsidiary of the Industrial & Commercial Bank of China disrupted Treasury trading in New York earlier this week.  Tue Jun 25Thu Dec 14Thu Nov 16   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-12-21",
      "title": "Microsoft pushes emergency fix for Windows Server Hyper-V VM issues",
      "text": " Microsoft has released emergency out-of-band (OOB) Windows Server updates to address a known issue breaking virtual machine (VM) creation on Hyper-V hosts after installing this month's Patch Tuesday updates.The issue affects only VMs managed with the System Center Virtual Machine Manager (SCVMM) and using Software Defined Networking (SDN).On affected systems, Windows admins see warnings during live migration, SLB Load Balancer or SDN RAS Gateway fails, and experience failures when creating new VMs and attaching Virtual Network Interface Cards (VNICs).To resolve this issue, admins must install the OOB cumulative updates released today for their systems on all affected Hyper-V hosts in their environment.Today's updates are not delivered through Windows Updates and will not install automatically on impacted servers.They can also be manually imported into Windows Server Update Services (WSUS) and Microsoft Endpoint Configuration Manager.The list of emergency Windows Server cumulative updates released today includes:\"You do not need to apply any previous update before installing these cumulative updates,\" Redmond added today.\"If you have already installed updates released December 13, 2022, you do not need to uninstall the affected updates before installing any later updates, including the updates listed above.\"This workaround requires running a set of commands on all SCVMM-managed Hyper-V hosts from an elevated PowerShell window (immediately after installing the KB5021237 and KB5021249 updates)."
   },
   {
      "time": "2022-12-21",
      "title": "Ransomware gang uses new Microsoft Exchange exploit to breach servers",
      "text": " Cybersecurity firm CrowdStrike spotted the exploit (dubbed OWASSRF) while investigating Play ransomware attacks where compromised Microsoft Exchange servers were used to infiltrate the victims' networks.\"Instead, it appeared that corresponding requests were made directly through the Outlook Web Application (OWA) endpoint, indicating a previously undisclosed exploit method for Exchange.\"CVE-2022-41080 was discovered and reported by zcgonvh with 360 noah lab and rskvp93, Q5Ca, and nxhoang99 with VcsLab of Viettel Cyber Security.At this time it is unclear whether the threat actors were abusing this Microsoft Exchange attack chain as a zero-day exploit before fixes were released.The leaked tooling contained a PoC for Play’s Exchange exploit, which allowed CrowdStrike to replicate the malicious activity logged in Play ransomware’s attacks.CrowdStrike believes that the proof-of-concept exploit was used to drop remote access tools such as Plink and AnyDesk on compromised servers.BleepingComputer also found that the tooling leaked by Agha contained the ConnectWise remote administration software, which was likely deployed in attacks as well.Organizations with on-premises Microsoft Exchange servers on their network are advised to apply the latest Exchange security updates (with November 2022 being the minimum patch level) or disable OWA until the CVE-2022-41080 patch can be applied.Since its launch in June, dozens of Play ransomware victims have uploaded samples or ransom notes to the ID Ransomware platform to identify what ransomware was used to encrypt their data.Unlike most ransomware operations, Play affiliates drop simple ransom notes with the word PLAY and a contact email address.Currently, there is no data leak linked to this ransomware or any indication that any data is stolen during attacks.Update December 22, 02:07 EST: Revised the article to correctly say the Play ransomware affiliate's tooling was shared online and not leaked."
   },
   {
      "time": "2022-12-21",
      "title": "Raspberry Robin Worm Targets Telcos & Governments",
      "text": " It's likely the group behind the worm called Raspberry Robin is just testing the waters — launching attacks against telecommunications companies and governments across Australia, Europe, and Latin America to see how far their malware can spread — for now.Researchers at Trend Micro have been tracking Raspberry Robin since September and are warning the worm is notable for its 10 layers of obfuscation and its ability to deploy a fake payload to throw off detection efforts.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-21",
      "title": "NATO-Member Oil Refinery Targeted in Russian APT Blitz Against Ukraine",
      "text": " Physical threats against a Ukrainian cybersecurity researcher and a failed attempt to breach a petroleum refinery inside a NATO-member nation are just the latest notable salvos in Russian state-backed APT group Trident Ursa's campaign against Ukraine. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-21",
      "title": "Microsoft will turn off Exchange Online basic auth in January",
      "text": " Microsoft warned today that it will permanently turn off Exchange Online basic authentication starting early January 2023 to improve security.\"Soon after basic auth is permanently disabled, any clients or apps connecting using Basic auth to one of the affected protocols will receive a bad username/password/HTTP 401 error.\"The outdated Exchange Online basic auth login method will be deprecated for Exchange ActiveSync (EAS), POP, IMAP, Remote PowerShell (RPS), Exchange Web Services (EWS), Offline Address Book (OAB), Autodiscover, and Outlook (for Windows and Mac).The SMTP AUTH protocol used for client email submissions will also be disabled in all tenants where it's not being used.These protocols will be disabled for basic auth use permanently during the first week of January 2023, with no way of re-enabling it again.Microsoft says it has already disabled basic auth in millions of tenants that weren't using it and toggled off unused protocols within tenants still using it to protect them from attacks exploiting this insecure login scheme.\"The same study found that over 97 percent of credential stuffing attacks also use legacy authentication. Customers that have disabled Basic Authentication have experienced 67 percent fewer compromises than those who still use it.\"After basic auth is deprecated, customers might experience various issues, including being unable to sign into Exchange Online starting January 2023.\"We're making this change to protect your tenant and data from the increasing risks associated with Basic auth,\" The Exchange Team added.\"Calling support will not help either, as they cannot re-enable Basic auth for you.\""
   },
   {
      "time": "2022-12-21",
      "title": "Hackers bombard PyPi platform with information-stealing malware",
      "text": " The PyPi python package repository is being bombarded by a wave of information-stealing malware hiding inside malicious packages uploaded to the platform to steal software developers' data.Since then, an additional 31 packages dropping 'W4SP' have been removed from the PyPI repository, with the malware's operators continuing to seek new ways to reintroduce their malware on the platform.The cybersecurity firm reported yesterday that at least 16 packages on PyPI are spreading ten different information-stealing malware variants based on W4SP Stealer.The malicious packages that contain these information stealers are:While these packages drop stealers that use different names, like Celestial Stealer, ANGEL stealer, Satan Stealer, @skid Stealer, and Leaf $tealer, Phylum has found that they are all based on the W4SP code.With one exception, \"chazz,\" the new stealers do not follow W4SP's complex attack chain that features multiple stages and code obfuscation.Instead, they drop the stealer's code directly into the \"main.py\" or the \"_init_.py\" files with no encoding, so a basic code review immediately reveals their nature.The \"chazz\" package, which drops a copy of the \"Leaf $tealer,\" is the only one of the new batch that features some obfuscation via the BlankOBF tool, but it's still reasonably easy to deobfuscatFollowing the same tactics as with the W4SP operation, the new stealers use GitHub repositories as a remote resource for downloading the malware payload.It is unclear whether these malware “clones” are operated by the same threat actors behind W4SP or its copycats, but Phylum hypothesizes it’s from different groups that attempt to mimic previous campaigns.All the packages presented in this report have been removed from the PyPI repository, but not before they were downloaded over 2,500 times.Hackers have been increasingly targeting open-source package repositories as compromising developer's systems offers an opportunity for even larger attacks.As developers commonly store authorization tokens and API keys in their applications, stealing these secrets could allow threat actors to conduct more widespread supply chain attacks or steal data for use in extortion demands.As long as the infection numbers make an effort worthwhile, we will continue to see threat actors uploading malicious packages on open-source repositories under different names and accounts."
   },
   {
      "time": "2022-12-21",
      "title": "AWS Elastic IP Transfer Feature Gives Cyberattackers Free Range",
      "text": " Attackers can compromise a new feature in Amazon Web Services (AWS) to hijack cloud accounts' static public IP addresses and abuse them for various malicious purposes, researchers have found.Attackers also can use the stolen EIP to attack a victim's own firewall-protected endpoints, or to serve as the original victim’s network endpoint to extend opportunities for data theft, the researchers said.\"The potential damage to the victim by hijacking an EIP and using it for malicious purposes can mean using the victim’s name, jeopardizing the victim’s other resources in other cloud providers/on-premises, and [stealing the] victim’s customers' information,\" Or Aspir, software engineer at Mitiga, wrote in the post.Threat actors must already have permissions on an organization's AWS account to leverage the new attack vector, which the researchers call \"a post-initial-compromise attack.\"However, because the attack was not possible before the feature was added and is not yet listed in the MITRE ATT&CK Framework, organizations may be unaware that they are vulnerable to it, as it's not likely to be picked up by existing security protections, the researchers said.\"With the right permissions on the victim’s AWS account, a malicious actor using a single API call can transfer the victim’s used EIP to their own AWS account, thus practically gaining control over it,\" Aspir wrote. \"In many cases it allows greatly increasing the impact of the attack and gaining access to even more assets.\"AWS introduced EIP in October as a legitimate feature to allow transfer of Elastic IP addresses from one AWS account to another. An Elastic IP (EIP) address is a public and static IPv4 address that can be reached from the Internet and can be allocated to an Elastic Compute Cloud (EC2) instance for Web-facing activities, such as website hosting or communicating with network endpoints under a firewall.AWS introduced the feature to make it easier to move Elastic IP addresses during AWS account restructuring by transferring the EIP to any AWS account — even AWS accounts that are not owned by someone or his or her organization, the researchers said.With the feature, the transfer is a mere \"two-step handshake between AWS accounts — the source account (either a standard AWS account or an AWS Organizations account) and the transfer account,\" Aspir explained.The ease with which EIPs can now be transferred creates an unintentional issue, however — while it certainly facilitates the process of transferring IP for legitimate account owners, it also makes it easier for malicious actors as well, the researchers said.Researchers described a basic scenario to illustrate how attackers can take advantage of EIP transfer, assuming that attackers already have permissions that allow them to \"see\" existing EIPs and their status, or whether or not they are associated with other computer resources.Typically, EIPs are associated, but sometimes an organization keeps dissociated EIP for later use, or as a result of an unmanaged environment that keeps unused resources, the researchers said. \"Either way, the attacker only needs to enable the EIP transfer, and the IP address is theirs,\" Aspir wrote.Attackers can do this in two ways with the correct permissions: either transfer a dissociated EIP or remove the association of an associated EIP and then transfer it, the researchers said.For the former, an adversary must have the following action in its attached Identity and Access Management (IAM) policy on AWS: \"ec2:DisassociateAddress\" action on the elastic IP addresses and the network interfaces that the IP addresses are attached to.To transfer an EIP, a threat actor must have the following actions in its attached IAM policy: \"ec2:DescribeAddresses\" on all the IP addresses and \"ec2:EnableAddressTransfer\" on the EIP address that the attacker wants to transfer, the researchers said.There are a wide range of attack scenarios that a threat actor can engage in after successfully transferring someone else's EIP to their own control.In external firewalls used by the victim, for example, an attacker can communicate with the network endpoints behind the firewalls if there is an allow rule on the specific IP address, the researchers said.Attackers also can use the stolen IP address as C2, using it for malware campaigns that appear legitimate and thus fly under the radar of security defensives. A threat actor can even cause denial of service (DoS) to a victim's public services if they dissociate an EIP from a running endpoint and transfer it, the researchers said.Anyone using EIP resources in an AWS account is at risk, and thus must treat the EIP resources like other resources in AWS that are in danger of exfiltration, the researchers advised.To protect themselves from an EIP transfer attack, Mitiga recommends that enterprises use the principle of least privilege on AWS accounts and even disable the ability to transfer EIP entirely if it's not a necessary feature on their environment.To do this, an organization can use native AWS IAM features such as service control policies (SCPs), which offer central control over the maximum available permissions for all accounts in an organization, the researchers said, providing an example in their post of how this works.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-21",
      "title": "KmsdBot Botnet Suspected of Being Used as DDoS-for-Hire Service",
      "text": " An ongoing analysis of the KmsdBot botnet has raised the possibility that it's a DDoS-for-hire service offered to other threat actors.Akamai, which examined the attack traffic, identified 18 different commands that KmsdBot accepts from a remote server, one of which, dubbed \"bigdata,\" caters to sending junk packets containing large amounts of data to a target in an attempt to exhaust its bandwidth.Also included are commands such as \"fivem\" and \"redm\" that are designed to target video game mod servers, alongside a \"scan\" instruction that \"appears to target specific paths within the target environment.\"Charting the infection attempts of the botnet signals minimal activity in the Russian territory and neighboring regions, potentially offering a clue as to its origins.A further breakdown of the attack commands observed over a 30-day time period shows \"bigdata\" leading with a frequency of more than 70. Calls to \"fivem\" have occurred 45 times, while \"redm\" has seen less than 10 calls.\"This tells us that although gaming servers are a specific target offered, it may not be the only industry that is being hit with these attacks,\" the researchers said. \"Support for multiple types of servers increases the overall usability of this botnet and appears to be effective in driving in customers.\"The KmsdBot botnet, in its current form, doesn't seek persistence on a machine, meaning its accidental disruption requires the attackers to rebuild the botnet from scratch. However, there are indications that the botnet may be making an attempt to stage a return.\"I did see infection attempts again about 24-48 hours after the bot went down and then attack commands started coming back in again around 24 hours after that,\" Cashdollar told The Hacker News. \"But currently, the last known C2 appears to be null routed and the bot has been quiet.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-21",
      "title": "New 'RisePro' Infostealer Increasingly Popular Among Cybercriminals - SecurityWeek",
      "text": " Hi, what are you looking for?A recently identified information stealer named ‘RisePro’ is being distributed by pay-per-install malware downloader service ‘PrivateLoader’, cyberthreat firm Flashpoint reports.Written in C++, RisePro harvests potentially sensitive information from the compromised machines and then attempts to exfiltrate it as logs.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   }
]