[
   {
      "time": "2022-07-20",
      "title": "FBI director expects onslaught of digital assaults targeting midterm elections | CyberScoop",
      "text": " \n\nJuly 19, 2022\n\nFederal law enforcement officials are preparing for a wave of multilayered cyberattacks and influence operations from China, Russia and Iran in the run up to November’s midterm elections, FBI Director Christopher Wray said Tuesday.The risks posed to the American public by “relatively modest hacking” increase exponentially when foreign governments layer such efforts with influence operations and disinformation that “causes panic or lack of confidence in our election infrastructure,” Wray said during a cybersecurity conference at Fordham University in New York City.Officials worry about how the impact of such threats might be magnified by what Wray called “multidisciplinary” cyber operations. The FBI is working closely with U.S. Cyber Command to manage election threats and when the two agencies are in “combat tempo” their respective teams are in touch every two hours at a minimum, Wray said.“These are much, much closer relationships” than was true in the past, Wray said. He added that the closer working ties between Cyber Command and the FBI and both agencies and state and local election officials “builds much more resilience in the whole system.”“It went from just sort of sowing divisiveness and discord through social media, fake personas, that kind of thing, into a much more multidisciplinary type of threat.” Cyber Command has conducted 50 such operations across 16 different countries over the past three plus years, Nakasone said, all of which have been aimed at fending off foreign interference in elections and other US interests. By partnering with foreign countries on the operations the U.S. positions itself to better understand adversaries, he said.Both officials emphasized that foreign adversaries are innovating quickly and unveiling new cyber weapons all the time, requiring officials to “understand how they’re getting better,” Nakasone said. He went on to stress that adversaries have shown a capacity to innovate, which has forced him to think often about “new and unique ways that an adversary might try to disrupt or try to influence our elections.”Officials have seen dramatic changes in how cyberthreats directed at elections are evolving with every election cycle, Wray said. During the 2018 midterms, for instance, officials witnessed attacks that originated from Russia as well as influence operations tied to China in what Wray called an “expansion of techniques.”“It went from just sort of sowing divisiveness and discord through social media, fake personas, that kind of thing, into a much more multidisciplinary type of threat,” Wray said.In 2020, the FBI found itself pitted against adversaries that were “constantly innovating new digital influence capabilities, new ways to recruit different types of proxies and access agents, and more and more countries getting into the act,” Wray said."
   },
   {
      "time": "2022-07-20",
      "title": "Hacking group '8220' grows cloud botnet to more than 30,000 hosts",
      "text": " A cryptomining gang known as 8220 Gang has been exploiting Linux and cloud app vulnerabilities to grow their botnet to more than 30,000 infected hosts.After gaining access, the attackers use SSH brute forcing to spread further and hijack available computational resources to run cryptominers pointing to untraceable pools.Starting late last month, the group began using a dedicated file for the management of the SSH brute forcing step, which contains 450 hardcoded credentials corresponding to a broad range of Linux devices and apps.Another update is the use of block lists in the script to exclude specific hosts from infections, mostly concerning honeypots set up by security researchers.Finally, 8220 Gang now uses a new version of its custom cryptominer, PwnRig, which is based on the open-source Monero miner XMRig.In the latest version of PwnRig, the miner uses a fake FBI subdomain with an IP address pointing to a Brazilian federal government domain to create a fake pool request and obscure the real destination of the generated money.The dropping cryptocurrency prices is forcing cryptojacking actors to scale up their operations so they can maintain the same profits. Monero, in particular, has lost over 20% of its value over the past six months.The dwindling crypto prices are expected to make cryptojacking less alluring for threat actors. However, it will continue to be a revenue source for plenty threat actors."
   },
   {
      "time": "2022-07-20",
      "title": "Building materials giant Knauf hit by Black Basta ransomware gang",
      "text": " The Knauf Group has announced it has been the target of a cyberattack that has disrupted its business operations, forcing its global IT team to shut down all IT systems to isolate the incident.The cyberattack took place on the night of June 29, and at the time of writing this, Knauf is still in the process of forensic investigation, incident response, and remediation.Emails seen by BleepingComputer warned that email systems were shut down as part of the response to the attack but that mobile phones and Microsoft Teams were still working for communication.Knauf is a German-based multinational building and construction materials producer that holds approximately 81% of the world’s wallboard market.The firm operates 150 production sites in several countries worldwide and owns U.S.-based Knauf Insulation and USG Corporation.While Knauf’s announcements doesn't explain the type of cyberattack they suffered, the extended duration, impact, and difficulty in restoring the IT systems point to a ransomware incident.Indeed, the ransomware gang known as Black Basta has taken responsibility for the attack via an announcement on their extortion site, listing Knauf as a victim on July 16, 2022.The ransomware gang has published 20% of the files they allegedly exfiltrated during the attack on Knauf, which over 350 visitors have accessed.Bleeping Computer has seen samples of email communication, user credentials, employee contact information, production documents, and ID scans.The fact that not all files have been leaked online yet indicates that the threat actors still have hope of a successful negotiation outcome and receiving a ransom payment.Due to showcasing knowledge and capability early on and similarities in the negotiation style, many experts in the field assumed that Black Basta was a rebrand of Conti."
   },
   {
      "time": "2022-07-20",
      "title": "UK heat wave causes Google and Oracle cloud outages",
      "text": " An ongoing heatwave in the United Kingdom has led to Google Cloud and Oracle Cloud outages after cooling systems failed at the companies' data centers.For the past week, the United Kingdom has suffered an ongoing record-breaking heat wave causing stifling temperatures throughout the region.However, today, with temperatures reaching a record-breaking 40.2 degrees Celsius (104.4 Fahrenheit), cooling systems at data centers used by Google and Oracle to host their cloud infrastructure have begun to fail.To prevent permanent damage to hardware components and thus create a prolonged outage, both Google and Oracle have shut down equipment, leading to outages in their cloud services.Oracle was the first to be affected, with the company reporting a cooling failure at approximately 11:30 AM EST today, causing \"non-critical hardware\" to be powered down.\"This step has been taken with the intention of limiting the potential for any long term impact to our customers.\"However, even with only non-critical hardware powered off, Oracle states that customers in this zone may be unable to access their Oracle Cloud Infrastructure resources.Almost two hours later, Google also reported cooling failures in one of their buildings hosting the europe-west2-a zone for region europe-west2.\"We're working hard to get the cooling back online and create capacity in that zone. We do not anticipate further impact in zone europe-west2-a and currently running VMs should not be impacted. A small percentage of replicated Persistent Disk devices are running in single redundant mode.\"\"In order to prevent damage to machines and an extended outage, we have powered down part of the zone and are limiting GCE preemptible launches. We are working to restore redundancy for any remaining impacted replicated Persistent Disk devices.\"Like Oracle, this cooling failure is disrupting Google Cloud customers, with virtual machines being terminated, unreachable machines, and Persistent Disk devices running in single redundancy mode.Both companies report that they do not expect any further impact as they work to bring cooling systems back online.Both Google and Oracle have resolved the cooling issues in their data centers, with service restored for Google on Tuesday and Oracle on Wednesday.Google restored their services Tuesday night at 11:45 PM EST, with the following final status update.\"There was a cooling related failure in one of our buildings that hosts a portion of capacity for zone europe-west2-a for region europe-west2 that is now resolved. GCE, Persistent Disk and Autoscaling impacts have been addressed. Customers can launch VMs in all zones of europe-west2. A small number of HDD backed Persistent Disk volumes are still experiencing impact and will exhibit IO errors. If you are continuing to experience issues with these services, please contact Google Cloud Product Support and reference this message.\"Oracle took a little longer to restore cooling, with services restored Wednesday at 7:00 AM EST.\"Following unseasonably high temperatures in the UK South (London) region, two cooler units in the data center experienced a failure when they were required to operate above their design limits. As a result, temperatures in the data center began to climb causing a subset of Compute infrastructure to go into protective shut down.\"Update 7/20/22 4:55 PM EST: Added updates on cooling system issues."
   },
   {
      "time": "2022-07-20",
      "title": "Experts Discover New CloudMensis Spyware Targeting Apple macOS Users - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-07-20",
      "title": "Cyber Command chief stands by comments on \\'offensive\\' operations against Russia",
      "text": " U.S. Cyber Command and National Security Agency chief Gen. Paul Nakasone stood by his comments last month about the U.S military conducting offensive cyber operations against Russia in its defense of Ukraine.Nakasone, during a panel discussion Tuesday with FBI Director Christopher Wray at the International Conference on Cyber Security, said his June statement stands in terms of the sorts of operations U.S. Cyber Command is conducting in response to the Russian invasion. \"We do three things at U.S. Cyber Command: We defend the Department of Defense’s networks, data and weapons systems. We defend the nation’s cyberspace with a series of interagency partners. And we provide support to joint force commanders like U.S. European Command. So we deny, degrade and disrupt. Being able to detect, defend, disrupt and deter, these are all things that we do in the course of our operations,\" he said.\"My comments stand in that in terms of what we’re doing, [which] obviously includes a variety of those things to deny, degrade and disrupt. I think this is exactly what we should expect out of U.S. Cyber Command and how we move forward.\"Nakasone's comments last month, made in Tallinn, Estonia, appeared to contradict the White House policy that the U.S. not engage in any direct conflict with Russia while assisting Ukraine. They also caused concern among security experts wondering how Russia would respond. Russia's Foreign Ministry threatened the U.S. in response, warning that they should not \"provoke Russia into retaliatory measures.\"\"A rebuff will certainly follow, it will be firm and resolute. However, the outcome of this mess could be catastrophic, because there will be no winners in a direct cyber clash of states,\" the Russian Foreign Ministry said.At the conference on Tuesday, Nakasone explained that U.S. Cyber Command has engaged in 50 different \"hunt forward\" operations across 16 different countries over the past three years. He described the operations as instances where countries invite U.S. Cyber Command in and have them effectively test their systems against theoretical attacks. \"This is a growth industry for us. We have a number of different countries that are interested in working with us on it,\" he said.\"We are also positioning ourselves to understand our adversaries better so we have a series of operations we’re conducting now as we approach the Fall.\"Nakasone also backed previous claims from NSA Cybersecurity Directorate chief Rob Joyce that there has been a decrease in ransomware attacks since Russia's invasion of Ukraine. At the conference Tuesday, Nakasone reiterated that U.S. Cyber Command is seeing a decrease in ransomware attacks.\"I would echo Rob Joyce’s comments. We’re seeing Russians much more focused on activities related to Ukraine,\" he said, adding that they have seen increases in the use of wiper malware. Wray, meanwhile, told the audience that the FBI continues to see a range of ransomware attacks with varying motives targeting almost all of the critical infrastructure sectors in the U.S. \"Ransomware itself is evolving. It used to be that a bad actor was only a cybercriminal and was only trying to lock up your system for money. Now, two things have changed. Sometimes the ransomware actor isn't a cybercriminal, its a nation-state with a different motive in mind,\" he explained. \"This is a manifestation of a trend we're seeing across the cyber landscape which is called a 'blended threat' where nation states work with cybercriminals. Nation-state actors now also moonlight and make money on the side as cybercriminals. And nation-states now use cybercriminal tools like ransomware to look like their cybercriminals and not nation-states. All this is happening more and more.\"Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-20",
      "title": "Continued cyber activity in Eastern Europe observed by TAG",
      "text": " Threat Analysis GroupJul 19, 2022min readHere is a deeper look at some campaign activity TAG has observed since our last update:Turla website disseminating fake DoS Android Apps.Pro-Ukrainian website used for disseminating StopWar.apk.Based on our analysis, we believe that the StopWar app was developed by pro-Ukrainian developers and was the inspiration for what Turla actors based their fake CyberAzov DoS app off of.Indicators:An example of this technique used to target Facebook usersExample of a recent COLDRIVER phishing lureRecently observed COLDRIVER indicators:Google's Threat Analysis Group analyzes recent state-sponsored campaigns exploiting the WinRAR vulnerability, CVE-2023-38831."
   },
   {
      "time": "2022-07-20",
      "title": "Unpatched Micodus GPS Tracker Vulnerabilities Allow Hackers to Remotely Disable Cars - SecurityWeek",
      "text": " Hi, what are you looking for?Widely used vehicle GPS trackers from Micodus are affected by critical vulnerabilities that can be exploited by hackers to stalk people and remotely disable cars, according to cybersecurity company BitSight.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-20",
      "title": "Russian SVR hackers use Google Drive, Dropbox to evade detection",
      "text": " State-backed hackers part of Russia's Federation Foreign Intelligence Service (SVR) have started using Google Drive legitimate cloud storage service to evade detection.By using online storage services trusted by millions worldwide to exfiltrate data and deploy their malware and malicious tools, the Russian threat actors are abusing that trust to render their attacks exceedingly tricky or even impossible to detect and block.The threat group tracked as APT29 (aka Cozy Bear or Nobelium) has adopted this new tactic in recent campaigns targeting Western diplomatic missions and foreign embassies worldwide between early May and June 2022.\"The ubiquitous nature of Google Drive cloud storage services – combined with the trust that millions of customers worldwide have in them – make their inclusion in this APT's malware delivery process exceptionally concerning.\"As Unit 42's threat analysts observed at the time, the Brute Ratel sample \"was packaged in a manner consistent with known APT29 techniques and their recent campaigns, which leveraged well-known cloud storage and online collaboration applications.\""
   }
]