[
   {
      "time": "2022-11-01",
      "title": "Indianapolis Housing Authority Hit by Ransomware - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-11-01",
      "title": "Accused ‘Raccoon’ Malware Developer Fled Ukraine After Russian Invasion – Krebs on Security",
      "text": " A 26-year-old Ukrainian man is awaiting extradition from The Netherlands to the United States on charges that he acted as a core developer for Raccoon, a popular “malware-as-a-service” offering that helped paying customers steal passwords and financial data from millions of cybercrime victims. KrebsOnSecurity has learned that the defendant was busted in March 2022, after fleeing mandatory military service in Ukraine in the weeks following the Russian invasion.Ukrainian national Mark Sokolovsky, seen here in a Porsche Cayenne on Mar. 18 fleeing mandatory military service in Ukraine. This image was taken by Polish border authorities as Sokolovsky’s vehicle entered Germany. Image: KrebsOnSecurity.com.The U.S. Attorney for the Western District of Texas unsealed an indictment last week that named Ukrainian national Mark Sokolovsky as the core developer for the Raccoon Infostealer business, which was marketed on several Russian-language cybercrime forums beginning in 2019.Raccoon was essentially a Web-based control panel, where — for $200 a month — customers could get the latest version of the Raccoon Infostealer malware, and interact with infected systems in real time. Security experts say the passwords and other data stolen by Raccoon malware were often resold to groups engaged in deploying ransomware.Working with investigators in Italy and The Netherlands, U.S. authorities seized a copy of the server used by Raccoon to help customers manage their botnets. According to the U.S. Justice Department, FBI agents have identified more than 50 million unique credentials and forms of identification (email addresses, bank accounts, cryptocurrency addresses, credit card numbers, etc.) stolen with the help of Raccoon.The Raccoon v. 1 web panel, where customers could search by infected IP, and stolen cookies, wallets, domains and passwords.According to those sources, U.S. authorities zeroed in on an operational security mistake that the Raccoon developer made early on in his posts to the crime forums, connecting a Gmail account for a cybercrime forum identity used by the Raccoon developer (“Photix”) to an Apple iCloud account belonging to Sokolovsky. For example, the indictment includes a photo that investigators subpoenaed from Sokolovsky’s iCloud account that shows him posing with several stacks of bundled cash.A selfie pulled from Mark Sokolovsky’s iCloud account. Image: USDOJ.When Russia invaded Ukraine in late February 2022, Sokolovsky was living in Kharkiv, a city in northeast Ukraine that would soon come under heavy artillery bombardment from Russian forces. Authorities monitoring Sokolovsky’s iCloud account had spent weeks watching him shuttle between Kharkiv and the Ukrainian capital Kyiv, but on Mar. 18, 2022, his phone suddenly showed up in Poland.Investigators learned from Polish border guards that Sokolovsky had fled Ukraine in a Porsche Cayenne along with a young blond woman, leaving his mother and other family behind. The image at the top of this post was shared with U.S. investigators by Polish border security officials, and it shows Sokolovsky leaving Poland for Germany on Mar. 18.At the time, all able-bodied men of military age were required to report for service to help repel the Russian invasion, and it would have been illegal for Sokolovsky to leave Ukraine without permission. But both sources said investigators believe Sokolovsky bribed border guards to let them pass.Authorities soon tracked Sokolovsky’s phone through Germany and eventually to The Netherlands, with his female companion helpfully documenting every step of the trip on her Instagram account. Here is a picture she posted of the two embracing upon their arrival in Amsterdam’s Dam Square:Authorities in The Netherlands arrested Sokolovsky on Mar. 20, and quickly seized control over the Raccoon Infostealer infrastructure. Meanwhile, on March 25 the accounts that had previously advertised the Raccoon Stealer malware on cybercrime forums announced the service was closing down. The parting message to customers said nothing of an arrest, and instead insinuated that the core members in charge of the malware-as-a-service project had perished in the Russian invasion.“Unfortunately, due to the ‘special operation,’ we will have to close our Raccoon Stealer project,” the team announced Mar. 25. “Our team members who were responsible for critical components of the product are no longer with us. Thank you for this experience and time, for every day, unfortunately everything, sooner or later, the end of the WORLD comes to everyone.”Sokolovsky’s extradition to the United States has been granted, but he is appealing that decision. He faces one count of conspiracy to commit computer fraud; one count of conspiracy to commit wire fraud; one count of conspiracy to commit money laundering, and one count of aggravated identity theft.If convicted, Sokolovsky faces a maximum penalty of 20 years in prison for the wire fraud and money laundering offenses, five years for the conspiracy to commit computer fraud charge, and a mandatory consecutive two-year term for the aggravated identity theft offense.\r\n         This entry was posted on Monday 31st of October 2022 04:53 PM \r\n         I have no sympathy for this self-centered sociopathic crook and coward. Once US justice is done with him, he should go back to stand for cybercrime, draft evasion and bribery, plus whatever else applies.  And it will be appropriate and hood for him to spend a stretch in prison at home. Slava Ukraini ! And ï !Most people living near Kharkov and other south eatern Ukraine are ethnically Russians and they could not care less about Ukraine that’s why most of them will not want to be drafted and will flee to Europe. Nationalism is something new in Ukraine and most people don’t feel it. No due to the war this nationalist sentiment in pushed through media, but when the war is over we will see how the people of Ukraine are thinking about this conflict.> . Nationalism is something new in UkraineWell it’s a pretty new nation after all, hope it lasts“Nationalism is something new in Ukraine”Please tell that to fans of the national poet of Ukraine, Taras Shevchenko (1814 – 1861). Please tell that to the Zaporizhian Cossacks, who unite much of Ukraine in the 16th and 17th centuries, and the Cossack Hetmanate of the 18th century. Tell that to those who briefly set up man Independent Ukraine in 1918. Tell that to those who suffered under the Holodomor of the 1930s. And so on.Ukrainian nationalism is only news to Putin.You have no clue. The Ukrainians in Kharkiv (with -iv!) and elsewhere are crystal clear about the death and destruction that the Russian terror brought into their lives. Even before these bastards occupied Crimea in 2014. No need to wait for the Russian defeat to see that there’s been a dramatic shift in perception – Russia is nothing but a terrorist state that destroyed thousands of lives. One doesn’t have to join the military to fight against them and their barbaric threats.While I certainly can understand why this perp fled, it goes to show that with everyone posting everything on the Internet, the days of actually doing research and recon are gone. All that’s necessary now is really to just comb and put puzzles together by checking IG, SC, FB, and other social media platforms.\nPeople willingly post everything and anything these days…Look, the guy may be guilty as sin with this Racoon thing, however having authorities follow my movements because I have a selfie with “stacks of cash”? I want to have stacks of cash! Pile them high in my room and let me swim in them! That is not a reason to begin tracking someone. There has to be something else that someone is not speaking about, Brian.As to Ukraine, I have no love for Putin. But if he eliminates the Nazi party that took over Ukraine in a coup in 2015, so much the better. I know ethnic Russians that were under the recent Nazi party fire-bombings in Western Ukraine and Crimea. It was horrid what they were doing to their own citizens, for me it is on the same level with the Syrian regime and Aleppo.  I just want any action to not harm any innocent civilians, just kill off the Nazis. Unfortunately with all the money and military hardware pouring into the Nazi’s coffers, that is not going to happen. Welcome to the topsy-turvey world where the West supports the Nazis and their new holocaust programme, against a dictator – who I remind you has nukes. And is being goaded into using them by a moronic idiot.Well, remember all Russians are Nazis.\nThey signed a peace treaty with Hitler, exterminated Jews, and did nothing to help win WW II.\nPutin is well known for his collection of Nazi memorabilia and wearing an SS uniform at home.When you have to use obviously false statements to prop up a dictatorship,\nyou’re a dork.Yes, and the earth is flat and Santa Claus is real too…..Every military in the world has a few nazis.@Concerned\nThe article states the cash in hand photo was as a result of a subpoena, which almost certainly means the subpoena included all contents from this guy’s iCloud account and the photo was just part of the contents. The “investigators” were already on his trail. As for the Nazis in Ukraine, why would such Nazis allow Zelensky, a Jew, to lead their country?\nPerhaps they embrace DIE (Diversity, Inclusivity, Equity) ideology more than their Nazism?>  allow Zelensky, a Jewhahahahahaha, what did you smokeThere are no Nazi parties in Ukraine. Russia is actively introducing this idea to the world community. Please, study the material about it carefully.It’s so true. RTFM is such a clue. Just read the M as inforMation and not just Manual :D. How could any reading-able (including all getting to the core of the information without own reading ability) person ever come to the conclusion the nazi-story could be true.\nLet me take a short and simple recap of information i studied:\nPutin~a [almost wrote Russia, but my believes are that most of the Russians weren’t into that] took Crimea (never mentioned just one Nazi for that), Putin~a invaded Ukraine couple of years later -> then Ukraine fires back. Timeline is showing who is the aggressor. Naming the action a ‘special operation’ while forbidding the ‘war’-narrative is more nazi-like then everything i saw Ukraine is doing.“I have no love for Putin. But”  -phrase needs autoflagged.\n“I have no love for Putin simps.” -the autocorrected verbage.> But if he eliminates the Nazi party that took over Ukraine in a coup in 2015\nHey, kremlebot, are they still paying you for posting this nonsense? I didn’t know the troll factory is still in operation.Brian, they’re using your site to perpetuate disinformation that creates social unrest out of thin air.Question:What’s the exchange rate for rubles to USD?like 100 to 1 or something like thatIt’s in the 60’s.  Down a bit from before April.  Not the most comfortable asswipe.these questions are just indicative how clueless about whole situation you are.\nYou can just google USD/RUB exchange rate on Google, and easily see that it is better than before 24 Feb.\nYIKES!When Russians refer to “Nazi coup”, what they mean is a free election held to replace the disgraced pro-Russian president found to have stolen 1.5 billion.  There were 2 additional elections since then with the current administration being a Jewish former comedian.  The argument that Putin is a dictator with nukes would seem to imply Russia is a threat and that NATO and Ukraine needs more funding so good argument, thanks.  The firebombings he may be referring to were in Odessa (not west Ukraine) which was stoked by armed Russian citizens in the region (not Ukrainians).  Russia has bombed their “liberated” ethnic Russian cities to the ground having poured thousands of civilians into mass graves and then conscripted the young men such as Sokolovsky to become “cannon meat” as they put it on the front to be shot in the back by the FSB/KGB if they attempt to retreat hence it’s Russia depopulating the region.  I don’t know of any significant issues in Crimea prior to the covert Russian invasion of the peninsula hence he’s lying when he knows someone who experienced them there.Do you live in a cave or something? I am afraid according to the European Union, the Nazi party is Kremlin and their propaganda, it’s pretty official at this point. Russia is going to have to pay for all of the missile strikes, destroyed life and none of the propaganda is going to help.Instead  of  fighting  to protect his  own country  from invading   Russian forces , Sokolvsky   wimped  out  and left  the country like a  coward . What a loser !Good  to see  that Apple  threw him under the bus  !The Government link for racoon does not work here in Indonesia – is there a suffix miss off it pleaseOutstanding coverage Brian. Well done.People: “I use Apple and not Google because Apple respects my privacy and won’t let the feds have my data!”\nApple: Well, actually, they just need a warrant and we hand it over, so….\nFeds: And we can gin up a warrant for almost any reason.  Try us™Spoken like a true conspiracy theorist who has no clue about how Law Enforcement actually works.\nSuuuurrre… we have nothing better to do than to “gin” up a warrant.I believe your tin foil hat is on too tight.It doesn’t matter what country these depraved criminals are from, Ukraine, Russia, Nigeria, whatever.  If they are destroying people’s lives by stealing their life’s savings, they deserve much more than 20 years in some gulag, maybe even capital punishment.This in turn piece has a tendency to redeem considerable potential customers. How you would support it? Getting this done offers a cool uncommon perspective in issues. I suppose utilizing anything at all legitimate possibly major to convey home elevators is the most essential consideration.I happen to live in Rome, Italy. Back in the early days of the war, my wife and I were heading north on the A1. I recall at a toll intersection, the car in front of us was taking a while to pay the toll and the people were out of their car trying to figure it out. If I recall, the car was a Porsche Cayenne and we were struck by the young age of the male driver and young blond woman, and that the plate or some other marking indicated the car was from Ukraine. My wife and I talked about it at length because we thought, ‘Why isn’t this guy back in Ukraine to fight and instead is driving a super nice car in Italy.’ I can’t ever know for sure whether the two are one and the same but it seems coincidental assuming he was actually in Italy at this point in time. Not that it matters but I could probably go back to any credit card/fuel charges back in March to see where the location was more specifically. Definitely 2 to 3 hours north from Rome.That guy stole 50 million credentials, but somehow the comment section is about Putin and talks it as if his worst crime is draft evasion. Can you just stop plastering your f*cking Ukrainian propaganda everywhere?agreed, maybe a suitable punishment would be to deliver him back to Ukraine, handcuffed from 15,000 feet.\nI see no reason to waist resources on a punk that steals from all, abandons his family and country. Just end him.Guy didn’t just evade the draft, he abandoned his elderly mother and the rest of his family to the tender mercies of Russian artillery while he and his girlfriend went on a joyride across Europe. Providing a service used to rip off strangers thousands of miles away might seem dry and distant. The way he treated family makes his scumbaggery more immediate and relatable.Re the comment section being about Putin & draft evasion, I see exactly one comment like that, from Sunshine State. Everything else seems to be in response to posts from the “Ukraine doesn’t really exist, and Jews are the real Nazis” trolls.Everyone is everything, since the beginning of time.\nAll colors , all ethnicities, all religions are all the same.\nThe human being , in a Matrix.Enjoy your life, until the next One.mr crabplease write about julius kivimakithank you“Sources tell KrebsOnSecurity that Sokolovsky has been consulting with Houston, Tx.-based attorney F. Andino Reynal, the same lawyer who represented Alex Jones in the recent defamation lawsuit against Jones ”What a stupid idea, I don’t believe that, get a decent lawyer, or one that at least does something beyond being a government plantComments are closed.Mailing ListSearch KrebsOnSecurityRecent PostsStory CategoriesWhy So Many Top Hackers Hail from Russia"
   },
   {
      "time": "2022-11-01",
      "title": "Hackers selling access to 576 corporate networks for $4 million",
      "text": " A new report shows that hackers are selling access to 576 corporate networks worldwide for a total cumulative sales price of $4,000,000, fueling attacks on the enterprise.The research comes from Israeli cyber-intelligence firm KELA which published its Q3 2022 ransomware report, reflecting stable activity in the sector of initial access sales but a steep rise in the value of the offerings.Although the number of sales for network access remained about the same as in the previous two quarters, the cumulative requested price has now reached $4,000,000.Initial access brokers (IABs) are hackers who sell access to corporate networks, usually achieved through credential theft, webshells, or exploiting vulnerabilities in publicly exposed hardware.After establishing a foothold on the network, the threat actors sell this corporate access to other hackers who use it to steal valuable data, deploy ransomware, or conduct other malicious activity.The reasons IABs choose not to leverage network access vary, ranging from lacking diverse intrusion skills to preferring not to risk increased legal trouble.IABs still play a crucial role in the ransomware infection chain, even if they got sidelined last year when big ransomware gangs that operated as crime syndicates operated their own IAB departments.The average selling price of these listings was $2,800, while the median selling price reached a record figure of $1,350.KELA also saw a case of a single access being offered for purchase at the astronomical price of $3,000,000. However, this listing was not included in the Q3 '22 stats and totals due to doubts about its authenticity.The top three IABs operated a large-scale business, offering between 40 and 100 accesses for sale in Q3 2022.Based on hacking forum discussions and marketplace listing removal events, the average time to sell corporate access was just 1.6 days, while most were of RDP and VPN types.This quarter's most targeted country was the United States, accounting for 30.4% of all IAB offerings. This stat is close to the 39.1% share of ransomware attacks in Q3 targeting U.S. companies.When looking at the targeted sectors, professional services, manufacturing, and technology topped the list with 13.4%, 10.8%, and 9.4%, respectively. Again, ransomware attacks feature a similar ranking,  emphasizing the connection between the two.As initial access brokers have become an integral part of the ransomware attack chain, properly securing your network from intrusion is crucial.This includes placing remote access servers behind VPNs, restricting access to publicly exposed devices, enabling MFA, and conducting phishing training to prevent the theft of corporate credentials."
   },
   {
      "time": "2022-11-01",
      "title": "Chegg sued by FTC after suffering four data breaches within 3 years",
      "text": " The U.S. Federal Trade Commission (FTC) has sued education technology company Chegg after exposing the sensitive information of tens of millions of customers and employees in four data breaches suffered since 2017.The agency's proposed order would require Chegg to shore up data security, implement multifactor authentication (MFA) to help users secure their accounts, limit collected and stored customer data, and allow customers to access and delete their data.\"Chegg took shortcuts with millions of students' sensitive information,\" said Samuel Levine, Director of the FTC's Bureau of Consumer Protection, on Monday.\"Today's order requires the company to strengthen security safeguards, offer consumers an easy way to delete their data, and limit information collection on the front end. The Commission will continue to act aggressively to protect personal data.\"In April 2018, a former contractor used login information to gain access to Chegg Amazon S3 buckets containing the data of millions of users. The data was later found for sale online, together with roughly 25 million passwords in plaintext, which forced the company to reset the passwords of 40 million users.One year later, after a Chegg executive's credentials were stolen in a phishing attack, a threat actor gained access to the executive email inbox and the personal info (including financial and medical information) of users and employees.After another 12 months, another Chegg employee fell victim to phishing, allowing the attackers to access the payroll system and steal hundreds of employees' W-2 information (e.g., birth date, Social Security numbers).The FTC complaint alleges that these four data breaches were the result of several poor data security practices, including Chegg failure to implement basic security measures such as the lack of MFA support, the use of a single login for all compromised databases, and not monitoring for malicious activity).Chegg is also accused of storing the employees' and customers' sensitive information insecurely and failing to provide its employees and contractors with phishing awareness training.\"Chegg's failure to protect its employees' medical and financial data was particularly problematic since this information is valuable on the open market and is used to commit identity theft and fraud.\"Update October 31, 15:49 EDT: A Chegg spokesperson shared the following update after the article was published:Data privacy is a top priority for Chegg. Chegg worked cooperatively with the Federal Trade Commission on these matters to find a mutually agreeable outcome and will comply fully with the mandates outlined in the Commission’s Administrative Order. The incidents in the Federal Trade Commission’s complaint related to issues that occurred more than two years ago. No monetary fines were assessed. We believe our positive negotiations with the FTC are indicative of our current robust security practices, as well as our efforts to continuously improve our security program. Chegg is wholly committed to safeguarding users’ data and has worked with reputable privacy organizations to improve our security measures and will continue our efforts."
   },
   {
      "time": "2022-11-01",
      "title": "NSA shares supply chain security tips for software suppliers",
      "text": " NSA, CISA, and the Office of the Director of National Intelligence (ODNI) have shared a new set of suggested practices that software suppliers (vendors) can follow to secure the supply chain.This guidance was developed through the Enduring Security Framework (ESF), a public-private partnership working to address threats to U.S. national security systems and critical infrastructure.\"Prevention is often seen as the responsibility of the software developer, as they are required to securely develop and deliver code, verify third party components, and harden the build environment. But the supplier also holds a critical responsibility in ensuring the security and integrity of our software,\" the NSA said on Monday.\"After all, the software vendor is responsible for liaising between the customer and software developer. It is through this relationship that additional security features can be applied via contractual agreements, software releases and updates, notifications and mitigations of vulnerabilities.\"More evidence that the software supply chain is a popular and constant target came from a Microsoft report published in October 2021."
   },
   {
      "time": "2022-11-01",
      "title": "Hong Kong: 43 Suspects Arrested For Defrauding HK$12 Million From Victims Via Online Shopping Scams and Love Frauds - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-11-01",
      "title": "Why Australian Healthcare Industry is Becoming a Lucrative target for Cyber Criminals - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-11-01",
      "title": "US Agencies Issue Guidance on Responding to DDoS Attacks - SecurityWeek",
      "text": " Hi, what are you looking for?The Cybersecurity and Infrastructure Security Agency (CISA), the Federal Bureau of Investigation (FBI), and the Multi-State Information Sharing and Analysis Center (MS-ISAC) have released joint guidance for responding to distributed denial-of-service (DDoS) attacks.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.Zero trust is not a replacement for identity and access management (IAM), but is the extension of IAM principles from people to everyone and...SecurityWeek spoke with more than 300 cybersecurity experts to see what is bubbling beneath the surface, and examine how those evolving threats will present...A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Joanna Burkey, CISO at HP, and Kevin Cross, CISO at Dell, discuss how the role of a CISO is different for a multinational corporation...In this issue of CISO Conversations we talk to two CISOs about solving the CISO/CIO conflict by combining the roles under one person.Security professionals understand the need for resilience in their company’s security posture, but often fail to build their own psychological resilience to stress.LastPass DevOp engineer's home computer hacked and implanted with keylogging malware as part of a sustained cyberattack that exfiltrated corporate data from the cloud...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-11-01",
      "title": "UK officials call for investigation following reports that government hid Liz Truss phone hack",
      "text": " British opposition politicians are calling for an “urgent investigation” into allegations the government covered up a security incident in which the personal phone of Liz Truss, while serving as Foreign Secretary, was hacked by “agents suspected of working for Russian President Vladimir Putin.”According to the newspaper it was discovered during the Conservative Party’s first leadership contest this year, but was “suppressed” by then Prime Minister Boris Johnson alongside the United Kingdom’s most senior civil servant, Cabinet Secretary Simon Case.She added: \"There are also serious security questions around why and how this information has been leaked or released right now which must also be urgently investigated.\"The foreign affairs spokesperson for the Liberal Democrats, Layla Moran, called for “an urgent investigation to uncover the truth,” and added: “If it turns out this information was withheld from the public to protect Liz Truss’s leadership bid, that would be unforgivable.”No other media outlet has been able to verify the Mail on Sunday’s report. A government spokesperson refused to comment on it when contacted by The Record, stating: “We do not comment on individuals’ security arrangements.”However they added that the government had “robust systems in place to protect against cyber threats. That includes briefings for Ministers, and advice on protecting their personal data and mitigating cyber threats.”The report – bylined to the conservative newspaper’s political editor and one of its columnists – has prompted criticism from opposition politicians.The Record has contacted Liz Truss’s parliamentary office and the Russian Embassy for their comments on the allegations.Some aspects of the Mail on Sunday story appear to be either erroneous or misleading. While it mentions “top-secret details of negotiations with key international allies” this is unlikely to refer to material actually classified as TOP SECRET, which is not accessible on personal devices.The report also mistakenly claims that the U.S. “used similar technology” to NSO Group’s spyware Pegasus “to spy on former German chancellor Angela Merkel’s phone over a number of years.”Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   }
]