[
   {
      "time": "2022-11-08",
      "title": "Robin Banks Phishing Service for Cybercriminals Returns with Russian Server",
      "text": " A phishing-as-a-service (PhaaS) platform known as Robin Banks has relocated its attack infrastructure to DDoS-Guard, a Russian provider of bulletproof hosting services.It was also found to prompt users to enter Google and Microsoft credentials on rogue landing pages, suggesting an attempt on part of the malware authors to monetize initial access to corporate networks for post-exploitation activities such as espionage and ransomware.\"This hosting provider is also notorious in not complying with takedown requests, thus making it more appealing in the eyes of threat actors,\" the researchers noted.Chief among the new updates introduced is a cookie-stealing functionality, in what's seen as an attempt to serve a broader clientele such as advanced persistent threat (APT) groups that are looking to compromise specific enterprise environments. It's offered for $1,500 per month.Robin Banks is also said to have incorporated a new security measure that requires its customers to turn on two-factor authentication (2FA) to view the stolen information via the service, or, alternatively, receive the data through a Telegram bot.\"The infrastructure of the Robin Banks phishing kit relies heavily on open source code and off-the-shelf tooling, serving as a prime example of the lowering barrier-to-entry to not only conducting phishing attacks, but also to creating a PhaaS platform for others to use,\" the researchers said.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-08",
      "title": "Iranian actors targeting healthcare via spear-phishing, vulnerability exploit | SC Media",
      "text": "  The headquarters building of the U.S. Department of Health and Human Services is the Hubert H. Humphrey Building, located at the foot of Capitol Hill. (Photo credit: Library of Congress Prints and Photographs Division Washington, D.C.)The white paper details the groups with a primary focus on the healthcare sector, as well as crucial mitigation factors and common exploits. Provider entities should review the insights to ensure they’re employing the necessary security measures.And China and Russia aren’t the only nation states exhibiting malicious behavior on the international stage. Iran and North Korea also continue to carry out sophisticated intrusions targeting U.S. victims. It was those quick actions that enabled the hospital to identify and mitigate the threat, spotlighting the importance of threat sharing and collaboration in the health sector.Fueled by past efforts, the HC3 report notes Iranian threat actors are historically risk-averse and “infamous for wiper malware as well as retaliatory attack strategies.” These actors commonly engage in spear phishing, DDoS attacks, theft of sensitive data, website defacement, and social media-driven operations.What’s more, these groups have signed agreements with both Russia and China on cybersecurity and information tech, furthering their cyber capabilities and possible impacts.Four groups are known to heavily target the healthcare sector and medical researchers, with spear phishing as the most common initial intrusion vector. One group frequently leverages lures tied to the healthcare sector, as well as job postings, password policies, or resumes. The insights detail the three phases of an attack, as well as the aftermath for providers to review. The report also contains a list of commonly exploited vulnerabilities that should be immediately patched or segmented from the network.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Ukraine had experienced a less than a day-long power outage in October 2022 following an attack by Russian state-sponsored hacking operation Sandworm targeted at an electrical substation amid the ongoing Russia-Ukraine war, marking the first cyberattack-related power interruption in the country since 2017, CyberScoop reports.Attacks deployed by Iranian state-backed threat operation MuddyWater against Israel saw the utilization of the new MuddyC2Go command-and-control framework, which replaced the PhonyC2 custom platform following the exposure of its source code, reports The Hacker News.Israel had its technology, logistics, and transportation industries targeted by Iranian advanced persistent threat operation Charming Kitten, also known as APT35 and Imperial Kitten, last month amid its ongoing war with Palestinian militant group Hamas, according to The Record, a news site by cybersecurity firm Recorded Future.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-11-08",
      "title": "Company News: Company Business News, Indian Companies News, Company Analysis, Corporate Industry News",
      "text": " GMR group to raise Rs 3,200 cr loan for developing Vizag Int'l AirportByju's lenders win fight over $1.2 billion loan default, control of unitDunzo says will hit profitability in 12 months, has reduced costsInsurtech startup Bimaplan raises $3.5 mn in pre-series A funding roundBillionaire Flipkart founder Bansal ready to launch stealth AI startupWill stay focused on Delhi & Bengaluru, open charging hubs for biz: Jaggi5G FWA device prices in India now below global average: Thiaw Seng NGWe worked very hard, it's the best proposal: Tata Steel CEO T V NarendranRegulations on AI good as long as we don't hinder innovations: SAP Labs[*] :Trailing 12 MonthsSearchLast Updated: Nov 12 2023 | 07:34 PM ISTShyam Metalics Energy logs over 4-fold jump in Q2; net profit up Rs 482 crShriram Properties Q2 sales bookings up 40% to Rs 608 cr on strong demandBSE Q2 net profit jumps to Rs 118 crore, revenue at record Rs 367 croreLast Updated: Nov 12 2023 | 07:34 PM ISTIndia among top 10 markets for us, not in top 5 yet, says SennheiserRed Hat India's Growth unaffected by global trends, embraces AI, says GMShould touch Rs 1K crore from OTC this year, says Nandini PiramalMankind Pharma sees 21% profit surge in Q2 despite consumer health hurdles"
   },
   {
      "time": "2022-11-08",
      "title": "U.S. unmasks hacker who stole 50,000 bitcoins from Silk Road",
      "text": " The U.S. Department of Justice has announced today the conviction of James Zhong, a mysterious hacker who stole 50,000 bitcoins from the 'Silk Road' dark net marketplace.Zhong pled guilty to money laundering crimes on Friday, November 4, for exploiting a \"withdrawal processing flaw\" that allowed him to withdraw many times more Bitcoin than he deposited on the dark web marketplace.The DoJ announcement also provides more details about the seizure of 51,351.9 Bitcoin, valued at over $3.3 billion at the time of the action, that occurred in November 2021. James Zhong used to be a member of the notorious dark net marketplace 'Silk Road,' a now-defunct illicit goods market that operated between 2011 and 2013, having over 100,000 members.As the defendant confessed, in September 2012, he stole 50,000 bitcoin from Silk Road by exploiting a flaw in the market's transaction system.Zhong funded nine different accounts with an initial deposit of 200 to 2,000 bitcoin and then triggered 140 withdrawal transactions in rapid succession.The hacker exploited a lag in the market's transaction system allowing someone to withdraw their own escrow multiple times.This way, Zhong tricked the system into releasing 50,000 bitcoin, which he then moved to various wallets to obscure the money trace.In 2017, after Bitcoin split into Bitcoin Cash and Bitcoin SV, Zhong received 50,000 Bitcoin cash. The Bitcoin Cash was converted into 3,500 Bitcoins, bringing Zhong's total to 53,500 Bitcoin linked to Silk Road.\"Thanks to state-of-the-art cryptocurrency tracing and good old-fashioned police work, law enforcement located and recovered this impressive cache of crime proceeds.\"Today's Department of Justice announcement explains that the seizure occurred on November 9, 2021, when law enforcement authorities holding a search warrant located the following on Zhong's residence:In addition to the above, the cybercriminal also forfeited all property, including investments in real estate and additional digital assets not linked to the criminal proceedings.In March 2022, Zhong voluntarily surrendered an additional 825.4 Bitcoins to the authorities, and in May 2022, he gave up another 35.5 Bitcoin.Zhong is scheduled to hear his sentence on February 22, 2023, with the maximum potential penalty for wire fraud being 20 years in prison."
   },
   {
      "time": "2022-11-08",
      "title": "Ukrainian hacktivists claim to leak trove of documents from Russia’s central bank",
      "text": " Ukrainian hacktivists claim to have breached the Central Bank of Russia, stealing thousands of internal documents.“If Russia’s Central Bank cannot protect its own data, how can it guarantee the stability of the ruble?” hacktivists wrote on the Telegram messaging app. The alleged heist was carried out by members from Ukraine’s IT Army — a group of more than 200,000 cyber volunteers formed after Russia’s invasion of Ukraine in late February to conduct coordinated distributed denial-of-service attacks on Russian websites.So far, it is difficult to say how significant the alleged leak of documents is. Some of the published files date back nearly two decades, while others outline the bank's strategy for the next two years.Some documents detail the Russian policy of replacing imported computer programs and software with domestic technology “to ensure the smooth operation of the bank's payment system.”Due to sanctions imposed after Russia's invasion of Ukraine, many international tech companies have left Russia or suspended operations, forcing the Kremlin to look for local alternatives.The IT Army also released documents that allegedly contain the personal data of Russian servicemen, their phone numbers, and bank account numbers.Russian banks have been the most popular targets among Ukrainian hacktivists since the beginning of the invasion. Earlier in September, the IT Army also hacked Russia’s third-largest bank, Gazprombank.A DDoS attack took the bank's website down for four hours, preventing customers from sending payments, accessing their personal accounts, and using mobile banking, according to the IT Army.“For a successful attack, we had to go through their entire network and find vulnerabilities there,” an IT Army representative told The Record. In order to bypass Russian DDoS protection services, the IT Army claimed to have created “a special program” that attacks the system “in a non-standard way, so it is difficult to deal with it.”“The attack was so powerful that even Rostelecom — Russia's largest internet provider — suffered serious difficulties,” Egorkin said at a conference in September. Nonetheless, the impacts of the group’s cyberattacks on the course of the cyber war between Ukraine and Russia remains unclear. Some of the operations have managed to temporarily disrupt Russian businesses or at least cause concern.The departure from Russia of global technology and cybersecurity companies like Cisco, IBM, Oracle, Imperva, Fortinet, Norton, and Avast has also made Russian businesses more vulnerable to cyberattacks.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-08",
      "title": "Maple Leaf Foods suffers outage following weekend cyberattack",
      "text": " Maple Leaf Foods confirmed on Sunday that it experienced a cybersecurity incident causing a system outage and disruption of operations.Maple Leaf Foods is Canada's largest prepared meats and poultry food producer, operating 21 manufacturing facilities, employing 14,000 people, and contracting over 700 barns. In 2021, the firm generated $3.3 billion in sales.Hackers often launch cyberattacks during weekends, hoping to find incident responders understaffed, and maximize their chances for success.Despite the timing, the Canadian food packaging giant says its IT team took immediate action to respond to the incident. Currently, the firm's specialists are working with cybersecurity and recovery experts to resolve the situation as soon as possible.\"The company is executing its business continuity plans as it works to restore the impacted systems,\" reads the announcement.\"However, it expects that full resolution of the outage will take time and result in some operational and service disruptions.\"Maple Leaf Foods says it will continue to work with customers and partners to minimize the food supply disruption in the Canadian market.In a comment sent to BleepingComputer, a firm spokesperson said that their investigation is still underway, but it is yet to determine how the cybersecurity incident happened.As for the following stages of recovery, the spokesperson told us they expect the disruption to continue as they restore impacted systems but will strive to keep that impact to a minimum.\"At this time, we are focused on restoring business continuity.\"\"We do expect some disruption in our operations and service levels as we work through the restoration process, but our team is deploying our business continuity plan and implementing workarounds to mitigate the impact on our operations and business.\" - Maple Leaf Foods.Finally, the firm has added that they have no insight into any possible issues related to this incident impacting any of its partner companies.At the time of writing, BleepingComputer has not noticed any announcements on cybercrime forums or ransomware gang extortion portals listing Maple Leaf Foods."
   },
   {
      "time": "2022-11-08",
      "title": "Police Arrests A Suspect Over Election Vote Tampering  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " The Pueblo Police Department has caught a suspect in association with a suspected case of voter machine tampering that happened at Pueblo Country election headquarters around one hour prior to the polls closing on June 28, 2022. 31-year-old Richard Patton from Pueblo was arrested Thursday morning on account of election tampering and cybercrimes. As per state records, Patton is a registered Democrat. Pueblo Police Department has assured the community that all voter security measures were followed to protect the voting process and make it successful. No information has been compromised, and the investigation is ongoing. \"Colorado law requires that tamper-evident seals are affixed to voting equipment under strict security requirements, including a chain of custody of election officials. Nobody else used the machine after Patton. The voting machine was taken into evidence, as well as security camera footage from that evening,\" said Pueblo Chieftain. Pueblo PD and the Pueblo County Sheriff's Office reports suggest that at 6 pm on election night, Patten went to the downtown office of the elections department to vote in person. All the registered Colorado voters are sent ballots in the mail however, one can also put a vote on in-person machines at registered sites. Election workers informed the police department that Patten asked them about the security situation before casting a ballot. Patton dropped off his ballot before he left the office, but the records prove that his ballot was cast. Soon after he left, an election worker went to clean the machine as per the covid protocols. The worker found an error code on the display of the machine that Patton used and informed supervisors. An error code was displayed on the screen. The Pueblo Chieftain reports:\"Drake Rambke, the election supervisor dispatched to Pueblo County after thousands of incorrect primary ballots were mailed to some Pueblo voters, told law enforcement that evening that he wasn’t sure if a USB device had been plugged into the machine, but multiple election workers said the seals on the voting machines had been tampered with.\"your nameYour Emailyour message"
   },
   {
      "time": "2022-11-08",
      "title": "Ransomware gang threatens to release stolen Medibank data",
      "text": " A ransomware gang that some believe is a relaunch of REvil and others track as BlogXX has claimed responsibility for last month's ransomware attack against Australian health insurance provider Medibank Private Limited.Medibank is one of Australia's largest private health insurers, covering over 3.9 million people and having 4,000 employees.The ransomware gang threatened today in a new entry added to its data leak website that it would leak data allegedly stolen from Medibank's systems within 24 hours.The gang is yet to reveal how much data it exfiltrated out of Medibank's network and hasn't shared any proof to verify these claims.A Medibank spokesperson was not available for comment when contacted by BleepingComputer earlier today to confirm the ransomware gang's claims.Due to the website redirects and code similarities, the new operation is considered by some to be a relaunch of the REvil operation, either by the developers or other members.Although Medibank is yet to confirm what hacking group is behind this attack, the company said in a press release published today that it refused a ransom demand made by the attackers.\"Today, we've announced that no ransom payment will be made to the criminal responsible for this data theft,\" Medibank said.\"Based on the extensive advice we have received from cybercrime experts we believe there is only a limited chance paying a ransom would ensure the return of our customers' data and prevent it from being published.\"The health insurer added that paying the attackers would also likely motivate them to go after customers affected by the data breach.Furthermore, a ransom payment will encourage others to attack Australian organizations, putting more people at risk.\"There is a strong chance that paying puts more people in harm's way by making Australia a bigger target,\" the company added. \"This decision is consistent with the position of the Australian Government.\"Today, before the ransomware gang starts leaking the allegedly stolen data to back their claims and attempt to force Medibank's hand into negotiating a deal, the company revealed the attackers gained access to sensitive information belonging to millions of customers.The complete rundown of data Medibank believes was exposed in the breach includes the following:Medibank added that it also believes the cybercriminals behind the October attack have not gained access to financial information (credit card and banking details), primary identity documents (e.g., driver's licenses), or health claims data for extras services (like dental, physio, optical and psychology).\"Customers should remain vigilant as the criminal may publish customer data online or attempt to contact customers directly.\""
   },
   {
      "time": "2022-11-08",
      "title": "Killnet targets Eastern Bloc government sites, but fails to keep them offline",
      "text": " Websites belonging to several state intelligence agencies across the former Eastern Bloc are online and functioning despite attempted distributed denial-of-service (DDoS) attacks from a pro-Kremlin group over the weekend.The hacking group Killnet, which for months has targeted government agencies and companies that criticize Russia or support Ukraine, listed the sites for the intelligence services of Estonia, Poland, Romania, Bulgaria, and Moldova on its Telegram channel, suggesting it had successfully targeted them.However, any outages if they occurred appear to have been extremely brief and the sites are now all functioning normally.The group, which has not displayed any sophisticated capabilities since emerging in February, primarily aims to target websites and organizations that will garner media attention.“These attacks are generally opportunistic in nature and, with DDoS mitigation steps, have minimal operational impact on victims; however, hacktivists will often publicize and exaggerate the severity of the attacks on social media. As a result, the psychological impact of DDoS attacks is often greater than the disruption of service,” the notice added.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-08",
      "title": "Russian hackers to blame for 75% of ransomware incidents in USA",
      "text": " The White House is working on establishing an International Counter Ransomware Task Force (ICRTF) that will be led by Australia. There also will be a Regional Cyber Defense Centre (RCDC) in Kaunas, Lithuania. The U.S. and its allies will also undertake biannual counter-ransomware exercises, and they will actively share information such as details about cryptocurrency wallets used for laundering extorted funds and ransomware strains on an active and enduring basis. The cooperation and multiple actions between the U.S. and its allies will aim to decrease the growing threat from Russia-linked bad actors.Ransomware attacks are a severe problem in the U.S. and the rest of the world. Each year tens of thousands of individuals and organizations become victims of such attacks. While the USA and its allies are working towards eliminating the threat, being prepared with the necessary antivirus tools is undoubtedly a step toward in the battle against the hackers.Panda Security specializes in the development of endpoint security products and is part of the WatchGuard portfolio of IT security solutions. Initially focused on the development of antivirus software, the company has since expanded its line of business to advanced cyber-security services with technology for preventing cyber-crime.Your email address will not be published. Required fields are marked * \n\nΔInput your search keywords and press Enter."
   }
]