[
   {
      "time": "2022-10-19",
      "title": "Ransom Cartel linked to notorious REvil ransomware operation",
      "text": " Researchers have linked the relatively new Ransom Cartel ransomware operation with the notorious REvil gang based on code similarities in both operations' encryptors.A new report from Palo Alto Network's Unit 42 sheds further light on the connection between the two cybercrime gangs, sharing similarities in techniques, tactics, and procedures (TTPs) and, most importantly, common ground in the code of their malware.Because the source code of REvil's encrypting malware was never leaked on hacking forums, any new project using similar code is either a rebrand or a new operation launched by a core member of the original gang.When analyzing encryptors for Ransom Cartel, the researchers found similarities in the structure of the configuration embedded in the malware, although the storage locations are different.The samples analyzed by Unit 42 show that Ransom Cartel is missing some configuration values, meaning that the authors are either trying to make the malware leaner or that their basis is an earlier version of the REvil malware.An interesting finding is that the Ransom Cartel samples do not feature REvil's strong obfuscation, which might mean that the authors of the new malware don't possess REvil's original obfuscation engine.There are also similarities in the tactics, techniques, and procedures (TTPs) used by REvil and Ransom Cartel, such as double-extortion attacks, large ransom demands, and a data leak site to pressure victims into paying a ransom.However, one technique used by Ransom Cartel, and not seen in REvil attacks, is using the Windows Data Protection API (DPAPI) to steal credentials.These credentials are then used to compromise Linux ESXi servers and authenticate to their vCenter web interfaces.Finally, the threat actors shut down VMs, terminate all related processes, and encrypt Vmware-related files (.log, .vmdk, .vmem, .vswp and .vmsn).The existence of DonPAPI, a not commonly used tool, indicates that the operators of Ransom Cartel are experienced threat actors.While there are strong connections between Ransom Cartel and REvil, they are not the only ransomware gang currently using REvil's code.Researchers at the time told BleepingComputer that the BlogXX encryptor was not only compiled from REvil's source code but also included new changes.\"Yes, my assessment is that the threat actor has the source code. Not patched like \"LV Ransomware\" did,\" security researcher R3MRUM told BleepingComputer at the time.AdvIntel CEO Vitali Kremez also told BleepingComputer that BlogXX's encryptors included a new 'accs' configuration option that contained account credentials for the targeted victim.Furthermore, the new ransomware operation used identical ransom notes and called themselves 'Sodinokibi,' an alternate name for REvil, on their Tor payment sites.However, unlike Ransom Cartel, BlogXX's history has an additional component that lends strong evidence that they are, in fact, the REvil rebrand.After REvil’s shut down, the gang’s old Tor websites were revived, but this time redirected visitors to the BlogXX operation’s data leak site.While these sites looked nothing like REvil's previous websites, the fact that the old Tor sites were redirecting to BlogXX's sites showed that the new operation had control of REvil's Tor private keys.As only the original REvil operators would possess these Tor private keys, it showed a strong connection between the two gangs.While irrefutable evidence that BlogXX or Ransom Cartel are rebrands of the REvil operation is yet to be found, it’s quite clear that at least some of the original members are behind these new ransomware operations."
   },
   {
      "time": "2022-10-19",
      "title": "Paris: l'hôpital Pierre-Rouquès-Les Bluets victime d'une cyberattaque",
      "text": " (Illustration) - Thomas Samson - AFPLa continuité des soins est néanmoins assurée. \"La plupart des dossiers médicaux restent accessibles à nos équipes\", selon la direction. Il est par ailleurs toujours possible de prendre rendez-vous au sein de l'établissement hospitalier par l'intérmédiaire de la plateforme Doctolib, mais certaines consultations sont suspendues.Outre le ralentissement des services de l'hôpital, les auteurs de la cyberattaque ont volé des données personnelles, \"y compris des données de santé\", de plusieurs patients.L'établissement n'a donné aucune information à propos d'une éventuelle rançon demandée par les cybercriminels.© Copyright 2006-2023 BFMTV.com. Tous droits réservés. Site édité par NextInteractive"
   },
   {
      "time": "2022-10-19",
      "title": "FBI: Scammers likely to target US Student Loan Debt Relief applicants",
      "text": " The FBI has released a warning that scammers may be targeting individuals seeking to enroll in the Federal Student Aid program to steal their personal information, payment details, and money.Eligible individuals must have an income below $125,000 or a total of $250,000 for joint filers, and the deadline for application is December 31, 2023.The program represents an opportunity for scammers to set up fraudulent websites that mimic the application form, send \"benefit eligibility\" phishing emails or SMS, and try multiple fraud channels against people.\"Cybercriminals and fraudsters use their schemes to receive payment for services they will not provide or collect victim information they can then use to facilitate a variety of other crimes,\" the agency added.Applying for the real federal student aid program is free of charge, so potential targets should pay attention to any requests to pay for enrolling in the program or for processing the application.Furthermore, the real application process does not require users to log into any accounts, nor does it ask individuals to upload any documents, personal or financial, during the first phase of the application.Finally, the U.S. government will not distribute notices to program beneficiaries, so any emails, phone calls, or SMS messages pointing to alleged application forms are attempts to defraud the recipients."
   },
   {
      "time": "2022-10-19",
      "title": "Oracle Critical Patch Update Advisory - October 2022",
      "text": " Oracle continues to periodically receive reports of attempts to maliciously exploit vulnerabilities for which Oracle has already released security patches. In some instances, it has been reported that attackers have been successful because targeted customers had failed to apply available Oracle patches. Oracle therefore strongly recommends that customers remain on actively-supported versions and apply Critical Patch Update security patches without delay.Security vulnerabilities addressed by this Critical Patch Update affect the products listed below. The product area is shown in the Patch Availability Document column.Please click on the links in the Patch Availability Document column below to access the documentation for patch availability information and installation instructions. Oracle lists updates that address vulnerabilities in third-party components that are not exploitable in the context of their inclusion in their respective Oracle product beneath the product's risk matrix.The protocol in the risk matrix implies that all of its secure variants (if applicable) are affected as well. For example, if HTTP is listed as an affected protocol, it implies that HTTPS (if applicable) is also affected. The secure variant of a protocol is listed in the risk matrix only if it is the only variant affected, e.g. HTTPS will typically be listed for vulnerabilities in SSL and TLS.Due to the threat posed by a successful attack, Oracle strongly recommends that customers apply Critical Patch Update security patches as soon as possible. Until you apply the Critical Patch Update patches, it may be possible to reduce the risk of successful attack by blocking network protocols required by an attack. For attacks that require certain privileges or access to certain packages, removing the privileges or the ability to access the packages from users that do not need the privileges may help reduce the risk of successful attack. Both approaches may break application functionality, so Oracle strongly recommends that customers test changes on non-production systems. Neither approach should be considered a long-term solution as neither corrects the underlying problem.Product releases that are not under Premier Support or Extended Support are not tested for the presence of vulnerabilities addressed by this Critical Patch Update. However, it is likely that earlier versions of affected releases are also affected by these vulnerabilities. As a result, Oracle recommends that customers upgrade to supported versions.The following people or organizations reported security vulnerabilities addressed by this Critical Patch Update to Oracle:In this Critical Patch Update, Oracle recognizes the following for contributions to Oracle's Security-In-Depth program:For this quarter, Oracle recognizes the following for contributions to Oracle's On-Line Presence Security program:Critical Patch Updates are released on the third Tuesday of January, April, July, and October. The next four dates are:This Critical Patch Update contains 14 new security patches for Oracle Database Products divided as follows:Oracle has released client Database fixes for CVEs which we believe are not exploitable in the context of the Database. The Database server includes a full copy of all the client bits, so any patch that is client applicable, also has to be applied on the server side."
   },
   {
      "time": "2022-10-19",
      "title": "Verizon notifies prepaid customers their accounts were breached",
      "text": " Verizon warned an undisclosed number of prepaid customers that attackers gained access to Verizon accounts and used exposed credit card info in SIM swapping attacks.\"Using the last four digits of that credit card, the third party was able to gain access to your Verizon account and may have processed an unauthorized SIM card change on the prepaid line that received the SMS linking to this notice. If a SIM card change occurred, Verizon has reversed it.\"Verizon added that it blocked further unauthorized access to its clients' accounts and found no evidence that this malicious activity is still ongoing.The company also reset the Account Security Codes (PINs) for an undisclosed number of customers \"in an abundance of caution.\"According to the notification, the attackers couldn't access the full credit card number or the customers' banking information, financial information, passwords, Social Security numbers, tax IDs, or other personal details since user accounts don't contain this info.However, Verizon said the threat actors could have accessed names, telephone numbers, billing addresses, price plans, and other service-related information on compromised accounts.One of the Verizon customers who received this notice told BleepingComputer that they were the victims of a SIM swap attack more than a week before Verizon alerted customers.\"On 10/7 when I was sim-swapped, the attackers breached my email and attempted to access my crypto accounts,\" they told BleepingComputer.\"I suspect they used information from the Coinbase breach to target me but got access due to the exposure of credit card info from Verizon.\"While Verizon's notification was published on its website earlier this week to warn customers of these attacks, the telecom giant made sure that search engines won't index the page by adding 'noindex' and 'nofollow' tags to its metadata.\"We recently identified possible unauthorized activity involving about 250 prepaid wireless accounts. We secured these accounts and put in place additional measures to protect our customers from further unauthorized access or fraud,\" a Verizon spokesperson told BleepingComputer.\"Verizon has notified the impacted customers and advised on additional steps the customers can take to enhance their account security. We take these matters seriously, and continually enhance and evolve our security protocols to keep customer data and accounts secure.Once the phone number is locked, it can no longer be ported to another line/carrier or swapped to another SIM unless the account owner removes the lock.Update October 18, 16:28 EDT: Added Verizon statement."
   },
   {
      "time": "2022-10-19",
      "title": "Cyberattack disrupts Bulgarian government websites over ‘betrayal to Russia’",
      "text": " The distributed denial-of-service (DDoS) attack briefly took down the websites of the presidential administration, the Defense Ministry, the Interior Ministry, the Justice Ministry, and the Constitutional Court. The pro-Russian hacking group Killnet claimed responsibility for the attack, saying it was a punishment “for betrayal to Russia and the supply of weapons to Ukraine.” The attack is just the latest in a string of high-profile Killnet DDoS campaigns, which knock websites offline by flooding them with junk traffic. The attacks have made websites temporarily unavailable, but have not done serious damage. Killnet has been active since the start of the Russian invasion of Ukraine. It previously targeted dozens of government networks across Europe in countries including Romania, Italy, Lithuania, Norway, Poland, Finland, and Latvia.Although the attack did not have serious consequences and no sensitive data was leaked, it provoked a strong reaction from Bulgarian government officials. Geshev called it \"a serious problem\" and \"an attack on the Bulgarian state.\"Bulgaria intends to request the extradition of this hacker from Russia, according to Sarafov, but the chance that the Kremlin will cooperate is very low, he said.\"In a totalitarian state, such a group cannot act independently. It performs the tasks assigned to it,” he said.Killnet usually attacks countries that actively support Ukraine. Bulgaria, however, has historically close ties to Russia and doesn't support Ukraine's attempts to become a member of NATO.During the war, Bulgaria has provided asylum to Ukrainian refugees, sent humanitarian aid to Ukraine, and repaired Ukraine’s heavy weapons. One of the reasons for Killnet's attack, according to Kolev, could be Bulgaria's active involvement in the political arena. “Killnet has attacked more than 50 countries,” he said. “Bulgaria's turn has come.”Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-19",
      "title": "German cybersecurity chief out amid reports of Russia ties | AP News",
      "text": " Copyright 2023 The Associated Press. All Rights Reserved.FILE -- Arne Schoenbohm, President of the Federal Office for Information Security (BSI), attends a perss conference in Bonn, Germany, Monday, Aug. 8, 2022. Germany’s Interior Ministry says that the head of the national cybersecurity agency has been dismissed following reports of possible ties to Russian intelligence, the Interior Ministry said Tuesday. (Rolf Vennenbernd/dpa via AP, file)BERLIN (AP) — The head of Germany’s national cybersecurity agency has been dismissed following reports of possible ties to Russian intelligence, the Interior Ministry said Tuesday.The ministry said that Interior Minister Nancy Faeser dismissed Arne Schoenbohm as head of the BSI agency following the allegations, which “damaged the necessary confidence of the public in the neutrality and impartiality” of his management, German news agency dpa reported.Schoenbohm co-founded a cybersecurity group a decade ago that brings together experts from public institutions and the private sector. German media have reported that one of its members was a company founded by a former Russian intelligence agent, which the group said last week that it had thrown out. The German government said over a week ago that it was investigating the reports comprehensively.There is growing concern in Germany that the country’s critical infrastructure might be targeted by Russia because of Berlin’s support for Ukraine in the war.\nSchoenbohm, 53, had been the head of the BSI since February 2016. There was no immediate word on who would succeed him.The ministry said Faeser’s decision was also in the interest of Schoenbohm himself and of the agency’s 1,500 employees and their ability to work without speculation about the personnel issue, dpa reported.It said that the allegations would be looked into and evaluated thoroughly, and that there is a presumption of innocence for Schoenbohm while that evaluation is ongoing.German news weekly Der Spiegel quoted Schoenbohm as saying that, since there had been no “feedback” on the allegations, he had asked on Monday for disciplinary proceedings to be opened to clear up the matter. He said he didn’t yet know “what the ministry has examined and what the concrete allegations against me look like.” Copyright 2023 The Associated Press. All Rights Reserved."
   },
   {
      "time": "2022-10-19",
      "title": "Researchers Keep a Wary Eye on Critical New Vulnerability in Apache Commons Text",
      "text": " Researchers are closely tracking a critical, newly disclosed vulnerability in Apache Commons Text that gives unauthenticated attackers a way to execute code remotely on servers running applications with the affected component.Researchers tracking the bug so far have been cautious in their assessment of its potential impact. Noted security researcher Kevin Beaumont wondered in a tweet on Monday if the vulnerability could result in a potential Log4shell situation, referring to the infamous Log4j vulnerability from late last year.\"We are aware of Proof-Of-Concept code for CVE-2022-42889 that can trigger the vulnerability in an intentionally vulnerable and controlled environment,\" GreyNoise researchers say. \"We are not aware of any examples of widely deployed real-world applications utilizing the Apache Commons Text library in a vulnerable configuration that would allow attackers to exploit the vulnerability with user-controlled data.\"GreyNoise is continuing to monitor for any evidence of \"proof-in-practice\" exploit activity, they added.The security vendor said people using Java version 15 and later should be safe from code execution since script interpolation won't work. But other potential vectors for exploiting the flaw — via DNS and URL — would still work, it noted.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   }
]