[
   {
      "time": "2022-07-14",
      "title": "CIA Coder Convicted of Massive Leak of US Hacking Tools - SecurityWeek",
      "text": " Hi, what are you looking for?A former CIA programmer was found guilty in New York federal court Wednesday of the 2017 leak of the US spy agency’s most valuable hacking tools to WikiLeaks, two years after his initial prosecution ended in mistrial.ByFlipboardRedditWhatsappWhatsappEmailAFP 2023Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailNo one combatting cybercrime knows everything, but everyone in the battle has some intelligence to contribute to the larger knowledge base.Daniel Kelley was just 18 years old when he was arrested and charged on thirty counts – most infamously for the 2015 hack of...The FBI dismantled the network of the prolific Hive ransomware gang and seized infrastructure in Los Angeles that was used for the operation.The Hive ransomware website has been seized as part of an operation that involved law enforcement in 10 countries.Employees of Chinese tech giant ByteDance improperly accessed data from social media platform TikTok to track journalists in a bid to identify the source...Spanish Court agreed to extradite Joseph James O’Connor to he U.S., who allegedly took part in the July 2020 hacking of Twitter accounts of...US government reminds the public that a reward of up to $10 million is offered for information on cybercriminals, including members of the Hive...A global cyber espionage campaign has resulted in the networks of many organizations around the world becoming compromised after the attackers managed to breach...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-14",
      "title": "New Lilith ransomware emerges with extortion site, lists first victim",
      "text": " A new ransomware operation has been launched under the name 'Lilith,' and it has already posted its first victim on a data leak site created to support double-extortion attacks.Upon execution, Lilith attempts to terminate processes that match entries on a hardcoded list, including Outlook, SQL, Thunderbird, Steam, PowerPoint, WordPad, Firefox, and more.This frees up valuable files from applications that may be using them at the moment, thus making them available for encryption.Before the encryption process is initiated, Lilith creates and drops ransom notes on all the enumerated folders.The note gives the victims three days to contact the ransomware actors on the provided Tox chat address, or they are threatened with public data exposure.The file types excluded from encryption are EXE, DLL, and SYS, while Program Files, web browsers, and the Recycle Bin folders are also bypassed.Interestingly, Lilith also contains an exclusion for 'ecdh_pub_k.bin,' which stores the local public key of BABUK ransomware infections. This might be a remnant from copied code, so it could be an indication of a link between the two ransomware strains.Finally, the encryption takes place using Windows cryptographic API, while the Windows’ CryptGenRandom function generates the random key.The ransomware appends the \".lilith\" file extension when encrypting files, as shown below.While it's too early to tell if Lilith could develop into a large-scale threat or a successful RaaS program, it's something analysts should keep an eye on.Its first victim, which has been removed from the extortion site at the time of writing this, was a large construction group based in South America.This is a sign that Lilith might be interested in big-game hunting and that its operators are already aware of the political labyrinths they need to navigate to avoid being targeted by law enforcement.After all, most of these novel ransomware projects are rebrands of older programs, so their operators typically know the intricacies of the field very well."
   },
   {
      "time": "2022-07-14",
      "title": "Microsoft releases PoC exploit for macOS sandbox escape vulnerability",
      "text": " Microsoft has published the exploit code for a vulnerability in macOS that could help an attacker bypass sandbox restrictions and run code on the system.Abusing macros in Office documents to deploy malware has long been an efficient and popular technique to compromise Windows systems.The same could be achieved on macOS machines lacking the proper security updates, Microsoft warns in a report today.Jonathan Bar Or of the Microsoft 365 Defender Research Team explains that the vulnerability was discovered while looking into methods to run and detect malicious macros in Microsoft Office documents on macOS.To ensure backward compatibility, Microsoft Word can read and write files that come with the prefix “~$,” which is defined in the app’s sandbox rules. The researchers came up with a proof-of-concept (PoC) that used the -stdin option for the open Command on a Python file to bypass the “com.apple.quarantine” extended attribute restriction.The demo exploit code is as simple as dropping a Python file that contains arbitrary commands and has in its name the special prefix for Word.Using the open -stdin command starts the Python app with the specially crafted file as the standard input.“Python happily runs our code, and since it’s a child process of launchd, it isn’t bound to Word’s sandbox rules,” Jonathan Or Bar explains.The researchers even managed to compress the exploit code above so much that it fits into a tweet.Microsoft reported the vulnerability to Apple last year in October and a fix was delivered with the macOS security updates in May 2022 (Big Sur 11.6.6)"
   },
   {
      "time": "2022-07-14",
      "title": "Retbleed: New Speculative Execution Attack Targets Intel, AMD Processors - SecurityWeek",
      "text": " Hi, what are you looking for?Researchers at Swiss university ETH Zurich have devised a new speculative execution attack that can lead to information leaks and works against both Intel and AMD processors.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-14",
      "title": "Honda redesigning latest vehicles to address key fob vulnerabilities",
      "text": " Honda said it is addressing a spate of recently-discovered vulnerabilities in its newly designed models after researchers found bugs affecting the key fob systems in its vehicles dating back to 2012.The researchers found a way to effectively capture the different codes generated by the PRNG and use them to eventually open the vehicle.They tested the 10 most popular models of Honda released since 2012 and found all were susceptible to the attack, leading them to claim all Honda models are vulnerable. The models they tested include Honda Civic 2012, Honda X-RV 2018, Honda C-RV 2020, Honda Accord 2020, Honda Odyssey 2020, Honda Inspire 2021, Honda Fit 2022, Honda Civic 2022, Honda VE-1 2022 and the Honda Breeze 2022.A Honda spokesperson told The Record that they also have confirmed the report but claimed that hackers would need “sophisticated tools and technical know-how to mimic Remote Keyless commands and gain access to certain vehicles of ours.” “However, while it is technically possible, we want to reassure our customers that this particular kind of attack, which requires continuous close-proximity signal capture of multiple sequential RF transmissions, cannot be used to drive the vehicle away,” the spokesperson said. “Furthermore, Honda regularly improves security features as new models are introduced that would thwart this and similar approaches.”The spokesperson added that all “completely redesigned” 2022 and 2023 model year vehicles have an “improved system” that addresses the issue. “Currently this includes 2022 Civic, 2022 MDX and 2023 HR-V. Our newer system transmits codes that immediately expire, which would prevent this type of attack from being successful,” the Honda spokesperson explained. The vulnerability was initially discovered last year and tagged as CVE-2021-46145, but that was only connected specifically to Honda Civic 2012. The bug is informally known as “Rolling-PWN” but the Star-V Lab researchers noted it is called that – as opposed to Honda-PWN – because “this bug may exist in other brands of vehicles too.”“Although the main targets for the research is Honda Automobiles, we have leads to show the impact of this vulnerability also applies to other car manufacturers. We will release more details in the future,” the researchers said.They said solutions to the vulnerability include bringing vehicles back to local dealerships and more.“But the recommended mitigation strategy is to upgrade the vulnerable BCM firmware through Over-the-Air (OTA) Updates if feasible. However, some old vehicles may not support OTA,” the researchers explained. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-14",
      "title": "New UEFI firmware flaws impact over 70 Lenovo laptop models",
      "text": " The UEFI firmware used in several laptops made by Lenovo is vulnerable to three buffer overflow vulnerabilities that could enable attackers to hijack the startup routine of Windows installations.Lenovo has issued a security advisory disclosing three medium severity vulnerabilities tracked as CVE-2022-1890, CVE-2022-1891, and CVE-2022-1892.The first is an issue in the ReadyBootDxe driver used in some Lenovo notebook products, while the last two are buffer overflow bugs in the SystemLoadDefaultDxe driver.This second driver is used in the Yoga, IdeaPad, Flex, ThinkBook, V14, V15, V130, Slim, S145, S540, and S940 Lenovo lines, affecting over 70 individual models.According to ESET, whose analysts discovered the three bugs and reported them to Lenovo, an attacker could leverage them to hijack the OS execution flow and disable security features.\"An attacker could create a specially crafted NVRAM variable, causing buffer overflow of the Data buffer in the second GetVariable call.\"UEFI firmware attacks are extremely dangerous because they enable threat actors to run malware early in an operating system's boot process, even before Windows built-in security protections are activated.This early level of access allows the malware to bypass or disable OS-level security protections, evade detection, and persist even after a disk is formatted.While low-skilled remote actors can't easily exploit these flaws, more capable hackers with access (malware or hands-on) to a targeted machine could leverage the vulnerabilities for silent yet ultra-powerful compromises."
   },
   {
      "time": "2022-07-14",
      "title": "https://www.bleepingcomputer.com/news/security/8-million-stolen-in-large-scale-uniswap-airdrop-phishing-attack/",
      "text": " "
   },
   {
      "time": "2022-07-14",
      "title": "U.S. FTC Vows to Crack Down on illegal Use and Sharing of Citizens' Sensitive Data",
      "text": " The U.S. Federal Trade Commission (FTC) warned this week that it will crack down on tech companies' illegal use and sharing of highly sensitive data and false claims about data anonymization.\"These companies often build profiles about consumers and draw inferences about them based on the places they have visited,\" the FTC said, adding the abuse of mobile location and health information exposes users to \"significant harm.\"To that end, the consumer protection authority said it intends to \"vigorously enforce\" the law should it uncover cases where location, health, or other sensitive data are exploited for profit or other ulterior motives.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-07-14",
      "title": "\r\n\tHavanaCrypt Ransomware Masquerades as a Fake Google Update - Infosecurity Magazine\r\n",
      "text": " News WriterA new ransomware family dubbed ‘HavanaCrypt’ disguises itself as a Google software update app, using a Microsoft web hosting service IP address as its command and control server to circumvent detection.The HavanaCrypt ransomware family detailed by Trend Micro is similar in its aims: “It disguises itself as a Google software update application and uses a Microsoft web hosting service IP address as its command and control server to circumvent detection,” Trend Micro said in a blog.HavanaCrypt avoids encrypting files in several directories, including Tor. Taking this into account, it is “highly possible” that the ransomware’s author is planning to communicate via the Tor browser, Trend Micro researchers said. In addition, the researchers pointed out that HavanaCrypt does not drop a ransom note. “This might be an indication that HavanaCrypt is still in its development phase,” they said. “Nevertheless, it is important to detect and block it before it evolves further and does even more damage.”“Ransomware groups are turning up pressure on their victims,” said Bharat Mistry, technical director at Trend Micro. “The level of sophistication used by criminal gangs is exponentially increasing and simply relying on user awareness training and endpoint defenses is no longer enough.”  "
   },
   {
      "time": "2022-07-14",
      "title": "https://www.infosecurity-magazine.com/news/ukraine-cyber-agency-cyber-attack?utm_source=twitterfeed&utm_medium=twitter",
      "text": " "
   }
]