[
   {
      "time": "2023-02-24",
      "title": "çææè·SideCopyç»ç»éå¯¹å°åº¦æ¿åºçAPTæ»å» - çæ",
      "text": " 2023-02-22      è¿æ¥ï¼çæå¨èææ¥å¹³å°æè·å°ä¸èµ·éå¯¹å°åº¦æ¿åºé¨é¨åèµ·çAPTæ»å»äºä»¶ï¼éè¿åæåç°æ­¤æ¬¡äºä»¶çæ»å»èçä¼¼SideCopyç»ç»ãè¯¥ç»ç»éè¿éé±¼é®ä»¶ç­æ¹å¼å°è¯±é¥µææ¡£åéç»åå®³èï¼å©ç¨ååµçè¿æ§æ¨é©¬ReverseRATæ¥è¾¾å°ä¿¡æ¯çªåãè¿ç¨æ§å¶çç®çãç®åï¼çæESMé²çæ¯ç»ç«¯å®å¨é²æ¤ç³»ç»å·²å¯æ£æµå¹¶æ¥æè¯¥ç±»è¿æ§æ¨é©¬ï¼å¹¿å¤§ç¨æ·å¯ä½¿ç¨è¯¥äº§åååçæ¯å±å®³ãçæå®å¨ä¸å®¶ä»ç»ï¼å¨æ­¤æ¬¡æ»å»äºä»¶ä¸­ï¼æªè·çè¯±é¥µææ¡£åä¸ºCyber Advisory 2023.docmï¼å¶ä¼ªè£æå®å¨æºææä¾ç»å°åº¦æ¿åºé¨é¨çå®å¨ç ç©¶æ¥åï¼æ¥åä¸»é¢ä¸ºãAndroidç³»ç»çå¨èåé¢é²æªæ½ãï¼ä»¥éé±¼é®ä»¶ç­æ¹å¼è¿è¡ä¼ æ­ï¼ç±äºéå¯¹æ¿åºé¨é¨ï¼åæ¶åå°å®å¨é¢åï¼å æ­¤æå·è¯±ææ§åéè½æ§ï¼è®©äººé¾ä»¥é²èãä¸æ¦æåå®³èç¹å»äºè¯¥ææ¡£ï¼å°±ä¼å¯å¨å¶ä¸­ååµçå®ä»£ç ï¼ä¸è½½å¹¶è¿è¡å­å¨äºè¿ç¨æå¡å¨ä¸çè¿æ§æ¨é©¬ãå¾ï¼è¯±é¥µææ¡£çæéè¿åæåç°ï¼è¯¥è¿æ§æ¨é©¬åä¸ºReverseRATï¼çä¼¼ç±å·´åºæ¯å¦çæ»å»èå¼åä½¿ç¨ï¼ä¸SideCopyç»ç»å·æéå¸¸å¯åçå³ç³»ï¼åæ¶å°æ¬æ¬¡æ»å»è¡å¨ææé¾ä¸SideCopyç»ç»è¿å¾ææé¾å¯¹æ¯åæï¼åç°ç¸ä¼¼åº¦æå¤§ï¼å æ­¤å¤å®æ­¤æ¬¡æ»å»è¡å¨çä¸»å¯¼èä¸ºSideCopyç»ç»ãå¾ï¼æ»å»æµç¨æ®æï¼SideCopyç»ç»çä¼¼æ¥èªäºå·´åºæ¯å¦ï¼è³å°ä»2019å¹´å°±å¼å§è¿è¡ç½ç»æ»å»æ´»å¨ï¼ä¸»è¦éå¯¹åäºå½å®¶ï¼ç¹å«æ¯å°åº¦åé¿å¯æ±çæ¿åºé¨é¨ãç±äºè¯¥ç»ç»çæ»å»æ¹å¼è¯å¾æ¨¡ä»¿SideWinderï¼çä¼¼æ¥èªå°åº¦çæ»å»ç»ç»ï¼ä¸­æååå°¾èï¼ç»ç»ï¼æå¾åSideCopyãç±äºAPTæ»å»æçéå¯¹æ§å¼ºãç»ç»ä¸¥å¯ãæç»­æ¶é´é¿ãé«éè½æ§åé´æ¥æ»å»çæ¾èç¹å¾ï¼ä¸ç®æ é½æ¯å·æéå¤§ä¿¡æ¯èµäº§ï¼å¦å½å®¶åäºãææ¥ãæç¥é¨é¨åå½±åå½è®¡æ°ççè¡ä¸ï¼å æ­¤å½åç¸å³æ¿åºæºæåä¼ä¸åä½å¡å¿è¦å¼èµ·éè§ï¼å å¼ºé²å¾¡æªæ½ï¼åå°ä»¥ä¸å ç¹ï¼ä¸æå¼æªç¥æ¥æºçå¯ççæä»¶åé®ä»¶ï¼é²æ­¢ç¤¾ä¼å·¥ç¨å­¦åéé±¼æ»å»ãç½å³å®å¨äº§åå¯å©ç¨å¨èææ¥è¿½æº¯å¨èè¡ä¸ºè½¨è¿¹ï¼å¸®å©ç¨æ·è¿è¡å¨èè¡ä¸ºåæãå®ä½å¨èæºåç®çï¼è¿½æº¯æ»å»çææ®µåè·¯å¾ï¼ä»æºå¤´è§£å³ç½ç»å¨èï¼æå¤§èå´ååç°è¢«æ»å»çèç¹ï¼å¸®å©ä¼ä¸æ´å¿«ååºåå¤çãææ¯è½¯ä»¶å¯æ¦æªæ¶æææ¡£åæ¨é©¬çæ¯ï¼å¦æç¨æ·ä¸å°å¿ä¸è½½äºæ¶ææä»¶ï¼ææ¯è½¯ä»¶å¯æ¦æªæ¥æï¼é»æ­¢çæ¯è¿è¡ï¼ä¿æ¤ç¨æ·çç»ç«¯å®å¨ãå¾ï¼çæESMé²çæ¯ç»ç«¯å®å¨é²æ¤ç³»ç»å¯æ¥æç¸åºè¿æ§æ¨é©¬è®¸å¤æ¶æè½¯ä»¶ç»å¸¸ä½¿ç¨å·²ç¥çç³»ç»æ¼æ´ãè½¯ä»¶æ¼æ´æ¥è¿è¡ä¼ æ­ï¼åæ¶å®è£è¡¥ä¸å°ææåå°æ¼æ´æ»å»å¸¦æ¥çå½±åã"
   },
   {
      "time": "2023-02-24",
      "title": "Russian covert influence operations have become ‘low-quality,’ says Meta",
      "text": " Since the beginning of the war in Ukraine, Russia’s covert influence operations on Facebook and Instagram have shied away from building convincing brands or personas, Meta announced on Thursday.Instead these operations are trying to escape the social media giant’s detection efforts by creating “a large number of low-quality accounts all at once, in the hope that at least a few might survive,” the company explained in its quarterly threat report.The activity has become less like “the stealthy and deceptive Russian influence operations we’ve disrupted in the past,” said the company, and now bears “a closer resemblance to a spammers’ playbook.”Meta said that the operators’ spam-like approach to influence operations was providing “low overall return on their activity.”The company said that the operations had a “uniquely aggressive persistence” suggesting that they “appeared to hastily respond to the state’s military actions with no time to build credibility and influence in promoting pro-Russia narratives” and “were likely paid to keep running these efforts … no matter how low the quality or impact of their work.”More traditional propaganda from Russian state-controlled media is on the wane, Meta’s threat report said, because those outlets have been banned from running ads and any posts that link to their content receive warning labels.Meta said this has had a “substantial drop” in the activity of these pages and people’s engagement with that content, despite “infrequent” attempts to evade the company’s bans and transparency requirements.“Although they are still active on our platforms, a number of Russian state-controlled media have shared posts urging followers to find them on other services instead,” the report said, suggesting the enforcement action is working.The company also said it took down 5,374 accounts and 12 groups on Facebook, as well as 100 accounts on Instagram, that were connected to a network operated by employees of the Serbian Progressive Party — the country’s ruling party — targeting domestic audiences.This network, which “ran across the internet and targeted social media services including Facebook, Instagram, Twitter, YouTube, in addition to local news media to create a perspective of widespread and authentic grassroots support for Serbian President Alexander Vučić.”It was unlike traditional troll farms, which operate in a single location or set of offices, and instead relied on individuals coordinating their efforts from across Serbia.The people behind the activity used fake accounts — some of which Meta said it detected and disabled automatically — to manipulate content by making it appear more popular than it really was, alongside posting original memes criticizing Serbian opposition figures.Meta said it was able to tie the operation to the Serbian Progressive Party, a group of employees known as its Internet Team, and state employees from around Serbia, following a tip from Twitter.The company’s threat report also announced the takedown of a network based in Cuba targeting people in that country as well as the Cuban diaspora abroad. The company’s investigation “found links to the Cuban government and its various entities,” Meta said.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-24",
      "title": "Pirated Final Cut Pro for macOS Offers Stealth Malware Delivery",
      "text": " People using pirated versions of Apple's Final Cut Pro video editing software may have gotten more than they bargained for when they downloaded the software from the many illicit torrents through which it is available.For the past several months at least, an unknown threat actor has used a pirated version of the macOS software to deliver the XMRig cryptocurrency mining tool on systems belonging to people who downloaded the app.Researchers from Jamf who recently spotted the operation have been unable to determine how many users might have installed the weaponized software on their system and currently have XMRig running on them, but the level of sharing of the software suggests it could be hundreds.Jaron Bradley, macOS detections expert at Jamf, says his company spotted over 400 seeders — or users who have the complete app — making it available via torrent to those who want it. The security vendor found that the individual who originally uploaded the weaponized version of Final Cut Pro for torrent sharing is someone with a multiyear track record of uploading pirated macOS software with the same cryptominer. Software in which the threat actor had previously sneaked the malware into includes pirated macOS versions of Logic Pro and Adobe Photoshop.\"Given the relatively high number of seeders and [the fact] that the malware author has been motivated enough to continuously update and upload the malware over the course of three and a half years, we suspect it has a fairly wide reach,\" Bradley says.\"The malware author never reaches out to a website located anywhere except within the i2p network,\" Bradley says. \"All attacker tooling is downloaded over the anonymous i2p network and mined currency is sent to the attackers' wallet over i2p as well.\"With the pirated version of Final Cut Pro that Jamf discovered, the threat actor had modified the main binary so when a user double clicks the application bundle the main executable is a malware dropper. The dropper is responsible for carrying out all further malicious activity on the system including launching the cryptominer in the background and then displaying the pirated application to the user, Bradley says.As noted, one of the most notable differences between the latest version of the malware and previous versions is its increased stealth — but this has been a pattern. The earliest version — bundled into pirated macOS software back in 2019 — was the least stealthy and mined cryptocurrency all the time whether the user was at the computer or not. This made it easy to spot. A later iteration of the malware got sneakier; it would only start mining cryptocurrency when the user opened a pirated software program. \"This made it harder for users to detect the malware's activity, but it would keep mining until the user logged out or restarted the computer. Additionally, the authors started using a technique called base 64 encoding to hide suspicious strings of code associated with the malware, making it harder for antivirus programs to detect,\" Bradley says.He tells Dark Reading that with the latest version, the malware changes the process name to look identical to system processes. \"This makes it difficult for the user to distinguish the malware processes from native ones when viewing a process listing using a command-line tool.One feature that has remained consistent through the different versions of the malware is its constant monitoring of the \"Activity Monitor\" application. Users can often open the app to troubleshoot problems with their computers and in doing so could end up detecting the malware. So, \"once the malware detects that the user has opened the Activity Monitor, it immediately stops all its processes to avoid detection.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-24",
      "title": "Microsoft urges Exchange admins to remove some antivirus exclusions",
      "text": " As the company explained, exclusions targeting the Temporary ASP.NET Files and Inetsrv folders and the PowerShell and w3wp processes are not required since they're no longer affecting stability or performance.However, admins should make a point out of scanning these locations and processes because they're often abused in attacks to deploy malware.\"We've validated that removing these processes and folders doesn't affect performance or stability when using Microsoft Defender on Exchange Server 2019 running the latest Exchange Server updates.\"You can also safely remove these exclusions from servers running Exchange Server 2016 and Exchange Server 2013 but you should monitor them and be ready to mitigate any issues that might come up.The list of folder and process exclusions that should be removed from file-level antivirus scanners includes:To defend against attacks using similar tactics, you should always keep your Exchange servers up to date, use anti-malware and security solutions, restrict access to IIS virtual directories, prioritize alerts, and regularly inspect config files and bin folders for suspicious files."
   },
   {
      "time": "2023-02-24",
      "title": "Clasiopa: New Group Targets Materials Research | Symantec Enterprise Blogs",
      "text": " A hitherto unknown attack group has been observed targeting a materials research organization in Asia. The group, which Symantec calls Clasiopa, is characterized by a distinct toolset, which includes one piece of custom malware (Backdoor.Atharvan). At present, there is no firm evidence on where Clasiopa is based or whom it acts on behalf.The infection vector used by Clasiopa is unknown, although there is some evidence to suggest that the attackers gain access through brute force attacks on public facing servers.Aside from the distinct toolset used, there were a number of attack hallmarks observed:There is some evidence to suggest that the attackers used two legitimate software packages. One compromised computer was running Agile DGS and Agile FD servers, software developed by Jiangsu. These packages are used for document security and protection in transit. Malicious files were dropped into a folder named “dgs” and one of the backdoors used was renamed from atharvan.exe to agile_update.exe. It is unclear if these software packages are being injected into or installed by the attackers.HCL Domino (formerly IBM Domino) was also run on a compromised machine in close proximity to the execution of backdoors, although it is unclear if this was a coincidence or not. However, both the Domino and Agile software appear to be using old certificates and the Agile servers use old vulnerable libraries.Atharvan is so-named because when the malware is run, it creates a mutex named: \"SAPTARISHI-ATHARVAN-101\" to ensure that only one copy is running.It will then contact a hardcoded C&C server. The hardcoded C&C addresses seen in one of the samples analyzed to date was for Amazon AWS South Korea (Seoul) region, which is not a common location for C&C infrastructure.The C&C communications are formatted as HTTP POST requests where the Host header is hardcoded as \"update.microsoft.com\", e.g.:POST /update.php HTTP/1.1User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/84.0.4147.105 Safari/537.36 Edg/84.0.522.52Host: update.microsoft.comContent-type: application/x-www-form-urlencodedContent-length: 46id=Atharvan&code=101&cid=H^[REDACTED]&time=5The request body includes the following parameters:When encrypting the \"msg\" value, the malware uses the following encryption algorithm:def encrypt(plaintext):    return bytes([((2 - byte) & 0xff) for byte in plaintext])The malware uses its own simplistic HTTP parser to extract the body from the server response. The extracted body is decrypted using the following algorithm:def decrypt(ciphertext):    return bytes([((2 - byte) & 0xff) for byte in ciphertext])When fetching commands, the malware expects the decrypted body to contain a sequence of strings separated by the \"\\x1A\" character.The first byte of each string specifies the command to execute and the remaining bytes are interpreted as command parameters.When configuring a communication schedule, the command parameters specify the times and days for the communication attempts. Several different times can be specified, with the hour and minute of the day encoded.The days are interpreted as:This scheduled communication configuration is another unusual feature of the malware and is not commonly seen in malware of this kind.In addition to this, one of the passwords used by the attackers for a ZIP archive was “iloveindea1998^_^”.While these details could suggest that the group is based in India, it is also quite likely that the information was planted as false flags, with the password in particular seeming to be an overly obvious clue.If an IOC is malicious and the file available to us, Symantec Endpoint products will detect and block that file.5b74b2176b8914b0c4e6215baab9e96d1e9a773803105cf50dac0427fac79c1b – Backdoor.Atharvan8aa6612c95c7cef49709596da43a0f8354f14d8c08128c4cb9b1f37e548f083b – Backdoor.Atharvan95f76a95adcfdd91cb626278006c164dcc46009f61f706426b135cdcfa9598e3 – Lilith940ab006769745b19de5e927d344c4a4f29cae08e716ee0b77115f5f2a2e3328 – Lilith38f0f2d658e09c57fc78698482f2f638843eb53412d860fb3a99bb6f51025b07 – Lilithc94c42177d4f9385b02684777a059660ea36ce6b070c2dba367bf8da484ee275 – Thumbsenderf93ddb2377e02b0673aac6d540a558f9e47e611ab6e345a39fd9b1ba9f37cd22 – Custom Proxy Tool3aae54592fe902be0ca1ab29afe5980be3f96888230d5842e93b3ca230f8d18d – Backdoor0550e1731a6aa2546683617bd33311326e7b511a52968d24648ea231da55b7e5 – Backdoor8023b2c1ad92e6c5fec308cfafae3710a5c47b1e3a732257b69c0acf37cb435b – Hacktool1569074db4680a9da6687fb79d33160a72d1e20f605e661cc679eaa7ab96a2cd – HacktoolThe Threat Hunter Team is a group of security experts within Symantec whose mission is to investigate targeted attacks, drive enhanced protection in Symantec products, and offer analysis that helps customers respond to attacks.We encourage you to share your thoughts on your favorite social platform."
   },
   {
      "time": "2023-02-24",
      "title": "Popular IBM file transfer tool vulnerable to cyberattacks, CISA says",
      "text": " The IBM Aspera Faspex file transfer tool used by dozens of large organizations and businesses has a serious bug that malicious hackers are actively exploiting, according to the Cybersecurity and Infrastructure Security Agency (CISA). The agency said the IBM vulnerability poses “significant risks to the federal enterprise.” CISA directs its alerts at the federal government, but they often apply widely to the private sector as well.For any company transferring large datasets — like genomics and biomedical research, media production, military signals intelligence, or financial services — Aspera was likely the go-to solution for many years, Broomhead explained. Broomhead added that the vulnerability is easy to exploit and allows a remote attacker to take actions on a system without having to get around network authentication processes.Nucleus Security’s Ryan Cribelar said the tool is used by large companies to transfer large files or large data sets quickly and securely over long distances. “It is used by all sorts of industries from finance to healthcare to government. It is a popular IBM product, so you can assume a large customer base purely from how long the product has been around, and the fact that shops usually use multiple IBM products if they are using one,” he said. The bug is enticing to attackers for at least two reasons, Cribelar said.\"It might live on a device that doesn't get as consistent scanning coverage as other devices, and the maintaining of the device — and who is responsible — could easily get lost over time as vulnerability management programs change in-house,\" he said. \"These two factors can allow for the vulnerability to have a longer lifetime on the device.\"Cribelar added that the vulnerable software is typically found in the outer perimeter of networks, making it a valuable portal for hackers to gain persistence in a victim's system without the likelihood of being discovered quickly. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-24",
      "title": "Hydrochasma Threat Group Bombards Targets With Slew of Commodity Malware, Tools",
      "text": " \"While Symantec researchers didn't observe data being exfiltrated from victim machines, some of the tools deployed by Hydrochasma do allow for remote access and could potentially be used to exfiltrate data,\" researchers wrote.Judging by its tools and tactics, the group's chief motive appears to be achieving persistent access to victim machines without being detected, \"as well as an effort to escalate privileges and spread laterally across victim networks,\" they noted.Indeed, the lack of custom malware lends itself to this motive, Brigid O Gorman, senior intelligence analyst with Symantec Threat Hunter team, tells Dark Reading.\"The group's reliance on living-off-the-land and publicly available tools is notable,\" she says. \"This may tell us a number of things about the group, including a desire to stay under the radar and make attribution of their activity more difficult.\"Researchers first were alerted to concerning activity on the victim's network when they noticed the presence of SoftEther VPN, a free, open source, and cross-platform VPN software often used by attackers.In this case, the first sign of suspicious activity that researchers found on victim machines was a lure document with a file name in the organization's native language that appeared to be an email attachment for a freight company \"product specification,\" they said. Researchers also found a lure that mimicked a resume for a \"development engineer.\"Once Hydrochasma gains access to a machine, attackers drop a Fast Reverse Proxy, a tool that can expose a local server protected by a network address translation (NAT) or firewall to the Internet. That in turn drops a legitimate Microsoft Edge update file. That's followed up by another file that's actually a publicly available tool called Meterpreter — which is part of the Metasploit framework — that can be used for remote access, researchers said.In fact, in the campaign that researchers observed, the group bombarded the victim organization with what seemed like everything but the kitchen sink in a flurry of publicly available tools aimed to guarantee its presence and persistence on the network.\"It is relatively unusual to see an attack group using only open source malware in an attack chain, so this did make Hydrochasma's activity stand out to us,\" O Gorman notes.Other tools being wielded by Hydrochasma in the attack included: Gogo scanning tool, an automated scanning engine; Process Dumper, which allows attackers to dump domain passwords; AlliN scanning tool, which can be used for lateral penetration of the intranet; and Fscan, a publicly available hacktool that can scan for open ports and more.Their assault on the victim network didn't stop there, however; additional tools that researchers observed being used in the attack included: Procdump, for monitoring an application for CPU spikes and generating crash dumps; BrowserGhost, which can grab passwords from a browser; the tunneling tool Gost proxy; Ntlmrelay for intercepting validated authentication requests to access network services; and HackBrowserData, an open source tool that can decrypt browser data.Symantec included both file and network indicators of compromise in its blog post to help organizations identify if they're being targeted by Hydrochasma.The extensive use of dual-use and living-off-the-land tools by the group highlights the need for organizations to have a comprehensive security solution to detect suspicious behavior on network machines, as well as stop malware, O Gorman says: \"Organizations should adopt a defense in-depth strategy, using multiple detection, protection, and hardening technologies to mitigate risk at each point of a potential attack chain,\" she tells Dark Reading. \"Organizations should also be aware of and monitor the use of dual-use tools inside their network.\"In general, Symantec also advises implementing proper audit and control of administrative account usage, as well as the creation of profiles of usage for admin tools, \"as many of these tools are used by attackers to move laterally undetected through a network,\" O Gorman adds.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-24",
      "title": "FTC: Americans lost $8.8 billion to fraud in 2022 after 30% surge",
      "text": " The U.S. Federal Trade Commission (FTC) revealed today that Americans lost almost $8.8 billion to various types of scams in 2022, following a significant surge of over 30% more lost to fraud compared to the previous year.In 2021, Americans also reported losses of more than $5.8 billion to fraud, another massive increase of over 70% compared to 2020.The FTC said on Thursday that 2.4 million consumers have reported losing money to scammers, most of them falling victim to imposter scams and online shopping scams throughout the last year.The top five fraud categories also include scam reports involving prizes, sweepstakes, and lotteries, investments, and business and job opportunities.\"The second highest reported loss amount came from imposter scams, with losses of $2.6 billion reported, up from $2.4 billion in 2021.\"​The FTC added 5.1 million consumer reports to its Consumer Sentinel Network (Sentinel) secure online database in 2022, with over 1.1 million reports of identity theft filed through the FTC's IdentityTheft.gov website.Unfortunately, these stats likely reflect just a fraction of the actual harm inflicted by romance scammers, given that most frauds are never reported.You can report fraud attempts at ReportFraud.ftc.gov and file an identity theft report at IdentityTheft.gov.Once included in the Sentinel database, your report will be available to roughly 2,800 federal, state, local, and international law enforcement professionals.Each report can help investigators find the fraudsters and make it easier to discover trends and educate the public."
   },
   {
      "time": "2023-02-24",
      "title": "Forsage DeFi platform founders indicted for $340 million scam",
      "text": " A Federal grand jury in the District of Oregon has indicted four Russian nationals founders of Forsage decentralized finance (DeFi) cryptocurrency investment platform for allegedly running a global Ponzi and pyramid scheme that raised $340 million.Forsage was promoted as a \"smart contract system\" that automatically distributes income to investors based on an algorithm, not requiring manual withdrawal requests.The project promised 100% transparency, complete decentralization, peer-to-peer transactions, no owner/admin, no chance of scams or sudden shutdown, and no company or third party involved.However, the reality couldn't be farther from that, as most Forsage investors soon found out that they were making no profit and, in many cases, lost all their investments.The defendants, Vladimir Okhotnikov, Olena Oblamska, Mikhail Sergeev, and Sergey Maskalov, face charges of running aggressive false advertisements on social media, pushing misleading investment and business opportunities related to Forsage to aspiring investors.Instead of a legitimate investment system, the defendants coded and deployed smart contracts on Forsage that essentially systematized a combination of Ponzi and pyramid schemes on the Ethereum, Binance Smart Chain, and Tron blockchains.Using blockchain forensic analysis, it was confirmed that over 80% of Forsage investors received less ETH than they had invested through Forsage. About half of all investors didn't get anything at all.Court documents show that the platform's founders used malicious code to direct large portions of the investor funds outside Forsage and into cryptocurrency wallets they controlled.This contradicted Forsage's promises to investors, including that \"100% of the income goes directly and transparently to the members of the project with zero risk.\"If the four defendants are found guilty of the alleged crimes, they face a maximum prison sentence of 20 years each.It is worth noting that Forsage’s website and social media channels are still online, claiming that the platform has distributed over $2.3 billion to over 2 million investors (Twitter data), or $1.5 billion to 2.7 million investors (website data)."
   },
   {
      "time": "2023-02-24",
      "title": "Ukraine says Russian hackers backdoored govt websites in 2021",
      "text": " The Computer Emergency Response Team of Ukraine (CERT-UA) says Russian state hackers have breached multiple government websites this week using backdoors planted as far back as December 2021. CERT-UA spotted the attacks after discovering a web shell on Thursday morning on one of the hacked websites that the threat actors (tracked as UAC-0056, Ember Bear, or Lorec53) used to install additional malware.This web shell was created in December 2021 and was used to deploy CredPump, HoaxPen, and HoaxApe backdoors one year ago, in February 2022, according to CERT-UA.The threat actors also used the GOST (Go Simple Tunnel) and the Ngrok tools during the early stages of their attack to deploy the HoaxPen backdoor.\"Presently, in the framework of the United Response Team under the National Cybersecurity Coordination Center, experts from the SSSCIP, the Security Service of Ukraine and the Cyber Police are working together to isolate and investigate the cyber incident.SSSCIP added that the incident had not caused \"essential system failures or disruptions\" that would affect the operation of Ukrainian public authorities.However, its operators are also suspected of orchestrating attacks against North American and Western European organizations."
   },
   {
      "time": "2023-02-24",
      "title": "Wiper Malware Surges Ahead, Spiking 53% in 3 Months",
      "text": " The increased use of disk wipers in cyberattacks that began with Russia's invasion of Ukraine early last year has continued unabated, and the malware has transformed into a potent threat for organizations in the region and elsewhere.Researchers at Fortinet recently analyzed attack data from the second half of 2022 and observed a startling 53% increase in threat actor use of disk wipers between the third and fourth quarters of the year. The trajectory suggests there will be no slowing down any time soon, the security vendor said.Russia-based advanced persistent threat (APT) groups — working in support of the country's military objectives in Ukraine — accounted for a lot of the initial surge in wiper use and continued activity last year. However, Fortinet's data shows that others, including financially motivated cybercriminals, hacktivist groups, and other individuals fueled the increase as well, especially toward the end of 2022.Leading up to last year, wiper activity tended to be almost nonexistent, according to Geri Revay, security researcher with Fortinet's FortiGuard Labs. But since the conflict between Russia and Ukraine started, threat actor use of the malware has exploded, he says. \"In 2022 alone we saw 16 different families targeted at 25 countries around the world,\" Revay says. \"In the second half of the year, we also started seeing a new breed of wipers, with some even open source and on GitHub, making it much more readily available for advanced persistent cybercrime campaigns,\" he says.Currently, the main motivation for the use of wiper malware appears to be focused around cyberwar and hacktivism, Revay says. But that doesn't mean threat actors won't use it in other ways, like using wipers to sabotage systems or to destroy evidence of a cybercrime.\"Most of the wiper attacks were targeting Ukrainian organizations in 2022, but that could easily have a spillover effect on other countries,\" Revay says. As an example, he points to one incident where an attack that targeted a Ukrainian satellite communication provider ended up taking 5,800 German wind turbines offline.In terms of how to prepare and how to respond to a wiper attack, \"it is very similar to a ransomware incident,\" Revay tells Dark Reading. \"If the ransom is not paid, which is the recommended approach, a ransomware can be also considered a wiper, because without the decryption key the encrypted data is as good as lost.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-23",
      "title": "Post-quantum algorithm vulnerable to side channel attacks, researchers | SC Media",
      "text": "  Such attacks avoid directly targeting a system or hardware’s defenses, instead leveraging traces of the physical signals they emit (such as supply current, execution time or electromagnetic emissions) to extract secrets.More recently, the advent of deep learning-based side channel analysis has made such attacks particularly relevant for breaking encryption systems and recovering secret keys. Apart from improving the effectiveness of some attacks, it has also allowed for attacks on true random number generators and physical unclonable functions, as well as non-differential message and secret key recovery attacks on post-quantum encryption algorithms. “Deep learning based side-channel attacks can overcome conventional countermeasures such as masking, shuffling, random delays insertion, constant-weight encoding, code polymorphism, and randomized clock,” wrote researchers Elena Dubrova, Kalle Ngo and Joel Gärtner.Encryption algorithms rely on a technique known as “masking” to prevent leakage of actionable emissions and defend against side channel attacks. Using a newly developed training method for neural networks, the researchers discovered a way to extract message bits for high-order masked implementations with the probability above 99%. They also developed a new message recovery method that manipulates ciphertexts to increase the leakage of message bits, improving the rate of message recovery and eventually extracting the algorithm’s secret key.There are different orders of complexity for this type of masking, and previous experiments have found a way to execute successful side channel attacks against algorithms with third-order masked software implementations. The method developed by KTH was successful in breaking CRYSTALS-Kyber using fifth-order implementations.“To the best of our knowledge, no side-channel attack on a higher than the third order masked implementation of any LWE/LWR PKE/KEM scheme has been demonstrated until now. The presented approach is not specific for CRYSTALS-Kyber and can potentially be applied to other LWE/LWR PKE/KEM schemes,” the authors wrote.CRYSTALS-Kyber is one of four post-quantum algorithms selected by NIST after a rigorous, multi-year vetting process to develop next generation encryption standards. While the other three are meant for digital signature and identity verification, CRYSTALS-Kyber is the only general purpose algorithm selected thus far.However, Dustin Moody, a mathematician in NIST’s computer security division, told SC Media that while the agency welcomes the new research, he does not believe it represents a fatal flaw in CRYSTALS-Kyber and said NIST currently has no plans to replace or deprioritize the algorithm.Often, encryption schemes can be tweaked or altered to account for a newly discovered flaw, or experts can develop countermeasures that prevent the kind of leakage that could be used in a side channel attack. Moody said that while “a side channel attack can fatally kill an algorithm, with this particular paper, we don’t feel it does that in any way.”“On this particular implementation of Kyber, we can use this [method] to break it under the circumstances in the experiment that they’re running. So it breaks a particular implementation that they’re working with, but it didn’t break the algorithm in general,” he said, later adding “It doesn’t say anything about the security of the algorithm itself. It didn’t exploit some flaw or design weakness to show that you’ll be able to attack it more generally.”Those thoughts were echoed by Ali El Kaafarani, CEO of PQShield, which makes and sells quantum-resistant technologies. The paper appears to highlight a valid side channel attack method, but not one necessarily specific to CRYSTALS-Kyber, and it doesn't unearth any new, fundamental weaknesses in the algorithm or its underlying mathematics.“It's important to understand the difference between an algorithm and its potentially many different implementations. Any algorithm can and will inevitably have many non-secure/broken implementations, this doesn’t mean that the algorithm itself is broken, otherwise people wouldn’t still be using RSA/ECC now,\" El Kaafarani said.Still, such adjustments do come with real tradeoffs. The algorithms selected by NIST were done in part based on their efficiency. Every new protection added to account for side channel leakage slows down its performance.“For CRYSTALS-Kyber…we asked the cryptographic community to do a lot of work here, and in the second and third rounds of our process, research seemed to show that to protect Kyber pretty well, it would be about twice as slow when you added on lots of countermeasures to protect it from side channel attacks,” said Moody.Derek is a senior editor and reporter at SC Media, where he has spent the past three years providing award-winning coverage of cybersecurity news across the public and private sectors. Prior to that, he was a senior reporter covering cybersecurity policy at Federal Computer Week. Derek has a bachelor’s degree in print journalism from Hofstra University in New York and a master’s degree in public policy from George Mason University in Virginia.The new PCI DSS standard puts more focus on application security, with more tools, testing and documentation required of developers.We need to develop our own talent, find ways to protect IP, and play the long game on AI against the Chinese and other tech adversaries – we can’t do it with EOs and more regulations. The Biden AI EO lacks depth – the industry needs to get more involved, and NIST must offer some strong guidance.On-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-23",
      "title": "New class of Apple bugs found in iOS, MacOS | SC Media",
      "text": "  New vulnerabilities in Apple’s macOS and iOS allow attackers to siphon a targeted user’s call history, calendar, address book and photos. The bugs signal bad news to Apple, according to researchers, who say they represent a new class of bugs within Apple’s security posture.The vulnerabilities “represent a significant breach of the security model of macOS and iOS, which relies on individual applications having fine-grained access to the subset of resources they need and querying higher privileged services to get anything else,” wrote Austin Emmitt, senior vulnerability researcherwith Trellix, in the report.In short, the “large new class of bugs” allow an attacker to “bypass code signing” protections that validate applications running on an iOS or macOS device are safe. Once bypassed, the un-signed code would not signal any red flag security warnings and execute — leading to escalation of privileges and sandbox escape conditions on both macOS and iOS devices. “Since the first version of iOS on the original iPhone, Apple has enforced careful restrictions on the software that can run on their mobile devices. Only applications that were cryptographically signed by a developer certificate trusted by Apple could be executed,” Emmitt wrote.These restrictions prevented malicious software from running on devices. What Trellix discovered were holes in Apple’s security approach that allows an attacker to run a malicious program, despite the code-signing requirements that identify the code’s origin, legitimacy and typically trustworthiness.The Apple vulnerabilities (CVE-2023-23531 and CVE-2023-23530) range in severity from medium to high, and are classified as privilege escalation bugs. While both bugs are serious, to exploit either vulnerability would require an adversary to already have compromised the targeted device. Apple issued patches for both with the release of its macOS 13.2 and iOS 16.3 software updates.The ForcedEntry bug was a two-stage attack. The first stage was sending the victim a PDF disguised as an image (GIF). The second stage abused Apple’s iOS sandbox component, allowing the code to “escape” and impact other system components.Trellix research focused on an Apple code filtering security tool for its sandbox called NSPredicate that was key to the ForceEntry attack chain. Emmitt said he examined the NSPredicateVisitor function, viewed as “Apple's primary mitigator of danger,” which led to the Trellix discovery. Despite an Apple patch to prevent the abuse of NSPredicate (in the context of Pegasus), Trellix found a way to bypass Apple’s mitigation efforts.As Patrick Wardle, creator of the Mac security website and tool suite Objective-See noted on Twitter, “Apple’s fixes [for the past FORCEDENTRY disclosure] were wholly useless.”The Trellix technical description of abusing weaknesses in Apple’s security approach center around Apple’s patch of NSPredicate.One example of the new class of bugs is tied to Apple’s use of a root-level process called CoreDuet, which collects data about behavior on the device. “An attacker with code execution in a process with the proper entitlements, such as Messages or Safari, can send a malicious NSPredicate and execute code with the privileges of this process,” Emmitt wrote.Additional flaws were found in OSLogService and an NSPredicate vulnerability in UIKitCore on the iPad, which could allow an attacker to access any app with no entitlements or read syslog data, respectively. In one scenario, an actor could set malicious scene activation rules to achieve code execution inside of SpringBoard and even wipe the device.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Ukraine had experienced a less than a day-long power outage in October 2022 following an attack by Russian state-sponsored hacking operation Sandworm targeted at an electrical substation amid the ongoing Russia-Ukraine war, marking the first cyberattack-related power interruption in the country since 2017, CyberScoop reports.Attacks deployed by Iranian state-backed threat operation MuddyWater against Israel saw the utilization of the new MuddyC2Go command-and-control framework, which replaced the PhonyC2 custom platform following the exposure of its source code, reports The Hacker News.Israel had its technology, logistics, and transportation industries targeted by Iranian advanced persistent threat operation Charming Kitten, also known as APT35 and Imperial Kitten, last month amid its ongoing war with Palestinian militant group Hamas, according to The Record, a news site by cybersecurity firm Recorded Future.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-23",
      "title": "Dutch intelligence: Many cyberattacks by Russia are not yet public knowledge",
      "text": " Many of Russia’s cyber operations against Ukraine and NATO members during the past year have not yet become public knowledge, according to a joint report published this week by two Dutch intelligence services.The fact that “the pace of Russian cyber operations is fast” is a big factor, the report said. And the nature of many targeted institutions — such as military and diplomatic agencies — leads to secrecy about their vulnerabilities.“Before and during the war, Russian intelligence and security services engaged in widespread digital espionage, sabotage and influencing against Ukraine and NATO allies,” says the report, which describes the full-blown invasion of Ukraine a year ago this week as “a turning point in history.”Russia’s target selection has been “very broad” the agencies said, meaning that even Ukrainian organizations that are not playing a “direct role in the course of the war or political decision-making” are being hacked.The joint report relays the findings of the intelligence agencies — collected through “sensitive operations using human and technical resources” — about the threat posed by the Russian state conducting cyberattacks on various institutions, physical sabotage on maritime infrastructure, and information operations.Russian threat, Western responseThe impact of “continued Russian attack attempts” in cyberspace has been “limited” thanks to Ukrainian and Western digital defenses, the joint report said, adding that Russia has “found it difficult to synchronize cyber operations with other military operations, such as airstrikes.”The largest part of Russian cyber operations were espionage activities aimed at accessing “military, diplomatic and economic information from both Ukraine and NATO allies,” said the intelligence agencies. The targets include tactical intelligence, such as the locations of military equipment and personnel.NATO members who are providing military support to Ukraine also are common targets of Russian intelligence. The joint report said that the “Dutch armed forces, ministries and embassies have also been the target of (unsuccessful) cyber espionage attempts in the past year.”“Moscow regularly attempts to digitally sabotage Ukrainian vital infrastructure and carries out constant wiper malware attacks. The sustained and very high pressure that Russia exerts with this requires constant vigilance from Ukrainian and Western defenders,” said the joint report.Despite this, “large-scale disruption has so far failed to materialize and the impact of cyber sabotage is dwarfed by the impact of physical military operations.”“The potential of cyber operations cannot be fully exploited by Russia,” the intelligence agencies added, without providing too much of an explanation. But the report said “most Russian digital attack attempts are detected prematurely or remedied quickly, thanks to far-reaching Ukrainian monitoring, detection and response measures. Ukraine receives significant help from, for example, Western intelligence services and companies.”The two agencies warned that the Ukrainian defense was “not guaranteed” and “can probably only be sustained as long as Western support remains as intensive and adaptive as the cyber operations of the Russian intelligence services.”Physical sabotage threatThe Dutch infrastructure in the North Sea includes internet cables, gas pipelines and wind farms, which the intelligence agencies warned “can be vulnerable to sabotage,” the report said. Russian ships also have been covertly mapping the Netherlands’ maritime infrastructure “and undertaking activities that indicate espionage and preparatory acts for disruption and sabotage.”For example, a Russian ship was detected at an offshore windfarm, according to the MIVD's chief, Gen. Jan Swillens. Dutch coast guard ships escorted the vessel out of the North Sea, said Swillens, who added that the Russian reconnaissance of the North Sea energy system is something the MIVD hadn't seen before.The report did not mention the suspected sabotage of the Nord Stream 1 and Nord Stream 2 natural gas pipelines, which run through the Baltic Sea.However the agencies added it was “conceivable” that Russia could seek to cause a similar physical threat to “other vital sectors, such as drinking water and energy supply, is also conceivable, as long as such attacks can be carried out covertly.”Information operationsRussia’s intelligence services “have succeeded several times in temporarily taking control of Ukrainian media broadcasts and broadcasting Russian messages,” said the report. “Subsequently, the systems of these media were digitally sabotaged.”Other incidents, such as malware aimed at disrupting Ukraine’s power supply, “are probably mainly aimed at undermining Ukrainian morale” rather than achieving a military objective, the Dutch agencies said.“To hide their involvement in covertly spreading disinformation and propaganda through digital channels, Russian intelligence services employ many techniques they also use for cyber operations,” the intelligence services warned.They added that in the case of the information operations troops within the Russian military intelligence service (GRU), it was “even partly the same units that are responsible for both cyber operations and covert influence.”Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-23",
      "title": "Shipping companies, medical laboratories in Asia targeted in espionage campaign",
      "text": " Several shipping companies and medical laboratories in an unspecified Asian country have been targeted in an ongoing espionage campaign that began in October, according to researchers from from Symantec.The hackers behind the campaign — which the researchers named Hydrochasma — have no ties to any group Symantec has researched before. The company is not publicly identifying the target nation, Brigid O Gorman, senior intelligence analyst with the Symantec Threat Hunter Team, told The Record.The researchers do not know where Hydrochasma is based, but O Gorman said the group has specifically gone after companies related to COVID-19 treatments and vaccines. “The actors did not use any custom malware, relying exclusively and extensively on publicly available and living-off-the-land tools,” she said. Using those tactics \"can help make an attack stealthier, while also making attribution more difficult.\"In its report, Symantec explained that the most likely motivation behind the campaign is intelligence gathering and potentially data exfiltration. The initial infection likely began with a phishing email because researchers found two lure documents in a victim organization’s native language related to shipping information, as well as an engineering resume. From those malicious files on one machine, the hackers were able to deploy several tools that allowed them to move around the victim’s network and expose local servers so that they could be taken over. Researchers found dozens of tools on the network that allowed for scanning, data exfiltration, remote connections and more. “The tools deployed by Hydrochasma indicate a desire to achieve persistent and stealthy access to victim machines, as well as an effort to escalate privileges and spread laterally across victim networks,” the researchers said. “While Symantec researchers didn’t observe data being exfiltrated from victim machines, some of the tools deployed by Hydrochasma do allow for remote access and could potentially be used to exfiltrate data,\" the researchers said. \"The sectors targeted also point towards the motivation behind this attack being intelligence gathering.” Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-23",
      "title": "Scammers Mimic ChatGPT to Steal Business Credentials",
      "text": " Scammers are capitalizing on the runaway popularity of and interest in ChatGPT, the natural language processing AI — impersonating it in order to infect victims with a Trojan malware called Fobo, in order to steal login credentials for business accounts.According to the report, this blatant scam has already spread to Africa, the Americas, Asia, and Europe.The researchers at Kaspersky have observed grifters running social media accounts that either impersonate the OpenAI/ChatGPT brand directly or pretend to be communities for fans of the program.Sometimes, the accounts post neutral content relating to ChatGPT, with a malicious link at the bottom. Other times, according to the blog post, they post \"fake credentials for the pre-created accounts that are said to provide access to ChatGPT. To motivate potential users even further, the attackers say that each account already has US $50 on its balance, which can be spent on using the chatbot.\"The real program has an entirely optional subscription plan but is otherwise free to use for the general public.Unwitting social media users who follow the malicious links in these posts land on a ChatGPT homepage, which is like for like with the real thing in almost every way.Clicking the \"download\" button — suspicious in itself, as ChatGPT has no desktop client — triggers the installation of an executable file.\"If this archive is unpacked and the executable file run,\" according to Kaspersky researchers, \"then, depending on the version of Windows, the user sees either a message saying installation failed for some reason, or no message at all — at which point the process seems to end.\"Behind the scenes, however, a Trojan horse has been unleashed. The Trojan looks for login credentials for apps like Google, Facebook, and TikTok, stored in the victim's browser. But in particular, Kaspersky explained, it's looking for usernames and passwords for business accounts.With employee usernames and passwords, the attackers could possibly perform more significant follow-on attacks against enterprises.\"On finding a business account in one of these services,\" the researchers explained, \"it tries to get additional information, such as how much money was spent on advertising from the account and what its current balance is.\"To avoid engaging with a malicious fake, though, Kaspersky recommended avoiding \"offers\" like those from this story, utilizing security software, and not clicking on links — better to go through a search engine or type the URL straight into your browser.As of this writing, Kaspersky has not responded to a direct request for comment by Dark Reading. So, in substitute, we asked the ChatGPT bot to provide insight on the matter. It had this to say:\"In conclusion, the rise of hackers impersonating ChatGPT to steal login credentials is a serious threat that should not be underestimated. The implications of such attacks are far-reaching and potentially devastating for individuals, organizations, and even entire industries. As technology continues to evolve, we can expect these types of attacks to become more sophisticated and difficult to detect. It is, therefore, imperative that individuals and organizations take proactive measures to protect themselves, such as regularly changing passwords, enabling two-factor authentication, and staying vigilant for signs of phishing attacks. Only by working together and taking these steps can we hope to mitigate the risks posed by hackers impersonating ChatGPT and other forms of cybercrime in the future.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-23",
      "title": "New S1deload Stealer malware hijacks Youtube, Facebook accounts",
      "text": " An ongoing malware campaign targets YouTube and Facebook users, infecting their computers with a new information stealer that will hijack their social media accounts and use their devices to mine for cryptocurrency.Victims are tricked into infecting themselves using social engineering and comments on FaceBook pages that push archives with adult themes (e.g., AlbumGirlSexy.zip, HDSexyGirl.zip, SexyGirlAlbum.zip, and more).If the user downloads one of the linked archives, they will instead get an executable signed with a valid Western Digital digital signature and a malicious DLL (WDSync.dll) containing the final payload.​Once installed on victims' devices, S1deload Stealer can be instructed by its operators to perform one of several tasks after connecting to the command-and-control (C2) server.As Bitdefender discovered, it can download and run additional components, including a headless Chrome web browser that runs in the background and emulates human behavior to artificially boost view counts on YouTube videos and Facebook posts.On other systems, it can also deploy a stealer that decrypts and exfiltrates saved credentials and cookies from the victim's browser and the Login Data SQLite database or a cryptojacker that will mine BEAM cryptocurrency.If it manages to steal a Facebook account, the malware will also attempt to estimate its actual value by leveraging the Facebook Graph API to find out if the victim is the admin of a Facebook page or group, if it pays for ads, or is linked to a business manager account.\"The stealer component we observed in the wild steals the saved credentials from the victim's browser, exfiltrating them to the malware author's server,\" Ács added.\"The malware author uses the newly obtained credentials to spam on social media and infect more machines, creating a feedback loop.\"​To avoid getting infected and having your social media accounts hijacked, you should never run executables from unknown sources and always keep your anti-malware software up to date.Unlike S1deload Stealer, the Stealc malware is distributed via fake cracked software, a highly popular tactic also used to push other info stealers like Vidar, Redline, Raccoon, and Mars."
   },
   {
      "time": "2023-02-23",
      "title": "Hackers use fake ChatGPT apps to push Windows, Android malware",
      "text": " Threat actors are exploiting the popularity of OpenAI's ChatGPT chatbot to distribute malware for Windows and Android, or direct unsuspecting vitims to phishing pages.ChatGPT gained immense traction since its launch in November 2022, becoming the most rapidly growing consumer application in modern history with more then100 million users by January 2023.This massive popularity and rapid growth forced OpenAI to throttle the use of the tool and launched a $20/month paid tier (ChatGPT Plus) for individuals who want to use the chatbot with no availability restrictions.The move created conditions for threat actors to take advantage of the tool's popularity by promising uninterrupted and free-of-charge access to premium ChatGPT. The offers are false and the goal is to lure users into installing malware or to provide account credentials.Security researcher Dominic Alvieri was among the first to notice one such example using the domain \"chat-gpt-pc.online\" to infect visitors with the Redline info-stealing malware under the guise of a download for a ChatGPT Windows desktop client.That website was promoted by a Facebook page that used official ChatGPT logos to trick users into getting redirected to the malicious site.Cyble discovered \"chatgpt-go.online\" which distributes malware that steals clipboard contents and the Aurora stealer.Additionally, \"chat-gpt-pc[.]online\" delivered the Lumma stealer in Cyble's tests. Another domain, \"openai-pc-pro[.]online,\" drops an unknown malware family.In addition to the above, Cyble discovered a credit card stealing page at \"pay.chatgptftw.com\" that supposedly offers visitors a payment portal to purchase ChatGPT Plus.When it comes to fake apps, Cyble says it discovered over 50 malicious applications that use the ChatGPT's icon and a similar name, all of them being fake and attempting to harmful activities on users' devices.Two examples highlighted in the report are 'chatGPT1,' which is an SMS billing fraud app, and 'AI Photo,' which contains the Spynote malware, which can steal call logs, contact lists, SMS, and files from the device.ChatGPT is exclusively an online-based tool available only at \"chat.openai.com\" and does not offer any mobile or desktop apps for any operating systems at the moment.Any other apps or sites claiming to be ChatGPT are fakes attempting to scam or infect with malware and should be considered at least suspicious and users should avoid them."
   },
   {
      "time": "2023-02-23",
      "title": "Hackers now exploit critical Fortinet bug to backdoor servers",
      "text": " Threat actors are targeting Internet-exposed Fortinet appliances with exploits targeting CVE-2022-39952, an unauthenticated file path manipulation vulnerability in the FortiNAC webserver that can be abused for remote command execution.Fortinet disclosed the vulnerability in a security advisory on Thursday, saying the bug affects multiple versions of its FortiNAC network access control solution and allows attackers to execute unauthorized code or commands following successful exploitation.Since Fortinet has not provided mitigation guidance or workarounds, updating is the only way to thwart attack attempts.Attackers have already begun targeting unpatched FortiNAC appliances with CVE-2022-39952 exploits, as first discovered by security researchers at the Shadowserver Foundation on Tuesday.\"We are seeing Fortinet FortiNAC CVE-2022-39952 exploitation attempts from multiple IPs in our honeypot sensors,\" Shadowserver's Piotr Kijewski said.CronUp security researcher Germán Fernández revealed in a report that they're \"observing massive exploitation of Fortinet FortiNAC devices via the CVE-2022-39952 vulnerability.\"\"This vulnerability is critical and key in the Cybersecurity ecosystem, since in the first instance, it could allow initial access to the corporate network,\" Fernández said.Malicious activity observed while analyzing these ongoing attacks matches Horizon3's PoC exploit capabilities, with CronUp seeing threat actors using corn jobs to open reverse shells to attackers' IP addresses.Update February 23, 12:45 EST: According to CronUp, attackers have now started to also install fortii.jsp and shell.jsp web shells in the bsc/campusMgr/ui/ROOT/ folder on compromised FortiNAC devices."
   },
   {
      "time": "2023-02-23",
      "title": "Russia blames hackers as commercial radio stations broadcast fake air strike warnings",
      "text": " Commercial radio stations across Russia on Wednesday morning broadcast warnings about air raids and missile strikes. The Ministry of Emergency Situations said the broadcasts were the “result of a hacker attack.”A statement from the Ministry of Emergency Situations said: “This morning in some regions, listeners on the air of radio stations could hear an alarm signal and a text message asking them to go to the shelter.”The ministry said that as a result of the breach affecting the unnamed satellite, “an unauthorized tie-in is going on the air,” and stressed that the alarm signals “do not correspond to reality.” The statement did not mention Ukraine.Authorities in Russian districts had to issue public statements to deny the threat of a missile strike. The governments of the Belgorod and Voronezh regions said that they presumed that the attack was conducted “from the Ukrainian side.”The authorities in Voronezh described the incident as “a provocation of accomplices of the Kyiv regime and is not true. The situation in the region is under control and without incident.”Oleg Shakirov, a foreign policy researcher based in Moscow, has posted several videos to Twitter of the broadcast alert as initially shared by Telegram users.It is not known who is to blame for the incident. The Russian government has repeatedly attempted to emphasize the danger that the Russian state and people face as a result of what it calls the special operation in Ukraine.Last month several Pantsir-S1 mobile anti-aircraft systems were installed on the roofs of buildings in central Moscow, almost 1,000 km north of the frontlines in eastern Ukraine. Although there have been reports that Ukrainian forces have conducted operations against the Russian military inside of Russian territory, Ukraine does not possess weapons capable of striking Moscow.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-23",
      "title": "Attackers Use a Poisoned Google Search to Target Chinese-speaking Individuals - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   }
]