[
   {
      "time": "2022-09-01",
      "title": "Migration policy org confirms cyberattack after extortion group touts theft",
      "text": " The International Centre for Migration Policy Development (ICMPD) confirmed on Wednesday it suffered a cyberattack that led to a data breach. ICMPD operates in 90 countries conducting research, projects and activities centered around migration. It currently has 19 member states — most of which are European — and has observer status at the United Nations. It works with several UN and European agencies as well as states across Africa, Asia and South America. Bernhard Schragl, communication coordinator for ICMPD, did not say when the attack took place but told The Record that the attackers managed to gain “limited access” to individual servers that held data.ICMPD set up a task force of internal and external IT experts who are currently investigating the incident. “Professional preparation as well as quick and decisive actions have prevented the attackers from inflicting additional harm. In less than 45 minutes after detection, an emergency response team was established, all external network connections were disconnected and all websites taken down to prevent the attack from spreading further,” Schragl said. The organization is in the process of investigating what information was compromised, according to Schragl, who added that they have reported the incident to law enforcement agencies. Schragl said ICMPD has either already informed or plans to inform any who had data that was affected by the attack about measures that need to be taken to protect themselves. The attack on ICMPD was launched by the Karakurt extortion group, which boasted on Telegram of stealing financial documents, banking data and personal information. On its leak site, the hacking group further explained that it stole 375 GB of data that included “correspondence on contracts, scans of contracts, project budgets, financial and insurance documents, invoices, passports, mailboxes of key members of the organization and much more.”“Karakurt actors have typically provided screenshots or copies of stolen file directories as proof of stolen data. Karakurt actors have contacted victims’ employees, business partners, and clients with harassing emails and phone calls to pressure the victims to cooperate,” the alert explained. “As of May 2022, the website contained several terabytes of data purported to belong to victims across North America and Europe, along with several ‘press releases’ naming victims who had not paid or cooperated, and instructions for participating in victim data ‘auctions,’” CISA added. The agencies noted that Karakurt does not target specific industries or companies, often choosing victims based on ease of access. The group typically gains access to systems by either purchasing stolen login credentials or purchasing access to victims who have been compromised by other cybercriminals. Emsisoft threat analyst Brett Callow previously told The Record that the group has been active since the middle of 2021 and is believed to be a spin-off of the Conti ransomware group. Advanced Intelligence said Karakurt is a side business of the group behind Conti, allowing them to monetize the data stolen during attacks where organizations are able to block the ransomware encryption process. Blockchain analysis firm Chainalysis has also previously identified several cryptocurrency wallets controlled by Karakurt which sent funds to Conti. The U.S. agencies confirmed much of what was reported by these security companies, highlighting that Karakurt has attacked victims in the midst of ransomware incidents.In several cases seen by CISA and the FBI, victims have gotten ransom notes from multiple ransomware variants simultaneously, “suggesting Karakurt actors purchased access to a compromised system that was also sold to another ransomware actor.”“This cyber incident has harmed the global humanitarian network’s ability to locate missing people and reconnect families,” officials said.  “This is why it is so vital that humanitarian data be respected and only used for intended purposes.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-01",
      "title": "Apple backports fix for actively exploited iOS zero-day to older iPhones",
      "text": " Apple has released new security updates to backport patches released earlier this month to older iPhones and iPads addressing a remotely exploitable WebKit zero-day that allows attackers to execute arbitrary code on unpatched devices.The flaw is tracked as CVE-2022-32894 and is an out-of-bounds write vulnerability in WebKit, the web browser engine used by Safari and other apps to access the web.If successfully exploited, it allows attackers to perform arbitrary code execution remotely by tricking their targets into visiting a maliciously crafted website under their control.The list of devices today's security updates apply to includes iPhone 5s, iPhone 6, iPhone 6 Plus, iPad Air, iPad mini 2, iPad mini 3, and iPod touch (6th generation), all of them running iOS 12.5.6.Even though Apple has disclosed that it received reports of active exploitation in the wild, the company is yet to release info regarding these attacks.By withholding this information, Apple is likely aiming to allow as many users as possible to apply the security updates before other attackers pick up on the zero-day's details and start deploying exploits in their own attacks targeting vulnerable iPhones and iPads.Although this zero-day vulnerability was most likely only used in targeted attacks, it's still strongly advised to install today's iOS security updates as soon as possible to block potential attack attempts.The U.S. Cybersecurity and Infrastructure Security Agency (CISA) also added this security bug to its catalog of exploited vulnerabilities on August 19, requiring Federal Civilian Executive Branch (FCEB) agencies to patch it to protect \"against active threats.\"This is the seventh zero-day bug fixed by Apple since the start of the year:"
   },
   {
      "time": "2022-09-01",
      "title": "AdGuard’s new ad blocker struggles with Google’s Manifest v3 rules",
      "text": " The first ad blocker extension for Chrome that is compatible with Google's Manifest V3 is now available.An extension manifest outlines the permissions and abilities a developer includes in an extension for Chrome browser.In version 3 of the manifest, Google changes the webRequest API to block extensions from modifying the data before it's shown to the user, which renders ad-blockers useless.The new ad-blocking extension that complies with Manifest V3 requirements comes from AdGuard, a developer of ad-blocking software. The extension is in an experimental stage.It was released to help identify margins for improvement and solutions to limitations. Even so, it highlights the restricting nature of Manifest V3.Manifest V3 was first announced in 2020 and became available with the release of Chrome 88, which came out in January 2021.The new AdGuard extension is technically weaker than its predecessor. According to the vendor, compliance to the new protocol is the only reason for this backward step.First, the new extension has to abide by a limit of 30,000 filtering rules and 5,000 dynamic rules set by the users themselves.If the user has installed multiple ad-blocking extensions on their browser, a global limit of 330,000 filtering rules is applied, so AdGuard might have even smaller leeway.The second problem is the inability to load rules to the filtering engine from the extension's server. AdGuard now has to define a set of declarative rules and let Chrome handle the network request filtering process.Because the new syntax for the rules is very limiting, not all existing rules can be converted, including Cookie rules that block certain trackers.The inability to refresh rules directly from the server will also cause delays in updating them and responding to new blocking requirements from website changes. AdGuard estimates these rule updates will now be \"several days\" apart.The third issue ad-blockers face with Manifest V3 is that users can no longer look at the filtering logs (present in manifest V2) because the browser is now blocking the ads.The only workaround is to unpack and install the extension in Developer Mode, which gives the software access to debugging options required to accept statistical data from the browser.Finally, replacing the background page with a service worker causes performance issues, as the latter goes dormant when there's no browser activity.Once a new page loads, the worker requires up to two seconds to wake up. While the declarative rules will still work to block the ads, there's a delay in applying the cosmetic filter to make the ads disappear.\"Although the experimental extension is not as effective as its predecessor, most users won't feel the difference,\" says AdGuard.\"The only thing you might notice is ad flickering due to the lag in the application of cosmetic rules,\" the developer adds."
   },
   {
      "time": "2022-09-01",
      "title": "Chile says gov’t agency struggling with ransomware attack",
      "text": " Chile’s cybersecurity incident response team said an unnamed government agency is dealing with a ransomware attack that targeted the organization’s Microsoft tools and VMware ESXi servers. Chile’s CSIRT said the attack started last Thursday but did not respond to requests for comment about what group was behind the attack or what department or agency was attacked. Recorded Future ransomware analyst Allan Liska said the extension is associated with the Thanos ransomware but it has also been associated with about a handful of other variants. “Which means it could be any number of families,” he explained. Chile’s cybersecurity agency said the attacker was able to take complete control of the victim’s system and left a ransom note, offering a communication channel and ways to contact them. The ransomware encrypted a wide variety of files and also included infostealer characteristics that took credentials from browsers, listed connected devices and drives, and had antivirus evasion capabilities. The group threatened to sell the information on the dark web if the unnamed agency didn't respond within three days. No ransomware group has taken credit for the attack yet. Chile’s cybersecurity officials included some indicators of compromise and malware characteristics in their statement on the incident. They urged other government agencies to make sure their Microsoft and VMware assets are patched, institute network segmentation and contact cybersecurity officials in the event of any attack. Ransomware groups continue to show little fear in directly attacking governments, and over the past few months several Latin America and Caribbean nations have been hit. Chile's own consumer protection agency announced last week that it was hit with ransomware in April. No group has come forward to take credit for the attack. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-01",
      "title": "Google Chrome bug lets sites write to clipboard without asking",
      "text": " Chrome version 104 accidentally introduced a bug that removes the user requirement to approve clipboard writing events from websites they visit.This functionality isn't limited to Google Chrome. Safari and Firefox also allow web pages to write to the system clipboard, yet they have gesture-based protections in place.The system clipboard is a temporary storage location on operating systems. It's typically used for copy-pasting and it can involve sensitive information such as banking account numbers, cryptocurrency wallet strings, or passwords.Overwriting this temporary storage space with arbitrary content puts users at risk as they could become victims of malicious activity.Threat actors could lure users to specially crafted websites impersonating a legitimate cryptocurrency service. When the user tries to make a payment and copies the wallet address to the clipboard, the website can write to the clipboard the threat actor's address.On some websites, when the user selects text to copy from a web page, additional content is appended to the clipboard (typically the page URL). In this case, though, the clipboard fills up with arbitrary content without any visible indication or user interaction.User gestures that give a web page permission to use the clipboard API include the keyboard shortcut for copying content (Ctrl+C), but in many cases, merely any interaction with the website is enough.Johnson tested on Safari and Firefox and found that pressing the down arrow key or using his mouse scroll wheel to navigate on a site gave clipboard writing permission to the loaded web page.Considering how common these actions are, this permission is sufficiently risky to deserve a fix.Thankfully, Johnson's tests confirmed that websites could not abuse this permission to read clipboard contents, which would be detrimental to user privacy.If you see the following message, your browser is vulnerable to permission abuse.Not all Chromium-based browsers are impacted by this issue, though. In tests from BleepingComputer, Brave didn't give the testing site permission to overwrite the clipboard.However, Johnson's embedded test box that fills the visitor's clipboard with website navigation actions worked on all browsers, so the cause of the discrepancy is unclear."
   },
   {
      "time": "2022-09-01",
      "title": "Ragnar Locker ransomware claims attack on Portugal's flag airline",
      "text": " The company said the attack was blocked and added that it found no evidence indicating the attackers gained access to customer information stored on impacted servers.\"No facts have been found that allow us to conclude that there has been improper access to customer data. The website and app still have some instability.\"It also added that customers could book flights, manage previously made bookings, and check in and download their boarding passes without logging in.Even though TAP is yet to confirm if this was a ransomware attack, the Ragnar Locker ransomware gang posted a new entry on their data leak website today, claiming to be behind last week's cyberattack that hit TAP's network.The ransomware group says it has \"reasons\" to believe that hundreds of Gigabytes of data might have been compromised in the incident and threatened to provide \"irrefutable evidence\" to disprove TAP's statement that its customers' data wasn't accessed in the incident.\"Several days ago Tap Air Portugal made a press-release where they claimed with confidence that they successfully repelled the cyber attack and no data was compromised (but we do have some reasons to believe that hundreds of Gigabytes might be compromised),\" the gang says.Ragnar Locker also shared a screenshot of a spreadsheet containing what looks like customer information stolen from TAP's servers, including names, dates of birth, emails, and addresses.Attackers using Ragnar Locker ransomware have also encrypted the systems of Portuguese multinational energy giant Energias de Portugal (EDP) and asked for a 1580 BTC ransom (the equivalent of more than $10 million at the time).TAP Air Portugal didn't reply to a request for comment when BleepingComputer reached out earlier today."
   },
   {
      "time": "2022-09-01",
      "title": "Kiwi Farms Offline Due to Targeted DDoS Attacks - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " Kiwi Farms is a website that hosts user-generated content and discussion forums. It has been accused of doxing, cyberbullying, and harassment. Kiwi Farms has been blocked from various social media websites and domain providers. Since 26th August 2022, however, Kiwi Farms has not been online and is showing a note from its administrators which says why the site is offline and how Kiwi Farms has been hit by DDoS (distributed denial of service) and other types of cyber attacks. Before the service was disrupted, according to the Kiwi Farm forum, it was targeted by a \"DDoS attack\" and other forms of network interruption attacks. The forum's administrators think that it was due to these cyberattacks and to safeguard other users, the internet service provider was compelled to ban their site.The website is infamous for doxing- or leaking personal information of users it considers \"incels\" (involuntary celibates), social justice warriors, feminists, and other users. It is believed that Kiwi Farms intently harass and humiliate people. A Twitch streamer and transgender activist Clara Sorrenti from Canada was arrested and swatted in London, Ontario, on 5th August. After a few days, the streamer's hotel address and location were exposed on Kiwi Farms. With the type of content that Kiwi Farms posts, it's no surprise that the site will be targeted by people who don't conform to its tactics. \"Although it is unclear who was behind the DDoS attack against Kiwi Farms, @YourAnonNews, the largest social media representative of the Anonymous movement also tweeted about the incident,\" reports HackRead. Currently, it is not confirmed if Anonymous Hacktivists were behind the attack. Cloudfare offers security and DDoS protection to sites. It also offers services to Kiwi Farms and since the site has been alleged of doxing and leaking personal information of people without consent, the critics want Cloudfare to stop providing its services. In August 2017, Cloudfare immediately removed the neo-nazi and racist website DailyStormer from the platform. In 2019,  the infamous messageboard 8chan was alleged of sharing inciting content against minorities, and people of colour got ticked off by its hosting company Voxility, and Cloudfare withdrew its services. \"However, at this moment there has been no statement from Cloudflare over the content Kiwi Farms has been accused of posting,\" said HackRead. your nameYour Emailyour message"
   },
   {
      "time": "2022-09-01",
      "title": "Three-day hackathon uncovers hundreds of bugs in Yahoo search engine tool Vespa | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondLive event brings together bug bounty hunters from across the globeA three-day hackathon held by Yahoo last week uncovered hundreds of security bugs in its text search engine tool Vespa.There were 218 bug submissions, with payouts totalling $218,121, with the highest bounty paid out at $15,000.Topping the leaderboard was hacker ‘putsi’, who successfully submitted 10 vulnerabilities and also earned the title of ‘most valuable hacker’ at the event.Participants were chosen from across Yahoo’s ‘Elite Program’, drawn from a group of regular contributors to the company’s bug bounty program and previous hacking event, which took place in May 2022.Inti De Ceukelaire, head of hackers at Intigriti, told The Daily Swig that the hackers “have made extremely valuable contributions to Yahoo’s cyber resilience”.“Yet, live hacking is about more than just great results alone: it forms long-lasting relationships with the community and further increases hacker engagement beyond borders,” he said.“40 hackers from 20 different countries, familiar and unfamiliar faces to Yahoo, have collaborated together with us and the Yahoo team in what we can only describe as our biggest and most successful event to date.”Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2022-09-01",
      "title": "\r\n\tLooking East: Japanese Credit Card Customers Targeted With Phishing Attacks - Infosecurity Magazine\r\n",
      "text": " EMEA Solutions Architect, Menlo SecurityNow we’re in 2022, it is clear that this trend isn’t changing.Today, cybercriminals are upping the ante, working to develop sophisticated spear phishing campaigns to trick potential users while abusing trusted platforms like SharePoint, Amazon AWS, Google and Adobe at more frequent rates.An analysis of impersonated sitesIn analyzing the mechanisms used for both the MICARD and American Express phishing pages, we uncovered many similarities.Beginning with the former, the URL used was “miicarrid[.]co[.]jp.sdsfsee[.]top.)”. When accessed, users would be presented with a login page requesting them to submit their credentials. If they proceeded to do so, they would then be redirected to a second webpage on the same domain that would ask them to submit their account details and card number.In the case of American Express, the spoofed URL was “www1[.]amerxcanexpress[.]tp.bhisjcn[.]jp”, again presenting any potential victim with a login page and then a secondary page requesting the submission of credit card information.In the case of both campaigns, should any visitor fall victim and enter their card information, they would then be directed to the homepage of the genuine site, while all their credentials would have been recorded within the URL path of phished pages.Interestingly, in analyzing the American Express campaign, the Menlo Labs team found a style page (laydate.css) from the path “/admin/im/css/modules/laydate/default/laydate.css?v=5.3.1” that had failed to load.By following the “/admin” path, we found what looked like an attacker control panel where the attacker would have been able to see any phished data. While the team was unfortunately unable to access it, it did help to clarify that the threat actor was likely to have been of Chinese origin.Embracing best practices to protect against repeatable threatsThe variety of similarities between the Amex and MICARD campaigns suggest that the threat actor has developed a repeatable methodology that could be expanded to impersonate many other brands using a set of attack tactics, techniques and procedures (TTPs) or a specific phishing kit.Indeed, there we several commonalities that we identified. The phishing pages were hosted on four IP addresses, used the same URL naming patterns, and were assigned to the registrar Namesilo LLC. Additionally, they were each powered by a LetsEncrypt SSL server certificate, the organization offering free, automated, and open certificate authority through the not-for-profit Internet Security Research Group (ISRG).While MICARD has demonstrated awareness of the campaign, having published a release advising its customers to be cautious of any emails impersonating the brand, the threat actor is likely to continue producing new spoofed sites targeting other financial players, moving from brand to brand as and when its sites are blocked.Indeed, this is just one campaign among thousands of similar attempts. As threat actors continue to advance their techniques in volume, reach and sophistication, organizations and their employees must respond by adopting best practices to prevent the potential success of phishing attempts.With approximately 19 in every 20 cyberattacks reported to involve human error in some way, security strategies must first begin with increasing awareness of potential threats and advocating caution.Beyond this, however, organizations should equally adopt multi-factor authentication (MFA) whenever possible to reduce the opportunity for credentials to be used maliciously should they become compromised."
   },
   {
      "time": "2022-09-01",
      "title": "\r\n\tUkrainian Police Bust Crypto Fraud Call Centers - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineAuthorities in Ukraine claim to have exposed a network of call centers in the country engaged in financial fraud targeting domestic and EU citizens.The criminal group’s ‘employees’ apparently used software to spoof phone numbers, so that they appeared to be calling from legitimate banking institutions.After cold calling their victims, the scammers would pretend to be staff at these banks in order to trick them into handing over their card details.In what appears to be another scheme, the fraudsters used fake websites for the trading of currency, cryptocurrency, securities, gold and oil in order to attract investors, guaranteeing them big profits.A third scam involved targeting foreign victims of cryptocurrency scams. They would pretend to be phoning from the fictitious ‘Community of Cryptocurrency Brokers’ and offer to return stolen funds for a commission.The NPU teamed up with the Ukrainian Security Service (SBU) to carry out the investigation.Officers conducted authorized searches at various unnamed locations and seized computer equipment, mobile phones and draft records that confirmed illegal activity.The Ukrainian authorities have been working hard to crack down on cybercrime even as their country comes under attack from Russia.Fake call centers are increasingly a key element of transnational crime in the region.Once victims filled out a contact form on these sites, they would receive a follow-up call from a fraudster."
   }
]