[
   {
      "time": "2022-11-03",
      "title": "Group indicted for breaching CPA, tax preparation firms via stolen credentials - Help Net Security",
      "text": " Four have also been charged with wire fraud conspiracy and aggravated identity theft. If convicted, each faces a maximum penalty of 20 years in federal prison for the RICO conspiracy count. They also face a maximum penalty of 20 years in federal prison for the wire fraud conspiracy count and a consecutive 2 years’ imprisonment for the aggravated identity theft count.According to the indictment and information shared in court, from 2015 through 2019, the defendants and numerous other conspirators – including a now-deceased conspirator who is referenced in the indictment as RICH4EVER4430 – banded together to engage in a sophisticated cybercrime and tax fraud scheme. The defendants and other conspirators formed an enterprise through which they filed thousands of false tax returns in the names of more than 9,000 identity theft victims.Members of the enterprise created and operated at least six fraudulent tax preparation businesses in south Florida, and used those businesses to file many of these false tax returns. The conspirators directed the resulting tax refunds to debit cards and bank accounts that they controlled.In other iterations of the charged RICO conspiracy, members of the enterprise “hijacked” the IRS-issued identification numbers of CPA and tax preparation firms and used those identification numbers to file scores of additional false tax returns. Members of the enterprise filed false self-prepared tax returns using stolen identities as well.To obfuscate their cybercriminal conduct, the conspirators routinely used pseudonyms, opened business entities and bank accounts in the names of nominees and identity theft victims, and conducted their illicit business using dozens of different email addresses. Altogether, the enterprise claimed more than $36 million in false tax refunds over the course of approximately four years. The actual loss amount is still being calculated but is at least $4 million."
   },
   {
      "time": "2022-11-03",
      "title": "New Windows 'LockSmith' PowerToy lets you free locked files",
      "text": " Microsoft has a new utility to the PowerToys toolset that will help Windows users find the processes using selected files and unlock them without requiring a third-party tool.PowerToys 0.64.0 also adds a Windows hosts file editor and a long list of bug fixes and changes that add stability and improve the other built-in tools.\"File Locksmith lists which processes are using the selected files or directories and allows closing those processes,\" the tool's description reads.While, until now, most users would have to install a third-party program designed to get rid of the \"locked\" status, you can now check which files are being used by which processes by right-clicking them in the File Explorer and clicking \"What's using this file?\" in the context menu.You can then terminate any processes found by File Locksmith or scan again using administrator privileges to look for processes launched by all users.​Today's release also bundles a new Hosts File Editor utility that helps manage the Windows Hosts file's contents, enabling force linking or mapping hostnames to IP addresses.The tool will help you add new entries to the Hosts files and update the ones already available. It also has a filter feature to quickly sieve through large files and narrow down the results list.\"The backup files are located near by hosts file in %SystemRoot%/System32/drivers/etc named hosts_PowerToysBackup_YYYYMMDDHHMMSS.\""
   },
   {
      "time": "2022-11-03",
      "title": "Hundreds of U.S. news sites push malware in supply-chain attack",
      "text": " Threat actors are using the compromised infrastructure of an undisclosed media company to deploy the SocGholish JavaScript malware framework (also known as FakeUpdates) on the websites of hundreds of newspapers across the U.S.\"The media company in question is a firm that provides both video content and advertising to major news outlets. [It] serves many different companies in different markets across the United States,\" Sherrod DeGrippo, VP of threat research and detection at Proofpoint, told BleepingComputer.The threat actor behind this supply-chain attack (tracked by Proofpoint as TA569) has injected malicious code into a benign JavaScript file that gets loaded by the news outlets' websites.This malicious JavaScript file is used to install SocGholish, which will infect those who visit the compromised websites with malware payloads camouflaged as fake browser updates delivered as ZIP archives (e.g., Chromе.Uрdatе.zip, Chrome.Updater.zip, Firefoх.Uрdatе.zip, Operа.Updаte.zip, Oper.Updte.zip) via fake update alerts.\"By modifying the codebase of this otherwise benign JS, it is now used to deploy SocGholish.\"In total, the malware has been installed on sites belonging to more than 250 U.S. news outlets, some of them being major news organizations, according to security researchers at enterprise security firm Proofpoint.While the total number of impacted news organizations is currently unknown, Proofpoint says it knows of affected media organizations (including national news outlets) from New York, Boston, Chicago, Miami, Washington, D.C., and more.\"TA569 has previously leveraged media assets to distribute SocGholish, and this malware can lead to follow-on infections, including potential ransomware,\" DeGrippo also told BleepingComputer.\"The situation needs to be closely monitored, as Proofpoint has observed TA569 reinfect the same assets just days after remediation.\"The infected computers were later used as a stepping point into the employers' enterprise networks in attacks attempting to deploy the gang's WastedLocker ransomware.Update November 02, 18:22 EDT: Added Proofpoint statement."
   },
   {
      "time": "2022-11-03",
      "title": "Emotet botnet starts blasting malware again after 4 month break",
      "text": " The Emotet malware operation is again spamming malicious emails after almost a four-month \"vacation\" that saw little activity from the notorious cybercrime operation.Emotet is a malware infection distributed through phishing campaigns containing malicious Excel or Word documents. When users open these documents and enable macros, the Emotet DLL will be downloaded and loaded into memory.While Emotet was considered the most distributed malware in the past, it suddenly stopped spamming on July 13th, 2022. A partial listing of example file names can be seen below:Today's Emotet campaign also introduces a new Excel attachment template that contains instructions to bypass Microsoft's Protected View.When a file is downloaded from the Internet, including as an email attachment, Microsoft will add a special Mark-of-the-Web (MoTW) flag to the file.When a user opens a Microsoft Office document containing a MoTW flag, Microsoft Office will open it in Protected View, preventing macros that install malware from being executed.However, in the new Emotet Excel attachment, you can see that the threat actors are instructing users to copy the file into the trusted 'Templates' folders, as doing this will bypass Microsoft Office's Protected View, even for files containing a MoTW flag.While Windows will warn users that copying a file into the 'Templates' folder requires 'administrators' permissions, the fact that a user is attempting to copy the file indicates that there is a good chance they will also press the 'Continue' button.When the attachment is launched from the 'Templates' folder, it will simply open and immediately execute macros that download the Emotet malware.The Emotet malware is downloaded as a DLL into multiple random-named folders under %UserProfile%\\AppData\\Local, as shown below.The macros will then launch the DLL using the legitimate regsvr32.exe command.Once downloaded, the malware will quietly run in the background while connecting to the Command and Control server for further instructions or to install additional payloads.Madjar told BleepingComputer that today's Emotet infections have not begun dropping additional malware payloads on infected devices.These Cobalt Strike beacons are then used for initial access by ransomware gangs who spread laterally on the network, steal data, and ultimately encrypt devices.Update 11/3/22: This article originally said spamming stopped on June 13th. Correct date is July 13th. "
   },
   {
      "time": "2022-11-03",
      "title": "French defense firm denies ransomware attack after leak site posting",
      "text": " UPDATE: A Thales spokesperson said the company's experts have not identified any publication of data after LockBit claimed it would leak stolen data on November 7. \"They are carefully monitoring the situation and the Group remains vigilant with regard to any data release. Thales reiterates that the Group has not identified any trace of impact on — nor intrusion into — its information systems. Besides, Thales has not received any authentic ransom notification,\" the spokesperson said. \"We remain attentive towards any allegations of data theft, Thales cybersecurity experts are fully mobilized, as data protection is our utmost priority.\"PREVIOUSLY: French defense and technology firm Thales has denied it was hit with ransomware after a hacking group threatened to leak data stolen from the company. A spokesperson for Thales confirmed that they were aware that the LockBit ransomware group  announced plans to release the data on Nov. 7 in a post on Monday on its leak site. But the company said it has found no evidence that it was ever attacked by the group. “Thales has not identified any trace of impact on — nor intrusion into — its information systems. Besides, we have not received any direct ransom notification,” the spokesperson told The Record. “A dedicated team of security experts systematically investigates this type of situation. We carefully monitor every allegation related to data theft as security of data remains our key priority.”A Thales spokesperson added that though they have not been contacted with any ransom demands, they have notified ANSSI, the government's national cybersecurity agency.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-03",
      "title": "Vodafone Italy discloses data breach after reseller hacked",
      "text": " Vodafone Italia is sending customers notices of a data breach, informing that one of its commercial partners, FourB S.p.A., who operates as a reseller of the telecommunications services in the country, has suffered a cyberattack.According to the notice, the cyberattack took place in the first week of September and resulted in the compromise of sensitive subscriber details.The exposed information includes subscription details, identity documents with sensitive data, and contact details.The notice clarifies that no account passwords or network traffic data have been compromised as a result of this incident.Vodafone Italia urges the recipients of the notifications to remain vigilant against incoming communications, as the risk of being targeted by phishing actors and scammers has now increased.The notice concludes that FourB has closed access to the breached servers and implemented higher-level security on its systems to prevent the occurrence of similar incident in the future.BleepingComputer has reached out to both Vodafone Italia and FourB S.p.A. for more information about the attack but has not received an answer at the time of publishing.While it’s not clear if it’s related to Vodafone's disclosure today, on September 3, 2022, a hacker group calling themselves KelvinSecurity claimed an attack against the telecommunications company.KelvinSecurity offered to sell a collection of 295,000 files totaling 310 GB of data they allegedly stole from Vodafone Italia and advertised the cache on messaging platforms and at least one hacker forum.At the time, the threat actor alleged that their purpose was to alert the company about security problems they had discovered but decided to offer the database for sale after the breached firm ignored their messages."
   },
   {
      "time": "2022-11-03",
      "title": "Missile Supplier MBDA Breach Disclosed by CloudSEK - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-11-03",
      "title": "Malicious proof-of-concepts are exposing GitHub users to malware and more | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondNew research suggests thousands of PoCs could be dangerousIn a paper titled ‘How security professionals are being attacked: A study of malicious CVE proof of concept exploits in GitHub’, researchers from Leiden University in the Netherlands recently detailed how thousands of PoCs for known vulnerabilities contain dangerous elements that do more than billed.Instead of performing an innocuous operation, these exploits could open the door to potential attack.The team – Soufian El Yadmani, Robin The, and Olga Gadyatskaya – collected publicly available PoCs shared on GitHub for CVEs discovered between 2017 and 2021.In total they studied 47,313 repositories that contained PoCs for at least one CVE from the target period, in what they called “the first large-scale qualitative and quantitative investigation of malicious PoCs”.They found that of the 47,313 GitHub repositories they had downloaded and checked, 4,893 (10.3%) were malicious.“The purpose of our research was to investigate how big the problem of fake and malicious PoCs for CVE exploits is, since it is our understanding that this is a problem that hasn’t been tackled by anyone before,” El Yadmani told The Daily Swig.“As a researcher and senior security researcher at Darktrace myself, we rely on sources like GitHub and Exploit-DB for these kinds of PoCs since the knowledge shared by other researchers speaks the same language as we do, which is programming.“About a year ago I noticed that the topic of malicious PoCs was increasingly spoken about on Twitter, but it was only about specific cases, and it was not clear how large the problem actually was.“Since there was no clear indication of how many PoCs were malicious, we chose to investigate the issue ourselves.”El Yadmani told The Daily Swig that the most interesting finding was the variation in fake and malicious PoCs that the team encountered.“In some the attackers were trying to plant malware on users’ machines, while in others, they tried to open backdoors using CobaltStrike, for example,” he said.“What’s surprising is that in some cases we found fake and harmless PoCs that included memes; the most interesting finding was that some of these people invested a lot of time in their PoCs, while their only purpose was to educate the community about how they should not blindly trust PoCs from other people.”“Ignoring this problem can cause damage that ranges from infecting yourself as [a] user, to infecting your company and likely your customers as well if it’s a more sophisticated attack,” El Yadmani warned.“Pen testers and developers should always read the code before running it, but in CVE PoCs it can be tricky and challenging in some cases.“That’s why we wanted to introduce an approach that helps [with] detecting suspicious behaviors in PoCs, automatically. We also want to invest more time in suggesting automated solutions that can help flagging malicious PoCs.“Our research is also an invitation to other researchers, either in academia or [the] industry, to invest more time in producing solutions for this problem.”Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2022-11-03",
      "title": "Australian Department of Defense Hit by Cyberattack - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " The Department of Defence is afraid that the personal information of personnel, like DoB, may have been breached after a communications platform used by the military suffered a ransomware attack. Hackers attacked the ForceNet service, which is operated by an external information and communications technology (ICT) provider. The organisation in the beginning told the Defense Department no data of former or current personnel was breached.However, the Department of Defense believes that personal details like the date of enlisting and DoB may have been stolen, despite initial hints being contrary to what the external provider is saying. In a message notification to the staff, the defence chief and secretary said the issue is being taken \"very seriously.\"There has been a series of cyberattacks in recent times, from health insurance companies to telecommunications.Medibank earlier this week confirmed a criminal organization behind a cyber attack on its company had access to the data of around 4 million customers, some of these consist of health claims. In September, Optus said a cyberattack had leaked the data of around 10 Million Australian users, with a considerable amount of information stolen from around 2.8 million people.Minister for Defense Personnel Matt Keogh ForceNet kept upto 40,000 records, saying \"I think all Australians, and rightly the Australian government, is quite concerned about this sort of cyber activity that's occurring, people seeking through nefarious means to get access to others' personal data.\"In the email to the staff, the Defense Department was confident that the hack of ForceNet was not targeted at the IT systems of the department. It said \"we are taking this matter very seriously and working with the provider to determine the extent of the attack and if the data of current and former APS [Australian public service] staff and ADF personnel has been impacted. If you had a ForceNet account in 2018, we urge you to be vigilant but not alarmed.\"Earlier talks with the service provider hint that there is no substantial proof that data of former and current ADF Personnel and APS staff personnel have been breached. It said, \"we are nevertheless examining the contents of the 2018 ForceNet dataset and what personal information it contains.\"your nameYour Emailyour message"
   },
   {
      "time": "2022-11-03",
      "title": "U.S. govt employees exposed to mobile attacks from outdated Android, iOS",
      "text": " According to a new report, almost half of Android-based mobile phones used by U.S. state and local government employees are running outdated versions of the operating system, exposing them to hundreds of vulnerabilities that can be leveraged for attacks.These statistics come from a report by cybersecurity firm Lookout, based on an analysis of 200 million devices and 175 million applications from 2021 to H2 2022.The report additionally warns of a rise in all threat metrics, including attempted phishing attacks against government employees, reliance on unmanaged mobile devices, and liability points in mission-critical networks.Outdated versions of mobile operating systems allow attackers to exploit vulnerabilities that can be used to breach targets, run code on the device, plant spyware, steal credentials, and more.The situation is much worse for Android, as ten months after the release of version 12, approximately 30% of federal devices and almost 50% of state and local government devices still needed to upgrade to the latest versions, thus remaining vulnerable to bugs that can be exploited in attacks.It should be noted that Android 13 is the latest version of the operating system, but it was released after the first half of 2022, from which this data was collected.Notably, 10.7% of the federal government and another 17.7% of state and local government devices were running Android 8 and 9, which reached the end of support in November 2021 and March 2022, respectively.These two OS versions carry over two thousand known vulnerabilities that Google will not fix, and the list only gets longer each month.According to Lookout, the most common attack against mobile users is malware delivery, accounting for about 75%, while credential harvesting represents most of the remaining percentage.The analysts say when comparing year-over-year stats, malware distribution is gradually dropping, and credential theft attacks are increasing.In 2022, 1 out of 11 government employees monitored by Lookout were targeted by a phishing attack, with both managed and unmanaged devices having roughly the same targeting rate.Of those who clicked on the malicious links and were warned about their error, 57% did not repeat their mistake, 19% clicked again, and 24% clicked over three times.However, while CISA advises state, local, and tribal governments to follow the same guidelines, they are not required to do so under this directive."
   },
   {
      "time": "2022-11-03",
      "title": "çä¼¼Lazarusç»ç»éå¯¹é©å½çæ»å»æ´»å¨åæ",
      "text": " æ¶é´ ï¼  2022å¹´11æ01æ¥  æ¥æºï¼  å®å¤©CERTè¿æï¼å®å¤©CERTåç°ä¸èµ·éå¯¹é©å½çæ»å»æ´»å¨ï¼è¯±é¥µææ¡£æ é¢ä¸ºâSogang KLEC.docxâï¼è¥¿æ±å¤§å­¦é©å½è¯­è¨æè²ä¸­å¿.docxï¼ãå¯¹è·åå°çæ ·æ¬ä»¥åå³èå°çæ¶æè½½è·è¿è¡åæç å¤ï¼æç»å°å¶å³èå°Lazarusç»ç»ãLazarusç»ç»ï¼åç§°ä¸ºHIDDEN COBRAãAPT38ãZincãGuardians of Peaceç­ï¼æ¯åå²å°åºææ´»è·çAPTç»ç»ä¹ä¸ãè¯¥ç»ç»çæ»å»ç®æ æ¶åæ³¢å°ãæºå©ãç¾å½ãå¢¨è¥¿å¥ãå·´è¥¿ç­æ°åä¸ªå½å®¶ï¼éå¯¹é¶è¡ãæ¯ç¹å¸äº¤ææç­éèæºæåä¸ªäººå®æ½å®åæ»å»æ´»å¨ï¼ä»¥è·åç»æµå©çï¼å ªç§°å¨çéèæºæçæå¤§å¨èä¹ä¸ãæ­¤å¤ï¼è¯¥ç»ç»è¿éå¯¹èªç©ºèªå¤©ãCOVID-19ç«èææ¯ãæ¿åºãåªä½ç­æºæåä¼ä¸è¿è¡æ¸éï¼ä»¥çªåéè¦èµæå¹¶è¿è¡ç ´ååç´¢ãæ­¤æ¬¡æ»å»æ´»å¨çæ»å»æµç¨å¤§è´å¦ä¸æç¤ºï¼1.éç¨æ¨¡æ¿æ³¨å¥çæ¹å¼ï¼ç­å¾è¯±é¥µææ¡£è¢«æå¼åå°æ»å»èæé çæ¶ææ¨¡æ¿ä¸è½½å°ä¸»æºæ§è¡ã2.æ¨¡æ¿ä¸­çå®ä»£ç è¯·æ±æå®çURLï¼ä¸è½½æ¶æè½½è·å¹¶å°å¶æ³¨å¥å°WINWORD.exeä¸­æ§è¡ã3.ä¸è½½å°çæ¶æè½½è·ä¸»è¦ç¨äºéæ¾ä¸è½½å·¥å·IEUpdate.exeå¹¶æ§è¡ï¼ä»¥åå°å¶æ·»å è³æ³¨åè¡¨RUNä¸­å®ç°æä¹åã4.IEUpdate.exeå¾å°æ§è¡ååéæ¶æ¯è·ååç»­éä¿¡ä½¿ç¨çC2ï¼æ ¹æ®åä¼ çä¿¡æ¯ä¸è½½ä¸åæ¶æè½½è·æ§è¡ã5.ç®åå·²ç¥å­å¨ä¸¤ç§è½½è·hvncengine.dllåshellengine.dllï¼ç¨äºä¸C2éä¿¡ä»¥å®ç°è¿ç¨æ§å¶ãå¾2â1 æ»å»æµç¨ç¤ºæå¾è¡¨3â1 è¯±é¥µææ¡£çæ¯åç§°åå§æä»¶åSogang\r\n                                  KLEC.docxMD5f1a61ee026eac8583ee840d297792478æä»¶å¤§å°æä»¶æ ¼å¼å©ç¨æ¼æ´æ éæ¾ææ³è¿ç¨æ¨¡æ¿æ³¨å¥åå»ºæ¶é´2022-04-06\r\n                                  8:40:00 UTCæåç¼è¾æ¶é´2022-08-05\r\n                                  2:40:00 UTCåå»ºèæ æåä¿å­èexcitingæ­£æå½å®¶è¯­è¨ko-KRVTé¦æ¬¡ä¸ä¼ æ¶é´2022-08-16\r\n                                  21:05:35 UTCVTæ£æµç»æ16/65éè¿å¬å¼ææ¥å¹³å°çå³èåè½åç°è¯±é¥µææ¡£çä¸è½½é¾æ¥ï¼ä¿¡æ¯è¯´æè¯±é¥µææ¡£æ¯å¨Naver Mailæä¾çå¤§éä»¶å­å¨ç«ç¹ä¸è½½å¾å°ï¼çæµæ»å»èå¯è½éè¿Naver Mailåééé±¼é®ä»¶è¿è¡æ»å»ãå·²ç¥Naver Mailæ¯ç±é©å½äºèç½éå¢Naver Corporationæä¾ççµå­é®ä»¶æå¡ãå¾3â1 è¯±é¥µææ¡£ä¸è½½é¾æ¥SaniTOXä¸ºé©å½Jiransecurityå¬å¸çä¸æ¬¾å®å¨é²æ¤è½¯ä»¶ï¼è¯±é¥µææ¡£ä»¿åSaniTOXè¯±å¯¼åå®³èå¯ç¨å®ï¼æ¶æææ¡£æ­£æåå®¹å¦ä¸ãå¾3â2 æ­¤æ¬¡æ»å»æ´»å¨è¯±é¥µææ¡£æ­£æåå®¹å¯¹ææ¡£æ­£æåå®¹å³èååç°ï¼è¯±é¥µææ¡£æ­£æåå®¹å¹¶éç¬¬ä¸æ¬¡åºç°ãå¾3â3 ä»¥å¾æ»å»æ´»å¨è¯±é¥µææ¡£æ­£æåå®¹[1] æ»å»èä½¿ç¨Wordæ¨¡æ¿æ³¨å¥çæ¹å¼ï¼å¨åå®³èæå¼è¯±é¥µææ¡£åä¸è½½æ¶ææ¨¡æ¿æ§è¡ï¼æ¨¡æ¿æå¨çå°åä¸ºhttp://23.106.160.173/temp2.dotmãå¾3â4 è¿ç¨æ¨¡æ¿é¾æ¥è¡¨3â2 æ¨¡æ¿æä»¶çæ¯åç§°åå§æä»¶åMD58D7C3F3C56AD3069908901790ADFA826æä»¶å¤§å°æä»¶æ ¼å¼å©ç¨æ¼æ´æ éæ¾ææ³å®ææ¡£åå»ºæ¶é´2022-07-31\r\n                                  2:45:00 UTCæåç¼è¾æ¶é´2022-08-03\r\n                                  14:48:00 UTCåå»ºèexcitingæåä¿å­èexcitingVTé¦æ¬¡ä¸ä¼ æ¶é´2022-08-16\r\n                                  21:13:22 UTCVTæ£æµç»æ37/65æ¨¡æ¿ä¸­åå«æ¶æå®ä»£ç ï¼å½æå¼ææ¡£åèªå¨æ§è¡ãå®ä»£ç ä¸»è¦åè½ä¸ºä¸è½½æ¶æè½½è·ï¼è¥æåä¸è½½ï¼ä¾¿å°ä¸è½½å°çæ¶æè½½è·æ³¨å¥å°Winwordç¨åºä¸­æ§è¡ãå¾3â5 ä¸è½½æ¶æè½½è·æ­¤å½æ°å°ä¸è½½çæ¶æè½½è·æ³¨å¥å°WinWordä¸­æ§è¡ãå¾3â6 æ³¨å¥å½æ°æ³¨å¥å°Winwordè¿ç¨ä¸­çæ¶æè½½è·è¿è¡åä¼å¨%LocalAppData%\\Microsoft\\PlayReadyä¸éæ¾IEUpdate.exeåerror.logæä»¶ï¼ä¹åéè¿fodhelper.exeç»è¿UACæåIEUpdate.exeæéæ§è¡ï¼error.logæä»¶ä¸­è®°å½äºåç»­æéè¦è®¿é®çé¨åURLé¾æ¥âs/ucnpe74wo87d3mm/server.txt?dl=0âãå¾3â7 æ¶æè½½è·éæ¾çæä»¶ä»¥åerror.logä¸­çåå®¹ä¿®æ¹æ³¨åè¡¨å¯å¨é¡¹å®ç°æä¹ååè½ãå¾3â8 å°IEUpdate.exeæä»¶æ·»å å°æ³¨åè¡¨RUNä¸­è¡¨3â3 äºè¿å¶å¯æ§è¡æä»¶çæ¯åç§°åå§æä»¶åIEUpdate.exeMD5c073012bc50b6a4f55f8edcce294a0b4å¤çå¨æ¶æIntel\r\n                                  386 or later, and compatiblesæä»¶å¤§å°92.00\r\n                                  KB (94208 bytes)æä»¶æ ¼å¼Win32\r\n                                  EXEæ¶é´æ³2022-08-03\r\n                                  03:27:06 UTCæ°å­ç­¾åæ å å£³ç±»åæ ç¼è¯è¯­è¨Microsoft\r\n                                  Visual C++ v.11 - 2012VTé¦æ¬¡ä¸ä¼ æ¶é´2022-08-16\r\n                                  21:13:22 UTCVTæ£æµç»æ49/72é¦åå¤æ­èªèº«æå¤è·¯å¾æ¯å¦åå«â:\\myapp.exeâï¼è¥åå«åéåºãå¾3â9 å¤æ­èªèº«æå¤è·¯å¾éè¿sleepè®¾ç½®å»¶è¿æ¶é´ï¼å¤æ­å»¶è¿æ¶é´æ¯å¦çæï¼ä»¥æ­¤ç»è¿é¨åä¿®æ¹sleepæ¶é´çæ²ç®±ãå¾3â10 æ²ç®±æ£æµè·åä¸»ç¡¬ççè®¾å¤æè¿°ä¿¡æ¯ï¼å¹¶å°å¶ä¸âVDEVICEâè¿è¡æ¼æ¥ï¼æ¼æ¥åçå­ç¬¦ä¸²éè¿CRCæ£ååä¸â0âè¿è¡æ¼æ¥ï¼æ ¼å¼ä¸ºâ0+CRCæ£ååçå¼âãå¾3â11 è·åä¸»æºä¿¡æ¯å¹¶çæä¸»æºæ è¯éè¿å¨ç³»ç»ç®å½ä¸åå»ºç®å½ï¼å¤æ­å¶æ¯å¦å·æç®¡çåæéãå¾3â12 æéå¤æ­è·åæä½ç³»ç»ççæ¬ä¿¡æ¯ãå¾3â13 è·åæä½ç³»ç»çæ¬ä¿¡æ¯è·åè¿ç¨å¿«ç§ï¼å¹¶å¤æ­å½åè¿è¡çè¿ç¨ä¸­ï¼æ¯å¦åå«âv3l4sp.exeâãâAYAgent.ayeâãâIEUpdate.exeâãå¶ä¸­âv3l4sp.exeâä¸ºé©å½AhnLabå¬å¸åè´¹ææ¯è½¯ä»¶V3 Liteçå­ç¨åºï¼âAYAgent.ayeâä¸ºé©å½å¬å¸ESTsoftçäºèç½å®å¨å¥ä»¶ALYacçä¸é¨åãå¾3â14 æ£æµæå®æè½¯å¦æå­å¨è·¯å¾ä¸ºâ%LocalAppData%\\Microsoft\\PlayReady\\IEUpdate.exeâä¸è¿ç¨IDä¸å½åè¿ç¨ä¸ç¬¦ï¼åå³é­ååçIEUpdate.exeè¿ç¨ãå¾3â15 å³é­ååè¿ç¨æ ¹æ®cmdlineçåæ°ä¸­æ¯å¦åå«â/sâãâ/aâæ¥è®¾ç½®æ è®°ï¼å¹¶æ ¹æ®ååè®¾ç½®çç®¡çåæéæ è®°éæ©ä¸ååæ¯æ§è¡ãå¾3â16 æ ¹æ®åæ°è®¾ç½®æ è®°å¤æ­ååçæææä½æ¯å¦æåãå¦æä¸ºç®¡çåæéï¼åä¼éè¿PowerShellå½ä»¤å°èªèº«æ·»å å°Windows Defenderæé¤åè¡¨ä¸­ãå¾3â17 å°æ­¤æä»¶æ·»å å°Windows Defenderç½ååå¦æéç®¡çåæéï¼åå»ºæ°çº¿ç¨å¹¶å¾ªç¯æ§è¡ï¼å·ä½å¦ä¸æç¤ºãå¾3â18 åå»ºçº¿ç¨çº¿ç¨åå»ºå¦ä¸ä¸ªçº¿ç¨å½æ°ï¼è¯¥çº¿ç¨å½æ°ç¨ä½åC2è¿è¡éä¿¡ãé¦åå°âdl.dropboxusercontent.comâä¸ä»error.logæä»¶ä¸­è·åå°çåå®¹è¿è¡æ¼æ¥ï¼å¹¶ä»æ¼æ¥åå½¢æçURLä¸­è·åæ¥ä¸æ¥éä¿¡çC2å°åãå¾3â19 ä»Dropboxä¸­è·åC2å°åç¶åå°æä½ç³»ç»çæ¬ä¿¡æ¯ãæ¯å¦å­å¨æå®çæè½¯ãååçæçuidä½ä¸ºä¸çº¿ååä¼ ãå¾3â20 æé ä¸çº¿åä¸çº¿ååä¼ å½æ°ï¼å°æ¶éå°çä¿¡æ¯åéå°post2.phpãå¾3â21 åéä¸çº¿åéåä»æ¼æ¥çURLä¸­æ¥æ¶æ°æ®ï¼å¹¶å¯¹æ°æ®è¿è¡å¤çï¼è·åæ°æ®ä¸­ç¬¬ä¸ä¸ªâ%âåçåå®¹ï¼å¹¶ä»¥â\\râãâ\\nâä½ä¸ºç»æç¬¦ãæ­¤åå®¹å°ä½ä¸ºåç»­ä¸è½½URLçèµæºå°åãè·åæ°å­0-9çé¿æä¼¯æ°å­ï¼ç»å¤çåå¾å°æä»¤IDãå¾3â22 åéè¯·æ±å¹¶æ¥æ¶C2çå½ä»¤å¾ªç¯æ§è¡ä¸åçå½ä»¤ï¼å¹¶ä¼å¤æ­æ¯å¦éå¤æ§è¡ãå¾3â23 æ§è¡C2ä¸åçå½ä»¤ä¸è½½dllæä»¶å¹¶éæ©å¯¼åºå½æ°æ§è¡ãå¾3â24 ä¸è½½åç»­è½½è·æ§è¡éè¿å¬å¼ææ¥å¹³å°æ¥æ¾ä¸è¿°æ ·æ¬çä¿¡æ¯ï¼å¨è¯±é¥µææ¡£å³èçPCAPæä»¶ä¸­åç°ä¸¤ä¸ªæä»¶ï¼åºä¸ºIEUpdate.exeä¸è½½çæ¶æè½½è·ï¼å®ä»¬å·æç¸åçåä¼ æ°æ®ç»æä¸è§£å¯ç®æ³ãè¡¨3â4 åä¼ æ°æ®ç»æå°æ°æ®å¤´çåç§»é¿åº¦\r\n                                  ï¼byteï¼è§£é0x00xCåºå®æ°æ®,è§£å¯åä¸º)(*&POIU:LKJ0xC0x8åºå®æ°æ®ï¼æéå¯æ¿æ¢ä¸ºæ¥æ¶çæ°æ®0x140x4è¯¥é¨åæ°æ®ï¼æ ¹æ®æ§è¡çåå®¹å³å®0x180x4åä¼ æ°æ®çé¿åº¦ï¼sizeï¼0x1Csizeåä¼ çæ°æ®0x1C+size0xCåºå®æ°æ®,è§£å¯åä¸º^%$#YTREHGFDå¨åä¼ æä»¶çè¿ç¨ä¸­ï¼åä¼ æ°æ®ç»æä¼æéå½è°æ´ï¼å·ä½å¦ä¸å¾æç¤ºãè¡¨3â5 æä»¶åä¼ æ°æ®ç»æå°æ°æ®å¤´çåç§»é¿åº¦\r\n                                  (byte)è§£é0x00xCåºå®æ°æ®,è§£å¯åä¸º)(*&POIU:LKJ0xC0x8åºå®æ°æ®ï¼æéå¯æ¿æ¢ä¸ºæ¥æ¶çæ°æ®0x140x8æ´ä½æä»¶å¤§å°0x1C0x4æä»¶è·¯å¾é¿åº¦0x20size1æä»¶è·¯å¾ï¼size1ï¼0x20+size10x8å½åæä»¶æéçä½ç½®0x28+size10x4å½åè¯»åæä»¶åå®¹çå¤§å°ï¼size2ï¼0x2C+size1size2è¯»åçæä»¶åå®¹0x2C+size1+size20xCåºå®æ°æ®,è§£å¯åä¸º^%$#YTREHGFDâ)(*&POIU:LKJâä¸â^%$#YTREHGFDâå¨é®çä¸çä½ç½®å¦ä¸å¾æç¤ºãå¾3â25 åä¼ æ°æ®ç»æä¸­çåºå®åå®¹å¨é®çä¸çä½ç½®è¡¨ 3â6 äºè¿å¶å¯æ§è¡æä»¶çæ¯åç§°åå§æä»¶åMD55beade9f8191c6a9c47050d4e3771b80å¤çå¨æ¶æIntel\r\n                                  386 or later, and compatiblesæä»¶å¤§å°æä»¶æ ¼å¼æ¶é´æ³2022-08-03\r\n                                  03:30:53 UTCæ°å­ç­¾åæ å å£³ç±»åæ ç¼è¯è¯­è¨Microsoft\r\n                                  Visual C++ v.7.10 - 11.0 - Visual 2012VTé¦æ¬¡ä¸ä¼ æ¶é´2022-08-16\r\n                                  21:15:12 UTCVTæ£æµç»æ48/71æ¶æè½½è·å­å¨ä¸¤ä¸ªå¯¼åºå½æ°SEEndåSEStartãSEEndç¨äºå³é­socketè¿æ¥ä»¥åç­å¾çº¿ç¨ï¼SEStartä¸ºè½½è·ä¸»è¦åè½ï¼ç¨äºä¸C2éä¿¡å®ç°hvncåè½ãæ ·æ¬è¿è¡åï¼é¦ååIEUpdate.exeä¸æ ·çæå¸¦æä¸»æºæ è¯çå­ç¬¦ä¸²ãå¾3â26 è·åä¸»æºä¿¡æ¯å¹¶çæä¸»æºæ è¯æ¯éååéï¼æ§è¡ä¸æ¬¡æ¶æåè½ãå¾3â27 è®¾ç½®é´éæ¶é´ä»¥ä¸è¿°å¸¦æä¸»æºæ è¯çå­ç¬¦ä¸²ä½ä¸ºåå­åå»ºæ¡é¢ãå¾3â28 æ°å»ºæ¡é¢è¿å¥çº¿ç¨å½æ°åï¼ä¸IEUpdate.exeä¸æ ·ï¼è¯»å âerror.logâä¸­çåå®¹åä¸âdl.dropboxusercontent.comâæ¼æ¥ï¼éè¿GETè¯·æ±è·åC2å°åï¼èåéè¿socketå°è¯è¿æ¥ãå¾3â29 ä»Dropboxä¸­è·åC2å¹¶è¿æ¥å¦æè¿æ¥æåçè¯ï¼å°éè¿socketåéååçæçä¸»æºæ è¯ç¬¦ï¼å¹¶è®¾ç½®å½åçº¿ç¨ä¸æ¡é¢çå³èãå¾3â30 åéç¹å®å­ç¬¦ä¸²ä¾æ¬¡ä»æå¡ç«¯æ¥æ¶å½ä»¤ï¼å®ç°hvncçåè½ãå¾3â31 æ¥æ¶å½ä»¤è§£æå¹¶æ§è¡æ ¹æ®ä¸åçå½ä»¤ï¼åç°ä¸åçæä½ï¼éååæå½ä»¤åå¯¹åºåè½å¤§è´å¦ä¸æç¤ºãè¡¨3â7 å½ä»¤åå¯¹åºåè½å½ä»¤åè½0x1æç»­åéæªå±ä¿¡æ¯0x2åæ­¢åéæªå±ä¿¡æ¯0x3æ§è¡ä¸åçå½ä»¤è¡0x5æ¨¡æé®çæä½0x6æ¨¡æé¼ æ æä½0x7æå¼explorer.exe,å¹¶è®¾ç½®å§ç»æ¾ç¤ºä»»å¡æ 0x8å¯å¨chrome.exeæ¶éä¸»æºä¿¡æ¯å¹¶çæä¸»æºæ è¯ç¬¦ãå¾3â32 æ¶éä¸»æºä¿¡æ¯å¹¶çæä¸»æºæ è¯ç¬¦åå»ºç®¡éç¨äºä¸cmd.exeå­è¿ç¨éä¿¡ãå¾3â33 åå»ºç®¡éåå»ºçº¿ç¨ï¼å¹¶å°cmd.exeçè¿åç»æåä¼ å°C2ãå¾3â34 è·åcmd.exeæ§è¡çç»æå¹¶åä¼ åå»ºä¸C2éä¿¡å¹¶ç¨äºå®ç°ä¸»è¦æ¶æåè½ççº¿ç¨ãå¾3â35 å®ç°æ¶æåè½ççº¿ç¨ä¸ä¹åä¸¤ä¸ªæ ·æ¬ç¸åï¼ä¾æ§æ¯è¯»å âerror.logâä¸­çåå®¹åä¸âdl.dropboxusercontent.comâæ¼æ¥ï¼ä»è¯¥å°åå¤è·ååç»­éä¿¡çC2ï¼å¹¶å°è¯ä½¿ç¨socketè¿æ¥ãå¾3â36 ä»Dropboxä¸­è·åC2å¹¶è¿æ¥è¥å¯ä»¥å»ºç«socketè¿æ¥ï¼åæ¥æ¶æå¡ç«¯å½ä»¤ï¼æ ¹æ®å½ä»¤å®ç°ä¸åæ¶æåè½ãå¾3â37 æ ¹æ®æä»¤å®ç°ä¸åæ¶æåè½æ ¹æ®ä¸åçå½ä»¤ï¼åç°ä¸åçæä½ï¼éååæå½ä»¤åå¯¹åºåè½å¤§è´å¦ä¸æç¤ºãè¡¨3â9 å½ä»¤åå¯¹åºåè½å½ä»¤åè½0x1æ ¹æ®æ¥åçæ°æ®ï¼æ¹ååä¼ æ°æ®ç»æçåç§»0xCå¤ç8ä¸ªå­è0x2éå¯cmd.exeè¿ç¨æèéè¿cmd.exeæ§è¡å½ä»¤è¡0x4è·åç£çåè¡¨æèè·åæå®ç®å½ä¸çå­ç®å½åæä»¶åç§°åè¡¨0x6è·åæå®æä»¶0xAè·åæªå±ä¿¡æ¯0xBè®¾ç½®æ è®°ï¼åæ­¢æªå±0xDæ¨¡æé¼ æ ç¹å»0xEæ¨¡æé¼ æ ç§»å¨0xFä¿®æ¹å¾åè½¬æ¢æ¶çåæ°0x14å°åä¼ æ°æ®ç»æçåç§»0xCå¤ç8ä¸ªå­èæ¹ä¸ºæ ·æ¬ä¸­å­å¨çæ°æ®0x1Eåä¼ chromeå¯é¥0x1Fè·åæå®ç®å½ä¸çæä»¶éè¿pdbè·¯å¾çç¸ä¼¼æ§ä»¥åç¸åçèªå®ä¹å å¯å½æ°å¯ä»¥æ¨æµåºæ»å»æ´»å¨ä¸­æ¶åç3ä¸ªPEæä»¶åºå½å±äºåä¸ä¸ªæ»å»èãåæ ¹æ®æ¨¡æ¿æä»¶ä¸­åå«çVBAä»£ç ä»¥åIEUpdate.exeä¸è½½å·¥å·ä»£ç ä¸Lazarusç»ç»ååæ»å»æ´»å¨ä¸­ç¸åºæä»¶çä»£ç å·æå¾é«çç¸ä¼¼ç¨åº¦ï¼æ¨æµæ¬æ¬¡æ»å»æ´»å¨åæ ·å½å±äºLazarusç»ç»ãIEUpdate.exeãhvncengine.dllãshellengine.dllä¸ä¸ªæä»¶çpdbåå¨åä¸ä¸ªç®å½ä¸ãå¾4â1 IEUpdate.exeçpdbå¾4â2 hvncengine.dllçpdbå¾4â3 shellengine.dllçpdbhvncengine.dllä¸shellengine.dllçèªå®ä¹å å¯å½æ°å®å¨ç¸åï¼ä½æç¨keyä¸åãIEUpdate.exeåshellengine.dllçkeyä¸ºâLNfYIUâï¼hvncengine.dllçkeyä¸ºâWhdeEgâãå¾4â4 èªå®ä¹å å¯å½æ°å¸¦ææ¶æå®çæ¨¡æ¿æä»¶åIEUpdate.exeä¸è½½å·¥å·ä¸åååç°Lazarusç»ç»çæ ·æ¬ä»£ç å¤§é¨åç¸ä¼¼ãå¾4â5 æ­¤æ¬¡æ»å»æ´»å¨æ¶åçvbaä»£ç  å¾4â6 ä»¥å¾æ»å»æ´»å¨æ¶åçvbaä»£ç [2] å¾4â7 æ­¤æ¬¡æ»å»æ´»å¨æ¶åçä¸è½½å·¥å·ä»£ç  å¾4â8 ä»¥å¾æ»å»æ´»å¨ä¸­æ¶åçä¸è½½å·¥å·ä»£ç [2]Lazarusç»ç»ç¸å³æ»å»æ´»å¨çè¡ä¸ºææ¯ç¹çATT&CKæ¡æ¶å¾è°±å¦ä¸æç¤ºï¼å¾5â1 Lazarusç»ç»æ»å»æ´»å¨å¯¹åºATT&CKå¨èæ¡æ¶æ å°å¾æ¬æ¬¡ç³»åæ´»å¨å±æ¶åATT&CKæ¡æ¶ä¸­11ä¸ªé¶æ®µç28ä¸ªææ¯ç¹ï¼å·ä½è¡ä¸ºæè¿°å¦ä¸è¡¨ï¼è¡¨5â1 ATT&CKææ¯è¡ä¸ºæè¿°ATT&CKé¶æ®µ/ç±»å«å·ä½è¡ä¸ºæ³¨éèµæºå¼åè·ååºç¡è®¾æ½å©ç¨DropBoxå­æ¾åç»­è¿æ¥çC2å°ååå§è®¿é®ç½ç»éé±¼çæµå¯è½å©ç¨éé±¼é®ä»¶ä¼ æ­è¯±é¥µæä»¶åå§è®¿é®æ°´åæ»å»çæµå¯è½éè¿æ°´åæ»å»ä¼ æ­è¯±é¥µæä»¶æ§è¡å©ç¨è¿ç¨é´éä¿¡shellengine.dllåé¨å¯éè¿ç®¡éæ§è¡cmdå½ä»¤æ§è¡è¯±å¯¼ç¨æ·æ§è¡è¯±å¯¼ç¨æ·æå¼æ»å»èæé çè¯±é¥µææ¡£æä¹åå©ç¨èªå¨å¯å¨æ§è¡å¼å¯¼æç»å½éè¿ä¿®æ¹æ³¨åè¡¨å¯å¨é¡¹å®ç°æä¹åæææ»¥ç¨æåæ§å¶æéæºå¶éè¿fodhelper.exeç»è¿UAC ææè¿ç¨æ³¨å¥å°IEUpdate.exeæ³¨å¥å°WINWORD.exeè¿ç¨é²å¾¡è§é¿æ»¥ç¨æåæ§å¶æéæºå¶éè¿fodhelper.exeç»è¿UACé²å¾¡è§é¿åæ··æ·/è§£ç æä»¶æä¿¡æ¯æ ·æ¬ç§çå³é®å­ç¬¦ä¸²éè¿èªå®ä¹ç®æ³å å¯é²å¾¡è§é¿åå¼±é²å¾¡æºå¶ä¿®æ¹Windows Defenderçç½ååé²å¾¡è§é¿è¿ç¨æ³¨å¥å°IEUpdate.exeæ³¨å¥å°WINWORD.exeè¿ç¨é²å¾¡è§é¿æ¨¡æ¿æ³¨å¥å©ç¨æ¨¡æ¿æ³¨å¥å è½½è¿ç¨æ¶ææ¨¡æ¿æ§è¡é²å¾¡è§é¿èæå/æ²ç®±éé¸éè¿å¤æ­sleepå»¶æ¶æ¯å¦æåè§é¿é¨åæ²ç®±å­è¯è®¿é®çªåWebä¼è¯cookieçªåchrome cookieåç°åç°åºç¨ç¨åºçªå£åç°åºç¨ç¨åºçªå£ï¼ä¾¿äºå®ç°è¿ç¨æ¡é¢æ§å¶åç°åç°æä»¶åç®å½åç°ç®æ æºä¸­çæä»¶åç®å½åç°åç°è¿ç¨åç°ç®æ æºä¸­çè¿ç¨ä¿¡æ¯åç°æ¥è¯¢æ³¨åè¡¨åç°ç®æ æºåç°åç°ç³»ç»ä¿¡æ¯åç°ç®æ æºçç³»ç»çæ¬ç­ä¿¡æ¯åç°åç°ç³»ç»ææè/ç¨æ·åç°ç®æ æºçå½åç¨æ·åç°åç°ç³»ç»æ¶é´åç°ç®æ æºå½åç³»ç»æ¶é´åç°èæå/æ²ç®±éé¸éè¿å¤æ­sleepå»¶æ¶æ¯å¦æåè§é¿é¨åæ²ç®±æ¶éæ¶éæ¬å°ç³»ç»æ°æ®æ¶éç³»ç»çæ¬ãç¨æ·åãæä»¶åè¡¨ãæä»¶ç­æ°æ®æ¶éè¾å¥æææè·é¼ æ ãé®çæ¶æ¯æ¶éè·åå±å¹æªå¾è·åå±å¹æªå¾å½ä»¤ä¸æ§å¶ä½¿ç¨åºç¨å±åè®®ä½¿ç¨socketåC2éä¿¡æ°æ®æ¸åºä½¿ç¨C2ä¿¡éåä¼ æ°æ®åéè¿C2ä¿¡éåä¼ Lazarusç»ç»æ¯åå²å°åºçé¡¶å°é»å®¢å¢ä¼ï¼ä¸æ³¨äºéå¯¹ç¹å®ç®æ è¿è¡é¿æçæç»­æ§ç½ç»æ»å»ï¼ä»¥çªåèµéåå®ç°æ¿æ²»ç®çä¸ºåºåç¹ï¼æ¯å¨çéèæºæçæå¤§å¨èä¹ä¸ãæ­¤æ¬¡æ»å»æ´»å¨ä¸­Lazarusç»ç»ä½¿ç¨å¤é¶æ®µä¸è½½å·¥å·ï¼å¹¶éè¿Dropboxè·åC2å°åï¼å å¤§æ»å»è½½è·è·åé¾åº¦ï¼åæ¶æ ·æ¬ä¸­å­å¨æ£æµæå®çæè½¯ç»ä»¶ä»¥åæ²ç®±çè¡ä¸ºï¼å¹²æ°åæãæ ·æ¬è¿å©ç¨fodhelper.exeç»è¿UACæåæ¶æè¿ç¨çæéï¼éè¿è¿ç¨æ³¨å¥çæ¹å¼ä»¥åæ´æ¹Windows Defenderçæé¤åè¡¨ä½¿æ»å»æ´»å¨æ´é¾è¢«åç°ãæ ·æ¬ä¸­æ£æµçæè½¯ALyacä»¥åAhnlabåä¸ºé©å½æµè¡çæè½¯ï¼ç»åè¯±é¥µæä»¶çåç§°âSogang KLEC.docxâä»¥åè¯±é¥µææ¡£æ­£æä¸­çå¾çå¯ä»¥æ¨æµåºè¿æ¯ä¸èµ·éå¯¹é©å½çæ»å»æ´»å¨ã"
   }
]