[
   {
      "time": "2023-11-14",
      "title": "Azerbaijan Agencies Sign Cyber-Partner Deals",
      "text": " Information security representatives from Azerbaijan and Turkmenistan have signed a memorandum of understanding (MOU) for future cooperation on cybersecurity issues.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-11-14",
      "title": "\r\n\tEU Formalizes Cybersecurity Support For Ukraine - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineThe EU has cemented ties with Ukraine on cybersecurity cooperation, with a new formal agreement designed to improve information sharing and capacity building.The broad-based arrangement covers “short-term structured cooperation actions,” but also has a focus on longer term policy alignment, ENISA said. It covers three areas:The move comes after the European Commission last week recommended Ukraine be invited to begin membership talks with the EU, as soon as it’s able to meet a set of final conditions.This process will likely last years but is an important step for the country given its struggle to regain ground from Russia in a much-hyped counter offensive.Commission vice president for foreign affairs, Josep Borrell, argued that support for Ukraine will also help the EU improve resilience to Russian aggression in cyberspace.“This makes today’s arrangement on enhanced cooperation for cybersecurity even more important. The arrangement is an additional essential component of our overall support to help Ukraine to defend itself against Russia, and of our long-term commitment to Ukraine’s security.”"
   },
   {
      "time": "2023-11-14",
      "title": "DP World cyberattack blocks thousands of containers in ports",
      "text": " A cyberattack on international logistics firm DP World Australia has severely disrupted the regular freight movement in multiple large Australian ports.DP World has an annual revenue of over $10 billion and specializes in cargo logistics, port terminal operations, maritime services, and free trade zones.It is responsible for operating 82 marine and inland terminals in 40 countries. It handles about 70 million containers carried annually by 70,000 vessels, corresponding to roughly 10% of the global container traffic.DP World has a significant presence in Australia, handling 40% of the nation’s container trade. It operates logistics terminals in the ports of Bing Bong, Fremantle, Brisbane, Sydney, and Melbourne.According to a statement the firm shared with BleepingComputer, a cyberattack on Friday, November 10 disrupted landside freight operations at its ports.In response, the company activated its emergency plans and engaged with cybersecurity experts to overcome problems caused by the incident. It is currently testing key systems required to resume normal business operations.The estimated damages are in the millions of dollars, as many of the stranded containers hold time-sensitive goods such as blood plasma, wagyu beef, and lobsters.The media statement also mentions the possibility of data access and exfiltration. However, an internal investigation is still ongoing and has not confirmed this.“DP World Australia appreciates this development may cause concern for some stakeholders […and] is working hard to assess whether any personal information has been impacted, and has taken proactive steps to engage the Office of the Australian Information Commissioner,\" - DP World AustraliaData theft is typical in ransomware attacks as it puts more pressure on the victim to pay a ransom. At this time, the company did not make any statement about threat actors stealing files from its network.At the time of writing, no known ransomware group has taken responsibility for attacking DP World."
   },
   {
      "time": "2023-11-14",
      "title": "New BiBi-Windows Wiper Targets Windows Systems in Pro-Hamas Attacks",
      "text": " Cybersecurity researchers have warned about a Windows version of a wiper malware that was previously observed targeting Linux systems in cyber attacks aimed at Israel.The BiBi-Windows Wiper artifact is said to have been compiled on October 21, 2023, two weeks after the onset of the war. The exact method by which it is distributed is currently unknown.Besides corrupting all files with the exception of those with .exe, .dll, and .sys extensions, the wiper deletes shadow copies from the system, effectively preventing the victims from recovering their files.Another notable similarity with its Linux variant is its multithreading capability.It's not immediately clear if the wiper has been deployed in real-world attacks, and if so, who the targets are.\"Although the campaign has primarily centered around Israeli IT and government sectors up to this point, some of the participating groups, such as Moses Staff, have a history of simultaneously targeting organizations across various business sectors and geographical locations,\" Security Joes said.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-14",
      "title": "\r\n\tPython Malware Poses DDoS Threat Via Docker API Misconfiguration - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistSecurity researchers have identified a new cyber-threat targeting publicly exposed instances of the Docker Engine API. In this campaign, attackers exploit misconfigurations to deploy a malicious Docker container with Python malware compiled as an ELF executable. The malicious tool, functioning as a Distributed Denial of Service (DDoS) bot agent, exhibits various attack methods for conducting DoS attacks.According to an advisory published by Cado Security Labs earlier today, the Docker Engine API, a previously targeted entry point, has gained popularity for initiating such attacks, often associated with the delivery of cryptojacking malware. The inadvertent exposure of the Docker Engine API occurs frequently. This prompts multiple unrelated campaigns to scan for potential vulnerabilities.The novel campaign discovered by the security experts involves attackers initiating access with an HTTP POST request to Docker’s API, leading to the retrieval of a malicious Docker container from Dockerhub. The attacker uses a Docker Hub user to host a specific container designed to appear innocuous as a MySQL image for Docker.Static analysis of the malware’s ELF executable revealed a 64-bit, statically linked ELF with intact debug information, indicating Python code compiled with Cython. The code is relatively short, focusing on various DoS methods, including SSL-based, UDP-based and Slowloris-style attacks.The bot connects to a command-and-control (C2) server, authenticating with a hard-coded password. Cado Security Labs monitored the botnet activity, witnessing DDoS attacks using UDP- and SSL-based floods. The C2 commands instruct the botnet to target specific IP addresses or domains, determining attack duration, rate and port.Despite not observing actual mining activity, the researchers cautioned that the malicious container contains files that could facilitate such actions.Additionally, while OracleIV is not categorized as a supply chain attack, Docker Hub users are urged to remain vigilant, perform periodic assessments of pulled images and implement network defenses. "
   },
   {
      "time": "2023-11-14",
      "title": "New Ransomware Group Emerges with Hive's Source Code and Infrastructure",
      "text": " The threat actors behind a new ransomware group called Hunters International have acquired the source code and infrastructure from the now-dismantled Hive operation to kick-start its own efforts in the threat landscape.While it's common for ransomware actors to regroup, rebrand, or disband their activities following such seizures, what can also happen is that the core developers can pass on the source code and other infrastructure in their possession to another threat actor.The threat actors behind it, however, have sought to dispel these speculations, stating that it purchased the Hive source code and website from its developers.\"The group appears to place a greater emphasis on data exfiltration,\" Zugec said. \"Notably, all reported victims had data exfiltrated, but not all of them had their data encrypted,\" making Hunters International more of a data extortion outfit.\"In general, as the new group adopts this ransomware code, it appears that they have aimed for simplification,\" Zugec said.\"They have reduced the number of command line parameters, streamlined the encryption key storage process, and made the malware less verbose compared to earlier versions.\"The ransomware, besides incorporating an exclusion list of file extensions, file names, and directories to be omitted from encryption, runs commands to prevent data recovery as well as terminate a number of processes that could potentially interfere with the process.\"While Hive has been one of the most dangerous ransomware groups, it remains to be seen if Hunters International will prove equally or even more formidable,\" Zugec noted.\"This group emerges as a new threat actor starting with a mature toolkit and appears eager to show its capabilities, [but] faces the task of demonstrating its competence before it can attract high-caliber affiliates.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-14",
      "title": "Ethereum feature abused to steal $60 million from 99K victims",
      "text": " Malicious actors have been abusing Ethereum's 'Create2' function to bypass wallet security alerts and poison cryptocurrency addresses, which led to stealing $60,000,000 worth of cryptocurrency from 99,000 people in six months.This is reported by Web3 anti-scam specialists at 'Scam Sniffer,' who observed several cases of in-the-wild exploitation of the function, in some cases losses incurred by one individual reaching up to $1.6 million.Unlike the original Create opcode, which generated new addresses based on the creator's address and nonce, Create2 allows calculating addresses before the deployment of the contract.It's a powerful tool for Ethereum developers, enabling advanced and flexible contract interactions, parameter-based contract address pre-calculation, deployment flexibility, suitability for off-chain transactions and certain dApps.Create2 introduced significant benefits, but several security implications and new attack vectors also came along with them.When a victim signs a malicious transaction, the attacker deploys a contract at the pre-calculated address and transfers the victim's assets to it, a non-reversible process.The second type of Create2 abuse is generating addresses similar to legitimate ones owned by the recipient, thus tricking users into sending assets to the threat actors, thinking they're sending it to a known address.The scheme, which is named 'address poisoning,' involves generating a large number of addresses and then picking those that match their specific phishing needs each time to trick their targets.Since August 2023, Scam Sniffer has recorded 11 victims losing nearly $3 million, with one of them transferring $1.6 million to an address resembling one they had sent money to recently.Most of these attacks went under the radar, silently siphoning millions, but some have caught the attention of the community.In the scam, the threat actor may also send the victim a small amount in crypto to register the address in the wallet's history, thus increasing the chances of the victim making the payment.When performing cryptocurrency transactions, it is always recommended to check the recipient's address thoroughly, and not just the first and last three-four characters, before approving it."
   },
   {
      "time": "2023-11-14",
      "title": "Ducktail Malware Targets the Fashion Industry",
      "text": " Ducktail is targeting marketing professionals in the fashion industry with its latest campaign, where the threat actors send out archives containing images of authentic products from well-known companies alongside a malicious executable camouflaged as a PDF file.The malware's objective is to install a browser extension adept at pilfering Facebook business and ads accounts, with the likely intent of selling the stolen credentials.The report noted this strategic shift indicates an evolving sophistication in Ducktail's attack techniques, tailored to exploit specific professional demographics.When the victim opens the malicious file, it saves a PowerShell script (param.ps1) and a fake PDF file to the device's public directory.The script, triggered by the default PDF viewer, opens the fake PDF, pauses, and then shuts down the Chrome browser.Simultaneously, the attack saves deceptive browser extension files to a Google Chrome directory, disguising itself as a Google Docs Offline extension. The malware can alter its path for hosting the extension.The obscured core script consistently sends details of open browser tabs to a command-and-control (C2) server.If Facebook-related URLs are detected, the extension attempts to steal ads and business accounts, extracting cookies and account details.To bypass two-factor authentication (2FA), the extension uses Facebook API requests and the 2fa[.]live service from Vietnam. Stolen credentials are sent to a C2 based in Vietnam.In this campaign, an additional script (jquery-3.3.1.min.js) is saved to the extension folder, which is a corrupted version of a core script from previous attacks.The threat actors have taken a new approach by leveraging Delphi as its programming language, departing from their usual .NET application approach.The Ducktail malware campaign's use of the Delphi programming language creates detection challenges for security teams, as the language's uncommon signature-based antivirus protections may miss this threat.\"To improve monitoring, organizations should employ more behavior-based analytics and heuristic monitoring to identify anomalies indicative of malicious activity,\" explains Amelia Buck, threat intelligence analyst at Menlo Security.She says marketing teams in particular should be trained to spot social engineering, given tailored attacks intended to mislead them.\"Regarding social engineering tactics, the legitimate-looking image files of products from well-known fashion brands build trust before delivering the infected PDFs,\" Buck notes.She points out training should advise staff to be skeptical of unsolicited files from outside senders, avoid enabling macros, and verify unexpected attachments through internal confirmation before opening.\"Caution should be taken even with work-relevant content, as relevance builds credibility for deception,\" she explains. \"Employees should also inspect sender addresses for spoofing rather than assume the site is legit.\"She adds that the browser extension component also warrants safeguards, recommending that all staff enable multifactor authentication for social media and other accounts containing sensitive information.\"This however should not be relied upon,\" she explains. \"They should also refrain from entering credentials into third-party extensions, watch for unapproved browser extension installs, and avoid using work credentials for personal browsing.\"Providing a password manager would also strengthens account security against password reuse across compromised accounts.The Vietnam-based financial cybercrime operation behind Ducktail has consistently demonstrated adaptability in its attack strategies.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-11-14",
      "title": "Lorenz ransomware gang hit Texas-based Cogdell Memorial Hospital",
      "text": " The facility operates as a Critical Access Hospital and a Rural Health Clinic serving rural West Texas. It is a 70-bed hospital that provides a wide range of services, including:Like other ransomware gangs, Lorenz operators also implement double-extortion model by stealing data before encrypting it and threatening them if the victim doesn’t pay the ransom. Ransom demands have been quite high, between $500.000 and $700.000.At the time of this writing, the Loren group has started uploading the stolen data (95%) US Healthcare organizations continue to be a privileged target of ransomware gangs. In mid-October, the ALPHV/BlackCat ransomware group claimed to have hacked the Morrison Community Hospital and added it to its dark web Tor leak site. The group claimed to have stolen 5TB of patients’ and employee’s information, backups, PII documents, and more. The gang also published a sample as proof of the stolen data.The group is known to have a role for its affiliates that prohibits attacking healthcare organizations. Its policy forbids encrypting systems of organizations where damage could lead to the death of individuals.The gang explained that one of its partners attacked SickKids violating its rules, for this reason, it blocked the affiliate.The Rhysida ransomware group threatened Prospect Medical Holdings to leak the stolen data if the company did not pay a 50 Bitcoins ransom (worth $1.3 million). The same group this week claimed to have breached other three US hospitals.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-11-14",
      "title": "CISA warns of actively exploited Juniper pre-auth RCE exploit chain",
      "text": " CISA warned federal agencies today to secure Juniper devices on their networks by Friday against four vulnerabilities now used in remote code execution (RCE) attacks as part of a pre-auth exploit chain.The alert comes one week after Juniper updated its advisory to notify customers that the flaws found in Juniper's J-Web interface (tracked as CVE-2023-36844, CVE-2023-36845, CVE-2023-36846, and CVE-2023-36847) have been successfully exploited in the wild.Administrators are urged to immediately secure their devices by upgrading JunOS to the most recent release or, as a minimum precaution, restrict Internet access to the J-Web interface to eliminate the attack vector.\"Given the simplicity of exploitation, and the privileged position that JunOS devices hold in a network, we would not be surprised to see large-scale exploitation,\" watchTowr Labs researchers said in August.\"Those running an affected device are urged to update to a patched version at their earliest opportunity, and/or to disable access to the J-Web interface if at all possible.\"With their addition to CISA's KEV list, U.S. Federal Civilian Executive Branch Agencies (FCEB) now must secure Juniper devices on their networks within a limited timeframe, following a binding operational directive (BOD 22-01) issued one year ago.After today's KEV catalog update, federal agencies must complete the upgrading of all Juniper devices within the next four days, by November 17th.While BOD 22-01 primarily targets U.S. federal agencies, CISA strongly encourages all organizations, including private companies, to prioritize patching the vulnerabilities as soon as possible."
   }
]