[
   {
      "time": "2022-12-29",
      "title": "TikTok banned from House of Representatives devices",
      "text": " TikTok will be banned from all devices managed by the House of Representatives, the chamber’s Chief Administrative Office announced Tuesday.The agency’s Office of Cybersecurity has \"deemed The TikTok mobile application to be a high risk to users due to a number of security risks,” the CAO said in an email.Staffers “are NOT allowed to download the TikTok app on any House mobile devices” and the app is “NOT allowed on House mobile devices,” the message stated.“If you have the TikTok app on your House mobile device, you will be contacted to remove it,” the email warned.The company did not immediately respond to a request for comment about the new CAO memo.The $1.7 trillion spending bill that Congress approved last week bans TikTok from all government devices in the face of growing concern among policymakers about the Chinese-owned video app. The legislation has yet to be signed into law by President Joe Biden. Federal officials have long expressed fears that the popular app could be used to spy on Americans, or hoover up their data, and used by Beijing to manipulate people via its video algorithm.FBI Director Christopher Wray earlier this month said the Chinese government could use TikTok for “influence operations” or to compromise devices.“All of these things are in the hands of a government that doesn’t share our values, and that has a mission that’s very much at odds with what’s in the best interests of the United States. That should concern us,” Wray said during an event at the University of Michigan.Martin Matishak is a senior cybersecurity reporter for The Record. He spent the last five years at Politico, where he covered Congress, the Pentagon and the U.S. intelligence community and was a driving force behind the publication's cybersecurity newsletter.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-12-29",
      "title": "North Korean Hackers Created 70 Fake Bank, Venture Capital Firm Domains - SecurityWeek",
      "text": " Hi, what are you looking for?North Korea’s BlueNoroff hackers have updated their arsenal and delivery techniques in a new wave of attacks targeting banks and venture capital firms, cybersecurity firm Kaspersky reports.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-29",
      "title": "LockBit ransomware used in attack on Ohio town’s court, police department and more",
      "text": " The city of Mount Vernon, Ohio said its police department, municipal court and other government offices were affected by a ransomware attack that started on December 19.“The breach occurred through a remote access tool utilized by the City’s information technology (IT) provider, which also affected other clients of that provider,” city officials said.  City experts and their IT provider, Dynamic Networks, have spent the last week working to restore all of the systems affected using backups. Vulnerable software has been removed from all of their systems, according to the statement. The statement claims no documents with personal identifiable information were “removed, or accessed, from City systems” but officials did not respond to questions about how that could be possible considering the ransomware gang gained access to both court and police systems. The city, which has about 17,000 residents, said it is also working with its insurance provider so they can have an independent evaluator determine whether personal information was stolen.  City officials did not respond to requests for comment about whether state or federal officials have been notified about the incident. Jay Carey, a representative for the Ohio Department of Public Safety and the Ohio governor’s office, told The Record that the city and county have not asked for assistance from state officials. Police officials in the city had to move to the Knox County Sheriff's Office to continue some work. \"This is part of a continuing trend of attacks against local, state and national governments,\" said Recorded Future ransomware expert Allan Liska. \"Recorded Future has noted 175 publicly reported attacks this year against governments, down from 2021 (196) but still a big problem.\"The LockBit ransomware gang has quickly become the most prolific ransomware gang operating in 2022, launching hundreds of attacks this year on government agencies, companies and organizations around the world.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-12-29",
      "title": "Hackers abuse Google Ads to spread malware in legit software",
      "text": " Malware operators have been increasingly abusing the Google Ads platform to spread malware to unsuspecting users searching for popular software products.Among the products impersonated in these campaigns include Grammarly, MSI Afterburner, Slack, Dashlane, Malwarebytes, Audacity, μTorrent, OBS, Ring, AnyDesk, Libre Office, Teamviewer, Thunderbird, and Brave.The threat actors the clone official websites of the above projects and distribute trojanized versions of the software when users click the download button.Some of the malware delivered to victim systems this way include variants of Raccoon Stealer, a custom version of the Vidar Stealer, and the IcedID malware loader.However, one missing detail was how users were exposed to these websites, a piece of information that has now become known.Two reports from Guardio Labs and Trend Micro explain that these malicious websites are promoted to a broader audience via Google Ad campaigns.The Google Ads platform helps advertisers promote pages on Google Search, placing them high in the list of results as advertisements, often above the official website of the project.This means that users looking for legitimate software on a browser without an active ad blocker will see promotion first and are likely to click on it because it looks very similar to the actual search result.If Google detects that the landing site is malicious, the campaign is blocked, and the ads are removed, so threat actors need to employ a trick in that step to bypass Google’s automated checks.According to Guardio and Trend Micro, the trick is to take the victims clicking on the ad to an irrelevant but benign site created by the threat actor and then redirect them to a malicious site impersonating the software project.“Those rogue sites are practically invisible to visitors not reaching from the real promotional flow showing up as benign, unrelated sites to crawlers, bots, occasional visitors, and of course for Google’s policy enforcers” - Guardio LabsThe payload, which comes in ZIP or MSI form, is downloaded from reputable file-sharing and code-hosting services such as GitHub, Dropbox, or Discord’s CDN. This ensures that any anti-virus programs running on the victim’s machine won’t object to the download.Guardio Labs says that in a campaign they observed in November, the threat actor lured users with a trojanized version of Grammarly that delivered Raccoon Stealer.The malware was bundled with the legitimate software. Users would get what they downloaded and the malware would install silently.One good way to block these campaigns is to activate an ad-blocker on your web browser, which filters out promoted results from Google Search.Another precaution would be to scroll down until you see the official domain of the software project you’re looking for. If unsure, the official domain is listed on the software’s Wikipedia page.If you visit the website of a particular software project frequently to source updates, it’s better to bookmark the URL and use that for direct access.A common sign that the installer you’re about to download might be malicious is an abnormal file size.Another clear giveaway of foul play is the domain of the download site, which may resemble the official one but has swapped characters in the name or a single wrong letter, known as “typosquatting.”"
   },
   {
      "time": "2022-12-29",
      "title": "Royal ransomware claims attack on Intrado telecom provider",
      "text": " The Royal Ransomware gang claimed responsibility for a cyber attack against telecommunications company Intrado on Tuesday.While Intrado is yet to share any information regarding this incident, sources have told BleepingComputer early this month that the attack started on December 1 and the initial ransom demand was $60 million.Warning that stolen data will get leaked online is a common scare tactic used by ransomware gangs to scare victims into negotiating a deal or returning to the negotiation table.The attackers claim to have obtained internal documents, passports, and employee driver's licenses from compromised Intrado devices.Although the ransomware gang has not yet leaked any of the files allegedly exfiltrated from Intrado's network, they did share a 52.8 MB archive containing scans of passports, business documents, and driver's licenses as proof of the breach.Intrado has not yet responded to multiple requests for comment from BleepingComputer via email and voicemail.The date of the initial breach coincides with a widespread outage that impacted all of Intrado's services, including Unified Communication Services, Healthcare, and Unified Communications as a Service (UCaaS).\"We are experiencing an issue with our internal network, Products are not impacted at this time. However, this may impact your ability to reach us via phone,\" Intrado said in an incident report on December 1st.\"The best method to contact support is by email or chat. We will provide an update when this situation is resolved and we apologize for any inconvenience.\"However, while Intrado has restored most of the affected services, the company was still working on fully restoring healthcare services one week ago."
   },
   {
      "time": "2022-12-29",
      "title": "DOJ arrests man behind brazen $100 million attack on Mango Markets",
      "text": " FBI agent Brandon Racz, who was tasked with investigating the case, found that in October Eisenberg “participated in a scheme to steal approximately $110 million by artificially manipulating the price of MNGO Perpetuals,\" a type of futures contract on the Mango Markets platform.Racz said Eisenberg effectively sold a large amount of MNGO to another account he controlled, artificially increasing the price of the coin in a span of 20 minutes.“Because Mango Markets allows investors to borrow and withdraw cryptocurrency based on the value of their assets on the platform, the increase in the value of the MNGO Perpetuals Eisenberg had purchased allowed Eisenberg to borrow, then withdraw, approximately $110 million worth of various cryptocurrencies from Mango Markets, which came from deposits of other investors in the Mango Markets exchange,” Racz said.Eisenberg had no plans to repay the borrowed money, Racz said. After he withdrew his deposits on the platform, the price of MNGO Perpetuals fell, leading to losses among other investors. Eisenberg used photos of his passports to verify his accounts, according to the FBI, and all of the financial transactions he conducted were recorded on the blockchain. Between October 11 and 13, officials connected to Mango Markets began negotiating with Eisenberg in the hopes that he would return some of the funds that had been taken. Eisenberg sent the cryptocurrency and then took to Twitter to claim credit for the attack. On October 15, he wrote that he believed all of his trades “were legal open market actions, using the protocol as designed, even if the development team did not fully anticipate all the consequences of setting parameters the way they are.”“Unfortunately, the exchange this took place on, Mango Markets, became insolvent as a result, with the insurance fund being insufficient to cover all liquidations. This led to other users being unable to access their funds,” he admitted.“To remedy the situation, I helped negotiate a settlement agreement with the insurance fund with the goal of making all users whole as soon as possible as well as recapitalizing the exchange.”He later said his deal with Mango Markets meant “all users will be able to access their deposits in full with no loss of funds.”The indictment references these tweets and notes that on October 12, Eisenberg flew from the U.S. to Israel in “an effort to avoid apprehension by law enforcement in the immediate aftermath of the Market Manipulation Scheme.”The affidavit, signed on December 23, does not say when Eisenberg arrived in Puerto Rico. Blockchain security company CertiK said several other people have used Eisenberg’s scheme to manipulate cryptocurrency platforms, like Lodestar earlier in December, and Moola Market in November. “In both cases, the attacker borrowed the illiquid native token of the lending platform, manipulated the price higher, and then used this newly-inflated value of their collateral to borrow more of the protocol’s assets,” a CertiK expert told The Record. “The risks of using illiquid tokens as collateral assets on lending platforms was made clear with the Mango Market exploit (or 'highly profitable trading strategy' as the exploiter called it). Users who have assets deposited into similar lending platforms should investigate to see if their assets are at similar risk of being drained by such a strategy. Collateral assets should be highly liquid, which makes this kind of manipulation much more difficult.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-12-29",
      "title": "Thousands of Citrix servers vulnerable to patched critical flaws",
      "text": " Thousands of Citrix ADC and Gateway deployments remain vulnerable to two critical-severity security issues that the vendor fixed in recent months.Threat actors had already been exploiting CVE-2022-27518 when Citrix published a security update to fix it.Fox IT analysts scanned the web on November 11, 2022, and found a total of 28,000 Citrix servers online.To determine how many of the exposed ones are vulnerable to the two flaws, the researchers had to learn their version number, which was not included in the HTTP response from the servers.Nevertheless, the responses carried MD5 hash-like parameters that could be used for matching them to Citrix ADC and Gateway product versions.Hence, the team downloaded and deployed all Citrix ADC versions they could source from Citrix, Google Cloud Marketplace, AWS, and Azure on VMs and matched hashes to versions.For the hashes that could not be matched with the versions sourced, the researchers resorted to figuring out the build date and deducing their version number based on that.This further reduced the number of unknown versions (orphan hashes), but in general, most hashes had been coupled to specific product versions.The final results are summarized in the following graph, indicating that as of December 28, 2022, the majority is on version 13.0-88.14, which is unaffected by the two security issues.The second most popular version was 12.1-65.21, vulnerable to CVE-2022-27518 if certain conditions are met, was running on 3,500 endpoints.The requirements for these machines to be exploitable ask for the use of SAML SP or IdP configurations, meaning that not all 3,500 systems were vulnerable to CVE-2022-27518.Then there are over 1,000 servers vulnerable to CVE-2022-27510 and approximately 3,000 endpoints potentially vulnerable to both critical bugs.The detections that return hashes with unknown Citrix version numbers come in third place, counting over 3,500 servers, which may or may not be vulnerable to either flaw.Regarding the patching speed, the United States, Germany, Canada, Australia, and Switzerland responded quickly to the publication of the relevant security advisories.The Fox IT team hopes its blog will help raise awareness on Citrix administrators who are yet to apply the security updates for the recent critical flaws, with the statistics highlighting there’s still much work that remains to be done to close all security gaps."
   },
   {
      "time": "2022-12-29",
      "title": "French data agency fines Microsoft $63 million for Bing cookie violations",
      "text": " France’s data privacy watchdog has issued Microsoft a more than $63 million fine for several violations related to how the Bing search engine handles cookies. Cookies are files created by websites as a user visits them, saving browsing information on the device and within the web browser.“When users visited the search engine... a cookie with several purposes, including the fight against advertising fraud, was automatically deposited on their terminal without any action on their part,” CNIL said in a decision made public on December 22. “Furthermore, when they kept browsing the search engine, a cookie with an advertising purpose was placed on their terminal, again without their consent being collected. However, the law requires that this type of cookie be deposited only after the users have expressed their consent.”CNIL added that the search engine offered a button to accept cookies immediately but no equivalent solution to allow users to refuse cookies. Two clicks were needed to refuse all cookies, while only one was needed to accept them, CNIL explained. “The committee noted that making the refusal mechanism more complex actually discourages users from refusing cookies and encourages them to prefer the ease of the consent button in the first window,” the agency said. “It considered that such a procedure infringed on the freedom of consent of Internet users.”While Microsoft implemented a “Refuse All” option in late March 2022, the agency found that until that point the company was in breach of French law.   They justified the €60 million fine because of the number of cookies processed, the number of users involved and the advertising profits Microsoft “indirectly generated from the data collected via cookies.” CNIL also issued an order for the company to get consent for cookies \"and tracers with advertising purposes\" for individuals living in France within three months, or it would be subject to a daily €60,000 fine. A Microsoft spokesperson said they \"fully cooperated with the CNIL\" and introduced changes to their cookie practices \"even before this investigation started.\" \"We continue to respectfully be concerned with the CNIL’s position on advertising fraud,\" the spokesperson said. \"We believe the CNIL’s position will harm French individuals and businesses by allowing fraud to spread online.” “The commission considered that this process affects the freedom of consent: since, on the Internet, the user expects to be able to quickly consult a website, the fact that they cannot refuse the cookies as easily as they can accept them influences their choice in favor of consent,” they said.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-12-29",
      "title": "BitKeep Confirms Cyber Attack, Loses Over $9 Million in Digital Currencies",
      "text": " Decentralized multi-chain crypto wallet BitKeep on Wednesday confirmed a cyber attack that allowed threat actors to distribute fraudulent versions of its Android app with the goal of stealing users' digital currencies.The incident is said to have taken place on December 26, 2022, with the threat actor exploiting and hijacking version 7.2.9 of the Android app package (.APK) file hosted on its website to distribute the trojanized variant.That said, the digital break-in doesn't impact BitKeep apps downloaded via Google Play, Apple App Store, or the Google Chrome Web Store.The Singapore-headquartered company, which was founded in 2018, said it has traced the wallet address used to carry out the theft and that some of the siphoned digital assets have been frozen.Users who have downloaded the APK file for version 7.2.9 are advised to install the latest version (7.3.0) released today and transfer the funds to a newly generated wallet address.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-29",
      "title": "Ransomware attack at Louisiana hospital impacts 270,000 patients",
      "text": " The Lake Charles Memorial Health System (LCMHS) is sending out notices of a data breach affecting almost 270,000 people who have received care at one of its medical centers.LCMHS is the largest medical complex in Lake Charles, Louisiana, comprising a 314-bed hospital, a 54-bed women's hospital, a 42-bed behavioral health hospital, and a primary care clinic for uninsured citizens.According to the announcement posted on the LCMHS site, the cybersecurity incident occurred on October 21, 2022, when the organization's security team detected unusual activity on the computer network.An internal investigation concluded on October 25, 2022 revealed that hackers had gained unauthorized access to LCMHS' network and then stole sensitive files.These files contained patient information such as:LCMHS' announcement clarifies that its electronic medical records were out of reach for the network intruders.\"Beginning December 23, 2022, we are mailing letters to patients whose information may have been involved in this incident,\" reads the notification.The Hive ransomware group listed LCMHS on its data leak site on November 15, 2022, a step that typically comes after failed negotiations for paying a ransom.Interestingly, the hackers claim that the encryption took place on October 25, 2022, four days after LCMHS reported the first detection of the network intrusion.Hive has also published the files allegedly stolen after breaching LCMHS systems.The listed files include bills of materials, cards, contracts, medical info, papers, medical records, scans, residents, and more. BleepingComputer could not confirm if these files are authentic or not.If you have received care on LCMHS in the past, it is recommended to stay vigilant for incoming communications asking you to give away personal information and payment data.Also, you should monitor your bank statements and report any suspicious transactions to your bank immediately."
   }
]