[
   {
      "time": "2023-10-31",
      "title": "UAE Bolsters Cyber Future With US Treasury Partnership, Collaborations",
      "text": " The United Arab Emirates' Cybersecurity Council has agreed to a number of partnerships to better improve its threat intelligence sharing capabilities, including forging ahead with collaborations with other nations.\"This allows the parties involved to see the issue of cyber defense from different points of view, and will certainly aid in a better and more well-rounded security posture for all involved, not just the UAE,\" says Andi Ursry, cyber-threat intelligence analyst at Optiv.Al Kuwaiti commented that the UAE's ICT industry has opened new \"windows of opportunity\" but added that the nation is also vulnerable to new and sophisticated types of security risks, which are dynamic and evolving in nature. As a result, these MoUs are forged with partners \"with the essential expertise and tools to eliminate information security incidents.\"The UAE Cybersecurity Council's actions in the past few weeks show clear ambitions for the country to be more global in its cyber capabilities, says Vibin Shaju, UAE general manager at Trellix. \"MOUs and public-private partnerships can encompass information sharing, collaborative incident response, regulatory compliance, public awareness and education, collaborative exercises and drills,\" he notes. \"Such collaboration is critical for addressing the dynamic and evolving nature of cybersecurity threats.\" Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-31",
      "title": "New BiBi-Linux wiper malware targets Israeli orgs in destructive attacks",
      "text": " A new malware wiper known as BiBi-Linux is being used to destroy data in attacks targeting Linux systems belonging to Israeli companies.The malware reveals its true nature by not dropping a ransom note or providing victims with a way to reach out to the attackers to negotiate payment for a decryptor, even though it fakes file encryption,\"Instead, it conducts file corruption by overwriting files with useless data, damaging both the data and the operating system.\"The payload (an x64 ELF executable named bibi-linux.out) found on the victim's systems allows the attackers to choose what folders to encrypt via command-line parameters.It can completely wipe a compromised device's operating system when run with root privileges if the attackers do not provide a target path, as it will attempt to delete the entire '/' root directory.BiBi-Linux uses multiple threads and a queue system for improved speed and effectiveness. It will overwrite files' contents to destroy them, renaming them using a ransom name and an extension made out of the 'BiBi' string (Bibi is a nickname used for Israel's Prime Minister, Benjamin Netanyahu) followed by a number.As seen by BleepingComputer, the number appended to the extension is the number of rounds a file has been wiped.The wiper sample discovered by Security Joes also features no obfuscation, packing, or other protective measures, making malware analysts' jobs much easier.This shows the threat actors are not concerned about their tools being captured and dissected, instead focusing on maximizing their attack's impact.Destructive malware has also been used extensively by Russian threat groups to target the systems of Ukrainian organizations since Russia invaded Ukraine in February 2022."
   },
   {
      "time": "2023-10-31",
      "title": "FTC orders non-bank financial firms to report breaches in 30 days",
      "text": " The U.S. Federal Trade Commission (FTC) has amended the Safeguards Rules, mandating that all non-banking financial institutions report data breach incidents within 30 days.Such entities include mortgage brokers, motor vehicle dealers, payday lenders, investment firms, insurance companies, peer-to-peer lenders, and asset management firms.This requirement adds to the Safeguards Rule, aiming to enhance data security measures to protect customer information and strengthen compliance obligations.It applies to security incidents that impact 500 or more consumers, especially if unauthorized third parties accessed unencrypted (cleartext) information.\"The addition of this disclosure requirement to the Safeguards Rule should provide companies with additional incentive to safeguard consumers' data.\"The notification requirement does not apply to cases where consumer information is encrypted as long as the attackers did not access the encryption key.The notice breached firms need to be submitted onto FTC's online portal and must include details about the security incident, such as:The agency has added a provision for a 60-day delay should a law enforcement official seek an extension in the public disclosure of a specific incident.The FTC emphasizes that submitting a data breach report doesn't automatically imply a violation of the Safeguards Rule, nor does it ensure an investigation or enforcement action.The new notification requirement will become effective 180 days after publication of the rule in the Federal Register, so the rule should be applicable starting in April 2024."
   },
   {
      "time": "2023-10-31",
      "title": "RCE exploit for Wyze Cam v3 publicly released, patch now",
      "text": " A security researcher has published a proof-of-concept (PoC) exploit for Wyze Cam v3 devices that opens a reverse shell and allows the takeover of vulnerable devices.Wyze Cam v3 is a top-selling, inexpensive indoor/outdoor security camera with support for color night vision, SD card storage, cloud connectivity for smartphone control, IP65 weatherproofing, and more.The first is a DTLS (Datagram Transport Layer Security) authentication bypass problem in the 'iCamera' daemon, allowing attackers to use arbitrary PSKs (Pre-Shared Keys) during the TLS handshake to bypass security measures.The second flaw manifests after the DTLS authenticated session has been established when the client sends a JSON object.The iCamera code that parses that object can be exploited due to bad handling of a specific array, leading to a stack buffer overflow where data is written into unintended parts of the memory.Attackers can leverage the second vulnerability to overwrite the stack memory and, given the lack of security features like stack canaries and position-independent execution in the iCamera code, execute their own code on the camera.The exploit was tested and confirmed to work on firmware versions 4.36.10.4054, 4.36.11.4679, and 4.36.11.5859.In a private discussion, Geissler explained to BleepingComputer that he made his exploit available to the public before most Wyze users could apply the patch to express his disapproval of Wyze's patching strategies.Releasing the fixes right after the registration had caused several teams that had a working exploit in their hands up until that moment to abandon the effort.Wyze told the researcher that the timing was a coincidence and that they were merely trying to safeguard their customers against a threat they had learned about a few days before.BleepingComputer reached out to Wyze for a comment about Geissler's accusations but has not received a response at this time.At this point, the PoC is now public, so it is likely to see mass exploitation in the future, and users are recommended to take immediate action to fix the bug.If unable to apply the firmware update, users should isolate their Wyze cameras from networks that serve critical devices."
   },
   {
      "time": "2023-10-31",
      "title": "Toronto Public Library services down following weekend cyberattack",
      "text": " The Toronto Public Library (TPL) is warning that many of its online services are offline after suffering a cyberattack over the weekend, on Saturday, October 28.TPL is Canada's largest public library system, giving people access to 12 million books through 100 branch libraries across Toronto. It has 1,200,000 registered members and operates on a budget that surpasses $200M.In an announcement published on a website created by the Toronto Public Library while their main site is offline, the library says that the following services are currently unavailable:However, the announcement clarifies that library branches remain open and operate according to the published schedule, so people may continue to borrow and return books as usual. WiFi access on the branches remains available, and telephone lines are operational.Also, online services hosted elsewhere, beyond tpl.ca, like Kanopy, Digital Archive, Digital Archive Ontario, TPL Kids, and 'Ready for Reading,' remain available.TPL's announcement does not provide any details on the type of cybersecurity incident that they suffered but mentions that there's currently no evidence that staff or customers have had their data exposed as a result.The organization underlines its quick response, the result of robust, proactive security measures, and requests patience, as complete system restoration might take a while.\"We do anticipate though that it may take several days before all systems are fully restored to normal operations.\"By the time of writing, no ransomware actors had taken responsibility for the attack on TPL's systems.Canadian firms and organizations have been the target of quite a few cyberattacks recently that have impacted service availability and raised concerns about potential data breaches."
   },
   {
      "time": "2023-10-31",
      "title": "SEC sues SolarWinds for misleading investors before 2020 hack",
      "text": " The U.S. Securities and Exchange Commission (SEC) today charged SolarWinds with defrauding investors by allegedly concealing cybersecurity defense issues before a December 2020 linked to APT29, the Russian Foreign Intelligence Service (SVR) hacking division.The SEC claims SolarWinds failed to notify investors about cybersecurity risks and poor practices that its Chief Information Security Officer, Timothy G. Brown (also facing legal action from regulatory authorities), knew about. Instead, the company reportedly disclosed only broad and theoretical risks to its investors.\"Rather than address these vulnerabilities, SolarWinds and Brown engaged in a campaign to paint a false picture of the company's cyber controls environment, thereby depriving investors of accurate material information.\"The regulator claims that Brown was already aware that attackers that would hack SolarWinds' systems remotely would be very hard to detect since at least 2018, according to presentations saying that the \"current state of security leaves us in a very vulnerable state for our critical assets\" and that \"[a]ccess and privilege to critical systems/data is inappropriate.\"Brown also expressed concerns in June 2020 that attackers could use SolarWinds' Orion software (which was trojanized by the Russian hackers to breach customers' systems months later) as a tool in future attacks because the company's backend systems were not \"resilient.\"Two months before the attack, the SEC says that a SolarWinds internal document revealed that the engineering teams were no longer able to keep up with a long list of new security issues that they had to address.\"We made a deliberate choice to speak—candidly and frequently—with the goal of sharing what we learned to help others become more secure. We partnered closely with the government and encouraged other companies to be more open about security by sharing information and best practices.\"The SEC's charges now risk the open information-sharing across the industry that cybersecurity experts agree is needed for our collective security.\"The malicious builds were used to drop the Sunburst backdoor onto the systems of \"fewer than 18,000\" victims. However, the attackers handpicked a substantially lower number of targets for second-stage exploitation.Update October 30, 18:14 EDT: A SolarWinds spokesperson sent the following statement after the article was published:We are disappointed by the SEC’s unfounded charges related to a Russian cyberattack on an American company and are deeply concerned this action will put our national security at risk. The SEC’s determination to manufacture a claim against us and our CISO is another example of the agency’s overreach and should alarm all public companies and committed cybersecurity professionals across the country. We look forward to clarifying the truth in court and continuing to support our customers through our Secure by Design commitments."
   },
   {
      "time": "2023-10-31",
      "title": "Wiki-Slack attack allows redirecting business professionals to malicious websites",
      "text": " The attackers choose a subject in Wikipedia that can be of interest to the potential victims, then they will go to the first page of the Wikipedia entry and edit the page. The trick consists of adding a legitimate referenced footnote to the entry. The footnote allows to set the stage for a formatting error when the article is shared on Slack. Once certain additional conditions are met – made easy by small grammatical changes to the Wikipedia article, Slack will render a link that is not visible in the original Wikipedia article.The researchers pointed out that the footnote itself is not malicious, but under certain additional conditions due to small grammatical changes to the Wikipedia article, Slack will render a link that is not visible in the original Wikipedia article.The three conditions that must be met are:This leads Slack to mishandle the spacing between the first and second paragraph, resulting in the creation of a new link in Slack. The researchers found more than 1,000 instances of this unintentional artifact.eSentire furter elaborated that attackers could leverage Wikipedia statistics to choose pages that generate a high volume of traffic and use them to launch attacks with the Wiki-Slack technique.The researchers explained that the Wiki-Slack attack is a numbers game, for this reason, leveraging ChatGPT or similar Large Language Model (LLM) an attacker can scale out the attack in a short time.Organizations are recommended to be vigilant on browser-based attacks that can lead to malware infections. Employing endpoint monitoring, and building cyber resilience into their processes can allow organizations to limit the exposure to such kinds of attacks.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-10-31",
      "title": "LastPass breach linked to theft of $4.4 million in crypto",
      "text": " Hackers have stolen $4.4 million in cryptocurrency on October 25th using private keys and passphrases stored in stolen LastPass databases, according to research by crypto fraud researchers who have been researching similar incidents.\"We regularly have people reach out via DM who have had their crypto assets stolen. We also approach victims we discover on-chain,\" ZachXBT told BleepingComputer.\"We ask potential LastPass victims multiple questions and typically have found one commonality between them all being LastPass.\"According to a tweet by ZachXBT on X, the threat actors stole $4.4 million from 25+ victims due to a LastPass breach in 2022.At the time, LastPass CEO Karim Toubba said that while the encrypted vaults were stolen, only customers knew the master password required to decrypt them.However, LastPass warned that for those using weaker passwords, it was advised to reset the master password.This suggestion was given because a weaker password can more easily be cracked using specialized programs that utilize a GPU to brute force easy-to-crack passwords.Once they gain access to this information, they can load the wallets onto their own devices and drain them of all funds.\"The number of victims who only had the specific group of seeds/keys that were drained stored in LastPass is simply too much to ignore.\"It is becoming increasingly clear that the threat actors behind the LastPass attack have successfully cracked the passwords for vaults and are using the stolen information to fuel their own attacks.Therefore, if you are a LastPass user who had an account during the August and December 2022 breaches, it is strongly suggested that you reset all of your passwords, including your password."
   },
   {
      "time": "2023-10-31",
      "title": "UAE Cyber Council Warns of Google Chrome Vulnerability",
      "text": " The United Arab Emirates' Cybersecurity Council has issued a warning about a high-risk vulnerability in Google Chrome, which could allow malicious actors to execute code remotely.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-31",
      "title": "StripedFly, a complex malware that infected one million devices without being noticed",
      "text": " Researchers from Kaspersky discovered a sophisticated malware, dubbed StripedFly, that remained under the radar for five years masquerading as a cryptocurrency miner.The malicious code has a complex modular structure that supports both Linux and Windows. The malicious code relies on a built-in TOR network tunnel for C2 communications, it supports an update and delivery functionality through trusted services such as GitLab, GitHub, and Bitbucket. Kaspersky researchers discovered that over one million updates have been downloaded from the C2 infrastructure since 2017.The malware uses different techniques to maintain persistence depending on the presence of the PowerShell interpreter and the privileges granted for the process. Typically, it modifies the registry or creates scheduler tasks on Windows systems. The experts reported that the malicious code also uses multiple methods on Linux as well.The functionality within the malware modules are divided into two types, service and extended functionality modules.The malware uses the modules for storing its configuration, upgrading and uninstalling itself, establishing a reverse proxy, harvesting credentials, performing reconnaissance and files, taking screenshots, executing processes, recording microphone input, and mining for Monero.While investigating this malware, Kaspersky also discovered an apparently related ransomware variant called. Similarities include the Tor client and multiple modules observed in StripedFly.“What was the real purpose? That remains a mystery. While ThunderCrypt ransomware suggests a commercial motive for its authors, it raises the question of why they didn’t opt for the potentially more lucrative path instead. The prevailing narrative often centers around ransomware actors collecting anonymous ransoms, but this case seems to defy the norm.” concludes the report”The question remains, but only those who crafted this enigmatic malware hold the answer. It’s difficult to accept the notion that such sophisticated and professionally designed malware would serve such a trivial purpose, given all the evidence to the contrary.”\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-10-31",
      "title": "A cascade of compromise: unveiling Lazarus' new campaign | Securelist",
      "text": " Solutions for:ThreatsCategories27 Oct 2023\n  minute read\t\t\t\t\t\t\t\tTable of ContentsAuthorsEarlier this year, a software vendor was compromised by the Lazarus malware delivered through unpatched legitimate software. What’s remarkable is that these software vulnerabilities were not new, and despite warnings and patches from the vendor, many of the vendor’s systems continued to use the flawed software, allowing the threat actor to exploit them. Fortunately, a proactive response by us detected an attack on another vendor and effectively thwarted the attacker’s efforts.Upon further investigation, we discovered that the software vendor that developed the exploited software had previously fallen victim to Lazarus several times. This recurring breach suggested a persistent and determined threat actor with the likely objective of stealing valuable source code or tampering with the software supply chain, and they continued to exploit vulnerabilities in the company’s software while targeting other software makers.Infection timelineThe adversary demonstrated a high level of sophistication, employing advanced evasion techniques and introducing SIGNBT malware for victim control. In addition, other malware found in memory included Lazarus’ prominent LPEClient, a tool known for victim profiling and payload delivery that has previously been observed in attacks on defense contractors and the cryptocurrency industry.Executive summary:In mid-July 2023, we detected a series of attacks on several victims who had been targeted through legitimate security software designed to encrypt web communications using digital certificates. The exact method by which this software was exploited to deliver the malware remains elusive. However, we identified post-exploitation activity within the processes of the legitimate software. In one instance, while examining the memory of the compromised security software from a victim’s system, we discovered the presence of the SIGNBT malware accompanied by a shellcode. This shellcode was responsible for launching a Windows executable file directly in memory.The actor uses various tactics to establish and maintain persistence on compromised systems. These include the creation of a file called ualapi.dll in the system folder, which is automatically loaded by the spoolsv.exe process at each system boot. Additionally, in several instances, registry entries were recorded to execute legitimate files for the purpose of malicious side-loading, further ensuring a resilient persistence mechanism.Methods for loading the final payloadThe loader process retrieves the first 32 bytes from tw-100a-a00-e14d9.tmp and uses this data as an AES decryption key to decrypt the remaining contents. Once decrypted, the payload, a Windows executable identified as SIGNBT, is loaded directly into memory. In this case, the loaded payload also reads the configuration file from the same path, but with a slightly different file name.Inside this file is a base64-encoded string, mirroring the approach used in the previous SIGNBT malware method. The first 32 characters of this string serve as the AES decryption key, while the subsequent data contains configuration information used by the malware. This decrypted configuration data includes details such as three C2 addresses, which are referred to as proxies, sleep intervals, version information, monitored targets, and various other parameters critical to the malware’s operation.The majority of SIGNBT malware instances are launched through the malware loader, which operates exclusively in memory. Upon execution, the malware begins communicating with the C2 server by sending a beacon after initialization of its configuration data. In its C2 communication, the malware uses distinctive strings that start with SIGNBT. This unique characteristic has earned it the designation of SIGNBT. In addition, the malware uses different prefixes at each stage of its C2 operation to verify and maintain its activities.The malware employs a multi-step process to create a 24-byte value for various purposes. First, it generates this value with the following components:After creating this 24-byte value, the malware generates an additional 24 bytes of random data. These two sets of 24 bytes are then XORed together using another randomly generated 24-byte key. Subsequently, both the resulting value and the 24-byte key are encoded with base64. Finally, these encoded values are combined with either three or seven randomly generated HTTP parameter names. In all future C2 communications, the malware uses a similar structure, making it more challenging to detect and analyze its communications.Structure of HTTP POST dataThe malware uses a mechanism to validate the response data received from the C2 server. Specifically, it checks to see if the response data contains a hard-coded HTML script.\nDuring the validation process, the malware decodes the first 12 bytes from the C2 server using base64, replacing the spaces with plus signs to create a seven-character string. This process is then repeated with the next 12 bytes. The first seven characters from each set are then XORed and compared to the “success” string. This repetitive procedure is applied to every HTTP communication sequence to verify that the response aligns with the expected “success” criterion.Next, the malware sends HTTP requests with the SIGNBTKE header, and if it receives a “success” message from the C2 server, it activates the getInfo function within the CCBrush class. This function gathers various information about the victim’s computer, such as computer name, product name, OS details, system uptime, CPU information, system locale, time zone, network status, and malware configuration data. After sending this system-specific information, the malware sends another HTTP request with the SIGNBTGC prefix, this time using a randomly chosen embedded HTTP parameter from a list of 100 possible parameter names.\nThe data received from the C2 server is decrypted using AES with a decryption key obtained from a SIGNBTLG HTTP request. If the decrypted data is “keep”, the malware responds with an “OK” message using the SIGNBTSR prefix, indicating a successful communication. If there are problems, the malware uses the SIGNBTFI prefix to convey the nature of the problem or failure in communication. To summarize, the C2 communication process can be described as follows:C2 communication processIf the delivered data does not equal “keep”, indicating that specific instructions or actions are required, the malware proceeds to invoke the corresponding class and function for backdoor behavior. The SIGNBT malware is equipped with an extensive set of functionalities designed to exert control over the victim’s system. To perform these functions, the malware receives instructions from the C2 server in the form of a class name, function name, and any necessary parameters. It then executes the relevant function embedded in the malware’s codebase.The name of each backdoor command is straightforward, implementing commonly used Windows commands such as ping, netstat, and systeminfo. It’s important to note that the backdoor is capable of implanting an additional payload for auto execution, internally named “deploy”. This backdoor function receives file paths via command-line arguments decrypted with AES. Using this command, SIGNBT has been observed to implant the phantom DLL we already described in the SIGNBT loader section above.Based on the analysis, it is evident that the actor’s initial compromise of the victim involved exploiting vulnerabilities within the software exploit. They then proceeded to deploy the SIGNBT malware using a DLL side-loading technique. Furthermore, the actor used the backdoor capability “deploy” to implant an additional payload for automated execution. This multifaceted attack demonstrates a high level of sophistication and a deliberate effort to infiltrate and maintain control over the victim’s system.Using the comprehensive backdoor as described above, the actor deploys additional malware in the victim’s memory. Notably, these newly delivered malware variants predominantly execute in the system’s memory only, without touching the disk. Based on our telemetry, the actor has been observed to deliver such tools as LPEClient and credential dumping utilities to the victim machines.Additional payload delivered by SIGNBTThe infection chains of the three campaigns attributed to Lazarus in 2023The Lazarus group remains a highly active and versatile threat actor in today’s cybersecurity landscape. The threat actor has demonstrated a profound understanding of IT environments, refining their tactics to include exploiting vulnerabilities in high-profile software. This approach allows them to efficiently spread their malware once initial infections are achieved. Moreover, the activities of this notorious actor transcend geographic boundaries and industry sectors. They have targeted various industries, each with distinct objectives and using different tools, tactics and techniques. This underscores their recent and ongoing activity characterized by sophisticated methods and unwavering motivations.SIGNBT loader\n9cd90dff2d9d56654dbecdcd409e1ef3         %system%\\ualapi.dll\n88a96f8730b35c7406d57f23bbba734d        %system%\\ualapi.dll\n54df2984e833ba2854de670cce43b823       %system%\\ualapi.dll\nAe00b0f490b122ebab614d98bb2361f7          %system%\\ualapi.dll\ne6fa116ef2705ecf9677021e5e2f691e\n31af3e7fff79bc48a99b8679ea74b589           C:\\GoogleD\\Coding\\JS\\Node\\winhttp.dllSIGNBT\n9b62352851c9f82157d1d7fcafeb49d3LPEClient\n3a77b5054c36e6812f07366fb70b007d       %systme%\\wbem\\wbemcomn.dll\nE89fa6345d06da32f9c8786b65111928 %ProgramData%\\Microsoft\\Windows\\ServiceSetting\\ESENT.dllFile path\nC:\\GoogleD\\Coding\\JS\\Node\\SgrmLpac.exe\nC:\\GoogleD\\Coding\\JS\\Node\\winhttp.dll\nC:\\Windows\\system32\\config\\systemprofile\\appdata\\Local\\tw-100a-a00-e14d9.tmp\nC:\\Windows\\system32\\config\\systemprofile\\appdata\\Local\\tw-100b-a00-e14d9.tmp\nC:\\ProgramData\\ntuser.008.dat\nC:\\ProgramData\\ntuser.009.dat\nC:\\ProgramData\\ntuser.001.dat\nC:\\ProgramData\\ntuser.002.dat\nC:\\ProgramData\\Microsoft\\Windows\\ServiceSetting\\ESENT.dllC2 servers\nhxxp://ictm[.]or[.]kr/UPLOAD_file/board/free/edit/index[.]php\nhxxp://samwoosystem[.]co[.]kr/board/list/write[.]asp\nhxxp://theorigin[.]co[.]kr:443/admin/management/index[.]php\nhxxp://ucware[.]net/skins/PHPMailer-master/index[.]php\nhxxp://www[.]friendmc[.]com/upload/board/asp20062107[.]asp\nhxxp://www[.]hankooktop[.]com/ko/company/info[.]asp\nhxxp://www[.]khmcpharm[.]com/Lib/Modules/HtmlEditor/Util/read[.]cer\nhxxp://www[.]vietjetairkorea[.]com/INFO/info[.]asp\nhxxp://yoohannet[.]kr/min/tmp/process/proc[.]php\nhxxps://admin[.]esangedu[.]kr/XPaySample/submit[.]php\nhxxps://api[.]shw[.]kr/login_admin/member/login_fail[.]php\nhxxps://hicar[.]kalo[.]kr/data/rental/Coupon/include/inc[.]asp\nhxxps://hspje[.]com:80/menu6/teacher_qna[.]asp\nhxxps://kscmfs[.]or[.]kr/member/handle/log_proc[.]php\nhxxps://kstr[.]radiology[.]or[.]kr/upload/schedule/29431_1687715624[.]inc\nhxxps://little-pet[.]com/web/board/skin/default/read[.]php\nhxxps://mainbiz[.]or[.]kr/SmartEditor2/photo_uploader/popup/edit[.]asp\nhxxps://mainbiz[.]or[.]kr/include/common[.]asp\nhxxps://new-q-cells[.]com/upload/newsletter/cn/frame[.]php\nhxxps://pediatrics[.]or[.]kr/PubReader/build_css[.]php\nhxxps://pms[.]nninc[.]co[.]kr/app/content/board/inc_list[.]asp\nhxxps://safemotors[.]co[.]kr/daumeditor/pages/template/template[.]asp\nhxxps://swt-keystonevalve[.]com/data/editor/index[.]php\nhxxps://vnfmal2022[.]com/niabbs5/upload/gongji/index[.]php\nhxxps://warevalley[.]com/en/common/include/page_tab[.]asp\nhxxps://www[.]blastedlevels[.]com/levels4SqR8/measure[.]asp\nhxxps://www[.]droof[.]kr/Board/htmlEdit/PopupWin/Editor[.]asp\nhxxps://www[.]friendmc[.]com:80/upload/board/asp20062107[.]asp\nhxxps://www[.]hanlasangjo[.]com/editor/pages/page[.]asp\nhxxps://www[.]happinesscc[.]com/mobile/include/func[.]asp\nhxxps://www[.]healthpro[.]or[.]kr/upload/naver_editor/subview/view[.]inc\nhxxps://www[.]medric[.]or[.]kr/Controls/Board/certificate[.]cer\nhxxps://www[.]muijae[.]com/daumeditor/pages/template/simple[.]asp\nhxxps://www[.]muijae[.]com/daumeditor/pages/template/template[.]asp\nhxxps://www[.]nonstopexpress[.]com/community/include/index[.]asp\nhxxps://www[.]seoulanesthesia[.]or[.]kr/mail/mail_211230[.]html\nhxxps://www[.]seouldementia[.]or[.]kr/_manage/inc/bbs/jiyeuk1_ok[.]asp\nhxxps://www[.]siriuskorea[.]co[.]kr/mall/community/bbs_read[.]asp\nhxxps://yoohannet[.]kr/min/tmp/process/proc[.]phpAuthorsA cascade of compromise: unveiling Lazarus’ new campaignYour email address will not be published. Required fields are marked *Name * Email * ΔTable of ContentsGReAT webinarsFrom the same authorsThe hottest research right in your inboxΔIn the same categoryAsian APT groups target various organizations from a multitude of regions and industries. We created this report to provide the cybersecurity community with the best-prepared intelligence data to effectively counteract Asian APT groups.We unveil a Lazarus campaign exploiting security company products and examine its intricate connections with other campaignsHow Kaspersky researchers obtained all stages of the Operation Triangulation campaign targeting iPhones and iPads, including zero-day exploits, validators, TriangleDB implant and additional modules.Nobody would even suspect the mining malware was merely a mask, masquerading behind an intricate modular framework that supports both Linux and Windows.  The amount of effort that went into creating the framework is truly remarkable, and its disclosure was quite astonishing.The hottest research right in your inboxΔThreatsCategories© 2023 AO Kaspersky Lab. All Rights Reserved.\nRegistered trademarks and service marks are the property of their respective owners.The hottest research right in your inboxΔ"
   }
]