[
   {
      "time": "2022-12-01",
      "title": "GoTo says hackers breached its dev environment, cloud storage",
      "text": " Remote access and collaboration company GoTo disclosed today that they suffered a security breach where threat actors gained access to their development environment and third-party cloud storage service.GoTo (formerly LogMeIn) began emailing customers Wednesday afternoon, warning that they have started investigating the cyberattack with the help of Mandiant and have alerted law enforcement.The company says they first learned of the incident after detecting unusual activity in their development environment and third-party cloud storage service.\"Upon learning of the incident, we immediately launched an investigation, engaged Mandiant, a leading security firm, and alerted law enforcement,\" reads an email from GoTo CEO Paddy Srinivasan.\"Based on the investigation to date, we have detected unusual activity within our development environment and third-party cloud storage service. The third-party cloud storage service is currently shared by both GoTo and its affiliate, LastPass.\"GoTo says the incident has not affected their products and services, and they remain fully functional.However, they have said they deployed \"enhanced security measures and monitoring capabilities\" after the attack.BleepingComputer has asked GoTo for further information, such as when the attack occurred or if the source code was stolen, but has yet to hear back."
   },
   {
      "time": "2022-12-01",
      "title": "Critical RCE bugs in Android remote keyboard apps with 2M installs",
      "text": " Three Android applications that allow users to use devices as remote keyboards for their computers have critical vulnerabilities that could expose key presses and enable remote code execution.The apps are PC Keyboard, Lazy Mouse, and Telepad, and their vulnerable versions (free and paid) and in Google Play they have a combined installation count of more than two million.The critical weaknesses were discovered by analysts at Synopsys, who informed the app developers of their findings in August 2022.The researchers published a security advisory today, after attempting to contact the software vendors again in October 2022 and not getting a reply.“Although the vulnerabilities are all related to the authentication, authorization, and transmission implementations, each application’s failure mechanism is different” - SynopsysThe flaws impacting each app are the following:The three apps are no longer maintained or supported by their developers, so they fit the criteria for defining “abandonware.”Continuing using the apps comes with significant risk of exposing sensitive information. Successful exploitation could also enable remote attackers run arbitrary code on the device.If you’re looking for a remote keyboard app, there are several actively maintained projects on Google Play, many of which have positive user ratings.Before installing an alternative app, make sure to check user reviews, read the project’s privacy policy carefully, and check the date for the last update. If possible, users should try to confirm that data in transit is encrypted."
   },
   {
      "time": "2022-12-01",
      "title": "Google accuses Spanish spyware company of ties to zero-day exploitation framework",
      "text": " A Spanish commercial spyware company is likely tied to an exploitation framework known to take advantage of vulnerabilities in Chrome, Firefox and Microsoft Defender, according to new research.Google’s Threat Analysis Group said the Heliconia framework – which “provides all the tools necessary to deploy a payload to a target device” – is likely linked to Variston IT, a company based in Barcelona. Variston did not respond to requests for comment. On its website, the company says it provides custom security solutions. TAG said it first became aware of the Heliconia exploitation framework when an anonymous researcher submitted three bugs to their Chrome bug reporting program. According to Google, the submission contained instructions and source code that had unique names like “Heliconia Noise,” “Heliconia Files,” and “Heliconia Soft.” The files had frameworks for deploying exploits in the wild and a script in the source code that included clues pointing to the possible developer of the exploitation frameworks: Variston IT.TAG worked with Project Zero researchers Ivan Fratric and Maddie Stone as well as V8 Security Team’s Stephen Röttger. “While we have not detected active exploitation… It appears likely these were utilized as zero-days in the wild. TAG has created detections in Safe Browsing to warn users when they attempt to navigate to dangerous sites or download dangerous files,” the researchers said. Google highlighted its past work tracking commercial spyware vendors like Variston for years, noting in Wednesday’s blog that their most recent research “underscores that the commercial surveillance industry is thriving and has expanded significantly in recent years, creating risk for Internet users around the globe.”The researchers said commercial spyware vendors have developed capabilities that were previously only available to governments “with deep pockets and technical expertise.” Even though much of this technology has been legalized under national or international laws, several recent revelations around companies like the NSO Group have proven that they are typically used in “harmful ways to conduct digital espionage against a range of groups.”Google, Microsoft and Mozilla fixed all of the vulnerabilities that were part of the Heliconia exploitation framework in 2021 and earlier this year. The third framework was “Heliconia Files,” which contained a fully documented Firefox exploit chain for Windows and Linux. It exploits CVE-2022-26485, a use-after-free vulnerability that was reported in March 2022 as being exploited in the wild.Google researchers said the package was likely exploiting the vulnerability since at least 2019, long before it was known publicly and patched. “The Heliconia exploit is effective against Firefox versions 64 to 68, suggesting it may have been in use as early as December 2018 when version 64 was first released,” TAG researchers said.  Google reiterated that it is committed to working against commercial spyware firms by “disrupting these threats, protecting users, and raising awareness of the risks posed by the growing commercial spyware industry.” The report was published on the same day that 15 journalists and other members of El Faro, one of the leading sources of independent news in Central America, filed a lawsuit against spyware firm NSO Group. The company has been at the center of controversy over the last two years after it was implicated in the hacks of devices owned by several world leaders.“The use of spyware to surveil and intimidate journalists poses a truly urgent threat to press freedom,” said Carrie DeCell, senior staff attorney with the Knight First Amendment Institute, which is representing the journalists.“American courts must ensure that spyware manufacturers are held accountable for their actions where those actions violate U.S. law.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-12-01",
      "title": "Lastpass says hackers accessed customer data in new breach",
      "text": " LastPass says unknown attackers breached its cloud storage using information stolen during a previous security incident from August 2022.The company added that, once in, the threat actors also managed to access customer data stored in the compromised storage service.\"We have determined that an unauthorized party, using information obtained in the August 2022 incident, was able to gain access to certain elements of our customers' information.\"Lastpass said it hired security firm Mandiant to investigate the incident and notified law enforcement of the attack.It also noted that customers' passwords have not been compromised and \"remain safely encrypted due to LastPass's Zero Knowledge architecture.\"\"We are working diligently to understand the scope of the incident and identify what specific information has been accessed,\" Lastpass added.The advisory was published days after BleepingComputer reached out to the company and received no response to questions regarding a possible breach.In emails sent to customers at the time, Lastpass confirmed the attackers had stolen source code and proprietary technical information from its systems.LastPass is behind one of the most popular password management software, claiming that it's being used by more than 33 million people and 100,000 businesses."
   },
   {
      "time": "2022-12-01",
      "title": "New Windows malware also steals data from victims’ mobile phones",
      "text": " Security researchers found a previously unknown backdoor they call Dolphin that's been used by North Korean hackers in highly targeted operations for more than a year to steal files and send them to Google Drive storage.According to research from cybersecurity company ESET, the APT 37 threat group (a.k.a. Reaper, Red Eyes, Erebus, ScarCruft) used the newly discovered malware against very specific entities. The group has been associated with espionage activity aligining with North Korean interests since 2012.The researchers found Doplphin in April 2021 and observed it evolve into new versions with improved code and anti-detection mechanisms.BLUELIGHT is used to launch Dolphin's Python loader on a compromised system but has a limited role in espionage operations.The Python loader includes a script and shellcode, launching a multi-step XOR-decryption, process creation, etc., eventually resulting in the execution of the Dolphin payload in a newly created memory process.Dolphin is a C++ executable using Google Drive as a command and control (C2) server and to store stolen files. The malware establishes persistence by modifying the Windows Registry.During the initial stage, Dolphin collects the following information from the infected machine:The backdoor also sends to the C2 its current configuration, version number, and time.The configuration contains keylogging and file exfiltration instructions, credentials for Google Drive API access, and encryption keys.The malware has an extended set of capabilities that includes scanning local and removable drives for various types of data (media, documents, emails, certificates) that is archived and delivered to Google Drive. This feature was further improved to filter data by extension.Its search capabilities extend to any phone connected to the compromised host by using the Windows Portable Device API.ESET notes that this functionality appeared to be under development in the first version of the malware they found. Evidence pointing to this was:Additionally, it can also lower the security a victim's Google account by changing related settings. This could allow attackers keep their access to the victim account for a longer periodDolphin can record user keystrokes in Google Chrome by abusing the 'GetAsyncKeyState' API and it can take a snapshot of the active window every 30 seconds.ESET researchers caught four distinct versions for the Dolphin backdoor, the latest being 3.0 from January 2022.It's possible that newer versions of Dolphin exist and have been used in attacks, given that the backdoor has been deployed against select targets.According to the researchers, the malware was used in a watering-hole attack on a South Korean paper reporting on activity and events related to North Korea. The hackers relied on an Internet Explorer exploit to ultimately deliver Dolphin backdoor to the target hosts."
   },
   {
      "time": "2022-12-01",
      "title": "Cybersecurity researchers take down DDoS botnet by accident",
      "text": " While analyzing its capabilities, Akamai researchers have accidentally taken down a cryptomining botnet that was also used for distributed denial-of-service (DDoS) attacks.KmsdBot targets Windows and Linux devices with a wide range of architectures, and it infects new systems via SSH connections that use weak or default login credentials.Compromised devices are being used to mine for cryptocurrency and launch DDoS attacks, with some of the previous targets being gaming and technology companies, as well as luxury car manufacturers.Unfortunately for its developers and luckily for the device owners, the botnet doesn't yet have persistence capabilities to evade detection.However, this means the malware has to start all over if it's detected and removed or it malfunctions in any way and loses its connection to the command-and-control (C2) server.This is also what also led to the botnet's demise after the current versions of the KmsdBot malware was unintentionally deactivated by Akamai's researchers.\"As part of this analysis, a syntax error caused the bot to stop sending commands, effectively killing the botnet.\"What helped take down KmsdBot was its lack of error-checking and \"the coding equivalent of a typo,\" which led to the malware crashing and stopping to send attack commands due to the wrong number of arguments to the C2 server.Basically, as Cashdollar explained, the crash was caused by issuing an attack command where the space between the target website and the port was missing.\"This malformed command likely crashed all the botnet code that was running on infected machines and talking to the C2 — essentially, killing the botnet,\" Cashdollar added.\"Because the bot doesn’t have any functionality for persistence on an infected machine, the only way to recover is to re-infect and rebuild the botnet from scratch.\"Organizations that could be the target of botnets using similar spreading tactics are advised to secure their systems against attacks by:"
   },
   {
      "time": "2022-12-01",
      "title": "Australia will now fine firms up to AU$50 million for data breaches",
      "text": " The Australian parliament has approved a bill to amend the country's privacy legislation, significantly increasing the maximum penalties to AU$50 million for companies and data controllers who suffered large-scale data breaches.The financial penalty introduced by the new bill is set to whichever is greater:Previously, the penalty for severe data exposures was AU$2.22 million, considered wholly inadequate to incentivize companies to improve their data security mechanisms.The new bill comes in response to a series of recent cyberattacks against Australian companies, including ransomware and network breaches, resulting in the exposure of highly sensitive data for millions of people in the country.\"These new, larger penalties send a clear message to large companies that they must do better to protect the data they collect.\"\"Significant privacy breaches in recent months have shown existing safeguards are outdated and inadequate. These reforms make clear to companies that the penalty for a major data breach can no longer be regarded as the cost of doing business.\" - Australian Government.Apart from setting higher fines, the new bill also gives greater powers to the Office of the Australian Information Commissioner (OAIC) to get more involved in the privacy breach resolution and scope determination process.\"The updated penalties will bring Australian privacy law into closer alignment with competition and consumer remedies and international penalties under Europe's General Data Protection Regulation,\" stated Commissioner Angelene Falk.\"In seeking penalties or taking regulatory action, our approach will continue to be pragmatic, evidence-based, and proportionate.\"For \"especially severe violations,\" the above is doubled to 20 million Euros and 4% of the annual turnover."
   },
   {
      "time": "2022-12-01",
      "title": "NVIDIA releases GPU driver update to fix 29 security flaws",
      "text": " NVIDIA has released a security update for its GPU display driver for Windows, containing a fix for a high-severity flaw that threat actors can exploit to perform, among other things, code execution and privilege escalation.The latest security update addresses 25 vulnerabilities on the Windows and Linux GPU drivers, while seven flaws are categorized as high-severity.The two most critical vulnerabilities are:CVE-2022-34671 has a lower severity rating despite being vulnerable to network attacks because of its high complexity, making its exploitation less likely.However, the CVE-2022-34669 flaw is more helpful to hackers and malware developers who already have access to a Windows device and are looking for ways to escalate their privileges or execute code.GPU and hardware drivers run with elevated privileges on the OS, so exploiting a vulnerability in a driver provides the same high level of privileges to malicious code or commands.Considering the popularity of NVIDIA products, there's a high chance of finding vulnerable GPU drivers on targeted computers, allowing attackers to exploit these flaws to gain greater privileges and spread further on a network.NVIDIA has yet to release in-depth technical details about these flaws, allowing users enough time to patch first.The NVIDIA driver versions that fix these vulnerabilities are the following:Linux users should consult this GPU driver version table instead:"
   },
   {
      "time": "2022-12-01",
      "title": "Android and iOS apps with 15 million installs extort loan seekers",
      "text": " Over 280 Android and iOS apps on the Google Play and the Apple App stores trapped users in loan schemes with misleading terms and employed various methods to extort and harass borrowers.To fuel the operation's extortion attempts, the apps stole excessive amounts of data from mobile phones not usually required to offer loans.In a new report by cybersecurity firm Lookout, researchers uncovered 251 Android 35 iOS lending apps that were downloaded a combined total of 15 million times, mostly from users in India, Colombia, Mexico, Nigeria, Thailand, the Philippines, and Uganda.Lookout reported all of them to Google and Apple for removal and was successfully able to remove all of them.These loan apps found great success in developing countries where people have limited financial opportunities and where reports of fraud are less likely to be prosecuted.When installed, the predatory loan apps requested users grant risky permissions that enabled the threat actors to access sensitive information on the device, such as the contact list, SMS content, photos, media, etc.As soon as the permissions are given, the apps immediately begin to upload sensitive data from the device to their own servers.If the user doesn’t approve these permission requests, the app will not allow them to submit loan requests.Next, the apps offer users deceiving or straight-out false loan terms so they are convinced to move forward.When the victims receive part of their loan, the interest rate terms change, or previously hidden fees emerge, sometimes reaching up to one-third of the total amount borrowed.Some users also report that the apps reduced the repayment period from a promised 180 days to only eight days, imposing hefty interest and penalty fees when overdue.With most people surprised and unable or unwilling to repay the loans, the app operators begin to harass them using the data stolen in the first stage, contacting people from the device's list and disclosing the debt to family and friends.Some scammed users even report the lenders sent edited images stolen from the device to contacts, causing great distress.The guidelines dictate that the minimum repayment period should be 60 days, and the maximum annual percentage rate of charge should be 36%.The above apps claimed terms that complied with these guidelines, but in practice, they followed a very different, much more aggressive approach, so the app stores removed them for term violations.Unfortunately, there need to be more checks to prevent the operators of these apps from re-submit these types of apps to the app stores under different names, so users should be vigilant.If you're interested in using a mobile loan app, read user reviews first, research the lender's reputation, and carefully consider the permission requests upon installation."
   },
   {
      "time": "2022-12-01",
      "title": "French Electricity Provider Fined for Storing Users' Passwords with Weak MD5 Algorithm",
      "text": " The French data protection watchdog on Tuesday fined electricity provider  Électricité de France (EDF) €600,000 for violating the European Union General Data Protection Regulation (GDPR) requirements.The probe also pointed fingers at EDF for failing to comply with GDPR data retention policies and for providing \"inaccurate information on the origin of the data collected.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]