[
   {
      "time": "2022-10-24",
      "title": "France Slaps Fine on Face Recognition Firm Clearview AI - SecurityWeek",
      "text": " Hi, what are you looking for?France on Thursday slapped a 20-million-euro fine on US firm Clearview AI for breaching privacy laws, as pressure mounts on the controversial facial-recognition platform.ByFlipboardRedditWhatsappWhatsappEmailAFP 2023Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.SecurityWeek spoke with more than 300 cybersecurity experts to see what is bubbling beneath the surface, and examine how those evolving threats will present...Joanna Burkey, CISO at HP, and Kevin Cross, CISO at Dell, discuss how the role of a CISO is different for a multinational corporation...In this issue of CISO Conversations we talk to two CISOs about solving the CISO/CIO conflict by combining the roles under one person.Security professionals understand the need for resilience in their company’s security posture, but often fail to build their own psychological resilience to stress.SecurityWeek examines how a layoff-induced influx of experienced professionals into the job seeker market is affecting or might affect, the skills gap and recruitment...2022 Cybersecurity Year in Review: Top news headlines and trends that impacted the security ecosystemThe three primary drivers for cyber regulations are voter privacy, the economy, and national security – with the complication that the first is often...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-24",
      "title": "SIM Swappers Sentenced to Prison for Hacking Accounts, Stealing Cryptocurrency - SecurityWeek",
      "text": " Hi, what are you looking for?Two Massachusetts individuals have been sentenced to prison for their roles in a scheme to take over high-profile social media accounts and steal cryptocurrency.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-24",
      "title": "Shein Parent Firm Zoetop Fined $1.9 Million - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-10-24",
      "title": "Multiple Campaigns Exploit VMware Vulnerability to Deploy Crypto Miners and Ransomware",
      "text": " A now-patched vulnerability in VMware Workspace ONE Access has been observed being exploited to deliver both cryptocurrency miners and ransomware on affected machines.The Mirai sample is retrieved from a remote server and is designed to launch denial-of-service (DoS) and brute-force attacks aimed at well-known IoT devices by making use of a list of default credentials.The distribution of RAR1Ransom and GuardMiner, on the other hand, is achieved by means of a PowerShell or a shell script depending on the operating system. RAR1ransom is also notable for leveraging the legitimate WinRAR utility to lock files in password-protected archives.The findings are yet another reminder that malware campaigns continue to actively exploit recently disclosed flaws to break into unpatched systems, making it essential that users prioritize applying necessary security updates to mitigate such threats.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-10-24",
      "title": "FBI Warns of Iranian Cyber Firm's Hack-and-Leak Operations - SecurityWeek",
      "text": " Hi, what are you looking for?The Federal Bureau of Investigation on Thursday issued an alert to warn that Iranian cyber group Emennet Pasargad is targeting organizations to steal their data and leak it online.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.WASHINGTON - Cyberattacks are the most serious threat facing the United States, even more so than terrorism, according to American defense experts. Almost half...Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-24",
      "title": "Microsoft’s Misconfiguration Leaked 65,000+ Companies' Data",
      "text": " Microsoft recently confirmed that a “misconfigured endpoint” was responsible for the exposure and leak of Microsoft customer data. The security lapse left an endpoint publicly accessible over the internet without any authentication.Well, the misconfiguration of the Azure Blob Storage was spotted on September 24, 2022, by cybersecurity company SOCRadar. This entire leak has been termed as BlueBleed.Even though Microsoft hasn’t revealed the exact number of impacted customers, SOCRadar suggests that the leak affected 65,000 entities in 111 countries.A total of around 2.4 terabytes of data that consists of invoices, product orders, signed customer documents, and partner ecosystem details, among others were leaked.At the time of writing this article, Microsoft said that it’s in the process of directly notifying impacted customers.In an alert, Microsoft stated that,“This misconfiguration resulted in the potential for unauthenticated access to some business transaction data corresponding to interactions between Microsoft and prospective customers, such as the planning or potential implementation and provisioning of Microsoft services,”Now SOCRadar has made its BlueBleed search portal available to Microsoft customers who might be concerned that they have been affected by the leak. That said, it seems Microsoft is not happy with the way SOCRadar handled this breach.In an official statement, Microsoft stated that encouraging entities to use its search tool “is not in the best interest of ensuring customer privacy or security and potentially exposing them to unnecessary risk.”In response, SOCRadar VP of Research and CISO Ensar Seker told BleepingComputer that,“No data was downloaded. Some of the data were crawled by our engine, but as we promised to Microsoft, no data has been shared so far, and all this crawled data was deleted from our systems,”“We redirect all our customers to MSRC (Microsoft 365 Admin Center Alert) if they want to see the original data. Search can be done via metadata (company name, domain name, and email). Due to persistent pressure from Microsoft, we even have to take down our query page today,” he added."
   },
   {
      "time": "2022-10-24",
      "title": "Exbyte: BlackByte Ransomware Attackers Deploy New Exfiltration Tool | Symantec Enterprise Blogs",
      "text": " Symantec’s Threat Hunter Team has discovered that at least one affiliate of the BlackByte ransomware (Ransom.Blackbyte) operation has begun using a custom data exfiltration tool during their attacks. The malware (Infostealer.Exbyte) is designed to expedite the theft of data from the victim’s network and upload it to an external server.The Exbyte exfiltration tool is written in Go and designed to upload stolen files to the Mega.co.nz cloud storage service.On execution, Exbyte performs a series of checks for indicators that it may be running in a sandboxed environment. This is intended to make it more difficult for security researchers to analyze the malware. To do this, it calls the IsDebuggerPresent and CheckRemoteDebuggerPresent APIs. It then checks for the running processes from the following applications:It then checks for the following anti-virus or sandbox-related files:Next, Exbyte enumerates all document files on the infected computer, such as .txt, .doc, and .pdf files, and saves the full path and file name to %APPDATA%\\dummy. The files listed are then uploaded to a folder the malware creates on Mega.co.nz. Credentials for the Mega account used are hardcoded into Exbyte.Symantec has observed attackers using AdFind, AnyDesk, NetScan, and PowerView prior to deploying the ransomware payload.Recent attacks have used version 2.0 of the BlackByte payload. On execution, the ransomware payload itself appears to download and save debugging symbols from Microsoft. The command is executed directly from the ransomware:powershell -command \"(New-Object Net.WebClient).DownloadFile('http://msdl.microsoft.com/download/symbols/ntkrnlmp.pdb/11D60DB07BA7433B923F49867DF515721/ntkrnlmp.pdb', 'CSIDL_SYSTEM_DRIVE\\systemdata\\ntkrnlmp.pdb')\"The ransomware then checks the version information of ntoskrnl.exe and then creates a service with the following details:binPath = C:\\systemdata\\generalatedisplayName = AAAAAAAAAAAAAA!!!!!!!!!!!!!!!BlackByte uses VssAdmin to delete volume shadow copies and resize storage allocation:cmd.exe /c start vssadmin.exe Delete Shadows /All /Quietvssadmin Resize ShadowStorage /For=K: /On=K: /MaxSize=401MBIt then makes the following service modifications:sc create ODosTEmONa binPath= CSIDL_SYSTEM_DRIVE\\systemdata\\generalate type= kernelsc.exe config RemoteRegistry start= autosc.exe config Dnscache start= autosc.exe config SSDPSRV start= autosc.exe config fdPHost start= autosc.exe config upnphost start= autoThe ransomware then modifies firewall settings to enable linked connections:netsh advfirewall firewall set rule \"group=\\\"Network Discovery\\\" \" new enable=Yes\"netsh advfirewall firewall set rule \"group=\\\"File and Printer Sharing\\\" \" new enable=Yes\"cmd.exe /c netsh advfirewall set allprofiles state offFinally, BlackByte injects itself into an instance of svchost.exe, conducts file encryption, and then deletes the ransomware binary on disk:cmd.exe /c ping 1.1.1.1 -n 10 > Nul & Del CSIDL_WINDOWS\\rdac.exe /F /QCSIDL_SYSTEM\\svchost.exe -s 27262842Following the departure of a number of major ransomware operations such as Conti and Sodinokibi, BlackByte has emerged as one of the ransomware actors to profit from this gap in the market. The fact that actors are now creating custom tools for use in BlackByte attacks suggests that it may be on the way to becoming one of the dominant ransomware threats. Yara Rulerule blackbyte_exfil{     meta:      copyright = \"Symantec\"      family = \"Alias:ExfilTool\"      description = \"Detects exfil tool used by BlackByte ransomware\"          strings:      $data_str1 = {41 B9 04 00 00 00 66 66 0F 1F 84 00 00 00 00 00                    43 0F B6 84 02 A0 00 00 00 41 30 00 49 FF C0 49                    83 E9 01 75 EB 49 83 EB 01 75 D5 40 B7 09 48 8D}      $data_str2 = {32 10 05 AF 59 2E 0D 38 32 59 C0 99 E8 A5 87 CB}      $data_str3 = \"@BCEFHJLNPRTVY\" ascii      condition:       all of ($data_str*)        and filesize > 2MB and filesize < 3MB and        (uint16(0) == 0x5A4D and uint16(uint32(0x3c)) == 0x4550)} rule blackbyte_exfil_unpacked{     meta:      copyright = \"Symantec\"      family = \"Alias:ExfilTool\"      description = \"Detects unpacked exfil tool used by BlackByte ransomware\"          strings:      $str1 = \").Login\"      $str2 = \").NewUpload\"      $str3 = \").CreateDir\"      $str4 = \".PreloginMsg\"      $str5 = \".UploadCompleteMsg\"      $str6 = \").UploadFile\"                  $str7 = {FF 20 47 6F 20 62 75 69 6C 64 69 6E 66 3A 08 02                           00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00                                                   07 75 6E 6B 6E 6F 77 6E 00 00 00 00 00 00 00 00}                  $c1 = {44 24 68 44 31 C2 88 50 10 0F B6 54 24 56 44 0F}                  $c2 = {FB 48 89 F7 4C 89 C6 E8 54 ED F6 FF 4C 8D 43 01}      condition:       all of ($str*) and ($c1 or $c2)        and filesize > 8MB  and        (uint16(0) == 0x5A4D and uint16(uint32(0x3c)) == 0x4550)} If an IOC is malicious and the file available to us, Symantec Endpoint products will detect and block that file. SHA256 file hashes:3fb160e1770fafeedff2d77841bf02108c25cca4cb6d77e3fbf759077f356b70 - Infostealer.Exbyte0097b8722c8c0840e8c1a4dd579438344b3e6b4d630d17b0bbe9c55159f43142 - Infostealer.Exbyteaeb1b789395357e8cc8dbd313b95f624fc03e037984040cd7c1704775bfb4bd2 - Infostealer.Exbyte477382529659c3452020170d8150820210ab8cbdc6417a0f0ac86a793cd0d9b4 - Ransom.Blackbyte1df11bc19aa52b623bdf15380e3fded56d8eb6fb7b53a2240779864b1a6474ad - Ransom.Blackbyte44a5e78fce5455579123af23665262b10165ac710a9f7538b764af76d7771550 - Ransom.Blackbyteeb24370166021f9243fd98c0be7b22ab8cbc22147c15ecef8e75746eb484bb1a - Ransom.Blackbytef361bafcc00b1423d24a7ea205264f5a0b96011e4928d9a91c2abc9911b433a1 - Ransom.Blackbyte20848d28414d4811b63b9645adb549eed0afbd6415d08b75b0a93fbf7cfbf21f - Ransom.Blackbyte754ac79aca0cc1bcf46000ef6c4cbe8bebeb50dae60823a1e844647ac16b6867 - Ransom.Blackbytef157090fd3ccd4220298c06ce8734361b724d80459592b10ac632acc624f455e - AdFind794a5621fda2106fcb94cbd91b6ab9567fb8383caa7f62febafcf701175f2b91 - AdFind batch script572d88c419c6ae75aeb784ceab327d040cb589903d6285bbffa77338111af14b - NetScanefc2125e628b116eb0c097c699e473a47a280dfcd3e02cada41bdf6969600b41 - PowerView4877ff7c3c2abd349646db1163814811e69b36374e289f5808cc794113ef55ae - AnyDesk Network:hxxp://gfs270n392[.]userstorage.mega.co[.]nz/ul/PCfY6R3GKGjIEQK2tzWLODSlhG-h5NbxGHdNAToANCzjKK8Z6kdCiqshxM6ctHDKpLU09-YobgYybaQkCnpwnw/4718592hxxp://gfs262n303[.]userstorage.mega.co[.]nz/ul/f_re9dP6f9G8GAJhd3p43aJnvHnw7rCHLumJV-MXDlaL2RaSQQrPH1BYStJHWy4JkPgJ13KczuiJoOl0iwjxDA/15204352hxxp://gfs206n171[.]userstorage.mega.co[.]nz/ul/9Y39ts0Mp6xtige0-wHhmMG74YgASgG1UhZYfzl_fh8TN_TQo1gSa92TNe_HTBxvOTirA0yfouEE74-Y3Cy1Tw/81264640hxxp://gfs206n108[.]userstorage.mega.co[.]nz/ul/aX72PSSxERHKJwLdWCCOmsJQRioP7N6kcAltRRTbAgwGtNzcsdYa_7HTb4ToVV_HcVPORXotYAF5WqFAsmAOKA/15204352hxxp://gfs208n174.userstorage[.]mega.co.nz/ul/z6nR8uTohiga4QeILJsXcAWlt05Vhu2XiDlne_Qag-rgAmZkK2aZMvYrWC5FHRebBpMoxYZEEqSStHyvU6SnWQ/6815744hxxp://gfs214n129.userstorage[.]mega.co.nz/ul/wVJUlrn9bMLekALaMZx_o5FeK-U1oG9q4CWqHGNslUnVY2-BgJcEUxIJX9O4fXEWkt-x80LeAr7Jz9gXTCwzDA/2752512hxxp://gfs204n140.userstorage[.]mega.co.nz/ul/_Amu75VCTCu6BgIdFs8ZgHPyHqBFm5Cj8bV1xkM5QFt2T0x-9C_KlHQAQ3kX4bzj8jgmyK9-dlbmx9ef6Y9JDw/1966080The Threat Hunter Team is a group of security experts within Symantec whose mission is to investigate targeted attacks, drive enhanced protection in Symantec products, and offer analysis that helps customers respond to attacks.We encourage you to share your thoughts on your favorite social platform."
   },
   {
      "time": "2022-10-24",
      "title": "Lockbit 3.0 Ransomware Targets UK-Based Kingfisher Insurance  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-24",
      "title": "US govt warns of Daixin Team targeting health orgs with ransomware",
      "text": " CISA, the FBI, and the Department of Health and Human Services (HHS) warned that a cybercrime group known as Daixin Team is actively targeting the U.S. Healthcare and Public Health (HPH) sector in ransomware attacks.The federal agencies also shared indicators of compromise (IOCs) and tactics, techniques, and procedures (TTPs) in a joint advisory issued today to help security professionals detect and block attacks using this ransomware strain.\"The Daixin Team is a ransomware and data extortion group that has targeted the HPH Sector with ransomware and data extortion operations since at least June 2022,\" the advisory revealed.Since June, Daixin Team attackers have been linked to multiple health sector ransomware incidents where they've encrypted systems used for many healthcare services, including electronic health records storage, diagnostics, imaging services, and intranet services.They're also known for stealing patient health information (PHI) and personal identifiable information (PII) and using it for double extortion to pressure victims into paying ransoms under the threat of releasing the stolen information online.The ransomware gang gains access to targets' networks by exploiting known vulnerabilities in the organizations' VPN servers or with the help of compromised VPN credentials belonging to accounts with multi-factor authentication (MFA) toggled off.Once in, they use Remote Desktop Protocol (RDP) and Secure Shell (SSH) to move laterally through the victim's networks.​To deploy the ransomware payloads, they escalate privileges using various methods, such as credential dumping.This privileged access is also used to \"gain access to VMware vCenter Server and reset account passwords for ESXi servers in the environment\" with the same goal of encrypting the systems using ransomware.\"This third-party reporting as well as FBI analysis show that the ransomware targets ESXi servers and encrypts files located in /vmfs/volumes/ with the following extensions: .vmdk, .vmem, .vswp, .vmsd, .vmx, and .vmsn. A ransom note is also written to /vmfs/volumes/.\" Before encrypting their victims' devices, they use Rclone or Ngrok to exfiltrate stolen data to dedicated virtual private servers (VPS).U.S. health organizations are advised to take the following measures to defend against Daixin Team's attacks:"
   }
]