[
   {
      "time": "2022-12-22",
      "title": "Samsung and Google fix Microsoft Intune Android 13 enrollment issue",
      "text": " Microsoft has confirmed today that Samsung and Google have fixed an Intune enrollment issue affecting Galaxy S22 smartphones running Android 13.Admins can also use it to easily enforce device-specific policies for users who access proprietary data using personal or company-owned devices.On affected S22 devices, Android users cannot complete enrollment if they create a Work Profile for Bring Your Own Device (BYOD) provisioning.When trying to enroll the device, users will see a \"Can't setup device. Contact your IT admin for help.\" error followed by a second \"Unable to create Work Profile.\" message.Admins are advised to tell users experiencing this known issue to reboot their personally-owned devices before attempting to enroll them, which should automatically download the Android Device Policy app required for the enrollment to finish successfully.Samsung has also issued a support document describing the issue and confirming that this was addressed via a server-side patch.\"If the issue persists after reboot, install the Android Device Policy app from the Google Play Store before proceeding with enrollment.\""
   },
   {
      "time": "2022-12-22",
      "title": "Corsair keyboard bug makes it type on its own, no malware involved",
      "text": " Corsair has confirmed that a bug in the firmware of K100 keyboards, and not malware, is behind previously entered text being auto-typed into applications days later.The company's statement comes after multiple K100 users have reported that their keyboards are typing text on their own at random moments.\"Corsair keyboards unequivocally do not log user input in any way and do not have the ability to log individual keystrokes,\" Corsair told Ars Technica.The exact cause of this bug is yet to be determined, and the Corsair spokesperson said the firm is working with impacted users to investigate the precise nature of the issue.Unfortunately, the latest firmware update made available to K100 devices (version 1.11.39) a couple of weeks back does not fix the issue.The recommended action to stop the K100 keyboard from auto-typing text at random moments is to reset it by unplugging the keyboard and holding down the Esc button for five seconds while plugging it back in.However, some users report that a factory reset and clearing the keyboard memory still don't prevent the issue from reoccurring after a while. Hence, users may have to wait until Corsair provides a firmware update that fixes this bug.Repeating randomly captured inputs may expose sensitive information in screen sharing and presentations. It can also interfere with the users' gaming experience, so if you're using your keyboard in these situations, you may want to replace it with something else until the bug is fixed."
   },
   {
      "time": "2022-12-22",
      "title": "“GodFather” Hits Banks, Crypto Wallets Apps as Android Trojan Emerges",
      "text": " The cyber security researchers at Group-IB have shared details of a dangerous mobile banking trojan targeting banking apps, crypto exchanges, and cryptocurrency wallets since at least June 2021.Dubbed “GodFather” by Group-IB, this malware has targeted users of over 400 cryptocurrency and banking apps across 16 nations. Group-IB detected the Trojan in June 2021, while the information was disclosed publicly by ThreatFabric in March 2022.When a victim interacts with a fake notification or attempts to open one of these apps, the malware displays a fake web overlay that starts stealing usernames and passwords, along with SMS-based 2FA codes.“If the potential victim’s system preferences include one of the languages in that region, the Trojan shuts down. This could suggest that GodFather’s developers are Russian speakers.” \n\n\n\nSuper secure VPNMinimal data loggingFavorable privacy policy\n\tHackread.com is among the registered trademarks of Gray Dot Media Group Ltd. Company registration number 12903776 in regulation with the United Kingdom Companies House. The registered address is 85 Great Portland Street, London, England, W1W 7LT The display of third-party trademarks and trade names on the site do not necessarily indicate any affiliation or endorsement of Hackread.com. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n\t\t\t\t"
   },
   {
      "time": "2022-12-22",
      "title": "Microsoft research uncovers new Zerobot capabilities | Microsoft Security Blog",
      "text": " \n\t\t\t\tNOTE: In this blog, Zerobot refers to a botnet that spreads primarily through IoT and web application vulnerabilities. It is not associated with the chatbot ZeroBot.ai.\t\t\t\t\t\t\tBotnet malware operations are a constantly evolving threat to devices and networks. Threat actors target Internet of Things (IoT) devices for recruitment into malicious operations as IoT devices’ configurations often leave them exposed, and the number of internet-connected devices continue to grow. Recent trends have shown that operators are redeploying malware for a variety of distributions and objectives, modifying existing botnets to scale operations and add as many devices as possible to their infrastructure.Zerobot affects a variety of devices that include firewall devices, routers, and cameras, adding compromised devices to a distributed denial of service (DDoS) botnet. Using several modules, the malware can infect vulnerable devices built on diverse architectures and operating systems, find additional devices to infect, achieve persistence, and attack a range of protocols. Microsoft tracks this activity as DEV-1061.April 2023 update – Microsoft Threat Intelligence has shifted to a new threat actor naming taxonomy aligned around the theme of weather. DEV-1061 is now tracked as Storm-1061. The most recent distribution of Zerobot includes additional capabilities, such as exploiting vulnerabilities in Apache and Apache Spark (CVE-2021-42013 and CVE-2022-33891 respectively), and new DDoS attack capabilities.IoT devices are often internet-exposed, leaving unpatched and improperly secured devices vulnerable to exploitation by threat actors. Zerobot is capable of propagating through brute force attacks on vulnerable devices with insecure configurations that use default or weak credentials. The malware may attempt to gain device access by using a combination of eight common usernames and 130 passwords for IoT devices over SSH and telnet on ports 23 and 2323 to spread to devices. Microsoft researchers identified numerous SSH and telnet connection attempts on default ports 22 and 23, as well as attempts to open ports and connect to them by port-knocking on ports 80, 8080, 8888, and 2323.In addition to brute force attempts on devices, Zerobot exploits dozens of vulnerabilities, which malware operators add on a rolling basis to gain access and inject malicious payloads. Zerobot 1.1 includes several new vulnerabilities, such as:Since the release of Zerobot 1.1, the malware operators have removed CVE-2018-12613, a phpMyAdmin vulnerability that could allow threat actors to view or execute files. Microsoft researchers have also identified that previous reports have used the vulnerability ID “ZERO-32906” for CVE-2018-20057, “GPON” for CVE-2018-10561, and “DLINK” for CVE-2016-20017; and that CVE-2020-7209 was mislabeled as CVE-2017-17106 and CVE-2022-42013 was mislabeled as CVE-2021-42013.Microsoft researchers have also found new evidence that Zerobot propagates by compromising devices with known vulnerabilities that are not included in the malware binary, such as CVE-2022-30023, a command injection vulnerability in Tenda GPON AC1200 routers.Upon gaining device access, Zerobot injects a malicious payload, which may be a generic script called zero.sh that downloads and attempts to execute Zerobot, or a script that downloads the Zerobot binary of a specific architecture. The bash script that attempts to download different Zerobot binaries tries to identify the architecture by brute-force, attempting to download and execute binaries of various architectures until it succeeds, as IoT devices are based on many computer processing units (CPUs). Microsoft has observed scripts targeting various architectures including ARM64, MIPS, and x86_64.Depending on the operating system of the device, the malware has different persistence mechanisms. Persistence tactics are used by malware operators to obtain and maintain access to devices. While Zerobot is unable to spread to Windows machines, we have found several samples that can run on Windows. On Windows machines, the malware copies itself to the Startup folder with the file name FireWall.exe (older versions use my.exe). Microsoft Defender for Endpoint detects this malware and related malicious activity on both Windows and Linux devices. See detection details below.To achieve persistence on Linux-based devices, Zerobot uses a combination of desktop entry, daemon, and service methods:Desktop entry:Zerobot copies itself to $HOME/.config/ssh.service/sshf then writes a desktop entry file called sshf.desktop to the same directory. Older Linux versions use $HOME/.config/autostart instead of $HOME/.config/ssh.service.Daemon:Copies itself to /usr/bin/sshf and writes a configuration at /etc/init/sshf.conf.Service:Copies itself to /etc/sshf and writes a service configuration at /lib/system/system/sshf.service, then enables the service (to make sure it starts at boot) with two commands:All persistence mechanisms on older Linux versions use my.bin and my.bin.desktop instead of sshf and sshf.desktop.In addition to the functions and attacks included in previous versions of the malware, Zerobot 1.1 has additional DDoS attack capabilities. These functions allow threat actors to target resources and make them inaccessible. Successful DDoS attacks may be used by threat actors to extort ransom payments, distract from other malicious activities, or disrupt operations. In almost every attack, the destination port is customizable, and threat actors who purchase the malware can modify the attack according to their target.The following are the previously known Zerobot capabilities:Previously undisclosed and new capabilities are the following:After persistence is achieved, Zerobot scans for other internet-exposed devices to infect. The malware randomly generates a number between 0 and 255 and scans all IPs starting with this value. Using a function called new_botnet_selfRepo_isHoneypot, the malware tries to identify honeypot IP addresses, which are used by network decoys to attract cyberattacks and collect information on threats and attempts to access resources. This function includes 61 IP subnets, preventing scanning of these IPs.Microsoft researchers also identified a sample that can run on Windows based on a cross-platform (Linux, Windows, macOS) open-source remote administration tool (RAT) with various features such as managing processes, file operations, screenshotting, and running commands. This tool was found by investigating the command-and-control (C2) IPs used by the malware. The script, which is used to download this RAT, is called impst.sh:The continuous evolution and rapid addition of new capabilities in the latest Zerobot version underscores the urgency of implementing comprehensive security measures. Microsoft recommends the following steps to protect devices and networks against the threat of Zerobot:Microsoft Defender for IoTMicrosoft Defender for IoT uses detection rules and signatures to identify malicious behavior. Microsoft Defender for IoT has alerts for the following vulnerabilities and exploits which may be tied to Zerobot activity:Microsoft Defender AntivirusMicrosoft Defender Antivirus detects the malicious files under the following platforms and threat names:Microsoft Defender for EndpointMicrosoft Defender for Endpoint alerts with the following titles can indicate threat activity on your network:Microsoft Defender for Endpoint also has detections for the following vulnerabilities exploited by Zerobot:Microsoft Defender for Endpoint’s Device Discovery capabilities discover and classify devices. With these capabilities, Microsoft 365 Defender customers using Microsoft Defender for IoT have visibility into security recommendations for devices with the following vulnerabilities:Devices with these vulnerabilities are also visible in the Microsoft Defender Vulnerability Management inventory.Microsoft Defender for CloudMicrosoft Defender for Cloud alerts with the following titles can indicate threat activity on your network:Microsoft 365 Defender customers can run the following query to find related activity in their networks.Zerobot filesThis query finds the file hashes associated with Zerobot activity.Zerobot HTTP requestsThis query finds suspicious HTTP requests originated by the IOCs associated with Zerobot activity.Zerobot port knockingThis query finds incoming connections from IOCs associated with Zerobot activity.Domains and IP addresses:New Zerobot hashes (SHA-256)SparkRat hashes (SHA-256): Rotem Sde-Or, Ilana Sivan, Gil Regev, Microsoft Defender for IoT Research TeamMeitar Pinto, Nimrod Roimy, Nir Avnery, Microsoft Defender Research TeamRamin Nafisi, Ross Bevington, Microsoft Threat Intelligence Center (MSTIC)\n\t\t\tA set of memory corruption vulnerabilities in the ncurses library could have allowed attackers to chain the vulnerabilities to elevate privileges and run code in the targeted program's context or perform other malicious actions. \t\t\n\t\t\tThe threat actor that Microsoft tracks as Storm-0324 is a financially motivated group known to gain initial access using email-based initial infection vectors and then hand off access to compromised networks to other threat actors. These handoffs frequently lead to ransomware deployment. Beginning in July 2023, Storm-0324 was observed distributing payloads using an open-source tool […]\t\t\n\t\t\tAnalysis of the techniques used by the threat actor tracked as Storm-0558 for obtaining unauthorized access to email data, tools, and unique infrastructure characteristics. \t\t\n\t\t\tMicrosoft has identified a phishing campaign conducted by the threat actor tracked as Storm-0978 targeting defense and government entities in Europe and North America. The campaign involved the abuse of CVE-2023-36884, which included a zero-day remote code execution vulnerability exploited via Microsoft Word documents.\t\tMicrosoft is a leader in cybersecurity, and we embrace our responsibility to make the world a safer place."
   },
   {
      "time": "2022-12-22",
      "title": "Data exfiltration using a COVID-bit attack | Kaspersky official blog",
      "text": " Solutions for:Stealing data from an isolated network by manipulating the voltage switching converter.\nDecember 21, 2022\nThis time, Guri explored the possibility of applying the operating principle of voltage switching to exfiltrate data. Any power supply for a phone or laptop is basically an AC-to-DC switching converter. Switch-mode power supplies are more compact than linear ones, but by their very nature emit a good deal of radio interference. Most of all, they irritate radio amateurs operating on medium and short waves, where the parasitic radiation of such power supplies is especially noticeable.Similar voltage converters are present in many personal computers, some of which are used to power the CPU. All modern CPUs use a system of dynamic voltage and frequency variation. Such a system makes it possible to reduce power consumption when the CPU is idle: you can lower its frequency and voltage, then raise them sharply when a new computational task comes along.Since in the studied scenario the attacker already controls the victim’s computer with malware, they are able to manipulate the CPU load in some way, and with it the frequency and voltage. But how? Guri found that the parasitic radiation of a switching voltage converter changes form when the operating voltage is altered. And the voltage varies depending on the load. That is, by applying a load to the CPU at a specific interval, you can generate a radio signal at a certain frequency.The signal transmission frequency can be set by alternately loading and unloading the CPU at this specific interval, thousands of times per second. The type of load (that is, what the CPU is asked to compute) does not matter: it is run for no other reason than to generate a radio signal of a certain shape. The CPU under load requires a change in the supply voltage, the voltage converter creates radio interference, and the conductors on the motherboard act as an antenna. Here’s what the resulting radio signal looks like:Guri also discusses in detail the issue of reception. A low-power radio signal can in reality be received at a distance of no more than 2 meters from an isolated system.The figure shows one of the possible scenarios: an attacker visits the victim’s office and extracts secret information from an infected machine. The data exfiltration can also be performed by a bribed employee of the target organization. In either case, it is unlikely that the attackers will be able to carry bulky radio gear with them, which is why the study highlights a method for receiving classified information via smartphone.Most smartphones are not equipped with a medium-wave radio receiver, but it’s possible to make do with an audio chip. An analog-to-digital converter in the smartphone is capable of digitizing radio waves with a frequency of up to 24 kilohertz, so one has to insert an antenna into the headset jack. It might not be ideal, but as practice shows, it gets the job done.The resulted data exfiltration technique is fairly effective (by the standards of attacks on protected isolated systems, of course). Besides the “slow” form of data theft shown above, Guri also tested out faster transmission methods, some of which hit speeds of up to 1000 bps. This is enough to transfer an IP address in an instant, an encryption key in 4 seconds, and small files in minutes.The study dutifully lists potential ways to counteract this method of exfiltration. The simplest is that same social distancing — not letting outsiders nearer than 2 meters to protected computers. And then there are some slightly more complex ones: you can, for example, stifle the data transfer by loading the CPU with your own tasks. This wastes energy, but reliably prevents leakage. Interestingly, locking the CPU on a particular frequency, despite reducing the signal power, does not rule out data transmission. The varying load on the CPU produces interference that can still help a spy, even at a constant frequency.Many hacks have started during Christmas holidays. A few simple tips will reduce the chances of your company becoming the next victim.\nMany hacks have started during Christmas holidays. A few simple tips will reduce the chances of your company becoming the next victim.\nDecember 20, 2022\nFour handy ways to lock your screen on Windows and macOS.\nFour handy ways to lock your screen on Windows and macOS.\nNovember 10, 2023\nMistakes commonly found in almost every large organization. What should the inforsec team look out for, and what protective measures should they take?\nMistakes commonly found in almost every large organization. What should the inforsec team look out for, and what protective measures should they take?\nNovember 8, 2023\nEverything you wanted to know about Google account passkeys: how they work, why they’re needed, where to enable them, how to configure them, and what storage options are available.\nEverything you wanted to know about Google account passkeys: how they work, why they’re needed, where to enable them, how to configure them, and what storage options are available.\nNovember 3, 2023\nReady, set, tech: preparing for your kids’ first device.\nReady, set, tech: preparing for your kids’ first device.\nOctober 31, 2023\nCopyright © 2023 AO Kaspersky Lab. All Rights Reserved.Global"
   },
   {
      "time": "2022-12-22",
      "title": "Password theft bug chain patched in Passwordstate credential manager | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondFlaws could be combined to grab passwords in cleartextVulnerabilities in enterprise password manager Passwordstate that could be combined to exfiltrate stored credentials have been patched.Passwordstate was subject to scrutiny by Swiss security consultancy modzero AG following a customer request to check the password manager’s security.Researchers also found another XSS, the use of hard-coded credentials for APIs, insufficient protection for password lists, and potential exposure of passwords in the browser extension.“Successful exploitation allows an unauthenticated attacker to exfiltrate passwords from an instance, overwrite all stored passwords within the database, or elevate their privileges within the application,” the researchers say.“The individual vulnerabilities can be chained to gain a shell on the Passwordstate host system and dump all stored passwords in cleartext – starting with nothing more than a valid username!”“Password safety and therefore password management solutions are the foundation on which an organization's security infrastructure is built on,” modzero commented. \"The uncovered findings show the incredible importance of ongoing security audits for critical assets and red teaming engagements within organizations.”The Daily Swig has reached out to Click Studios and we will update if and when when we hear back.Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2022-12-22",
      "title": "Kiss-a-Dog Discovered Utilizing a 20-Year-Old Process Hider - Cado Security | Cloud Forensics & Incident Response",
      "text": " Despite many of the TTPs and overall objective remaining the same, this campaign employed a new method of initial access and deployed some additional payloads that weren’t reported by Crowdstrike. These included a (rather old) open source process hider and a version of Tsunami, a Linux backdoor that’s long been a favourite of cryptojacking groups.For initial access, this updated version of the Kiss-a-Dog campaign utilised a common Redis exploitation attack pattern to download and execute an initialisation shell script on the compromised node. Essentially, this attack involves writing the contents of a cron job to the data store, using the CONFIG SET DIR command to set the working directory to one of the cron directories and then saving the database. When the cron scheduler runs, the database file is read and interpreted as a cron job, resulting in arbitrary code execution. Examples of cron commands used to retrieve additional payloadsContents of ai.shThe script begins with a log statement and some variable assignment, including the decoding of the following payload URL:http://kiss[.]a-dog[.]top/b2f628/m/xm.jpgAs we can see from lines 24 and 27 in ai.sh, the resource in this URL is a tarball which appears to contain another executable (start).Extracted contents of xm.jpg tarballThe “start” executable, referenced by the ai.sh script can be seen amongst the tarball contents. It’s another simple shell script, used to determine the CPU architecture of the target system and rename one of two ELF binaries compiled for each architecture.Contents of “start”Unsurprisingly, given the new name for the aarch64 and x86_64 binaries, these are versions of XMRig compiled for each of the two architectures. More interestingly, the script executes something named “hide”, as can be seen on line 9.To add to the confusion, the “start” script above invokes the hider without any arguments, printing the help text for the executable and not actually hiding any processes.Invoking XHide without any argumentsFurther along the execution chain, we discover a script named “mining”, which was included in the xm.jpg tarball.On lines 7 and 9, we can see the XHide process hider being used to disguise the miner process created by either the ARM64 or x86_64 versions of XMRig. The developers have chosen to masquerade as Sendmail, a Linux email transfer agent. The PID of this process is then saved to the file ra.pid, for later use by the malware.Since it’s not every day you encounter a 20 year old process hider, we decided to test whether this approach does actually work. We transferred the payloads used by this campaign to an analysis machine running Ubuntu 20.04, and executed the script above. After running ps auxxx, we noticed a process with the name “sendmail: accepting connections” with 99.6% CPU usage. This was then confirmed to be the XMRig executable.Fake “sendmail: accepting connections” process in ps aux outputThis showed that XHide does indeed still function as intended, and is an effective tool for masquerading malicious processes.Cryptojacking groups have utilised open source process hiders and rootkits for quite some time. Extracting and compiling diamorphineCustom shell script process hider utilised by WatchDogClearly, hiding processes is a key goal of cloud cryptojacking groups. Mining cryptocurrency is incredibly resource intensive and can result in the compromised system grinding to a halt. Naturally, when investigating slow-downs like this, the first step an administrator will take is to list the CPU usage of running processes and look for anything with high utilisation. Masquerading as legitimate processes may help the attackers evade detection, even if only momentarily. The developers behind this new version of Kiss-a-Dog obviously value the ability to hide the mining process, as they’ve utilised three individual open source process hiders. This gives them redundancy, should a method fail. Once again, the use of a 20 year old process hider demonstrates the resourcefulness of attackers in the cloud malware landscape, and we expect to see the Kiss-a-Dog campaign continue to evolve over time.Cado Security is the provider of the first cloud forensics and incident response platform. By leveraging the scale and speed of the cloud, the Cado platform automates forensic-level data capture and processing across cloud, container, and serverless environments. Only Cado empowers security teams to respond at cloud speed.Cado Security is the provider of the first cloud forensics and incident response platform. By leveraging the scale and speed of the cloud, the Cado platform automates forensic-level data capture and processing across cloud, container, and serverless environments. Only Cado empowers security teams to respond at cloud speed.© Copyright 2023 Cado Security"
   },
   {
      "time": "2022-12-22",
      "title": "Critical Vulnerability in Hikvision Wireless Bridges Allows CCTV Hacking - SecurityWeek",
      "text": " Hi, what are you looking for?Chinese video surveillance company Hikvision has patched a critical vulnerability in some of its wireless bridge products. The flaw can lead to remote CCTV hacking, according to the researchers who found it.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-22",
      "title": "Okta's source code stolen after GitHub repositories hacked",
      "text": " Okta, a leading provider of authentication services and Identity and Access Management (IAM) solutions, says that its private GitHub repositories were hacked this month.According to a 'confidential' email notification sent by Okta and seen by BleepingComputer, the security incident involves threat actors stealing Okta's source code.BleepingComputer has obtained a 'confidential' security incident notification that Okta has been emailing to its 'security contacts' as of a few hours ago. We have confirmed that multiple sources, including IT admins, have been receiving this email notification.Earlier this month, GitHub alerted Okta of suspicious access to Okta's code repositories, states the notification.\"Upon investigation, we have concluded that such access was used to copy Okta code repositories,\" writes David Bradbury, the company's Chief Security Officer (CSO) in the email.Despite stealing Okta's source code, attackers did not gain unauthorized access to the Okta service or customer data, says the company. Okta's \"HIPAA, FedRAMP or DoD customers\" remain unaffected as the company \"does not rely on the confidentiality of its source code as a means to secure its services.\" As such, no customer action is needed.At the time of writing our report, the incident appears to be relevant to Okta Workforce Identity Cloud (WIC) code repositories, but not Auth0 Customer Identity Cloud product, given the email wording.An excerpt from the remainder of the notification, reviewed by BleepingComputer, is published below:As soon as Okta learned of the possible suspicious access, we promptly placed temporary restrictions on access to Okta GitHub repositories and suspended all GitHub integrations with third-party applications.\nWe have since reviewed all recent access to Okta software repositories hosted by GitHub to understand the scope of the exposure, reviewed all recent commits to Okta software repositories hosted with GitHub to validate the integrity of our code, and rotated GitHub credentials. We have also notified law enforcement.\nAdditionally, we have taken steps to ensure that this code cannot be used to access company or customer environments. Okta does not anticipate any disruption to our business or our ability to service our customers as a result of this event.\nNote: The security event pertains to Okta Workforce Identity Cloud (WIC) code repositories. It does not pertain to any Auth0 (Customer Identity Cloud) products.\nWe have decided to share this information consistent with our commitment to transparency and partnership with our customers.While ending its 'confidential' email that pledges a 'commitment to transparency,' Okta says it will publish a statement today on its blog.BleepingComputer reached out to Okta with questions in advance of publishing but a reply was not immediately available.It's been a difficult year for Okta with its series of security incidents and bumpy disclosures."
   },
   {
      "time": "2022-12-22",
      "title": "",
      "text": " "
   }
]