[
   {
      "time": "2023-02-10",
      "title": "Graphiron: New Russian Information Stealing Malware Deployed Against Ukraine | Symantec Enterprise Blogs",
      "text": " The Nodaria espionage group (aka UAC-0056) is using a new piece of information stealing malware against targets in Ukraine. The malware (Infostealer.Graphiron) is written in Go and is designed to harvest a wide range of information from the infected computer, including system information, credentials, screenshots, and files.The earliest evidence of Graphiron dates from October 2022. It continued to be used until at least mid-January 2023 and it is reasonable to assume that it remains part of the Nodaria toolkit.Graphiron is a two-stage threat consisting of a downloader (Downloader.Graphiron) and a payload (Infostealer.Graphiron).The downloader contains hardcoded command-and-control (C&C) server addresses. When executed, it will check against a blacklist of malware analysis tools by checking for running processes with the names listed in Table 1.If no blacklisted processes are found, it will connect to a C&C server and download and decrypt the payload before adding it to autorun.The downloader is configured to run just once. If it fails to download and install the payload it won’t make further attempts nor send a heartbeat.Graphiron uses AES encryption with hardcoded keys. It creates temporary files with the \".lock\" and \".trash\" extensions. It uses hardcoded file names designed to masquerade as Microsoft office executables: OfficeTemplate.exe and MicrosoftOfficeDashboard.exeThe payload is capable of carrying out the following tasks:Password theft is carried out using the following PowerShell command:[void][Windows.Security.Credentials.PasswordVault,Windows.Security.Credentials,ContentType=WindowsRuntime];$vault = New-Object Windows.Security.Credentials.PasswordVault;$vault.RetrieveAll() | % { $_.RetrievePassword();$_} | Select UserName, Resource, Password | Format-Table –HideTableHeadersThe following command was used to export the list of PuTTY sessions:\"CSIDL_SYSTEM\\reg.exe\" query HKCU\\Software\\SimonTatham\\Putty\\SessionsIn addition to this, as with earlier malware, Graphiron communicates with the C&C server using port 443 and communications are encrypted using the AES cipher.Nodaria has been active since at least March 2021 and appears to be mainly involved in targeting organizations in Ukraine. There is also limited evidence to suggest that the group has been involved in attacks on targets in Kyrgyzstan. Third-party reporting has also linked the group to attacks on Georgia.The group sprang to public attention when it was linked to the WhisperGate wiper attacks that hit multiple Ukrainian government computers and websites in January 2022. When WhisperGate was initially loaded onto a system, the malware would overwrite the portion of the hard drive responsible for launching the operating system when the machine is booted up with a ransom note demanding $10,000 in Bitcoin. However, this was just a decoy as the WhisperGate malware destroys data on an infected machine and it cannot be recovered, even if a ransom is paid.The group’s usual infection vector is spear-phishing emails, which are then used to deliver a range of payloads to targets. Custom tools used by the group to date include:Like Graphiron, many of Nodaria’s earlier tools were written in Go. Graphiron appears to be the latest piece of malware authored by the same developers, likely in response to a need for additional functionality. While GraphSteel and GrimPlant used Go version 1.16, Graphiron uses version 1.18, confirming it is a more recent development.While Nodaria was relatively unknown prior to the Russian invasion of Ukraine, the group’s high-level activity over the past year suggests that it is now one of the key players in Russia’s ongoing cyber campaigns against Ukraine.If an IOC is malicious and the file available to us, Symantec Endpoint products will detect and block that file.SHA-256:0d0a675516f1ff9247f74df31e90f06b0fea160953e5e3bada5d1c8304cfbe63 — Downloader.Graphiron878450da2e44f5c89ce1af91479b9a9491fe45211fee312354dfe69e967622db — Downloader.Graphiron80e6a9079deffd6837363709f230f6ab3b2fe80af5ad30e46f6470a0c73e75a7 — Infostealer.Graphironeee1d29a425231d981efbc25b6d87fdb9ca9c0e4e3eb393472d5967f7649a1e6 — Infostealer.Graphironf0fd55b743a2e8f995820884e6e684f1150e7a6369712afe9edb57ffd09ad4c1 — Infostealer.Graphironf86db0c0880bb81dbfe5ea0b087c2d17fab7b8eefb6841d15916ae9442dd0cce — Infostealer.GraphironNetwork:208.67.104[.]95 — C&C serverThe Threat Hunter Team is a group of security experts within Symantec whose mission is to investigate targeted attacks, drive enhanced protection in Symantec products, and offer analysis that helps customers respond to attacks.We encourage you to share your thoughts on your favorite social platform."
   },
   {
      "time": "2023-02-10",
      "title": "Phishing Surges Ahead, as ChatGPT & AI Loom",
      "text": " Phishing is having a moment, with a massive spike in campaign volumes in the latter half of 2022. In fact, total phishing emails increased by 61% in the second half, according to an analysis this week. That could also be set to accelerate, as the rise of ChatGPT and other new tools are making their mark on the sector too. Malware volumes overall also increased, 12% quarter for quarter, with Vade detecting 58.9 million emails in the fourth quarter of 2022 that included malware, the researchers found.Email remains the top channel for distributing phishing and malware, giving hackers a convenient, scalable, and efficient vehicle for exploiting users and compromising accounts, Todd Stansfield, content marketing manager, noted in the report.\"Email threat activity continues to increase, creating the need for organizations of all sizes to fortify their cybersecurity,\" he wrote.Breaking down the numbers by the month, phishing volumes remained relatively stable through the first half of the fourth quarter, with 62.3 million phishing emails tracked in October and 47 million in November, according to the report.In terms of who they target and how they do it, phishing threat actors aren't getting especially creative given the current way enterprise users work and collaborate.Facebook remained the top brand in terms of impersonation for the second consecutive quarter, with researchers observing 6,700 unique phishing URLs impersonating the social networking giant in the fourth quarter of 2022, they reported. The company was followed by Microsoft, PayPal, Google, and Netflix in descending order as the brands that threat actors prefer to impersonate.\"With the growing popularity of productivity suites, users are increasingly using email to access and use productivity apps such as file sharing and instant messaging,\" Stansfield wrote, adding that threat actors have taken notice and are crafting phishing campaigns to target the specific behavior of corporate productivity-suite users.\"By purchasing a phishing kit, novice hackers can deploy highly convincing and effective schemes against their targets,\" Stansfield acknowledged.One recent enhancement to these kits is the ability to automatically localize phishing pages based on a victim's native language, a handy tool that allows threat actors to target various regions quickly without being multilingual themselves, the researchers said.The feature works by identifying the language settings of the targeted user's browser and leveraging it to update and display the phishing page accordingly. While improving the contextual accuracy of each phishing attack, the new feature also enables hackers to target users across multiple languages using a single kit, thus increasing the reach of their campaigns, according to Vade.Moreover, the problem with phishing is that it doesn't just end with an attacker giving up credentials, but ultimately, they can use these credentials as a way into corporate networks to steal data, distribute ransomware and other malware, and engage in other nefarious activity.Enterprises need to move beyond traditional email security solutions and adopt ones that can respond to the more sophisticated tactics of attackers, the researchers said. Specifically, collaborative and AI-enhanced solutions that can provide \"predictive defense against known and unknown threats using the latest threat intelligence and a core set of AI technologies,\" are the way forward, Stansfield said.\"On the flip side, we use AI to detect anomalies in email, from the content itself to the behavior of files that might be included in those emails,\" he says. \"There will be a battle between what you might call good and bad AI.\"If phishing emails do slip through an organization's security protections, training employees to identify phishing emails before they click on them can also be a reliable way to prevent credential or malware compromise before it occurs, Scott Caveza, senior research manager at cyber exposure management firm Tenable, tells Dark Reading.\"Phishing attacks continue to be successful as they target our weakest link in security, humans,\" he says. \"Regardless of the author of the email, be it AI or an actual human, organizations need to invest in and develop mature security programs where security awareness training, including specific training on spotting phishing attacks, are priorities for the organization.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-10",
      "title": "NIST Picks IoT Standard for Small Electronics Cybersecurity",
      "text": " After a search that took several years, the National Institute of Standards and Technology (NIST) has chosen Ascon to be the standard to protect data generated by exploding ranks of lightweight electronics that make up the Internet of Things (IoT). NIST will publish the full standard later in 2023, the organization says. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-10",
      "title": "7 Critical Cloud Threats Facing the Enterprise in 2023",
      "text": " Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-10",
      "title": "Hackers use fake crypto job offers to push info-stealing malware",
      "text": " A campaign operated by Russian threat actors uses fake job offers to target Eastern Europeans working in the cryptocurrency industry, aiming to infect them with a modified version of the Stealerium malware named 'Enigma.'The attacks start with an email pretending to be a job offer with fake cryptocurrency interviews to lure their targets. The emails have a RAR archive attachment which contains a TXT (\"interview questions.txt\") and an executable (\"interview conditions.word.exe\").The text file contains interview questions written in Cyrillic, which follow a standard format and are made to appear legitimate.If the victim is tricked into launching the executable, a chain of payloads is executed that eventually downloads the Enigma information-stealing malware from Telegram.The first-stage downloader is a C++ tool that uses techniques like API hashing, string encryption, and irrelevant code to evade detection while downloading and launching the second-stage payload, \"UpdateTask.dll.\"The second-stage payload, also written in C++, uses the \"Bring Your own Vulnerable Driver\" (BYOVD) technique to exploit the CVE-2015-2291 Intel vulnerability. This Intel driver flaw allows commands to be executed with Kernel privileges.The threat actors abuse this vulnerability to disable Microsoft Defender before the malware downloads the third payload.The third-stage downloads the final payload, Enigma Stealer, from a private Telegram channel, which Trend Micro says is a modified version of Stealerium, an open-source information-stealing malware.Enigma targets system information, tokens, and passwords stored in web browsers like Google Chrome, Microsoft Edge, Opera, and more. Additionally, it targets data stored in Microsoft Outlook, Telegram, Signal, OpenVPN, and other apps.Enigma can also capture screenshots from the compromised system and extract clipboard content or VPN configurations.Finally, all stolen data is compressed in a ZIP archive (\"Data.zip\") and sent back to the threat actors via Telegram.Some of Enigma's strings, such as web browser paths and Geolocation API services URLs, are encrypted with the AES algorithm in cipher-block chaining (CBC) mode, likely to conceal the data and prevent unauthorized access or tampering.Trend Micro has not assigned attribution with strong confidence but discovered several elements that may indicate a Russian threat actor is behind the attacks.The first clue is that one of the logging servers used in this campaign to track the execution flow of active infections hosts an Amadey C2 panel, which is quite popular in Russian cybercrime forums.Second, the server runs \"Deniska,\" a special-purpose Linux system only referenced in Russian-speaking forums.Finally, the server's default time zone is set to Moscow, another indicator that the threat actors are Russian."
   },
   {
      "time": "2023-02-10",
      "title": "Gootloader malware, SEO poisoning targets healthcare in ‘aggressive’ campaign | SC Media",
      "text": "  “The threat actor displayed fast-moving behaviors, quickly heading to control the network it infected, and getting elevated privileges in less than 4 hours,” researchers wrote.The attack analysis confirmed multiple layers of obfuscation and the “existence of multiple JavaScript loops that makes the execution longer, probably acting as an anti-sandbox mechanism.” “The actors create websites or populate web forums or similar websites with specific keywords and links, leading to a website hosting the infected file,” researchers wrote. As noted, the threat actors leverage SEO poisoning tactics to bring its infected pages to the top of internet browser search results to appear as legitimate sites.“SEO poisoning and Google service abuse, in general, have been documented a lot recently, which indicates this infection vector is becoming common for threat actors,” they added.The team “observed the deployment of Gootloader through heavily obfuscated JavaScript files with a file size of more than 40 Megabytes,” as well as the use of fake search engine ads linked to the infected piece of malware.The infections follow a similar flow: tricking a user into downloading the malware using the above tactics, prompting a ZIP file decompression that leads to the first- and second-stage payloads, and leading to a massive file meant to throw off security tools.Researchers note that most of the domains in the Gootloader PowerShell second stage script had one item in common: “/xmlrpc.php\" was displayed in relation to VirusTotal. The actors behind the variant commonly use compromised WordPress websites to use as C2 servers.After a Gootloader infection, the threat actor used “hands-on keyboard activities” that led to further deployment of attack frameworks, Cobalt Strike and SystemBC, “a proxy malware leveraging SOCKS5 and often used during the exfiltration phase of an attack.”The attacks have also used DLL Hijacking “on top of a VLC MediaPlayer executable.” These frameworks are used in both the infection and lateral movement stages of attacks.A successful infection would give a threat actor the ability to remotely control the victim’s device and gather system information, before launching into a “discovery process” to select the most interesting targets. Gootloader also enables attackers to maintain persistence through scheduled task, gather data, and maintain remote control.Given the spate of targeted ransomware and DDoS attacks on healthcare, provider organizations should be on high alert.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Malicious Python packages spread BlazeStealer malware Eight new Python packages masquerading as obfuscation tools have been used to facilitate the distribution of the BlazeStealer malware since January, The Hacker News reports.Hackread reports that Microsoft Azure's Automation Service has been leveraged to create the first cryptocurrency miner that could not be detected by security systems.Indian government organizations had their Windows and Linux systems subjected to two new attack campaigns by Pakistan-linked advanced persistent threat operation SideCopy, one of which involved the exploitation of a WinRAR security vulnerability, aimed at facilitating the deployment of various remote access trojans, The Hacker News reports.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-10",
      "title": "US and South Korea accuse North Korea of using hospital ransoms to fund more hacking",
      "text": " North Korean state hackers are using a variety of ransomware strains to attack healthcare organizations and other targets globally, with the goal of pulling in money to fund other operations, the U.S. and South Korea said Thursday. Specific targets for those cyber operations include U.S. defense information networks and military contractors, according to joint advisory from the Cybersecurity and Infrastructure Security Agency (CISA), the FBI, the NSA and several South Korean defense and intelligence agencies.North Korean hackers have used both internally developed ransomware like Maui and H0lyGh0st, the agencies said, as well as other extortion malware attained by other means — such as Deadbolt, ech0raix, GonnaCry, Hidden Tear, Jigsaw, LockBit 2.0, My Little Ransomware, NxRansomware, Ryuk, and YourRansom.The agencies also said North Korean hackers have attempted to portray themselves as members of other ransomware groups like the now-shuttered REvil.They have generated multiple web domains, personas and accounts to obscure their actions, according to the agencies, which noted that the hackers are able to “procure infrastructure, IP addresses, and domains with cryptocurrency generated through illicit cybercrime, such as ransomware and cryptocurrency theft.”They also use VPNs to make it appear attacks are coming from more innocuous locations outside of North Korea. The hackers use a range of exploits for common vulnerabilities like Log4Shell and others. The agencies named three specific vulnerabilities – CVE-2021-44228, CVE-2021-20038 and CVE-2022-24990 – as ones typically used by North Korean actors. In addition to ransomware, the hackers use other customized malware to exfiltrate data, perform reconnaissance operations and steal files. “DPRK cyber actors have been observed setting ransoms in bitcoin. Actors are known to communicate with victims via Proton Mail email accounts,” the advisory said. “For private companies in the healthcare sector, actors may threaten to expose a company’s proprietary data to competitors if ransoms are not paid.”The advisory highlights a startling trend across the world as nation-states have begun deploying ransomware for a variety of reasons and purposes. Allan Liska, a ransomware expert at cybersecurity company Recorded Future, said more than 50 national governments or national government agencies have been hit by ransomware in 2022. The Record is an editorially independent unit of Recorded Future.“We’ve seen what appear to be government-backed ransomware attacks from Russia, China, Iran and North Korea. Now, North Korea has always used ransomware attacks, dating back to 2017, but they seem to have really stepped up their attacks this year, making them even more dangerous as an adversary,” he said. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-10",
      "title": "Hackers breach Reddit to steal source code and internal data",
      "text": " Reddit suffered a cyberattack Sunday evening, allowing hackers to access internal business systems and steal internal documents and source code.The company says the hackers used a phishing lure targeting Reddit employees with a landing page impersonating its intranet site. This site attempted to steal employees' credentials and two-factor authentication tokens.After one employee fell victim to the phishing attack, the threat actor was able to breach internal Reddit systems to steal data and source code.\"We show no indications of breach of our primary production systems (the parts of our stack that run Reddit and store the majority of our data).\"Reddit says they learned of the breach after the employee self-reported the incident to the company's security team.After investigating the incident, Reddit says the stolen data includes limited contact information for company contacts and current and former employees.The data also included some details about the company's advertisers but credit card information, passwords, and ad performance was not accessed.Reddit also says that there are no indications that the threat actors were able to breach production systems used to run the website.In that attack, threat actors breached Riot Games and stole source code for League of Legends (LoL) multiplayer online battle arena, the Teamfight Tactics (TFT) auto battler game, and a legacy anti-cheat platform.BleepingComputer has contacted Reddit with further questions but a reply was not immediately available."
   },
   {
      "time": "2023-02-10",
      "title": "Hacker develops new 'Screenshotter' malware to find high-value targets",
      "text": " A new threat actor tracked as TA866 targets organizations in the United States and Germany with new custom malware to perform surveillance and data theft on infected systems.The threat actor appears to have financial motivations, performing a preliminary evaluation of breached systems to determine if the target is valuable enough for further intrusion.The threat actor targets victims using phishing emails that include Microsoft Publisher (.pub) attachments with malicious macros, URLs linking to .pub files with macros, or PDFs containing URLs that download dangerous JavaScript files.Proofpoint says the number of emails sent in TA866 increased exponentially in December 2022 and continued upward in January 2023, with the emails written in English or German, depending on the target.If the recipients of these emails click on the URLs, a multi-step attack chain is triggered, resulting in the download and execution of \"Screenshotter,\" one of TA866's custom malware tools.This tool takes JPG screenshots from the victim'svictim's machine and sends them back to the threat actor'sactor's server for review.The attackers then manually examine these screenshots and decide whether the victim is of value. This evaluation may include having the Screenshotter malware snap more screenshots or dropping additional custom payloads like:Its capabilities include stealing cryptocurrency wallets, credentials, and cookies stored in web browsers, FTP clients, Steam accounts, Telegram and Discord accounts, VPN configurations, and email clients.Additionally, Rhadamanthys is also capable of stealing files from the breached system.Proofpoint says TA866 is actively involved in the attacks, checking the stolen data and sending commands to its malware during times that resemble a regular workday in the UTC+2 or UCT+3 time zone.When combined with the presence of Russian language variable names and comments in the code of the AHK Bot loader, the clues indicate that TA866 is very likely a Russian threat actor.Proofpoint has attempted to find overlaps and similarities with past reports describing similar TTPs (techniques, tactics, and procedures), but it could not make any definitive connections.However, there are signs of the AHK Bot tool being used in previous espionage campaigns.TA866 attacks are still underway, and Proofpoint warns that Active Directory profiling should be a cause of concern, as it could compromise all domain-joined hosts with information-stealing malware."
   },
   {
      "time": "2023-02-10",
      "title": "Malicious Google ads sneak AWS phishing sites into search results",
      "text": " A new phishing campaign targeting Amazon Web Services (AWS) logins is abusing Google ads to sneak phishing sites into Google Search to steal your login credentials.Initially, the threat actors linked the ad directly to the phishing page. However, at a later phase, they added a redirection step, likely to evade detection by Google’s ad fraud detection systems.The malicious Google ads take the victim to a blogger website (“us1-eat-a-w-s.blogspot[.]com”) under the attackers’ control, which is a copy of a legitimate vegan food blog. The site uses ‘window.location.replace’ to automatically redirect the victim to a new website that hosts the fake AWS login page, made to appear authentic.The victim is prompted to select if they are a root or IAM user and then enter their email address and password. This option helps the threat actors categorize the stolen data into two categories of value and utility.The phishing domains seen by Sentinel Labs are:An interesting feature of the phishing pages is that their author has included a JavaScript function to disable right clicks, middle mouse buttons, or keyboard shortcuts.Sentinel Labs says this is likely a mechanism to prevent users from navigating away from the page, either purposefully or by mistake.The security firm reports seeing Portuguese used as a language in the JavaScript code comments and variables, while the root page of the blogger domain mimics a Brazilian dessert business. Finally, the Whois details used for registering the domains point to a Brazilian person.Sentinel Labs reported the abuse to CloudFlare, which protected the phishing sites, and the internet company quickly shut down the account. However, the malicious Google Ads remain, even if the sites they link to are no longer online.Google Ads have been under massive abuse from cybercriminals of all kinds lately, serving as an alternative method to reach potential victims."
   },
   {
      "time": "2023-02-09",
      "title": "CISA Releases Recovery Script for Victims of ESXiArgs Ransomware",
      "text": " The US Cybersecurity and Infrastructure Security Agency (CISA) has released a recovery script for victims of the ESXiArgs ransomware variant that affected thousands of organizations worldwide this week.ESXiArgs has already infected more than 3,000 unpatched servers in the US, Canada, and multiple other countries. Victims have reported receiving a ransom demand of around 2 Bitcoin (or around $22,800 at press time) for the decryption key. Affected organizations have also reported the threat actor behind the campaign warning them to pay up within three days or risk having their sensitive information released publicly.In a Feb. 8 update, Rapid7 said its threat intelligence shows that multiple ransomware groups, in addition to the operator of ESXiArg, are targeting CVE-2021-21974 and other VMware ESXi vulnerabilities.\"This script does not seek to delete the encrypted config files, but instead seeks to create new config files that enable access to the VMs,\" CISA said. \"While CISA works to ensure that scripts like this one are safe and effective, this script is delivered without warranty, either implicit or explicit.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-09",
      "title": "Hackers used fake websites to target state agencies in Ukraine and Poland",
      "text": " Hackers attempted last week to infect Ukrainian government computer systems with malware hosted on fake websites impersonating legitimate state services.One of the malware variants used by this group, Aperetif, has been known to security researchers since May, and has been used to steal technical information about victims’ computers, such as about the operating system, hardware and software components, and network configuration values.The recent campaign, however, used Aperetif in a unique way: hackers distributed it through fake websites posing as Ukraine's Ministry of Foreign Affairs and Poland's Central Cybercrime Bureau. To gain access to victims' devices, the hackers sent out phishing emails to employees of Ukrainian and Polish state organizations with instructions on how to download software that scans computers for viruses after potential Russian cyberattacks.These emails contained a link to a supposedly legitimate government website where users could download software containing a malicious file. The execution of malicious files mimics the process of scanning computers for viruses, making it potentially hard for victims to detect. Hackers also placed the malicious file on a fake website rather than in an email attachment to avoid detection, the report said.  CERT-UA said the payloads allowed hackers to take screenshots of the victim's computer, scan the desktop folder for files with the specified extensions, and exfiltrate user data. A spokesperson for the agency said they could not share details about how many devices were infected or what information was stolen.This is not the first time WinterVivern has used fake websites to attack users in Ukraine and Poland. In previous campaigns, they lured victims to bogus webpages of Ukraine’s Ministry of Defense, Ukraine’s Security Service, and Polish police.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-09",
      "title": "US NIST unveils winning encryption algorithm for IoT data protection",
      "text": " The National Institute of Standards and Technology (NIST) announced that ASCON is the winning bid for the \"lightweight cryptography\" program to find the best algorithm to protect small IoT (Internet of Things) devices with limited hardware resources.Small IoT devices are becoming increasingly popular and omnipresent, used in wearable tech, \"smart home\" applications, etc. However, they are still used to store and handle sensitive personal information, such as health data, financial details, and more.That said, implementing a standard for encrypting data is crucial in securing people's data. However, the weak chips inside these devices call for an algorithm that can deliver robust encryption at very little computational power.\"These algorithms should cover most devices that have these sorts of resource constraints.\"ASCON was selected as the best of the 57 proposals submitted to NIST, several rounds of security analysis by leading cryptographers, implementation and benchmarking results, and feedback received during workshops. The whole program lasted for four years, having started in 2019.ASCON was eventually picked as the winner for being flexible, encompassing seven families, energy efficient, speedy on weak hardware, and having low overhead for short messages.NIST also considered that the algorithm had withstood the test of time, having been developed in 2014 by a team of cryptographers from Graz University of Technology, Infineon Technologies, Lamarr Security Research, and Radboud University, and winning the CAESAR cryptographic competition's \"lightweight encryption\" category in 2019.Two of ASCON's native features highlighted in NIST's announcement are AEAD (Authenticated Encryption with Associated Data) and hashing.AEAD is an encryption mode that provides confidentiality and authenticity for transmitted or stored data, combining symmetric encryption and MAC (message authentication code) to prevent unauthorized access or tampering.Hashing is a data integrity verification mechanism that creates a string of characters (hash) from unique inputs, allowing two data exchange points to validate that the encrypted message has not been tampered with.NIST still recommends the AES technique for AEAD and SHA-256 for hashing; however, these are unsuitable for smaller, weaker devices.Despite ASCON's lightweight nature, NIST says the scheme is powerful enough to offer some resistance to attacks from powerful quantum computers at its standard 128-bit nonce. However, this is not the goal or purpose of this standard, and lightweight cryptography algorithms should only be used for protecting ephemeral secrets."
   },
   {
      "time": "2023-02-09",
      "title": "Developers in China, Russia had access to Facebook user data for years, senators say  | SC Media",
      "text": "  Meta is again being called out for its dubious privacy practices, this time over allegations that “significant amounts of sensitive user data” was available for access to “hundreds of thousands of developers” from what Facebook classified as “high-risk jurisdictions,” like China and Russia.An audit of Meta’s privacy practices revealed “nearly 90,000 separate developers” in China and over 42,000 developers in Russia, and thousands of developers in other high-risk jurisdictions, including Iran and North Korea, had access to user information. The letter was sent after the company’s own investigation revealed the apparent data sharing. The internal audit was brought on after the Cambridge Analytica fallout in 2018, where a New York Times report found Facebook handed privileged API access to Huawei, OPPO, TCL, and other China-backed device makers for at least eight years.The Times report confirmed the “device manufacturers were permitted to access a wealth of information on Facebook’s users, including profile data, user IDs, photos, as well as contact information and even private messages.” The news prompted a host of lawsuits.“We were startled to learn recently, as a result of this ongoing litigation and discovery, that Facebook had concluded that a much wider range of foreign-based developers, in addition to the PRC-based device-makers, also had access to this data,” the senators wrote.In fact, Facebook’s own internal materials warned that the high-risk jurisdictions “may be governed by potentially risky data storage and disclosure rules or be more likely to house malicious actors,” including “states known to collect data for intelligence targeting and cyber espionage,” the letter continues.Warner and Rubio have “grave concerns about the extent to which this access could have enabled foreign intelligence service activity, ranging from foreign malign influence to targeting and counterintelligence activity.”Based on the unsealed documents that showed Facebook performed separate reviews on the risky developers, Zuckerberg is asked to explain the review process and conclusions, the precise percentage of the developers located in China and Russia, and “what communications, if any, has Facebook had with these developers since its initial identification.”The senators asked for logs into the frequency of the data sharing, as well as the criteria used to evaluate risk associated with operating in those countries, the exact information they had access to, and for how long. Zuckerberg is also asked to estimate just how many users were impacted this time around.Meta has consistently been in the hot seat over its data practices even before the Cambridge Analytica scandal, particularly over its handling of health data.In October, Warner issued another letter to Zuckerberg demanding: “Where required by law, does Meta always comply with any and all notification requirements when the Meta Pixel handles or transmits protected information, in the manner and time required by such laws?”The company is currently defending itself against well over 1,000 lawsuits, more than a dozen of which are tied to the Pixel tracking tool alone. But with $480.21 billion in market capital, it’s unclear just what impact, if any, these measures will incur.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.TechCrunch reports that more than a million Maine residents were confirmed by state government officials to have had their personal data compromised as part of the widespread MOVEit file transfer system hack conducted by the Cl0p ransomware operation.U.S. advanced electronic components manufacturer Kyocera AVX Components Corporation has disclosed that 39,111 individuals around the world had their data compromised following a ransomware attack earlier this year, which has been claimed by the LockBit ransomware operation, reports BleepingComputer.TechCrunch reports that two-factor authentication has been required by major U.S. genetic testing and genealogy firms 23andMe, Ancestry, and MyHeritage in the aftermath of the significant 23andMe breach, which resulted in the theft of data from more than a million of its Jewish Ashkenazi and Chinese users.On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-09",
      "title": "Malicious Dota 2 game modes infected players with malware",
      "text": " Security researchers have discovered four malicious Dota 2 game modes that were used by a threat actor to backdoor the players' systems.\"These game modes were named Overdog no annoying heroes (id 2776998052), Custom Hero Brawl (id 2780728794), and Overthrow RTZ Edition X10 XP (id 2780559339),\" Avast malware researcher Jan Vojtěšek said.The attacker also included a new file named evil.lua that was used to test server-side Lua execution capabilities. This malicious snippet could be used for logging, executing arbitrary system commands, creating coroutines, and making HTTP GET requests.The backdoor enabled the threat actor to remotely execute commands on the infected devices, potentially allowing the installation of further malware on the device.​\"This backdoor permits the execution of any JavaScript acquired through HTTP, providing the attacker the power to both conceal and modify the exploit code at their discretion without undergoing the game mode verification process, which can be dangerous, and updating the entire custom game mode,\" Vojtěšek said.On players' compromised systems, the backdoor was also used to download a Chrome exploit known to be abused in the wild.\"Since V8 was not sandboxed in Dota, the exploit on its own allowed for remote code execution against other Dota players,\" Vojtěšek added.The JavaScript exploit for CVE-2021-38003 was injected in a legitimate file that added scoreboard functionality to the game likely to make it harder to detect.Valve also took down the malicious game modes and alerted all players impacted by the attack.\"One way or another, we can say that this attack was not very large in scale. According to Valve, under 200 players were affected,\" Vojtěšek added.The cheat dev removed the features in a new version on January 21 and apologized for the chaos caused by the cheat's users. "
   },
   {
      "time": "2023-02-09",
      "title": "Toyota Global Supply Chain Portal Flaw Put Hacker in the Driver's Seat",
      "text": " [This article was updated on 2/13/2023 with an update from the researcher's report stating that the Toyota portal was created and is maintained by the automaker.]An ethical hacker found a backdoor in a Web app used by Toyota employees and suppliers for coordinating tasks related to the automaker's global supply chain, gaining control of the global system merely by knowing the email address of one of its users.Once acting as an administrator, Zveare said he had \"full access\" to internal Toyota projects, documents, and user accounts, including some of those that belonged to Toyota external partners and suppliers such as Michelin, Continental, Stanley Black & Decker, and Harman.All in all, the researcher gained read/write access to Toyota's global user directory of more than 14,000 users. Zveare also could access corporate user account details, confidential documents, projects, supplier rankings/comments, and other sensitive data related to those users, he said.Indeed, had a threat actor discovered the issue before him, \"the consequences could have been severe,\" Zveare observed.The issue could have allowed attackers to create their own user account with an elevated role to retain access should the issue ever be discovered and fixed, or download and leak all the data to which they had access, he said.They also could have deleted or modified data in a way to be disruptive to global Toyota operations, or crafted a highly targeted phishing campaign to attempt to capture \"real corporate login details, which could have exposed other Toyota systems to attacks,\" Zveare wrote.The researcher reported the issue to Toyota on Nov. 3 and the company reported back 20 days later that it had been fixed — a speedy response with which Zveare was \"impressed,\" he said.\"Out of all the security issues I have reported so far to various vendors, Toyota’s response was the fastest and most effective,\" he said.Fortunately for Toyota, the latest breach was an ethical one and, thanks to Zveare's responsible disclosure, the company could fix it before there was any impact on the company or its partners' business, notes one security professional.However, the GSPIMS API appeared to be secure, which inspired Zveare to further dig into the application code to see what else might be cooking. What he eventually found was that JSON Web Tokens — or session tokens representing the users' valid authenticated sessions on the website — were being generated based on a user's email without requiring a password.Zveare Googled for Toyota supply chain users and made an educated guess to formulate the email of someone who he thought would be a user of the GSPIMS portal. \"Then I fired off the createJWT HTTP request, and it returned a valid JWT!\" he wrote.His discovery gave him the ability to generate a valid JWT for any Toyota employee or supplier registered in GSPIMS, \"completely bypassing the various corporate login flows, which probably also enforce two-factor authentication options,\" Zveare wrote.Though the user whose email he accessed the system with did not have system administrator privileges, he eventually searched within the GSPIMS to find the email of someone who did, and using that he gained full control of the system as an administrator.Enterprises have work to do to in order to block the issue Zveare found, security experts say. For starters, security administrators must take a more holistic approach to security and realize the wider impact their overall security posture — or lack thereof — can have on all of the partners and customers with whom they do business.\"What are perceived as 'internal systems' to organizations, no longer are,\" Dror Liwer, co-founder of cybersecurity firm Coro said in an email statement to Dark Reading. \"With partners, suppliers, and employees collaborating via the Internet — all systems should be considered external, and as such, protected against malicious intrusion.\"Developing this big-picture perspective and security strategy is not so simple, as most enterprises already have their hands full managing their own company's risk, notes Lorri Janssen-Anessi, director of external cyber assessments for BlueVoyant.However, considering how easy it was for Zveare to gain access to a system that serves Toyota's global supply chain, companies need to get their heads around this risk to maintain security across any third party that touches their network, she says.\"What today's organizations should take from the reported vulnerability in Toyota's supplier management network is a firm reminder to look at their own vendor and supplier cybersecurity,\" Janssen-Anessi says.Among the key measures to consider include shoring up access control and user account privileges, ensuring that they only provide employees and third-parties with access to the data needed for their particular role, she notes. \"This helps to control what data can be accessed in the event of a breach,\" Janssen-Anessi says.Indeed, a more data-centric approach overall to security could help enterprises avoid or mitigate a scenario that Zveare demonstrated, Comforte AG's Horst observes. He advises that organizations find ways to protect data as soon as it enters their corporate data ecosystem, thus protecting \"the data itself rather than perimeters and borders around the data.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-09",
      "title": "Android 14 to block malware from abusing sensitive permissions",
      "text": " Google has announced the release of the first developer preview for Android 14, the next major version of the world's most popular mobile operating system, which comes with security and privacy enhancements, among other things.Starting with Android 14, apps will have to declare precisely how they plan to use certain phone features, data exchange between them will be limited, and additional files downloaded by apps will be read-only.A highlighted security feature in Android 14 is to block the installation of malicious apps that target older API levels (Android versions), which allows easier abuse of sensitive permissions.Starting with the \"Runtime receivers,\" which enable apps to receive intents broadcast by the system or other applications, all apps targeting Android 14 must declare if they need to receive information from other apps or if they should be limited to system \"broadcasts.\"This new security measure continues the \"Context.registerReceiver()\" feature introduced in previous Android releases. It aims to prevent malicious apps on the device from intercepting or misusing broadcasts meant to reach other apps.To further tighten up the information exchange between apps and prevent malware from gripping sensitive user data, Android 14 will also restrict the sending of \"intents\" that don't have a specified recipient.With this new security enhancement, malware can no longer intercept intents sent from other apps and read their contents.The third security feature that will land on Android 14 is \"safer dynamic code loading,\" which limits all files downloaded by an application to read-only mode.This would help prevent some code-injection scenarios involving manipulated executables that are meant to be run by privileged apps.Finally, Android 14 will block the installation of harmful apps that target SDK versions lower than 23 (Android 6.0) to achieve easier permissions abuse.\"Malware often targets older API levels to bypass security and privacy protections that have been introduced in newer Android versions,\" explains Google.\"To protect against this, starting with Android 14, apps with a targetSdkVersion lower than 23 cannot be installed.\"In Android 6.0 (2015), Google introduced a runtime permission model that required apps to request the user to grant permission access requests for sensitive operations like the device's camera, microphone, GPS sensors, phone calls, and SMS access upon the app's launch.Malware targeting previous SDK versions can specify it in the manifest XML file and request access to sensitive permissions upon installation, which is easier for users to overlook and approve.The new permissions protection system will also make it impossible for users to install apps that haven't been updated for some time. However, Google says older apps already installed on devices that upgrade to Android 14 will continue to work.Android 14 is still far from its final form, and we may see more security features land on the second developer preview in March 2023."
   },
   {
      "time": "2023-02-09",
      "title": "Money Lover for Android & iOS leaked email addresses, transactions",
      "text": " A flaw in the Money Lover financial app for Android, iOS, and Windows allowed any logged-in member to see the email addresses and live transaction metadata for other users' shared wallets.Money Lover is a finance app allowing users to manage their expenses and budgets that has been downloaded five million times on the Play Store, with the app also available for iOS and Windows.Money Lover allows users to create \"shared wallets\" with specific users, like family members or coworkers, to log transactions to collaborate in expense logging and monitoring.Users invited to a shared wallet typically know each other, so sharing data and email addresses are expected.However, Trustwave's analyst and Money Lover user, Troy Driver, found that transaction data and email addresses associated with shared wallets are exposed to any authenticated users of the app.\"The email address and shared wallet name can be viewed via the Web Sockets tab of the browser's \"Developer Tools.\" All Money Lover users who make use of the Shared Wallet feature are affected by this issue.\"The analyst discovered the information disclosure flaw while examining the app's traffic using a proxy and the Web Sockets view in the browser's Developer Tools.The exposed data included email addresses, wallet names, and limited transaction data.The analyst thought these might have been the emails of the developers of a JavaScript library. However, when the list got quickly populated with more addresses, it became clear that the app's server was leaking sensitive information.Trustwave reported the issue to the publisher of Money Lover, Finsify, who released a fixing update on January 27, 2023.The report did not clarify when the flaw was discovered or how long Money Lover users remained exposed.It is essential to clarify that the information disclosure bug only impacted users who used the shared wallet feature.The main repercussion of this flaw is that an attacker accessing email addresses and transaction metadata could perform targeted phishing attacks against the exposed users to gain access to further sensitive information.Money Lover users are recommended to update their app to the latest available version using their operating system's app store."
   },
   {
      "time": "2023-02-09",
      "title": "CERT-UA Alerts Ukrainian State Authorities of Remcos Software-Fueled Cyber Attacks",
      "text": " The mass phishing campaign has been attributed to a threat actor it tracks as UAC-0050, with the agency describing the activity as likely motivated by espionage given the toolset employed.The bogus emails that kick-start the infection sequence claim to be from Ukrainian telecom company Ukrtelecom and come bearing a decoy RAR archive. Of the two files present in the file, one is a password-protected RAR archive that's over 600MB and the other is a text file containing the password to open the RAR file.Embedded within the second RAR archive is an executable that leads to the installation of the Remcos remote access software, granting the attacker full access to commandeer compromised computers.The Italian company calls it a \"lightweight, fast and highly customizable Remote Administration Tool with a wide array of functionalities.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-02-08",
      "title": "CISA says Killnet DDoS attacks on U.S. hospitals had little effect",
      "text": " The Cybersecurity and Infrastructure Security Agency said it helped dozens of hospitals respond to a series of distributed denial-of-service (DDoS) incidents last week that were launched by a pro-Kremlin hacking group.A spokesperson for CISA told The Record that several of the incidents temporarily reduced the availability of the hospitals’ public-facing websites, but there were no reports of unauthorized access to hospital networks, disruption to health care delivery or impacts on patient safety.On their popular Telegram channel, the hackers boasted of launching DDoS attacks on hospitals in more than 25 states. Less than half of the attacks — which involved routing a deluge of page requests at hospital websites — were successful in knocking websites offline, CISA said. The agency said DDoS incidents have become a priority issue. The spokesperson added that for much of the past year, CISA has been helping organizations mitigate DDoS attacks, particularly those launched by Killnet. The agency also worked with several tech companies to provide free resources to under-funded organizations that can help them reduce the impact of DDoS attacks. CISA plans to continue working with the U.S. Department of Health and Human Services (HHS) to communicate with hospitals about government assistance and third-party services.Cybersecurity firm Cloudflare said hospitals have reached out in recent days looking for help in addressing Killnet’s DDoS campaign. Cloudflare experts said the attacks are not originating from a single botnet — a group of Internet-connected devices taken over by hackers and used to amplify DDoS attacks. Omer Yoachimik, product manager at Cloudflare, told The Record that attacks have come in several waves over the last week and so far have been relatively small, in the range of the range of 10,000 to 100,000 HTTP requests per second (rps). The largest attack on a hospital reached 1.6 million rps, with the peak lasting less than 10 seconds and the entire attack taking about six minutes. Cloudflare did not name the hospital.“That’s a large attack that would degrade services and affect application usability,” he said, adding that most sites would not be able to withstand that without a DDoS protection service.Yoachimik explained that their research into the DDoS campaign indicates that the attacks are being crowdsourced – meaning Killnet operators are reaching out to other groups and individuals that are either using multiple botnets or different attack methods. “It is likely that pro-Russian ransomware groups or operators, such as those from the defunct Conti group, will heed Killnet’s call and provide support. This likely will result in entities Killnet targeted also being hit with ransomware or DDoS attacks as a means of extortion, a tactic several ransomware groups have used,” HHS warned. Akamai’s Patrick Sullivan said attacks on Eastern Europe have skyrocketed from 1% to as high as 30% of all observed attacks on its DDoS platform in 2022.“There has been a surge in politically motivated DDoS attacks in the past year due to heightened geopolitical tensions,” he said. “Threat actors have targeted a variety of sectors, including government institutions and private companies, across Western Europe, in addition to US healthcare organizations most recently.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-08",
      "title": "First Linux variant of Clop ransomware targeted universities, colleges but was flawed",
      "text": " The first Linux variant of the Clop ransomware was rife with issues that allowed researchers to create a decryptor tool for victims.Terefos explained that the new Linux variant was mostly used to target educational institutions – including a university in Colombia – but had issues that defenders could exploit to help victims. “We discovered a flaw in the Linux version of Clop ransomware which enabled us to create a decryptor tool. We have not seen any new versions of the ransomware in the wild. However, we predict that the ransomware authors will likely attempt to fix the flaw in future versions, so organizations should take steps to protect themselves against the ransomware,” Terefos said. “We found that the Linux version of the Cl0p ransomware is in an early stage of development, suggesting that the threat actors are still manually operating and tweaking the ransomware to target specific victims. We also noticed that the ransomware had hardcoded victim-specific details, such as file paths for encryption, indicating that the threat actors had knowledge of the victim environment before launching the attack.”The researchers noted that the developers likely did not invest much time or resources into improving the obfuscation or evasiveness of the Linux version because many security systems could not detect it. The Windows version allowed the ransomware group to list out what folders and files should not be encrypted, but that functionality was not seen with the Linux version. The Linux version was used to target specific folders and all file types. “Rather than simply port the Windows version of Cl0p directly, the authors have chosen to build bespoke Linux payloads. We understand this to be the primary reason for the lack of feature parity between the new Linux version and the far more established Windows variant,” Terefos explained.“SentinelLabs expects future versions of the Linux variant to start eliminating those differences and for each updated functionality to be applied in both variants simultaneously.”The Linux version also leaves the ransom note in a .txt format while the Windows version leaves the ransom note in .rtf.In spite of the June 2021 arrests, Clop has not stopped operating and the development of a Linux version should prompt defenders to be ready for anything, Terefos said. “Ransomware groups are constantly seeking new targets and methods to maximize their profits. Being widely used in enterprise environments, Linux and cloud devices offer a rich pool of potential victims,” Terefos told The Record. “In recent years, many organizations have shifted towards cloud computing and virtualized environments, making Linux and cloud systems increasingly attractive targets for ransomware attacks. Therefore, ransomware groups targeting Linux and cloud systems is a natural progression in their quest for higher profits and easier targets.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-08",
      "title": "Florida hospital still diverting some EMS patients 5 days after cyberattack | SC Media",
      "text": "  Tallahassee Memorial Health is continuing to divert some emergency care patients five days after a reported IT security issue, despite making progress in its recovery efforts.TMH has been “proactively working to solve” the incident with support from law enforcement, which has brought some of its care services back online. Notably, the health system canceled surgeries between Thursday and Monday, but is now “performing limited surgeries and procedures.”The networks for its labor and delivery facility, as well as its connected physician practices, are operational. However, clinicians are still leveraging paper processes for registration, admission, and during care, which is causing expected delays in care. “Our teams are working around the clock in collaboration with outside consultants to investigate the cause of the event and safely restore all computer systems as quickly as possible,” according to the latest notice. But as with most healthcare security incidents, recovery is often slow-going. For some of the largest health systems, EHR downtime can last up to four weeks.But all hospital services remained open, outside of its pharmacy, outpatient imaging, and pulmonary function testing services. A website notice shows imaging and walk-in lab services remain closed. The hospital has not provided an update outside of the initial report.A successful phishing attack against a Highmark employee in December potentially compromised the data of 300,000 patients.The notice shows an employee was sent an email with a malicious link, which compromised their email account for two days between Dec. 13 and Dec. 15. Upon discovery, Highmark immediately shut down the account, reset passwords, and implemented network blocking.However, the compromise enabled the threat actor to access emails within the account, some of which contained patient data.The data varied by patient and could include names and Social Security numbers, as well as enrollment information like group names, identification numbers, claims data, treatment information, dates of service, procedures, and prescription information. For some patients, financial information, contact details, and email addresses were also compromised.Highmark is continuing to bolster its email security controls, as it provides employees with further cyber and phishing training to help prevent future attempts.Sharp Healthcare is notifying 62,777 patients of a recent website hack that potentially compromised their protected health information. Sharp Health is a nonprofit healthcare group based in San Diego.On Dec. 12, a hack was detected on a server that supports the Sharp Health website. The IT team took the affected servers offline and launched incident response protocols. The forensics later determined the activity was tied to a threat actor accessing a website server for several hours, which led to the access of a single file containing patient data. The data varied by patient and could include patient ID numbers, invoice numbers, payment amounts, and provider names. No financial data or further identifiers were compromised during the incident. Sharp Health stressed that only patients “who paid a bill or invoice using the online bill payment service between Aug. 12, 2021, and Jan. 12, 2023” were affected.”The health group has since enhanced its website security tools and is continuing to monitor its “systems to proactively identify additional safeguards.”A network hack against Cardiovascular Associates led to the theft of data for 441,640 patients tied to its Alabama care sites.First discovered on Dec. 5, a threat actor gained access to “certain systems” within the CA network. After securing the impacted systems, an investigation was launched with support from an outside forensic firm. The forensic evidence revealed the access enabled the actor to copy some personal and health data from the network for a week between Nov. 28 and Dec. 5. The stolen information could include demographic details, SSNs, health insurance information, treatment information, medical record numbers, dates of service, provider names, diagnoses, health assessment information, tests and imaging, and billing and claims data. Some passports, driver’s licenses, credit and debit card information, and other financial account details were also affected.In response to this incident, Cardiovascular Associates has added further security and monitoring enhancements to minimize the risk of a recurrent incident.Regal Medical Group, Lakeside Medical Organization, ADOC Medical Group, and Greater Covina Medical in New York was hit with a ransomware attack on Dec. 8, which led to the exfiltration of data tied to over 3.3 million patients. It's the biggest healthcare data breach reported so far this year and impacts more patients than the third-largest incident reported in 2022.The health group is known collectively as Regal, and its notice shows the cyberattack began on Dec. 1 but went undetected for one week.After experiencing “difficulty in accessing some servers,” Regal performed an extensive review that found malware on some of its servers. The subsequent investigation later found the incident was caused by a threat actor accessing and exfiltrating data from its systems.A third-party team helped the medical group with its response to the incident, including restoring access to the systems and analyzing the impacted data. The stolen data could include names, SSNs for some patients, dates of birth, contact details, diagnoses, treatments, lab test results, prescriptions, radiology reports, and health plan numbers.Regal is providing all impacted patients with a year of free credit monitoring and has since bolstered its security and protocols.A network hack deployed against Howard Memorial Hospital in December led to the exfiltration of data tied to 53,668 patients. HMH detected the hack on Dec. 4 after the actor publicly claimed to have stolen patient data from its network.An investigation confirmed the allegations and determined the threat actor first gained access on Nov. 14. Upon discovery, HMH secured the network and performed a comprehensive review to identify the potentially stolen information.But “ultimately, HMH made the decision to notify all current or former patients and employees, in an abundance of caution, due to a potential impact to their information,” according to the notice. The data possibly accessed or stolen by the attacker could include SSNs, contact details, dates of birth, health insurance information, medical record numbers, medical histories, diagnoses, treatments, and physician names.Update: This story was updated on Feb 10 to include the number of patients affected by the Regal incident, newly reported to the Department of Health and Human Services.Update 2: This story was updated on Feb. 21 to include the number of patients impacted by the Cardiovascular Associates incident as reported to HHS.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Okta had 4,961 current and former employees' data, including names, health insurance plan numbers, and Social Security numbers, compromised following a breach at its third-party vendor Rightway Healthcare, reports The Register.Threat actors using private keys and passphrases from LastPass databases stolen in cyberattacks last August and December were reported by ZachXBT and MetaMask developer Taylor Monahan to have been able to exfiltrate $4.4 million worth of cryptocurrency on Oct. 25, BleepingComputer reports.The three companies claim no sensitive customer data was lost despite being targeted after the breach of the identity and access management firm.On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-08",
      "title": "New QakNote attacks push QBot malware via Microsoft OneNote files",
      "text": " A new QBot malware campaign dubbed \"QakNote\" has been observed in the wild since last week, using malicious Microsoft OneNote' .one' attachments to infect systems with the banking trojan.Qbot (aka QakBot) is a former banking trojan that evolved into malware that specializes in gaining initial access to devices, enabling threat actors to load additional malware on the compromised machines and perform data-stealing, ransomware, or other activities across an entire network.Threat actors can embed almost any file type when creating malicious OneNote documents, including VBS attachments or LNK files. These are then executed when a user double-clicks on the embedded attachment in a OneNote Notebook.However, it is necessary to introduce social engineering to convince users to click on a particular spot to launch the embedded attachment, usually done with a 'Double Click to View File' button or some other call to action, as shown below.Once launched, the embedded attachments can execute commands on the local machine to download and install malware.This switch in QBot's distribution was first publicly reported by Cynet's researcher Max Malyutin on Twitter on January 31, 2023.A script in the HTA file will use the legitimate curl.exe application to download a DLL file (the Qbot malware) to the C:\\ProgramData folder and is then executed using Rundll32.exe.The QBot payload injects itself into the Windows Assistive Technology manager (“AtBroker.exe”) to conceal its presence and evade detection from AV tools running on the device.Sophos reports that QBot’s operators employ two distribution methods for these HTA files: one that sends emails with an embedded link to the weaponized .one file and one where the “thread injections” method is used.The latter is a particularly tricky technique where the QBot operators hijack existing email threads and send a “reply-to-all” message to its participants with a malicious OneNote Notebook file as the attachment.To make these attacks even more deceptive for the victims, the threat actors use a fake button in the Notebook file that supposedly downloads the document from the cloud, but if clicked, it instead runs the embedded HTA attachment.While this action will generate a warning dialog for the victim warning about the risks of running attachments, there's always a chance that it will be ignored.As a defense against this new attack vector, Sophos suggests that email administrators consider blocking all .one file extensions, as they are not commonly sent as attachments. "
   },
   {
      "time": "2023-02-08",
      "title": "Microsoft launches new AI chat-powered Bing and Edge browser",
      "text": " Microsoft announced on Tuesday a new version of its Bing search engine powered by a next-generation OpenAI language model more powerful than ChatGPT and specially trained for web search.\"AI will fundamentally change every software category, starting with the largest category of all – search,\" Microsoft Chairman and CEO Satya Nadella said today at a Redmond press event.\"Today, we're launching Bing and Edge powered by AI copilot and chat, to help people get more from search and the web.\"Once you reach the top of the list and are accepted, you will receive an email notification indicating that you can now access the new Bing by going to Bing.com.You can then start using it via the standard search box. The new Bing engine will also be available through the chat experience, which can be found at the top of the search user interface.\"Bing searches for relevant content across the web and then summarizes what it finds to generate a helpful response. It also cites its sources, so you're able to see links to the web content it references,\" Microsoft explains.However, the company warns that \"Bing will sometimes misrepresent the information it finds, and you may see responses that sound convincing but are incomplete, inaccurate, or inappropriate. Use your own judgment and double check the facts before making decisions or taking action based on Bing's responses.\"​The new Edge browser provides users with two new features named 'chat' and 'compose' available in the sidebar that will allow them to summarize the contents of the currently loaded page or generate content based on a prompt, respectively.This feature is currently only in the Microsoft Edge Developer channel and can be accessed by clicking on the Bing logo above the sidebar. However, it requires being part of the preview, which is slowly adding new users.Microsoft says that users can \"get ahead in the line\" by downloading the 'Microsoft Defaults' program, which sets Edge and Bing as your default browser and search engine, and by installing the Microsoft Bing app.In BleepingComputer's tests, this did not allow us to immediately get access to Bing's AI chat feature but allegedly moved us up on the waiting list.For those that can't yet access the preview, Microsoft has shared the following chat queries that you can test today to see how the new AI-powered search engine works:For example, if you ask Bing to suggest a 3-course menu, it will generate a menu using recipes from the search index. When generating the AI-chat answer, each sourced item will link to the original source.Microsoft also uses the AI model with the core Bing search-ranking engine, which, according to the company, has led to \"the largest jump in relevance in two decades,\" making searches more relevant and accurate."
   },
   {
      "time": "2023-02-08",
      "title": "Russian crypto exchange exec pleads guilty to laundering Ryuk ransomware funds",
      "text": " A Russian man pleaded guilty on Monday in an Oregon court on charges related to laundering funds for the Ryuk ransomware group. Dubnikov pleaded guilty to one count of conspiracy to commit money laundering, which according to the Department of Justice is punishable by up to 20 years in federal prison, three years’ supervised release, and a $500,000 fine. Dubnikov is specifically accused of receiving 35 Bitcoin – part of a ransom paid to threat actors by a U.S.-based company – in exchange for approximately $400,000 in July 2019. He then converted the Bitcoin into Tether coins, before sending the currency on to a co-conspirator, who converted it to Chinese yuan. James Reddick has worked as a journalist around the world, including in Lebanon and in Cambodia, where he was Deputy Managing Editor of The Phnom Penh Post. He is also a radio and podcast producer for outlets like Snap Judgment.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-08",
      "title": "DPRK Using Unpatched Zimbra Devices to Spy on Researchers",
      "text": " A recent round of compromises that exploited unpatched Zimbra devices was an effort sponsored by the North Korean government and intended to steal intelligence from a collection of public and private medical and energy sector researchers.\"The campaign targeted public and private sector research organizations, the medical research, and energy sector as well as their supply chain,\" the W Labs report added. \"The motivation of the campaign is assessed to be most likely for intelligence benefit.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-08",
      "title": "Remcos software deployed in spying attempt on Ukraine’s government, CERT says",
      "text": " In a recent phishing campaign against Ukrainian government agencies, hackers attempted to install Remcos surveillance software on victims’ computers, according to a recent alert.One of the archives attached to the email contained an executable file of more than 600MB in size. Running this file installed the Remcos program on the victim's computer. CERT-UA did not disclose which Ukrainian government services were targeted by phishing emails or whether hackers managed to successfully install the spyware. The agency pinned the effort on a group labeled UAC-0050 that has been active in Ukraine since 2020. The hackers carried out previous attacks using remote desktop software Remote Utilities, CERT-UA said.A possible goal of the group is espionage, according to CERT-UA, as its members mostly targeted Ukraine’s government services.Breaking Security openly advertises Remcos on its website, describing it as “a lightweight, fast, and highly customizable remote administration tool with a wide array of functionalities.” Users can download the free version of the software or buy the premium version for €58 ($62). This Excel file displayed a yellow security bar warning the victim about dangerous macro code. The file message lured the victim into clicking the button to bypass the warning and execute the malicious macro code, Fortinet explains.With Remcos software, hackers can steal user credentials, gain control over online accounts and deploy additional malware variants on an infected computer, researchers said.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-08",
      "title": "Over 12% of analyzed online stores expose private data, backups",
      "text": " Many online stores are exposing private backups in public folders, including internal account passwords, which can be leveraged to take over the e-commerce sites and extort owners.The study examined 2,037 stores of various sizes and found that 250 (12.3%) exposed ZIP, SQL, and TAR archives on public web folders that can be freely accessed without requiring authentication.The archives appear to be backups containing database passwords, secret administrator URLs, internal API keys, and customer PII (personally identifiable information).In the same report, Sansec explains that its analysts observe constant activity from attackers who launch automated scans trying to pinpoint these backups and perform breaches.“Exposed secrets have been used to gain control of stores, extort merchants and intercept customer payments.”Threat actors try out various combinations of possible backup names on target sites based on the site name and public DNS data, such as “/db/staging-SITENAME.zip.”Because these probes are inexpensive to run and do not affect the target store’s performance, threat actors can conduct them for entire weeks until they find a backup.Sansec reports seeing multiple source IPs for these attacks, so threat actors are well aware of the existence of exposed backups, and many of them are attempting to take advantage.If the exposed backups contain administrator details, master database passwords, or staff accounts, the attackers can use them to gain access to the site and steal data or perform destructive attacks.Sansec urges website owners to routinely check their sites for accidentally exposed data and backup.If you have exposed a website backup publicly, immediately reset admin accounts and database passwords, and enable 2FA on all staff accounts.Additionally, check the web server logs to see if the backup was downloaded by a third party, and check admin account activity logs to identify signs of external access and malicious behavior.Sansec suggests that website administrators configure the webserver to restrict access to archive files if not needed in daily operations to prevent data leaks. Additionally, those using the Adobe Commerce platform should use the “immutable storage” feature."
   },
   {
      "time": "2023-02-08",
      "title": "Medusa botnet returns as a Mirai-based variant with ransomware sting",
      "text": " A new version of the Medusa DDoS (distributed denial of service) botnet, based on Mirai code, has appeared in the wild, featuring a ransomware module and a Telnet brute-forcer.Moreover, Medusa is now promoted as a MaaS (malware-as-a-service) for DDoS or mining via a dedicated portal. It promises service stability, client anonymity, support, an easy-to-use API, and adjustable cost based on specific needs.What's particularly interesting in this new Medusa variant is a ransomware function that enables it to search all directories for valid file types for encryption. The list of target file types includes mainly documents and vector design files.Valid files are encrypted using AES 256-bit encryption, and the .medusastealer extension is appended to the encrypted files' nameHowever, the encryption method appears broken, turning the ransomware into a data wiper.After encrypting files on the device, the malware sleeps for 86,400 seconds (24 hours) and deletes all files on the system drives.Only after deleting files does it display a ransom note that asks for the payment of 0.5 BTC ($11,400), which is counter-intuitive for a successful extortion attempt.Cyble believes this is an error in the code as the destruction of system drives makes it impossible for the victims to use their systems and read the ransom note. This bug also indicates that the new Medusa variant, or at least this feature, is still in development.It's worth noting that while the new version of Medusa features a data exfiltration tool, it does not steal user files before encryption. Instead, it focuses on collecting basic system information that helps in identifying victims and estimating resources that can be used for mining and DDoS attacks.Medusa also features a brute forcer that tries out commonly used usernames and passwords against internet-connected devices. Then, if successful, it attempts to download an additional payload that Cyble hasn't been able to retrieve and analyze.Next, Medusa executes the \"zmap\" command to find other devices with Telnet services running on port 23 and then tries to connect to them using the retrieved IP addresses and a combination of usernames and passwords.Finally, upon establishing a Telnet connection, the malware infects the system with the primary Medusa payload (\"infection_medusa_stealer\").The final Medusa payload also has incomplete support for receiving the “FivemBackdoor” and “sshlogin” commands.However, the corresponding code isn’t present in the client Python file yet, which is another sign of its ongoing development."
   }
]