[
   {
      "time": "2022-07-18",
      "title": "Data of 4,000 Patients at VCU Health Exposed - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-07-18",
      "title": "Critical Infrastructure Operators Implementing Zero Trust in OT Environments - SecurityWeek",
      "text": " Hi, what are you looking for?A survey commissioned by cybersecurity company Xage shows that zero trust is on track to being implemented in many operational technology (OT) environments, particularly in critical infrastructure organizations.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.Zero trust is not a replacement for identity and access management (IAM), but is the extension of IAM principles from people to everyone and...SecurityWeek spoke with more than 300 cybersecurity experts to see what is bubbling beneath the surface, and examine how those evolving threats will present...Joanna Burkey, CISO at HP, and Kevin Cross, CISO at Dell, discuss how the role of a CISO is different for a multinational corporation...In this issue of CISO Conversations we talk to two CISOs about solving the CISO/CIO conflict by combining the roles under one person.Security professionals understand the need for resilience in their company’s security posture, but often fail to build their own psychological resilience to stress.SecurityWeek examines how a layoff-induced influx of experienced professionals into the job seeker market is affecting or might affect, the skills gap and recruitment...2022 Cybersecurity Year in Review: Top news headlines and trends that impacted the security ecosystemGot a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-18",
      "title": "Powerful 'Mantis' DDoS Botnet Hits 1,000 Organizations in One Month - SecurityWeek",
      "text": " Hi, what are you looking for?Web protection firm Cloudflare warns that a small but powerful botnet has launched distributed denial-of-service (DDoS) attacks on roughly 1,000 organizations over the past month alone.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-18",
      "title": "Cyber attack hits RI sewer-system operator Narragansett Bay Commission",
      "text": " PROVIDENCE — The Narragansett Bay Commission, which runs sewer systems in parts of the metropolitan Providence and Blackstone Valley areas, was hit by a ransomware attack on its computer systems.A spokeswoman for the commission acknowledged the attack in a Friday evening email to The Providence Journal.\"Last week, the Narragansett Bay Commission identified a cybersecurity incident that involved the encryption of data on certain computers and systems in its network,\" spokeswoman Jamie R. Samons said in the email.While she did not specify a ransomware attack, such attacks typically involve hackers encrypting data on a victim's computer system and refusing to supply the key to decode the data until a ransom is paid.Samons did not reply to a follow-up email asking whether a ransom was paid.She did note that the systems hit by the attack are not ones that control the operation of the sewage system.\"There has been no disruption to wastewater collection and treatment services,\" Samons wrote.She said that law enforcement was contacted immediately.It was unclear whether customer information was taken during the attack.\"If it is determined that anyone’s personal information was potentially subject to unauthorized access or acquisition in connection with this incident, Narragansett Bay Commission will promptly provide notice to those individuals in accordance with applicable law,\" Samons wrote. \"Notably, Narragansett Bay Commission does not store payment information or Social Security numbers for any of its customers on its systems.\"She said the commission is enhancing security measures on its systems, as well as training employees \"concerning data security.\""
   },
   {
      "time": "2022-07-18",
      "title": "North Korean Hackers Employ H0lyGh0st Ransomware to Target Businesses - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-07-18",
      "title": "Predatory Sparrow's Assault on Iran's Steel Industry - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-07-18",
      "title": "Supply Chain Attack Technique Spoofs GitHub Commit Metadata - SecurityWeek",
      "text": " Hi, what are you looking for?Security researchers at Checkmarx are warning of a new supply chain attack technique that relies on spoofed commit metadata to add legitimacy to malicious GitHub repositories.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...2022 Cybersecurity Year in Review: Top news headlines and trends that impacted the security ecosystemThe overall effect of current global geopolitical conditions is that nation states have a greater incentive to target the ICS/OT of critical industries, while...PayPal is alerting roughly 35,000 individuals that their accounts have been targeted in a credential stuffing campaign.A CSRF vulnerability in the source control management (SCM) service Kudu could be exploited to achieve remote code execution in multiple Azure services.GitHub this week announced the revocation of three certificates used for the GitHub Desktop and Atom applications.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-18",
      "title": "TikTok urged to preserve Ukraine content for war crime investigations",
      "text": " Keep abreast of significant corporate, financial and political developments around the world. Stay informed and spot emerging risks and opportunities with independent global reporting, expert commentary and analysis you can trust.Keep reading for HK$10Find the plan that suits you best.Premium access for businesses and educational institutions.International Edition"
   }
]