[
   {
      "time": "2022-08-23",
      "title": "Over 80,000 exploitable Hikvision cameras exposed online",
      "text": " Security researchers have discovered over 80,000 Hikvision cameras vulnerable to a critical command injection flaw that's easily exploitable via specially crafted messages sent to the vulnerable web server.The flaw is tracked as CVE-2021-36260 and was addressed by Hikvision via a firmware update in September 2021.However, according to a whitepaper published by CYFIRMA, tens of thousands of systems used by 2,300 organizations across 100 countries have still not applied the security update.CYFIRMA says Russian-speaking hacking forums often sell network entrance points relying on exploitable Hikvision cameras that can be used either for \"botnetting\" or lateral movement.Of an analyzed sample of 285,000 internet-facing Hikvision web servers, the cybersecurity firm found roughly 80,000 still vulnerable to exploitation.Most of these are located in China and the United States, while Vietnam, the UK, Ukraine, Thailand, South Africa, France, the Netherlands, and Romania all count above 2,000 vulnerable endpoints.While the exploitation of the flaw doesn't follow a specific pattern right now, since multiple threat actors are involved in this endeavor, CYFIRMA underlines the cases of the Chinese hacking groups APT41 and APT10, as well as Russian threat groups specializing in cyberespionage.An example they give is a cyberespionage campaign named \"think pocket,\" which has been targeting a popular connectivity product used in an array of industries across the globe since August 2021.Apart from the command injection vulnerability, there's also the issue of weak passwords that users set for convenience or that come with the device by default and aren't reset during the first set up.Bleeping Computer has spotted multiple offerings of lists, some even free, containing credentials for Hikvision camera live video feeds on clearnet hacking forums."
   },
   {
      "time": "2022-08-23",
      "title": "CISA is warning of high-severity PAN-OS DDoS flaw used in attacks",
      "text": " A recent vulnerability found in Palo Alto Networks' PAN-OS has been added to the catalog of Known Exploitable Vulnerabilities from the U.S. Cybersecurity and Infrastructure Security Agency (CISA).The security issue is a high-severity risk identified as CVE-2022-0028 that allows a remote threat actor to deploy reflected and amplified denial-of-service (DoS) attacks without having to authenticate.Several PAN-OS versions powering PA-Series, VM-Series, and CN-Series devices are vulnerable to CVE-2022-0028 and Palo Alto Networks has released patches for all of them.While exploiting the flaw can only cause a DoS condition on the affected device, it has already been used for at least one attack.According to the vendor, a threat actor exploiting the issue could hide their original IP address, making remediation a more difficult task.CISA is warning federal agencies that they should apply available fixes by September 9 and is using the following summary to describe it:A Palo Alto Networks PAN-OS URL filtering policy misconfiguration could allow a network-based attacker to conduct reflected and amplified TCP denial-of-service (RDoS) attacks.Palo Alto Networks that CVE-2022-0028 is exploitable only under certain conditions, which are not part of a common firewall configuration:"
   },
   {
      "time": "2022-08-23",
      "title": "FBI warns of residential proxies used in credential stuffing attacks",
      "text": " The Federal Bureau of Investigation (FBI) warns of a rising trend of cybercriminals using residential proxies to conduct large-scale credential stuffing attacks without being tracked, flagged, or blocked.The warning was issued as a Private Industry Notification on the Bureau's Internet Crime Complaint Center (IC3) late last week to raise awareness among internet platform admins who need to implement defenses against credential stuffing attacks.Credential stuffing is a type of attack where threat actors use large collections of username/password combinations exposed in previous data breaches to try and gain access to other online platforms.Because people commonly use the same password at every site, cybercriminals have ample opportunity to take over accounts without cracking passwords or phishing any other information.Because credential stuffing attacks carry specific characteristics that differentiate them from regular login attempts, websites can easily detect and stop them.To override basic protections, the FBI warns that threat actors are using residential proxies to hide their actual IP address behind ones commonly associated with home users, which are unlikely to be present in blocklists.Proxies are online servers that accept and forward requests, making it appear like a connection is from them rather than the actual initiator (attacker).Residential proxies are preferable over data center-hosted proxies because they make it harder for protection mechanisms to discern between suspicious and regular consumer traffic.Using these tools, cybercriminals automate credential stuffing attacks, with bots attempting to log in across numerous sites using previously stolen login credentials.Moreover, some of these proxy tools offer the option to brute-force account passwords or include \"configs\" that modify the attack to accommodate particular requirements, like having a unique character, minimum password length, etc.The FBI says credential stuffing attacks are not limited to websites and have been seen targeting mobile applications due to their poor security.\"Cyber criminals may also target a company’s mobile applications as well as the website,\" warns the FBI advisory.\"Mobile applications, which often have weaker security protocols than traditional web applications, frequently permit a higher rate of login attempts, known as checks per minute (CPMs), facilitating faster account validation.\"In a joint operation involving the FBI and the Australian Federal Police, the agencies investigated two websites that contained over 300,000 unique sets of credentials obtained through credential stuffing attacks.The FBI says these websites counted over 175,000 registered users and generated over $400,000 in sales for their services.FBI's advisory urges administrators to follow certain practices to help protect their users from losing their accounts to credential stuffing attacks, even when they use weak passwords.The key points include:Regular users can protect themselves by activating MFA on their accounts, using strong and unique passwords, and remaining vigilant against phishing attempts."
   },
   {
      "time": "2022-08-23",
      "title": "Will spyware maker NSO Group's struggles reduce use of its eavesdropping tech? Critics doubt it. | CyberScoop",
      "text": " \n\nAugust 22, 2022\n\nEmbattled Israeli spyware vendor NSO Group announced a major reorganization Sunday — replacing its longtime CEO and laying off roughly 100 of its 700 employees — but experts who track the growing trade in surveillance technology say that’s unlikely to curtail deployment of the company’s technology designed to secretly monitor its targets. “The piling discoveries of unlawful surveillance of activists, journalists and other members of civil society show a rotten mercenary spyware industry, and a moratorium of their sales is as urgent now as ever,” Guarnieri told CyberScoop. The firm “will examine all aspects of its business, including streamlining operations to ensure NSO remains one of the world’s leading high-tech cyber intelligence companies,” the company said in a statement to the Post.The company’s woes have been apparent for some time and it has limited options, said John Scott-Railton, a senior researcher with the Toronto-based Citizen Lab, one of the organizations investigating the use of NSO Group technology.“NSO’s business strategy these days seems to be: hold on and hope for an acquisition miracle, or a change of government,” Scott-Railton told CyberScoop Monday. “We’ve heard for months that they are running low on cash, and big layoffs and a shakeup seem to speak to that.”He added that he expects it will be business as usual for the NSO Group, though, because “NSO supplies problematic customers, who will keep doing bad things with the tech.”Scott-Railton is also skeptical that the company’s announced reforms will amount to much.“NSO’s short corporate history is littered with reorganizations that weren’t, diligence that wasn’t turnarounds that didn’t, and reforms that went nowhere,” he said. “I don’t see any reason this will be different.”"
   },
   {
      "time": "2022-08-23",
      "title": "Misconfigured Meta Pixel exposed healthcare data of 1.3M patients",
      "text": " U.S. healthcare provider Novant Health has disclosed a data breach impacting 1,362,296 individuals who have had their sensitive information mistakenly collected by the Meta Pixel ad tracking script.Meta Pixel (formerly Facebook Pixel) is a JavaScript tracking script that Facebook advertisers can add to their site to track advertising performance.The unauthorized patient data access and disclosure began in May 2020, when Novant ran promotional campaigns for COVID-19 vaccination, which involved Facebook advertisements.To track these advertisements, the healthcare company added the Meta Pixel code to their site to measure how well the advertisements worked.As explained in a statement published late last week, Meta pixel was misconfigured on Novant Health's site and the 'MyChart' portal, transmitting privacy information to Meta and its advertising partners.The information that may have been exposed through Meta Pixel includes the following:Unfortunately, this means that even those who haven't used Novant's services directly might still have been exposed due to the tracker's misconfiguration.Novant finally removed Meta pixel from its sites and portal in May 2022, when its I.T. teams realized the mistake, so the exposure lasted for two years.The firm says it has determined the impacted individuals after a lengthy investigation that was concluded on June 17, 2022, so only those who received notices may consider themselves breached.Novant says it has reached out to Meta several times to delete the healthcare data but did not receive a response.\"We reached out to Meta Facebook several times and through different channels, but never got a response,\" Novan Health concludes in their advisory.Bleeping Computer has contacted Facebook for a comment on the above, and we will update this piece as soon as we hear back.While the lawsuit listed two healthcare service providers in the defendants' section, the outline involved many hospitals in the country following similar illegal tracking practices.Considering the delay in discovering the misconfiguration, it's possible that the investigation was launched in response to the news of the legal action.Distributing notices of a breach doesn't mitigate the consequences of the incident. However, it may help reduce the chances of facing legal action on similar grounds as those against UCSF Medical Center and the Dignity Health Medical Foundation."
   },
   {
      "time": "2022-08-23",
      "title": "Greek natural gas operator suffers ransomware-related data breach",
      "text": " Greece's largest natural gas distributor DESFA confirmed on Saturday that they suffered a limited scope data breach and IT system outage following a cyberattack.However, some files and data were accessed and possibly \"leaked,\" so there was a network intrusion, even if limited.DESFA deactivated many of its online services to protect client data. However, these services will gradually return to normal operations as experts work towards a careful restoration.DESFA assures its consumers that this incident won't impact the gas supply and that all input and output points operate at normal capacity.The company states it has informed the police's cybercrime department, the national data protection office, the national defense department, and the ministry of energy and environment to help resolve the matter at minimal time and consequence.Finally, DESFA declares an unwavering stance against communicating with cyber criminals, so there will be no negotiation of a ransom payment.The threat actors posted a list of allegedly stolen data on their data leak/extortion portal and a small set of stolen files that don't appear to include classified information.Moreover, Ragnar Locker says they've found multiple security vulnerabilities on DESFA's systems and informed them of the fact, likely as part of their extortion attempt. However, the threat actors allegedly did not respond to them.The ransomware actors threaten to publish all files corresponding to the file tree if the victimized organization doesn't meet their demands.This attack comes at a tough time for gas suppliers in Europe, as all countries in the continent decided to abruptly cut their dependence on Russian natural gas, which inevitably created problems."
   },
   {
      "time": "2022-08-23",
      "title": "LockBit ransomware blames Entrust for DDoS attacks on leak sites",
      "text": " The LockBit ransomware operation's data leak sites have been shut down over the weekend due to a DDoS attack telling them to remove Entrust's allegedly stolen data.This leak consisted of 30 screenshots of data allegedly stolen from Entrust, including legal documents, marketing spreadsheets, and accounting data.Soon after they started leaking data, researchers began reporting that the ransomware gang's Tor data leak sites were unavailable due to a DDoS attack.Yesterday, security research group VX-Underground learned from LockBitSupp, the public-facing representative of the LockBit ransomware operation, that their Tor sites were under attack by someone they believed to be connected to Entrust.\"Ddos attack began immediately after the publication of data and negotiations, of course it was them, who else needs it? In addition, in the logs there is an inscription demanding the removal of their data,\" LockBitSupp told BleepingComputer in response to the questions about the attack.As you can see from these HTTPS requests, the attacker added a message to LockBit in the browser user agent field telling them to delete Entrust's data.In retaliation to the attack, LockBit's data leak sites now show a message warning that the ransomware gang plans to upload all of Entrust's data as a torrent, which will make it almost impossible to take down.\"The last ones to do this were the Accenture, but they were not very good at it, the Entrust were much more successful at it,\" explained LockBitSupp.BleepingComputer has been unable to confirm if this statement is true.The ALPHV ransomware operation's data leak sites were also down this weekend in what is believed to be a DDoS attack. However, it is not known if the two attacks are related.BleepingComputer has contacted Entrust to ask if they were responsible for the DDoS attack on LockBitSupp but did not receive a reply. So, at this point, it is unclear if Entrust, an affiliated cybersecurity company, or simply a rival threat actor is taking advantage of the situation by conducting the attacks.Security researchers are unsure who is attacking LockBit, with some saying that it would be unprecedented for a cybersecurity company to conduct attacks like these.\"I believe this is somehow backed by Entrust at the moment but not another group attacking both. The only group with an interest in attacking both would be the feds or gov entities,\" security researcher Dominic Alvieri told BleepingComputer.While we will likely never know who is behind these attacks, it has shown how effective attacks like this can be in disrupting a ransomware gang's operations.Whether victims, cybersecurity companies, or even governments may adopt such tactics in the future (if not already doing so) remains to be seen."
   },
   {
      "time": "2022-08-23",
      "title": "Researchers Find Counterfeit Phones with Backdoor to Hack WhatsApp Accounts",
      "text": " Budget Android device models that are counterfeit versions associated with popular smartphone brands are harboring multiple trojans designed to target WhatsApp and WhatsApp Business messaging apps.The malware, which Doctor Web first came across in July 2022, were discovered in the system partition of at least four different smartphones: P48pro, radmi note 8, Note30u, and Mate40, was \"Moreover, instead of having one of the latest OS versions installed on them with the corresponding information displayed in the device details (for example, Android 10), they had the long outdated 4.4.2 version.\"\"The danger of the discovered backdoors and the modules they download is that they operate in such a way that they actually become part of the targeted apps,\" the researchers said.\"As a result, they gain access to the attacked apps' files and can read chats, send spam, intercept and listen to phone calls, and execute other malicious actions, depending on the functionality of the downloaded modules.\"To avoid the risk of becoming a victim of such malware attacks, it's recommended that users purchase mobile devices only from official stores and legitimate distributors.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-08-23",
      "title": "Textile Company Sferra Discloses Data Breach - SecurityWeek",
      "text": " Hi, what are you looking for?Textile company Sferra Fine Linens on Friday announced that it has started notifying individuals of a cybersecurity incident involving their personal information.Founded in 1891, Sferra designs and sells Italian-made luxury linen products, including luxury sheets, table linens, and bedding collections, as well as decorative home accessories.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-08-23",
      "title": "RTLS Systems Found Vulnerable to MiTM Attacks and Location Tampering",
      "text": " RTLS is used to automatically identify and track the location of objects or people in real-time, usually within a confined indoor area. This is achieved by making use of tags that are attached to assets, which broadcast USB signals to fixed reference points called anchors that then determine their location.Put simply, the idea is to estimate the anchor coordinates and use it to manipulate the geofencing rules of the RTLS system, effectively tricking the software into granting access to restricted areas and even causing disruption to production environments.\"If an attacker is able to alter the position of a tag by modifying the positioning packet related to that tag, it may become possible to enter restricted zones or steal valuable items without the operators being able to detect that a malicious activity is ongoing.\"Even worse, by altering the position of tags and placing them inside areas monitored by geofencing rules, an adversary can cause the stoppage of entire production lines by showing that a worker is nearby even when no one is actually around.In an alternate scenario, the location data could be tampered to place a worker outside of a geofencing zone so that dangerous machinery would restart while a worker is in close proximity, posing severe safety risks.But it's worth pointing out that doing so necessitates that an attacker either compromises a computer connected to that network, or surreptitiously adds a rogue device to gain unauthorized access to the network.To remediate such threats, it's recommended to enforce network segregation and add a traffic encryption layer on top of the existing communications to prevent AitM attacks.\"Weak security requirements in critical software can lead to safety issues that cannot be ignored,\" researchers Andrea Palanca, Luca Cremona, and Roya Gordon said. \"Exploiting secondary communications in UWB RTLS can be challenging, but it is doable.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]