[
   {
      "time": "2022-09-08",
      "title": "NSA official: \\'Open society\\' keeps US ahead on cybersecurity, technology",
      "text": " The National Security Agency’s No. 2 official said Wednesday that the U.S. still outpaces foreign adversaries when it comes to cybersecurity and technology thanks to the country’s “open society.” “The grist of that is innovation. Innovation sparks creativity and solutions. That puts us ahead and it's not just in our technology, but it's in our processes, the way we attack problems,” he added. “People in the U.S. and within many of our nations that we partner with, they go with the art of the possible. They don't look at it through the lens of autocratic control and so that generates different outcomes that are much more relevant and they're speedy.”Barnes specifically called out China, which has invested significantly in cutting-edge technologies like supercomputing and advanced analytics.“The scale of their pursuits are daunting, are scary,” he told the audience. “But I still don't think they can replicate the way we bring magic together between people with technology and the things that have always generated the bleeding edge technologies. I'll just say, here in the U.S., that continues, and that's the thing we have to pursue, because that's what differentiates us.”Barnes, who has held his current role at NSA since 2017, said that the country has not approached developing technology from the standpoint of “being paranoid about its misuse and misapplication.”“Our society doesn't operate that way and for good reason. We have an open society, which is our strength, but that makes us more vulnerable to those who would want to penetrate us and subvert our interests,” according to Barnes. “And so the thing that keeps me up at night is the lack of preparedness that we have to have as a society to keep bad things at bay.”Martin Matishak is a senior cybersecurity reporter for The Record. He spent the last five years at Politico, where he covered Congress, the Pentagon and the U.S. intelligence community and was a driving force behind the publication's cybersecurity newsletter.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-08",
      "title": "HP fixes severe bug in pre-installed Support Assistant tool",
      "text": " HP issued a security advisory alerting users about a newly discovered vulnerability in HP Support Assistant, a software tool that comes pre-installed on all HP laptops and desktop computers, including the Omen sub-brand.HP Support Assistant is used to troubleshoot issues, perform hardware diagnostic tests, dive deeper into technical specifications, and even check for BIOS and driver updates on HP devices.The flaw, discovered by researchers at Secure D and reported to HP, is tracked as CVE-2022-38395 and has a \"high\" severity score of 8.2, as it enables attackers to elevate their privileges on vulnerable systems.DLL hijacking happens when a malicious actor places a DLL containing malicious code in the same folder as the abused executable, exploiting Windows' logic to prioritize those libraries against DLLs in the System32 directory.The code that executes by loading the library assumes the privileges of the abused executable, in this case, HP Support Assistant running with 'SYSTEM' privileges.Hence, CVE-2022-38395 can be exploited by attackers who have already established their presence on a system via low-privileged malware or a RAT tool.Still, due to the large number of devices with HP Support Assistant installed and the low complexity of exploitation, it is recommended that all HP users upgrade Support Assistant as soon as possible.HP recommends that customers using version 9.x to update to the latest version of the Support Assistant via the Microsoft Store.Those using the older version 8.x won't receive a security update, so they are advised to move to the newer branch. To do that, open the software, go to the \"About\" section, and click \"check for updates.\"This is not the first time HP's pre-installed self-help tools create security risks for users and not even the first time for Support Assistant in particular.Considering the above, if you don't need or use your computer vendor's bloatware, deleting these tools would remove all associated risks."
   },
   {
      "time": "2022-09-08",
      "title": "Inglis: Hundreds of gov’t, business orgs consulted for national cyber strategy",
      "text": " National Cyber Director Chris Inglis said on Wednesday his office is hard at work on a new national cybersecurity strategy and has already gotten feedback on the document from more than 300 organizations within the U.S. government and private sector.Speaking at the Billington Cybersecurity Summit in Washington, D.C., Inglis told the audience that the White House has been collaborating on the effort with the National Security Council, the Cybersecurity and Infrastructure Security Agency, FBI and a “broad range of federal agencies and departments.”“It will talk about cyber in the context of why we care about it, not for its own sake but so that we can do the functions dependent upon that, be they personal, business, national security or perhaps societal aspirations,” he told the audience.The document will also outline the costs and investments required to deliver “resilience by design.” “We have to be willing to pay the cost necessary to have confidence in this space, in the same way we have done for other systems of interest. We might not draw specific analogies to the transportation system or the drug and therapeutic systems that we benefit from, but those are great analogies to lift and shift into this space,” he said. “We at some point came to understand how critical they were to our daily life and the critical functions, the health and safety that we want to have in our lives. We therefore were prepared to make the investments and what then resulted was something that was a shared responsibility, not the responsibility of one party alone.”Sullivan told agencies in a memo that it will focus \"on cybersecurity here at home, while reflecting international dependencies.” Deputy National Cyber Director for Strategy and Budget Rob Knake has led the effort alongside Harry Krejsa, acting assistant national cyber director for strategy and research, and Matthew Ferren, cyber policy adviser for ONCD, according to CyberScoop.I am also thrilled to have Neal Higgins and Rob Knake on board. They have already proven to be invaluable members of our senior leadership, and I am grateful for their service.On Wednesday, Inglis stressed that the national cybersecurity strategy is a team effort involving dozens of stakeholders inside and outside of his office.  “I think those are the things you’ll see in our, and I mean that in the biggest possible sense, national cybersecurity strategy,” he said. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-08",
      "title": "Sprawling, multi-year Iranian cyberespionage and surveillance group exposed in new report | CyberScoop",
      "text": " \n\nSeptember 7, 2022\n\nIran’s Islamic Revolutionary Guard Corps Intelligence Organization has, since at least 2015, run a sprawling cyberespionage and surveillance operation against people and organizations of interest to the Iranian government, including within the U.S., researchers with cybersecurity firm Mandiant said Wednesday.The cyber activity in support of those operations is perhaps most concerning about APT 42’s work, Mandiant Vice President of Intelligence John Hultquist told CyberScoop ahead of the report’s release.“The agency behind these actors is very dangerous,” Hultquist said. “When we talk about cybersecurity, and who we’re protecting and what we’re protecting, there aren’t many risks that are more serious than somebody’s life being in danger that we deal with. And that’s definitely what could be on the table here.” APT 42 targeting patterns focus largely on the Middle East region, the researchers said, but what distinguishes APT 42 activity is the targeting of “organizations and individuals deemed opponents or enemies of the regime, specifically gaining access to their personal accounts and mobile devices. The group has consistently targeted Western think tanks, researchers, journalists, current Western government officials, former Iranian government officials, and the Iranian diaspora abroad.”APT 42 also supports broader Iranian intelligence needs, the analysis concludes, such as targeting the pharmeceutical sector at the onset of the COVID-19 pandemic in March 2020, and pursuing domestic and foreign-based opposition groups prior to recent Iranian presidential elections. “This indicates that APT42 is trusted by the Iranian government to quickly react to geopolitical changes by adjusting their flexible operations to targets of operational interest to Tehran,” the researchers said.APT 42 remains “a threat to foreign policy officials, commentators, and journalists, particularly those in the United States, the United Kingdom, and Israel, working on Iran-related projects,” the researchers said. “Additionally, the group’s surveillance activity highlights the real-world risk to individual targets of APT42 operations, which include Iranian dual-nationals, former government officials, and dissidents both inside Iran and those who previously left the country, often out of fear for their personal safety.”"
   },
   {
      "time": "2022-09-08",
      "title": "Google: Conti repurposing tools for Ukraine attacks using Follina bug, Musk impersonation",
      "text": " Google noted that Ukrainian cybersecurity experts from CERT-UA tracked the group as UAC-0098 and said they are tied to at least five different campaigns conducted from April to August 2022.“UAC-0098 is a threat actor that historically delivered the IcedID banking trojan, leading to human-operated ransomware attacks. The attacker has recently shifted their focus to targeting Ukrainian organizations, the Ukrainian government, and European humanitarian and non-profit organizations,” Google security researchers said on Wednesday. “TAG assesses UAC-0098 acted as an initial access broker for various ransomware groups including Quantum and Conti, a Russian cybercrime gang known as FIN12/WIZARD SPIDER.”TAG began tracking UAC-0098 after uncovering a phishing campaign in April that tried to spread a tool that provided backdoor access to systems. The tool — named AnchorMail — was developed by the Conti group, according to TAG. The report notes that the campaign “stood out because it appeared to be both financially and politically motivated” due to how experimental it was and because it went after Ukrainian organizations.From April to mid-June, Google tracked a campaign from the group that repeatedly targeted Ukrainian hotels.A May 11 attack on Ukrainian organizations working in the hospitality industry involved phishing emails purporting to be from the National Cyber Police of Ukraine.The emails urged victims to click on a malicious link as a way to download updates for their operating system. Six days later, the same group took over a compromised email account of a hotel in India and began sending phishing emails with malicious ZIP archives to organizations working in the hospitality industry in Ukraine.TAG found that the same compromised Indian hotel email account was used to attack NGOs in Italy.By May 19, the group pivoted again, using a different tactic to get people to click on malicious links. The phishing emails purported to be from representatives of Starlink — the satellite internet subsidiary of Elon Musk’s rocket company SpaceX. Ukrainian organizations operating in the technology, retail and government sectors were then hit with a similar attack on May 23. One day later, the Academy of Ukrainian Press was targeted with phishing emails containing dropbox links to malicious documents. “On June 19, TAG disrupted a campaign with more than 10,000 spam emails impersonating the State Tax Service of Ukraine. The emails had an attached ZIP file containing a malicious RTF file,” Google researchers explained.The report includes a copy of one of the fake emails, which claim to come from the State Tax Service of Ukraine and urge people to open a malicious document related to paying taxes. TAG researchers said UAC-0098 activities are an example of how the lines between financially motivated cyberattacks and government-supported hacks are blurring. “Rather uniquely, the group demonstrates strong interest in breaching businesses operating in the hospitality industry of Ukraine, going as far as launching multiple distinct campaigns against the same hotel chains. So far, TAG has not identified what post-exploitation actions UAC-0098 takes following a successful compromise,” the researchers said. The State Department also highlighted the group’s ties to Russia — Conti pledged support to the Russian government following its invasion of Ukraine in February “and threatened critical infrastructure organizations of countries perceived to carry out cyberattacks or war against the Russian government,” the U.S. State Department said.Emsisoft Threat Analyst Brett Callow, a ransomware expert tracking the various criminal groups behind attacks, told The Record that given Conti’s previous threatens of retaliatory attacks on U.S. critical infrastructure in the event of the U.S. attacking Russia after its invasion of Ukraine, “it wouldn’t be at all surprising if some of the Conti team were targeting Ukraine.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-08",
      "title": "200,000 North Face accounts hacked in credential stuffing attack",
      "text": " Outdoor apparel brand 'The North Face' was targeted in a large-scale credential stuffing attack that has resulted in the hacking of 194,905 accounts on the thenorthface.com website.The success of these attacks relies on the practice of password recycling, where a person uses the same credentials across multiple online platforms.The credential stuffing attack on The North Face website began on July 26, 2022, but the website's administrators detected the unusual activity on August 11, 2022, and were able to stop it on August 19, 2022.After investigating the attack, North Face determined that the attackers managed to breach close to 200,000 accounts using valid credentials, potentially accessing the following customer information:Payment details like credit card data are not stored on the website, so the attackers could not access sensitive financial information.\"We do not keep a copy of payment card details on thenorthface.com. We only retain a \"token\" linked to your payment card, and only our third-party payment card processor keeps payment card details,\" explains the firm in the breach notification.\"The token cannot be used to initiate a purchase anywhere other than on thenorthface.com.\"Additionally, all user passwords have been reset, and all payment card tokens on accounts accessed by unauthorized intruders were wiped.Hence, impacted customers with an account on the website will have to enter a new password and re-enter their payment card details to make a purchase.Of course, affected users are expected to pick a unique, strong (long) password and avoid the comfort of recycling credentials.Also, if the customers use the same passwords on other online platforms, those should be changed immediately to avoid additional compromises.VF Corporation owns several successful brands besides The North Face, like Vans, Timberland, Eastpak, Kipling, Dickies, and Napapijri. However, those don't appear to have been impacted by this or similar attacks."
   },
   {
      "time": "2022-09-08",
      "title": "Ransomware gang's Cobalt Strike servers DDoSed with anti-Russia messages",
      "text": " Someone is flooding Cobalt Strike servers operated by former members of the Conti ransomware gang with anti-Russian messages to disrupt their activity.However, former Conti members continue to use the same Cobalt Strike infrastructure to conduct new attacks under other ransomware operations.Someone is now tracking the TeamServers (C2) used by ransomware actors to control the Cobalt Strike (CS) Beacon payloads on compromised hosts (clients), which allow lateral movement on the network.When flooding the CS servers, these people are using the username “Stop Putin!” on multiple computers and changing their computer name to various messages, such as “Stop the war!,” “15000+ dead Russian soldiers!,” and “Be a Russian patriot!”The researcher says that the messages are flooding the servers at a high rate of about two every second.As an effect of this large number of pings, TeamServer’s Java application is overloaded and activity is disrupted in a similar way a denial-of-service (DoS) condition would.Running Cobalt Strike TeamServer from a Java application was possible in versions of the toolkit up to 4.6, released this year in April. In more recent releases, the component runs from an executable image (TeamServerImage).Disrupting ransomware gangs’ activity with denial-of-service has happened before, the LockBit operation being a recent target, allegedly for encrypting systems belonging to digital security company Entrust.The hackers blamed the DDoS on Entrust since the HTTPS requests came with the message to delete the company’s data.However, the disruption was temporary and the ransomware actor came online with stronger infrastructure allowing them to keep the stolen data available even when facing distributed denial-of-service (DDoS) attacks."
   },
   {
      "time": "2022-09-08",
      "title": "Albania blames Iran for July cyberattack, severs diplomatic ties",
      "text": " Albanian Prime Minister Edi Rama announced on Wednesday that the entire staff of the Embassy of the Islamic Republic of Iran was asked to leave within 24 hours.\"This extreme response, one that is unwanted but totally forced on us, is fully proportionate to the gravity and risk of the cyberattack that threatened to paralyse public services, erase digital systems and hack into State records, steal Government intranet electronic communication and stir chaos and insecurity in the country.\"The United States government also formally blamed Iran for attacking Albania in July and said the country would be held accountable for threatening the security of a NATO ally.\"We have concluded that the Government of Iran conducted this reckless and irresponsible cyberattack and that it is responsible for subsequent hack and leak operations.\"The United States will take further action to hold Iran accountable for actions that threaten the security of a U.S. ally and set a troubling precedent for cyberspace.\"\"You know, we've seen how cyber threats, including ransomware attacks, increasingly are able to cause damage and disruption to the real world,\" Biden said.\"I can't guarantee this, and you're as informed as I am, but I think it's more likely we're going to end up — well, if we end up in a war, a real shooting war with a major power, it's going to be as a consequence of a cyber breach of great consequence.\"Biden's remarks came one month after a NATO statement issued in mid-June saying that cyberattacks are comparable to \"armed attacks\" in some circumstances.\"Allies recognise that the impact of significant malicious cumulative cyber activities might, in certain circumstances, be considered as amounting to an armed attack.\""
   },
   {
      "time": "2022-09-08",
      "title": "Shikitega - New stealthy malware targeting Linux",
      "text": " Powered byAT&T Alien LabsAT&T Alien Labs has discovered a new malware targeting endpoints and IoT devices that are running Linux operating systems. Shikitega is delivered in a multistage infection chain where each module responds to a part of the payload and downloads and executes the next one. An attacker can gain full control of the system, in addition to the cryptocurrency miner that will be executed and set to persist.Figure 1. Shikitega operation process.Shikitega uses an infection chain in multiple layers, where the first one contains only a few hundred bytes, and each module is responsible for a specific task, from downloading and executing Metasploit meterpreter, exploiting Linux vulnerabilities, setting persistence in the infected machine to downloading and executing a cryptominer.The main dropper of the malware is a very small ELF file, where its total size is around only 370 bytes, while its actual code size is around 300 bytes. (figure 2)Figure 2. Malicious ELF file with a total of only 376 bytes.Figure 3. First “Shikata Ga Nai” decryption loop.Figure 4. Second “Shikata Ga Nai” decryption loop created by the first one.After several decryption loops, the final payload shellcode will be decrypted and executed. As the malware does not use any imports, it uses ‘int 0x80’ to execute the appropriate syscall. As the main dropper code is very small, the malware will download and execute additional commands from its command and control by calling 102 syscall (sys_socketcall). (Figure 5)Figure 5. Calling system functions using interruptsThe C&C will respond with additional shell commands to execute, as seen in the packet capture in figure 6. The first bytes marked in blue are the shell commands that the malware will execute.Figure 6. Additional commands received from C&C.The received command will download additional files from the server that won’t be stored in the hard drive, but rather will be executed from memory only. (Figure 7)Figure 7. Executes additional shell code received from C&C.In other malware versions, it will use the “execve” syscall to execute ‘/bin/sh’ with command received from the C&C. (figure 8)Figure 8. Executing shell commands by using syscall_execve.In addition the malware will use wget to download and execute the next stage dropper.The next downloaded and executed file is an additional small ELF file (around 1kb) encoded with the “Shikata Ga Nai” encoder. The malware decrypts a shell command that will be executed by calling syscall_execve with ‘/bin/sh” as a parameter with the decrypted shell. (Figure 9)Figure 9. Second stage dropper decrypts and executes shell commands.Figure 10. Exploiting Linux vulnerability CVE-2021-3493.Figure 11. Exploiting CVE-2021-4034 vulnerability.The malware will leverage the exploit to download and execute the final stage with root privileges - persistence and cryptominer payload.To achieve persistence, the malware will download and execute a total of 5 shell scripts. It persists in the system by setting 4 crontabs, two for the current logged in user and the other two for the user root. It will first check if the crontab command exists on the machine, and if not, the malware will install it and start the crontab service.Figure 12. Adding root crontab to execute the final payload.Below is the list of downloaded and executed script to achieve persistence:script namedetailsunix.shCheck if “crontab” commands exist in the system, if not install it and start the crontab service.brict.shAdds crontab for current user to execute cryptominer.politrict.shAdds root crontab to execute cryptominer.truct.shAdds crontab for current user to download cryptominer and config from C&C.restrict.shAdds root crontab to download cryptominer and config from C&C. As the malware persists with crontabs, it will delete all downloaded files from the system to hide its presence.The malware downloads and executes XMRig miner, a popular miner for the Monero cryptocurrency. It will also set a crontab to download and execute the crypto miner and config from the C&C as mentioned in the persistence part above.Figure 13. XMRig miner is downloaded and executed on an infected machine.Figure 14. Command and control server hosted on a legitimate cloud hosting service.Threat actors continue to search for ways to deliver malware in new ways to stay under the radar and avoid detection. Shiketega malware is delivered in a sophisticated way, it uses a polymorphic encoder, and it gradually delivers its payload where each step reveals only part of the total payload. In addition, the malware abuses known hosting services to host its command and control servers. Stay safe!The following technical indicators are associated with the reported intelligence. A list of indicators is also available in the OTX Pulse. Please note, the pulse may include other activities related but out of the scope of the report.TYPEINDICATORDESCRIPTIONDOMAINdash[.]cloudflare.ovhCommand and controlDOMAINmain[.]cloudfronts.netCommand and controlSHA256b9db845097bbf1d2e3b2c0a4a7ca93b0dc80a8c9e8dbbc3d09ef77590c13d331Malware hashSHA2560233dcf6417ab33b48e7b54878893800d268b9b6e5ca6ad852693174226e3bedMalware hashSHA256f7f105c0c669771daa6b469de9f99596647759d9dd16d0620be90005992128ebMalware hashSHA2568462d0d14c4186978715ad5fa90cbb679c8ff7995bcefa6f9e11b16e5ad63732Malware hashSHA256d318e9f2086c3cf2a258e275f9c63929b4560744a504ced68622b2e0b3f56374Malware hashSHA256fc97a8992fa2fe3fd98afddcd03f2fc8f1502dd679a32d1348a9ed5b208c4765Malware hashSHA256e4a58509fea52a4917007b1cd1a87050b0109b50210c5d00e08ece1871af084dMalware hashSHA256cbdd24ff70a363c1ec89708367e141ea2c141479cc4e3881dcd989eec859135dMalware hashSHA256d5bd2b6b86ce14fbad5442a0211d4cb1d56b6c75f0b3d78ad8b8dd82483ff4f8Malware hashSHA25629aafbfd93c96b37866a89841752f29b55badba386840355b682b1853efafcb8Malware hashSHA2564ed78c4e90ca692f05189b80ce150f6337d237aaa846e0adf7d8097fcebacfe7Malware hashSHA256130888cb6930500cf65fc43522e2836d21529cab9291c8073873ad7a90c1fbc5Malware hashSHA2563ce8dfaedb3e87b2f0ad59e1c47b9b6791b99796d38edc3a72286f4b4e5dc098Malware hashSHA2566b514e9a30cbb4d6691dd0ebdeec73762a488884eb0f67f8594e07d356e3d275Malware hashSHA2567c70716a66db674e56f6e791fb73f6ce62ca1ddd8b8a51c74fc7a4ae6ad1b3adMalware hashSHA2562b305939d1069c7490b3539e2855ed7538c1a83eb2baca53e50e7ce1b3a165abMalware hash CVE-2021-3493SHA2564dcae1bddfc3e2cb98eae84e86fb58ec14ea6ef00778ac5974c4ec526d3da31fMalware hash CVE-2021-4034SHA256e8e90f02705ecec9e73e3016b8b8fe915873ed0add87923bf4840831f807a4b4Malware hashSHA25664a31abd82af27487985a0c0f47946295b125e6d128819d1cbd0f6b62a95d6c4Malware shell scriptSHA256623e7ad399c10f0025fba333a170887d0107bead29b60b07f5e93d26c9124955Malware shell scriptSHA25659f0b03a9ccf8402e6392e07af29e2cfa1f08c0fc862825408dea6d00e3d91afMalware shell scriptSHA2569ca4fbfa2018fe334ca8f6519f1305c7fbe795af9eb62e9f58f09e858aab7338Malware shell scriptSHA25605727581a43c61c5b71d959d0390d31985d7e3530c998194670a8d60e953e464Malware shell scriptSHA256ea7d79f0ddb431684f63a901afc596af24898555200fc14cc2616e42ab95ea5dMalware hashINSIGHTS REPORTSELF ASSESSMENT© Copyright 2023"
   },
   {
      "time": "2022-09-08",
      "title": "DangerousSavanna: Two-year long campaign targets financial institutions in French-speaking Africa - Check Point Research",
      "text": " Figure 1 – Locations of targeted financial services employees, all in French-speaking African countries. The infection starts with spear-phishing emails written in French, usually sent to several employees of the targeted companies, all of which are medium to large financial groups in French-speaking Africa. In the early stages of the campaign, the phishing emails were sent using Gmail and Hotmail services. To increase their credibility, the actors began to use lookalike domains, impersonating other financial institutions in Africa such as the Tunisian Foreign bank, Nedbank, and others. For the last year, the actors also used spoofed email addresses of a local insurance advisory company whose domain doesn’t have an SPF record.Figure 2 – An example of a phishing email in which the actors used the name of an existing employee at the impersonated company.Figure 3 – Overview of the changes in the DangerousSavanna infection chains, infrastructure and payloads. Since 2021, the actors have been attaching malicious documents to their phishing emails. These documents are either Word documents with macros, documents with a remote template (or, in some cases a few layers of external templates), or PDF documents, which lure the victim to download and then manually execute the next stage. All these documents, both MS Office or PDF, are written in the French language and share similar metadata such as the usernames digger, hooper davis, and HooperDEV.Figure 4 – Overview of the lure documents used in the campaign.The basic flow utilizes Word documents with macros, which drop an LNK file in the Startup folder. When the LNK file is executed, it downloads from the server and executes PowerShell commands, which perform AMSI bypass and eventually install the PoshC2 implant.Figure 5 – Phishing document with macro – infection flow.The macros contain a lot of unused code to complicate its analysis. The code for the main functionality is trivial, containing only reverse string obfuscation and caret obfuscation to create the LNK file used to retrieve the PoshC2 implant:During this campaign, we observed multiple variations of this flow:In addition, the actors actively use PDF files to lure the user to download and manually execute the next stage. These are VBE or JAR files that perform very similar actions, directly loading the PoshC2 implant or dropping an LNK file to load PoshC2. Recently, the actors have relied mostly on PoshC2 implants to control the infected machines. Typically, after the initial infection launches PowerShell to download code from a Pastebin-like service called paste.c-net.org or a dedicated C&C server, it replies with a PowerShell PoshC2 implant, usually consisting of three byte-encoded blocks (all standard modules from PoshC2). The first two PowerShell code blocks that are executed contain two very similar AMSI bypass techniques:The third block contains a backdoor which is responsible for communication with the C&C server. It sends requests to the server in a loop with a cookie called SessionID with a base64-encoded AES encrypted string that contains information about the victim:\"$env:userdomain;$u;$env:computername;$env:PROCESSOR_ARCHITECTURE;$pid;$procname;1\"The script expects the response by the C&C to be a PowerShell script as well since it passes the result to the Invoke-Expression cmdlet. Back in October 2021, we observed a case where a malicious document from the campaign reached out to paste.c-net.org, but instead retrieved a PowerShell script that loads an AsyncRAT assembly in memory. However, this AsyncRAT build is completely unobfuscated, and in fact contains a server certificate with the CN “AsyncRAT Server”, showing the attackers gave little thought to making any changes to the open-source tool.Figure 6 – AsyncRAT Source Code on GitHub vs decompiled AsyncRAT (on the right) The earliest versions of the documents, dated in the first half of 2021, have different macros which are significantly more obfuscated and contain more than a 1MB of junk code.Figure 8 – Shellcode injection from WindowsFormsApp3.exe (0b1d7c043be8c696d53d63fc0c834195) to mspaint.exe.Searching for more related files, we found additional executables written in C# that in a similar way launch a process such as notepad.exe or mspaint.exe and inject the shellcode to them, not embedded but downloaded from a C&C server, into the benign process. These simple injector executables vary little in their functionality. The difference between them is the obfuscation methods: some are packed with SmartAssembly, and some contain obfuscated variable names. However, all of the shellcode payloads we observed are Meterpreter shellcode, and of those executables that contain their debug information, all reference the PDB path starting with C:\\Users\\wallstreet\\. Figure 9 – Simplified infection chain for “Nouvelles Reformes 2021.pdf.exe” (7b8d0b4e718bc543de4a049e23672d79)The second-stage executables’ purpose is to inject the final payload, the Meterpreter shellcode which is usually downloaded from the hard-coded address, to different benign Windows processes. These tools are similar to those discussed by InQuest and, unless their debugging information was removed, also contain PDB paths with the unique username wallstreet.In late 2021, some of the infection chains started using C# executables to perform even more simple actions, simply launching PowerShell to pull the next stage from a server. At the time, the campaign was already using PoshC2 implants instead of Metasploit payloads, but the tools still have PDB paths referring to wallstreet. (Example: C:\\Users\\wallstreet\\source\\repos\\PDF Document\\PDF Document\\obj\\Release\\PDF Document.pdb).  Figure 10 – DLL from the attacker shellcode that patches AmsiScanBuffer and EtwEventWrite.Figure 11 – Event log showing the shellcode injection into RuntimeBroker.exe.It then loads the base64-encoded .NET executable containing a base64-encoded PoshC2 PowerShell implant. This chain of events eventually allows the actors to re-establish the backdoor in a stealthier manner, running as a known Microsoft process. To set up persistence, the actors drop a batch file called WinComp.bat to the disk. First, it searches for the process iexpress.exe, the one that runs the injected shellcode. If the process exists, the script terminates. Otherwise, it starts the PowerShell backdoor using an obfuscated command, and connects to a C2 server controlled by the attackers:Additionally, the actors drop another script called slmgr.vbs to the disk which simply executes WinComp.bat. To finish setting up persistence, the actors create a scheduled task to run slmgr.vbs every 5 minutes, and two different scheduled tasks to execute WinComp.bat every 6 hours. After installing the scheduled tasks, the actors add a hidden attribute on the script files to hide them from the user in the hope of avoiding detection: Finally, the attackers attempt to create a memory dump of the svchost.exe process, most likely to extract from it the existing RDP credentials.  DangerousSavanna targets medium or large finance-related enterprises which operate across multiple African countries. The companies that belong to these financial groups provide a wide range of banking products and services, and include not only banks but also insurance companies, microfinancing companies, financial holding companies, financial management companies, financial advisory services, etc. Despite the relatively low complexity of their tools, we observed the signs that might point out that the attackers managed to infect some of their targets. This was most likely due to the actors’ persistent attempts at infiltration. If one infection chain didn’t work out, they changed the attachment and the lure and tried targeting the same company again and again trying to find an entry point. With social engineering via spear-phishing, all it takes is one incautious click by an unsuspecting user. Figure 12 – Overview of the changes in infection chains, infrastructure and payloads. In this article, we analyzed a malicious email campaign targeting financial institutions in West and North Africa. This campaign, which has been running for almost two years, often changes its tools and methods, demonstrating the actors’ knowledge of open-source tools and penetration testing software. We expect that this campaign, which shows no signs of stopping or slowing down, will continue to adjust its operations and methods with an eye to maximizing its financial gain. Subscribe for cpr blogs, news and more© 1994- Check Point Software Technologies LTD. All rights reserved.First Name\nLast Name\nCountry—Please choose an option—ChinaIndiaUnited StatesIndonesiaBrazilPakistanNigeriaBangladeshRussiaJapanMexicoPhilippinesVietnamEthiopiaEgyptGermanyIranTurkeyDemocratic Republic of the CongoThailandFranceUnited KingdomItalyBurmaSouth AfricaSouth KoreaColombiaSpainUkraineTanzaniaKenyaArgentinaAlgeriaPolandSudanUgandaCanadaIraqMoroccoPeruUzbekistanSaudi ArabiaMalaysiaVenezuelaNepalAfghanistanYemenNorth KoreaGhanaMozambiqueTaiwanAustraliaIvory CoastSyriaMadagascarAngolaCameroonSri LankaRomaniaBurkina FasoNigerKazakhstanNetherlandsChileMalawiEcuadorGuatemalaMaliCambodiaSenegalZambiaZimbabweChadSouth SudanBelgiumCubaTunisiaGuineaGreecePortugalRwandaCzech RepublicSomaliaHaitiBeninBurundiBoliviaHungarySwedenBelarusDominican RepublicAzerbaijanHondurasAustriaUnited Arab EmiratesIsraelSwitzerlandTajikistanBulgariaHong Kong (China)SerbiaPapua New GuineaParaguayLaosJordanEl SalvadorEritreaLibyaTogoSierra LeoneNicaraguaKyrgyzstanDenmarkFinlandSlovakiaSingaporeTurkmenistanNorwayLebanonCosta RicaCentral African RepublicIrelandGeorgiaNew ZealandRepublic of the CongoPalestineLiberiaCroatiaOmanBosnia and HerzegovinaPuerto RicoKuwaitMoldovMauritaniaPanamaUruguayArmeniaLithuaniaAlbaniaMongoliaJamaicaNamibiaLesothoQatarMacedoniaSloveniaBotswanaLatviaGambiaKosovoGuinea-BissauGabonEquatorial GuineaTrinidad and TobagoEstoniaMauritiusSwazilandBahrainTimor-LesteDjiboutiCyprusFijiReunion (France)GuyanaComorosBhutanMontenegroMacau (China)Solomon IslandsWestern SaharaLuxembourgSurinameCape VerdeMaltaGuadeloupe (France)Martinique (France)BruneiBahamasIcelandMaldivesBelizeBarbadosFrench Polynesia (France)VanuatuNew Caledonia (France)French Guiana (France)Mayotte (France)SamoaSao Tom and PrincipeSaint LuciaGuam (USA)Curacao (Netherlands)Saint Vincent and the GrenadinesKiribatiUnited States Virgin Islands (USA)GrenadaTongaAruba (Netherlands)Federated States of MicronesiaJersey (UK)SeychellesAntigua and BarbudaIsle of Man (UK)AndorraDominicaBermuda (UK)Guernsey (UK)Greenland (Denmark)Marshall IslandsAmerican Samoa (USA)Cayman Islands (UK)Saint Kitts and NevisNorthern Mariana Islands (USA)Faroe Islands (Denmark)Sint Maarten (Netherlands)Saint Martin (France)LiechtensteinMonacoSan MarinoTurks and Caicos Islands (UK)Gibraltar (UK)British Virgin Islands (UK)Aland Islands (Finland)Caribbean Netherlands (Netherlands)PalauCook Islands (NZ)Anguilla (UK)Wallis and Futuna (France)TuvaluNauruSaint Barthelemy (France)Saint Pierre and Miquelon (France)Montserrat (UK)Saint Helena, Ascension and Tristan da Cunha (UK)Svalbard and Jan Mayen (Norway)Falkland Islands (UK)Norfolk Island (Australia)Christmas Island (Australia)Niue (NZ)Tokelau (NZ)Vatican CityCocos (Keeling) Islands (Australia)Pitcairn Islands (UK)\nEmail\n\nBFSI uses cookies on this site. We use cookies to enable faster and easier experience for you. By continuing to visit this website you agree to our use of cookies."
   }
]