[
   {
      "time": "2022-09-22",
      "title": "Security alert: new phishing campaign targets GitHub users - The GitHub Blog",
      "text": " On September 16, GitHub Security learned that threat actors were targeting GitHub users with a phishing campaign by impersonating CircleCI to harvest user credentials and two-factor codes. While GitHub itself was not affected, the campaign has impacted many victim organizations.On September 16, GitHub Security learned that threat actors were targeting GitHub users with a phishing campaign by impersonating CircleCI to harvest user credentials and two-factor codes. While GitHub itself was not affected, the campaign has impacted many victim organizations. Today, we are sharing details of what we’ve learned to help raise awareness of this phishing campaign and protect potential future victims.Reported versions include messages like these, which imply that a user’s CircleCI session expired and that they should log in using GitHub credentials.The threat actor uses the following tactics:Known phishing domains as of September 27, 2022:We are sharing this today as we believe the attacks may be ongoing and action is required for customers to protect themselves.Upon conducting our analysis, we reset passwords and removed threat actor-added credentials for impacted users, and we notified all of the known-affected users and organizations that we discovered through our analysis. If you did not receive an email notice from us, then we do not have evidence that your account and/or organization was accessed by the threat actor at this time. We suspended all identified threat actor accounts, and we will continue to monitor for malicious activity and notify new victim users and organizations as needed.We will continue to respond to new phishing domains as we discover them. See below for more steps you can take to protect yourself from phishing.If you believe you may have entered credentials on a phishing site:To verify that you’re not entering credentials in a phishing site, confirm that the URL in the address bar is “https://github.com/login” and that the site’s TLS certificate is issued to GitHub, Inc.The security and trustworthiness of GitHub and the broader developer ecosystem is our highest priority. Our investigation is ongoing, and we will continue to remediate and notify affected users as needed.AI. Security.DevEx.Catch the very best from this year’s global developer event, now on-demand.Discover tips, technical guides, and best practices in our monthly newsletter for developers.Improve your GitHub Action’s security posture by securing your source repository, protecting your maintainers, and making it easy to report security incidents. Learn about how GitHub Advanced Security’s new AI-powered features can help you secure your code more efficiently than ever.We’re excited to highlight another top contributing researcher to GitHub’s Bug Bounty Program—@Ammar Askar!Discover tips, technical guides, and best practices in our monthly newsletter for developers."
   },
   {
      "time": "2022-09-22",
      "title": "Domain shadowing becoming more popular among cybercriminals",
      "text": " Threat analysts at Palo Alto Networks (Unit 42) discovered that the phenomenon of 'domain shadowing' might be more prevalent than previously thought, uncovering 12,197 cases while scanning the web between April and June 2022.Domain shadowing is a subcategory of DNS hijacking, where threat actors compromise the DNS of a legitimate domain to host their own subdomains for use in malicious activity but do not modify the legitimate DNS entries that already exist.These subdomains are then used to create malicious pages on the cybercriminals' servers while the domain owner's site's web pages and DNS records remain unchanged, and the owners don't realize they have been breached.In the meantime, the threat actors are free to host C2 (command and control) addresses, phishing sites, and malware-dropping points, abusing the good reputation of the hijacked domain to bypass security checks.The attackers can theoretically change the DNS records to target users and owners of the compromised domains, but they typically prefer to take the stealthy path described above.Unit 42 explains that detecting real cases of domain shadowing is particularly challenging, which makes the tactic so alluring for the perpetrators.The analysts mention that VirusTotal marked only 200 domains as malicious out of the 12,197 domains Palo Alto's detectors uncovered.Most (151) of the VirusTotal detections were related to a single phishing campaign using a network of 649 shadowed domains on 16 compromised websites.Furthermore, phishing pages hosted on domains with a good reputation would appear trustworthy to a visitor, causing them to more likely to submit data on the page.The phishing campaign discovered by Palo Alto’s researchers compromised 16 domains to create 649 subdomains, hosting bogus login pages or redirection points to phishing pages.The subdomains that redirect to the phishing sites can easily bypass email security filters as they don’t host anything malicious and have a benign reputation.The threat actors target Microsoft account credentials, and while the URL is clearly not related to Microsoft, it won’t trigger warnings from internet security tools.In one case, the domain owners realized the compromise, but not before numerous subdomains had been created and facilitated malicious operations on their infrastructure.While protection from rogue subdomains is the responsibility of domain owners, registrars, and DNS service providers, it would be prudent for users always to be wary when submitting data.This includes the possibility that a subdomain on a well-known domain can be malicious and for users to double-check everything before they submit credentials or other sensitive information."
   },
   {
      "time": "2022-09-22",
      "title": "LockBit ransomware builder leaked online by \"angry developer\"",
      "text": " The LockBit ransomware operation has suffered a breach, with an allegedly disgruntled developer leaking the builder for the gang's newest encryptor.The new version promised to 'Make Ransomware Great Again,' adding new anti-analysis features, a ransomware bug bounty program, and new extortion methods.However, it looks like LockBit has suffered a breach, with two people (or maybe the same person) leaking the LockBit 3.0 builder on Twitter.However, VX-Underground says that LockBitSupp, the public representative of the LockBit operation, claims they were not hacked, but rather a disgruntled developer leaked the private ransomware builder.\"We reached out to Lockbit ransomware group regarding this and discovered this leaker was a programmer employed by Lockbit ransomware group,\" VX-Underground shared in a now-deleted tweet.\"They were upset with Lockbit leadership and leaked the builder.\"BleepingComputer has spoken to multiple security researchers who have confirmed that the builder is legitimate.Regardless of how the private ransomware builder was leaked, this is not only a severe blow to the LockBit ransomware operation but also to the enterprise, which will see a rise in threat actors using it to launch their own attacks.The leaked LockBit 3.0 builder allows anyone to quickly build the executables required to launch their own operation, including an encryptor, decryptor, and specialized tools to launch the decryptor in certain ways.The builder consists of four files, an encryption key generator, a builder, a modifiable configuration file, and a batch file to build all of the files.The included 'config.json' can be used to customize an encryptor, including modifying the ransom note, changing configuration options, deciding what processes and services to terminate, and even specifying the command and control server that the encryptor will send data.By modifying the configuration file, any threat actor can customize it to their own needs and modify the created ransom note to link to their own infrastructure.When the batch file is executed, the builder will create all of the files necessary to launch a successful ransomware campaign, as shown below.BleepingComputer tested the leaked ransomware builder and was easily able to customize it to use our own local command and control server, encrypt our files, and then decrypt them, as shown below.This builder is not the first time a ransomware builder or source code was leaked online, leading to increased attacks by other threat actors who launched their own operations."
   },
   {
      "time": "2022-09-22",
      "title": "Malwarebytes mistakenly blocks Google, YouTube for malware",
      "text": " Malwarebytes has addressed an issue that prevented users from accessing websites and services hosted on the google.com domain, including Google search and Youtube.According to a large number of reports from people affected by this, their browsers were prevented from accessing Google sites after Malwarebytes flagged and blocked them as malicious.\"I turned off real time web protection and now it works fine. Any device I have that doesn't have Malwarebytes (Android phone, other windows devices) wasn't affected.\"Malwarebytes quickly picked up on what was going on and explained in a tweet published in response to the stream of user reports that this was caused by a temporary issue affecting a web filtering component module in the company's security products.Malwarebytes also provided a workaround for impacted users, which required them to disable the buggy module by opening Malwarebytes and toggling off the Web Protection option in the Real Time Protection card.One hour, the anti-malware software vendor revealed that it had resolved the issue and all customers' software would update on its own to remove the false positive errors.\"The issue is now resolved, and the update should happen automatically. If you are still experiencing issues, please ensure the Malwarebytes client is updated to the latest version,\" Malwarebytes told affected users via Twitter.\"This update is applied during the normal update process, and the issue should automatically resolve. In some cases, updating to the latest database may require temporarily disabling the web filtering feature.\"The most likely reason is that the update still has to finish rolling out to Malwarebytes' entire customer base.Update: Added further info from Malwarebytes VP Michael Sherwood."
   },
   {
      "time": "2022-09-22",
      "title": "Unpatched 15-year old Python bug allows code execution in 350k projects",
      "text": " A vulnerability in the Python programming language that has been overlooked for 15 years is now back in the spotlight as it likely affects more than 350,000 open-source repositories and can lead to code execution.Disclosed in 2007 and tagged as CVE-2007-4559, the security issue never received a patch, the only mitigation provided being a documentation update warning developers about the risk.The vulnerability is in the Python tarfile package, in code that uses un-sanitized tarfile.extract() function or the built-in defaults of tarfile.extractall(). It is a path traversal bug that enables an attacker to overwrite arbitrary files.\"Failure to write any safety code to sanitize the members files before calling for tarfile.extract() tarfile.extractall() results in a directory traversal vulnerability, enabling a bad actor access to the file system\" - Charles McFarland, vulnerability researcher in the Trellix Advanced Threat Research teamThe flaw stems from the fact that code in the extract function in Python's tarfile module explicitly trusts the information in the TarInfo object \"and joins the path that is passed to the extract function and the name in the TarInfo object\"Analyzing the impact, Trellix researchers found that the vulnerability was present in thousands of software projects, both open and closed source.The researchers scraped a set of 257 repositories more likely to include the vulnerable code and manually checked 175 of them to see if they were affected. This revealed that 61% of them were vulnerable.Running an automated check on the rest of the repositories increased the number of impacted projects to 65%, indicating a widespread issue.However, the small sample set served only as a baseline for coming up with an estimation of all impacted repositories available on GitHub.\"With GitHub’s help we were able to get a much larger dataset to include 588,840 unique repositories that include ‘import tarfile’ in its python code\" - Charles McFarlandUsing the 61% vulnerability rate verified manually, Trellix estimates that there are more than 350,000 vulnerable repositories, many of them used by machine learning tools (e.g. GitHub Copilot) that help developers complete a project faster.Such automated tools rely on code from hundreds of thousands of repositories to provide \"auto-complete\" options. If they provide insecure code, the issue propagates to other projects without the developer knowing it.Looking further into the problem, Trellix found that open-source code vulnerable to CVE-2007-4559 \"spans a vast number of industries.\"As expected, the most impacted is the development sector, followed by web and machine learning technology.The researchers showed that the vulnerability can be leveraged on Linux, too. They managed to escalate the file write and achieve code execution in a test on Polemarch IT infrastructure management service.Apart from drawing attention to the vulnerability and the risk it poses, Trellix also created patches for a little over 11,000 projects. The fixes will be available in a forked of the impacted repository. Later, they will be added to the main project via pull requests.Because of the large number of affected repositories, the researchers expect more than 70,000 projects to receive a fix in the next few weeks. Hitting the 100% mark is a tough challenge, though, as merge requests also need to be accepted by the maintainers.BleepingComputer has reached out to Python Software Foundation for a comment about CVE-2007-4559 but has not received an answer at publishing time."
   },
   {
      "time": "2022-09-22",
      "title": "LinkedIn Smart Links abused in evasive email phishing attacks",
      "text": " Phishing actors are abusing LinkedIn’s Smart Link feature to bypass email security products and successfully redirect targeted users to phishing pages that steal payment information.Smart Link is a feature reserved for LinkedIn Sales Navigator and Enterprise users, allowing them to send a pack of up to 15 documents using a single trackable link.Besides its versatility, Smart Link provides marketing people with analytics, generating reports about who viewed the shared content and for how long.Hence, phishing actors aren’t just using Smart Link for bypassing email security protections but can also gain insight into the effectiveness of their campaigns, allowing them to optimize their lures.The phishing email sent to targets supposedly originates from Slovenská pošta, the state-owned postal service provider in Slovakia, informing the recipient of the need to cover costs for a parcel that’s pending shipment.Using email header trickery, the address appears legitimate to the recipient, but if examined closely, it becomes clear that the sender is actually “sis.sk@augenlabs.com”, entirely unrelated to the postal service.The embedded “confirm” button contains a LinkedIn Smart Link URL, with added alphanumeric variables at its end to redirect the victim to a phishing page. (“linkedin[.]com/slink?code=g4zmg2B6”)The redirection feature in Smart Links is typically used for promoting marketing pages, advertisements, etc., but threat actors abuse it to override security checks.The presented shipment cost on the landing page isn’t high, set to a realistic €2.99, but the goal of the phishing actors isn’t to receive money but to steal the target’s credit card details, including the number, holder’s name, expiration date, and CVV.Visitors who enter the information and click on “submit” will be informed that their payment has been received and eventually redirected to a final SMS code confirmation page with the sole purpose of sprinkling legitimacy in the process.While this still-ongoing campaign targets Slovakians, the abuse of LinkedIn Smart Link by phishing actors with a broader scope may be just a matter of time.BleepingComputer has contacted LinkedIn to ask if they have plans to implement safeguards to prevent this abuse, but we have not heard back yet.Update 9/22/22 - LinkedIn has responded to our request for a comment with the following statement:Our internal teams work to take action against those who attempt to harm LinkedIn members through phishing."
   },
   {
      "time": "2022-09-22",
      "title": "Over 39,000 Unauthenticated Redis Instances Found Exposed on the Internet",
      "text": " The shell script, which is still accessible, is engineered to perform the following actions -The SSH key is said to have been set on 15,526 out of 31,239 unauthenticated Redis servers, suggesting that the attack was attempted on \"over 49% of known unauthenticated Redis servers on the internet.\"However, a primary reason why this attack could fail is because the Redis service needs to be running with elevated permissions (i.e., root) so as to enable the adversary to write to the aforementioned cron directory.\"Although, this can be the case when running Redis inside a container (like docker), where the process might see itself running as root and allow the attacker to write these files,\" Censys researchers said. \"But in this case, only the container is affected, not the physical host.\"Censys's report also revealed that there are about 350,675 internet-accessible Redis database services spanning 260,534 unique hosts.\"While most of these services require authentication, 11% (39,405) do not,\" the company said, adding \"out of the total 39,405 unauthenticated Redis servers we observed, the potential data exposure is over 300 gigabytes.\"The top 10 countries with exposed and unauthenticated Redis services include China (20,011), the U.S. (5,108), Germany (1,724), Singapore (1,236), India (876), France (807), Japan (711), Hong Kong (512), the Netherlands (433), and Ireland (390).China also leads when it comes to the amount of data exposed per country, accounting for 146 gigabytes of data, with the U.S. coming a distant second with roughly 40 gigabytes.Censys said it also found numerous instances of Redis services that have been misconfigured, noting that \"Israel is one of the only regions where the number of misconfigured Redis servers outnumber the properly configured ones.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-09-22",
      "title": "Record DDoS Attack with 25.3 Billion Requests Abused HTTP/2 Multiplexing",
      "text": " Cybersecurity company Imperva has disclosed that it mitigated a distributed denial-of-service (DDoS) attack with a total of over 25.3 billion requests on June 27, 2022.The \"strong attack,\" which targeted an unnamed Chinese telecommunications company, is said to have lasted for four hours and peaked at 3.9 million requests per second (RPS).The attack was launched from a botnet that comprised nearly 170,000 different IP addresses spanning routers, security cameras, and compromised servers located in more than 180 countries, primarily the U.S., Indonesia, and Brazil.The disclosure also comes as web infrastructure provider Akamai said it fielded a new DDoS assault aimed at a customer based in Eastern Europe on September 12, with attack traffic spiking at 704.8 million packets per second (pps).UDP, being both connectionless and session-less, makes it an ideal networking protocol for handling VoIP traffic. But these same traits can also render it more susceptible to exploitation.\"There are no internal protections that can limit the rate of a UDP flood. As a result, UDP flood DoS attacks are exceptionally dangerous because they can be executed with a limited amount of resources.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-09-22",
      "title": "Critical Remote Hack Flaws Found in Dataprobe's Power Distribution Units",
      "text": " The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Tuesday released an industrial control systems (ICS) advisory warning of seven security flaws in Dataprobe's iBoot-PDU power distribution unit product, mostly used in industrial environments and data centers.Claroty's analysis of the PDU firmware shows that the product is crippled by issues ranging from command injection to path traversal flaws, exposing customers to severe security risks -Successful remote exploitation of the flaws \"puts an attacker within arm's length of disrupting critical services by cutting off electric power to the device and subsequently, anything plugged into it,\" Claroty researcher Uri Katz said.\"Even an innocuous power distribution unit remotely managed over the internet or via a cloud-based management platform can provide a determined attacker to target the network, or with a way to disrupt essential services by cutting power to devices plugged into a PDU,\" Katz said.Claroty further disclosed that it found a way to enumerate cloud-connected iBoot PDU devices by exploiting a combination of a valid cookie and the device ID (a sequential numeric value that can be trivially guessed), thereby widening the available attack surface to all connected devices.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]