[
   {
      "time": "2023-02-10",
      "title": "Graphiron: New Russian Information Stealing Malware Deployed Against Ukraine | Symantec Enterprise Blogs",
      "text": " The Nodaria espionage group (aka UAC-0056) is using a new piece of information stealing malware against targets in Ukraine. The malware (Infostealer.Graphiron) is written in Go and is designed to harvest a wide range of information from the infected computer, including system information, credentials, screenshots, and files.The earliest evidence of Graphiron dates from October 2022. It continued to be used until at least mid-January 2023 and it is reasonable to assume that it remains part of the Nodaria toolkit.Graphiron is a two-stage threat consisting of a downloader (Downloader.Graphiron) and a payload (Infostealer.Graphiron).The downloader contains hardcoded command-and-control (C&C) server addresses. When executed, it will check against a blacklist of malware analysis tools by checking for running processes with the names listed in Table 1.If no blacklisted processes are found, it will connect to a C&C server and download and decrypt the payload before adding it to autorun.The downloader is configured to run just once. If it fails to download and install the payload it won’t make further attempts nor send a heartbeat.Graphiron uses AES encryption with hardcoded keys. It creates temporary files with the \".lock\" and \".trash\" extensions. It uses hardcoded file names designed to masquerade as Microsoft office executables: OfficeTemplate.exe and MicrosoftOfficeDashboard.exeThe payload is capable of carrying out the following tasks:Password theft is carried out using the following PowerShell command:[void][Windows.Security.Credentials.PasswordVault,Windows.Security.Credentials,ContentType=WindowsRuntime];$vault = New-Object Windows.Security.Credentials.PasswordVault;$vault.RetrieveAll() | % { $_.RetrievePassword();$_} | Select UserName, Resource, Password | Format-Table –HideTableHeadersThe following command was used to export the list of PuTTY sessions:\"CSIDL_SYSTEM\\reg.exe\" query HKCU\\Software\\SimonTatham\\Putty\\SessionsIn addition to this, as with earlier malware, Graphiron communicates with the C&C server using port 443 and communications are encrypted using the AES cipher.Nodaria has been active since at least March 2021 and appears to be mainly involved in targeting organizations in Ukraine. There is also limited evidence to suggest that the group has been involved in attacks on targets in Kyrgyzstan. Third-party reporting has also linked the group to attacks on Georgia.The group sprang to public attention when it was linked to the WhisperGate wiper attacks that hit multiple Ukrainian government computers and websites in January 2022. When WhisperGate was initially loaded onto a system, the malware would overwrite the portion of the hard drive responsible for launching the operating system when the machine is booted up with a ransom note demanding $10,000 in Bitcoin. However, this was just a decoy as the WhisperGate malware destroys data on an infected machine and it cannot be recovered, even if a ransom is paid.The group’s usual infection vector is spear-phishing emails, which are then used to deliver a range of payloads to targets. Custom tools used by the group to date include:Like Graphiron, many of Nodaria’s earlier tools were written in Go. Graphiron appears to be the latest piece of malware authored by the same developers, likely in response to a need for additional functionality. While GraphSteel and GrimPlant used Go version 1.16, Graphiron uses version 1.18, confirming it is a more recent development.While Nodaria was relatively unknown prior to the Russian invasion of Ukraine, the group’s high-level activity over the past year suggests that it is now one of the key players in Russia’s ongoing cyber campaigns against Ukraine.If an IOC is malicious and the file available to us, Symantec Endpoint products will detect and block that file.SHA-256:0d0a675516f1ff9247f74df31e90f06b0fea160953e5e3bada5d1c8304cfbe63 — Downloader.Graphiron878450da2e44f5c89ce1af91479b9a9491fe45211fee312354dfe69e967622db — Downloader.Graphiron80e6a9079deffd6837363709f230f6ab3b2fe80af5ad30e46f6470a0c73e75a7 — Infostealer.Graphironeee1d29a425231d981efbc25b6d87fdb9ca9c0e4e3eb393472d5967f7649a1e6 — Infostealer.Graphironf0fd55b743a2e8f995820884e6e684f1150e7a6369712afe9edb57ffd09ad4c1 — Infostealer.Graphironf86db0c0880bb81dbfe5ea0b087c2d17fab7b8eefb6841d15916ae9442dd0cce — Infostealer.GraphironNetwork:208.67.104[.]95 — C&C serverThe Threat Hunter Team is a group of security experts within Symantec whose mission is to investigate targeted attacks, drive enhanced protection in Symantec products, and offer analysis that helps customers respond to attacks.We encourage you to share your thoughts on your favorite social platform."
   },
   {
      "time": "2023-02-10",
      "title": "Phishing Surges Ahead, as ChatGPT & AI Loom",
      "text": " Phishing is having a moment, with a massive spike in campaign volumes in the latter half of 2022. In fact, total phishing emails increased by 61% in the second half, according to an analysis this week. That could also be set to accelerate, as the rise of ChatGPT and other new tools are making their mark on the sector too. Malware volumes overall also increased, 12% quarter for quarter, with Vade detecting 58.9 million emails in the fourth quarter of 2022 that included malware, the researchers found.Email remains the top channel for distributing phishing and malware, giving hackers a convenient, scalable, and efficient vehicle for exploiting users and compromising accounts, Todd Stansfield, content marketing manager, noted in the report.\"Email threat activity continues to increase, creating the need for organizations of all sizes to fortify their cybersecurity,\" he wrote.Breaking down the numbers by the month, phishing volumes remained relatively stable through the first half of the fourth quarter, with 62.3 million phishing emails tracked in October and 47 million in November, according to the report.In terms of who they target and how they do it, phishing threat actors aren't getting especially creative given the current way enterprise users work and collaborate.Facebook remained the top brand in terms of impersonation for the second consecutive quarter, with researchers observing 6,700 unique phishing URLs impersonating the social networking giant in the fourth quarter of 2022, they reported. The company was followed by Microsoft, PayPal, Google, and Netflix in descending order as the brands that threat actors prefer to impersonate.\"With the growing popularity of productivity suites, users are increasingly using email to access and use productivity apps such as file sharing and instant messaging,\" Stansfield wrote, adding that threat actors have taken notice and are crafting phishing campaigns to target the specific behavior of corporate productivity-suite users.\"By purchasing a phishing kit, novice hackers can deploy highly convincing and effective schemes against their targets,\" Stansfield acknowledged.One recent enhancement to these kits is the ability to automatically localize phishing pages based on a victim's native language, a handy tool that allows threat actors to target various regions quickly without being multilingual themselves, the researchers said.The feature works by identifying the language settings of the targeted user's browser and leveraging it to update and display the phishing page accordingly. While improving the contextual accuracy of each phishing attack, the new feature also enables hackers to target users across multiple languages using a single kit, thus increasing the reach of their campaigns, according to Vade.Moreover, the problem with phishing is that it doesn't just end with an attacker giving up credentials, but ultimately, they can use these credentials as a way into corporate networks to steal data, distribute ransomware and other malware, and engage in other nefarious activity.Enterprises need to move beyond traditional email security solutions and adopt ones that can respond to the more sophisticated tactics of attackers, the researchers said. Specifically, collaborative and AI-enhanced solutions that can provide \"predictive defense against known and unknown threats using the latest threat intelligence and a core set of AI technologies,\" are the way forward, Stansfield said.\"On the flip side, we use AI to detect anomalies in email, from the content itself to the behavior of files that might be included in those emails,\" he says. \"There will be a battle between what you might call good and bad AI.\"If phishing emails do slip through an organization's security protections, training employees to identify phishing emails before they click on them can also be a reliable way to prevent credential or malware compromise before it occurs, Scott Caveza, senior research manager at cyber exposure management firm Tenable, tells Dark Reading.\"Phishing attacks continue to be successful as they target our weakest link in security, humans,\" he says. \"Regardless of the author of the email, be it AI or an actual human, organizations need to invest in and develop mature security programs where security awareness training, including specific training on spotting phishing attacks, are priorities for the organization.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-10",
      "title": "NIST Picks IoT Standard for Small Electronics Cybersecurity",
      "text": " After a search that took several years, the National Institute of Standards and Technology (NIST) has chosen Ascon to be the standard to protect data generated by exploding ranks of lightweight electronics that make up the Internet of Things (IoT). NIST will publish the full standard later in 2023, the organization says. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-10",
      "title": "7 Critical Cloud Threats Facing the Enterprise in 2023",
      "text": " Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-10",
      "title": "Hackers use fake crypto job offers to push info-stealing malware",
      "text": " A campaign operated by Russian threat actors uses fake job offers to target Eastern Europeans working in the cryptocurrency industry, aiming to infect them with a modified version of the Stealerium malware named 'Enigma.'The attacks start with an email pretending to be a job offer with fake cryptocurrency interviews to lure their targets. The emails have a RAR archive attachment which contains a TXT (\"interview questions.txt\") and an executable (\"interview conditions.word.exe\").The text file contains interview questions written in Cyrillic, which follow a standard format and are made to appear legitimate.If the victim is tricked into launching the executable, a chain of payloads is executed that eventually downloads the Enigma information-stealing malware from Telegram.The first-stage downloader is a C++ tool that uses techniques like API hashing, string encryption, and irrelevant code to evade detection while downloading and launching the second-stage payload, \"UpdateTask.dll.\"The second-stage payload, also written in C++, uses the \"Bring Your own Vulnerable Driver\" (BYOVD) technique to exploit the CVE-2015-2291 Intel vulnerability. This Intel driver flaw allows commands to be executed with Kernel privileges.The threat actors abuse this vulnerability to disable Microsoft Defender before the malware downloads the third payload.The third-stage downloads the final payload, Enigma Stealer, from a private Telegram channel, which Trend Micro says is a modified version of Stealerium, an open-source information-stealing malware.Enigma targets system information, tokens, and passwords stored in web browsers like Google Chrome, Microsoft Edge, Opera, and more. Additionally, it targets data stored in Microsoft Outlook, Telegram, Signal, OpenVPN, and other apps.Enigma can also capture screenshots from the compromised system and extract clipboard content or VPN configurations.Finally, all stolen data is compressed in a ZIP archive (\"Data.zip\") and sent back to the threat actors via Telegram.Some of Enigma's strings, such as web browser paths and Geolocation API services URLs, are encrypted with the AES algorithm in cipher-block chaining (CBC) mode, likely to conceal the data and prevent unauthorized access or tampering.Trend Micro has not assigned attribution with strong confidence but discovered several elements that may indicate a Russian threat actor is behind the attacks.The first clue is that one of the logging servers used in this campaign to track the execution flow of active infections hosts an Amadey C2 panel, which is quite popular in Russian cybercrime forums.Second, the server runs \"Deniska,\" a special-purpose Linux system only referenced in Russian-speaking forums.Finally, the server's default time zone is set to Moscow, another indicator that the threat actors are Russian."
   },
   {
      "time": "2023-02-10",
      "title": "Gootloader malware, SEO poisoning targets healthcare in ‘aggressive’ campaign | SC Media",
      "text": "  “The threat actor displayed fast-moving behaviors, quickly heading to control the network it infected, and getting elevated privileges in less than 4 hours,” researchers wrote.The attack analysis confirmed multiple layers of obfuscation and the “existence of multiple JavaScript loops that makes the execution longer, probably acting as an anti-sandbox mechanism.” “The actors create websites or populate web forums or similar websites with specific keywords and links, leading to a website hosting the infected file,” researchers wrote. As noted, the threat actors leverage SEO poisoning tactics to bring its infected pages to the top of internet browser search results to appear as legitimate sites.“SEO poisoning and Google service abuse, in general, have been documented a lot recently, which indicates this infection vector is becoming common for threat actors,” they added.The team “observed the deployment of Gootloader through heavily obfuscated JavaScript files with a file size of more than 40 Megabytes,” as well as the use of fake search engine ads linked to the infected piece of malware.The infections follow a similar flow: tricking a user into downloading the malware using the above tactics, prompting a ZIP file decompression that leads to the first- and second-stage payloads, and leading to a massive file meant to throw off security tools.Researchers note that most of the domains in the Gootloader PowerShell second stage script had one item in common: “/xmlrpc.php\" was displayed in relation to VirusTotal. The actors behind the variant commonly use compromised WordPress websites to use as C2 servers.After a Gootloader infection, the threat actor used “hands-on keyboard activities” that led to further deployment of attack frameworks, Cobalt Strike and SystemBC, “a proxy malware leveraging SOCKS5 and often used during the exfiltration phase of an attack.”The attacks have also used DLL Hijacking “on top of a VLC MediaPlayer executable.” These frameworks are used in both the infection and lateral movement stages of attacks.A successful infection would give a threat actor the ability to remotely control the victim’s device and gather system information, before launching into a “discovery process” to select the most interesting targets. Gootloader also enables attackers to maintain persistence through scheduled task, gather data, and maintain remote control.Given the spate of targeted ransomware and DDoS attacks on healthcare, provider organizations should be on high alert.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Malicious Python packages spread BlazeStealer malware Eight new Python packages masquerading as obfuscation tools have been used to facilitate the distribution of the BlazeStealer malware since January, The Hacker News reports.Hackread reports that Microsoft Azure's Automation Service has been leveraged to create the first cryptocurrency miner that could not be detected by security systems.Indian government organizations had their Windows and Linux systems subjected to two new attack campaigns by Pakistan-linked advanced persistent threat operation SideCopy, one of which involved the exploitation of a WinRAR security vulnerability, aimed at facilitating the deployment of various remote access trojans, The Hacker News reports.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-10",
      "title": "US and South Korea accuse North Korea of using hospital ransoms to fund more hacking",
      "text": " North Korean state hackers are using a variety of ransomware strains to attack healthcare organizations and other targets globally, with the goal of pulling in money to fund other operations, the U.S. and South Korea said Thursday. Specific targets for those cyber operations include U.S. defense information networks and military contractors, according to joint advisory from the Cybersecurity and Infrastructure Security Agency (CISA), the FBI, the NSA and several South Korean defense and intelligence agencies.North Korean hackers have used both internally developed ransomware like Maui and H0lyGh0st, the agencies said, as well as other extortion malware attained by other means — such as Deadbolt, ech0raix, GonnaCry, Hidden Tear, Jigsaw, LockBit 2.0, My Little Ransomware, NxRansomware, Ryuk, and YourRansom.The agencies also said North Korean hackers have attempted to portray themselves as members of other ransomware groups like the now-shuttered REvil.They have generated multiple web domains, personas and accounts to obscure their actions, according to the agencies, which noted that the hackers are able to “procure infrastructure, IP addresses, and domains with cryptocurrency generated through illicit cybercrime, such as ransomware and cryptocurrency theft.”They also use VPNs to make it appear attacks are coming from more innocuous locations outside of North Korea. The hackers use a range of exploits for common vulnerabilities like Log4Shell and others. The agencies named three specific vulnerabilities – CVE-2021-44228, CVE-2021-20038 and CVE-2022-24990 – as ones typically used by North Korean actors. In addition to ransomware, the hackers use other customized malware to exfiltrate data, perform reconnaissance operations and steal files. “DPRK cyber actors have been observed setting ransoms in bitcoin. Actors are known to communicate with victims via Proton Mail email accounts,” the advisory said. “For private companies in the healthcare sector, actors may threaten to expose a company’s proprietary data to competitors if ransoms are not paid.”The advisory highlights a startling trend across the world as nation-states have begun deploying ransomware for a variety of reasons and purposes. Allan Liska, a ransomware expert at cybersecurity company Recorded Future, said more than 50 national governments or national government agencies have been hit by ransomware in 2022. The Record is an editorially independent unit of Recorded Future.“We’ve seen what appear to be government-backed ransomware attacks from Russia, China, Iran and North Korea. Now, North Korea has always used ransomware attacks, dating back to 2017, but they seem to have really stepped up their attacks this year, making them even more dangerous as an adversary,” he said. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-10",
      "title": "Hackers breach Reddit to steal source code and internal data",
      "text": " Reddit suffered a cyberattack Sunday evening, allowing hackers to access internal business systems and steal internal documents and source code.The company says the hackers used a phishing lure targeting Reddit employees with a landing page impersonating its intranet site. This site attempted to steal employees' credentials and two-factor authentication tokens.After one employee fell victim to the phishing attack, the threat actor was able to breach internal Reddit systems to steal data and source code.\"We show no indications of breach of our primary production systems (the parts of our stack that run Reddit and store the majority of our data).\"Reddit says they learned of the breach after the employee self-reported the incident to the company's security team.After investigating the incident, Reddit says the stolen data includes limited contact information for company contacts and current and former employees.The data also included some details about the company's advertisers but credit card information, passwords, and ad performance was not accessed.Reddit also says that there are no indications that the threat actors were able to breach production systems used to run the website.In that attack, threat actors breached Riot Games and stole source code for League of Legends (LoL) multiplayer online battle arena, the Teamfight Tactics (TFT) auto battler game, and a legacy anti-cheat platform.BleepingComputer has contacted Reddit with further questions but a reply was not immediately available."
   },
   {
      "time": "2023-02-10",
      "title": "Hacker develops new 'Screenshotter' malware to find high-value targets",
      "text": " A new threat actor tracked as TA866 targets organizations in the United States and Germany with new custom malware to perform surveillance and data theft on infected systems.The threat actor appears to have financial motivations, performing a preliminary evaluation of breached systems to determine if the target is valuable enough for further intrusion.The threat actor targets victims using phishing emails that include Microsoft Publisher (.pub) attachments with malicious macros, URLs linking to .pub files with macros, or PDFs containing URLs that download dangerous JavaScript files.Proofpoint says the number of emails sent in TA866 increased exponentially in December 2022 and continued upward in January 2023, with the emails written in English or German, depending on the target.If the recipients of these emails click on the URLs, a multi-step attack chain is triggered, resulting in the download and execution of \"Screenshotter,\" one of TA866's custom malware tools.This tool takes JPG screenshots from the victim'svictim's machine and sends them back to the threat actor'sactor's server for review.The attackers then manually examine these screenshots and decide whether the victim is of value. This evaluation may include having the Screenshotter malware snap more screenshots or dropping additional custom payloads like:Its capabilities include stealing cryptocurrency wallets, credentials, and cookies stored in web browsers, FTP clients, Steam accounts, Telegram and Discord accounts, VPN configurations, and email clients.Additionally, Rhadamanthys is also capable of stealing files from the breached system.Proofpoint says TA866 is actively involved in the attacks, checking the stolen data and sending commands to its malware during times that resemble a regular workday in the UTC+2 or UCT+3 time zone.When combined with the presence of Russian language variable names and comments in the code of the AHK Bot loader, the clues indicate that TA866 is very likely a Russian threat actor.Proofpoint has attempted to find overlaps and similarities with past reports describing similar TTPs (techniques, tactics, and procedures), but it could not make any definitive connections.However, there are signs of the AHK Bot tool being used in previous espionage campaigns.TA866 attacks are still underway, and Proofpoint warns that Active Directory profiling should be a cause of concern, as it could compromise all domain-joined hosts with information-stealing malware."
   },
   {
      "time": "2023-02-10",
      "title": "Malicious Google ads sneak AWS phishing sites into search results",
      "text": " A new phishing campaign targeting Amazon Web Services (AWS) logins is abusing Google ads to sneak phishing sites into Google Search to steal your login credentials.Initially, the threat actors linked the ad directly to the phishing page. However, at a later phase, they added a redirection step, likely to evade detection by Google’s ad fraud detection systems.The malicious Google ads take the victim to a blogger website (“us1-eat-a-w-s.blogspot[.]com”) under the attackers’ control, which is a copy of a legitimate vegan food blog. The site uses ‘window.location.replace’ to automatically redirect the victim to a new website that hosts the fake AWS login page, made to appear authentic.The victim is prompted to select if they are a root or IAM user and then enter their email address and password. This option helps the threat actors categorize the stolen data into two categories of value and utility.The phishing domains seen by Sentinel Labs are:An interesting feature of the phishing pages is that their author has included a JavaScript function to disable right clicks, middle mouse buttons, or keyboard shortcuts.Sentinel Labs says this is likely a mechanism to prevent users from navigating away from the page, either purposefully or by mistake.The security firm reports seeing Portuguese used as a language in the JavaScript code comments and variables, while the root page of the blogger domain mimics a Brazilian dessert business. Finally, the Whois details used for registering the domains point to a Brazilian person.Sentinel Labs reported the abuse to CloudFlare, which protected the phishing sites, and the internet company quickly shut down the account. However, the malicious Google Ads remain, even if the sites they link to are no longer online.Google Ads have been under massive abuse from cybercriminals of all kinds lately, serving as an alternative method to reach potential victims."
   },
   {
      "time": "2023-02-09",
      "title": "CISA Releases Recovery Script for Victims of ESXiArgs Ransomware",
      "text": " The US Cybersecurity and Infrastructure Security Agency (CISA) has released a recovery script for victims of the ESXiArgs ransomware variant that affected thousands of organizations worldwide this week.ESXiArgs has already infected more than 3,000 unpatched servers in the US, Canada, and multiple other countries. Victims have reported receiving a ransom demand of around 2 Bitcoin (or around $22,800 at press time) for the decryption key. Affected organizations have also reported the threat actor behind the campaign warning them to pay up within three days or risk having their sensitive information released publicly.In a Feb. 8 update, Rapid7 said its threat intelligence shows that multiple ransomware groups, in addition to the operator of ESXiArg, are targeting CVE-2021-21974 and other VMware ESXi vulnerabilities.\"This script does not seek to delete the encrypted config files, but instead seeks to create new config files that enable access to the VMs,\" CISA said. \"While CISA works to ensure that scripts like this one are safe and effective, this script is delivered without warranty, either implicit or explicit.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-09",
      "title": "Hackers used fake websites to target state agencies in Ukraine and Poland",
      "text": " Hackers attempted last week to infect Ukrainian government computer systems with malware hosted on fake websites impersonating legitimate state services.One of the malware variants used by this group, Aperetif, has been known to security researchers since May, and has been used to steal technical information about victims’ computers, such as about the operating system, hardware and software components, and network configuration values.The recent campaign, however, used Aperetif in a unique way: hackers distributed it through fake websites posing as Ukraine's Ministry of Foreign Affairs and Poland's Central Cybercrime Bureau. To gain access to victims' devices, the hackers sent out phishing emails to employees of Ukrainian and Polish state organizations with instructions on how to download software that scans computers for viruses after potential Russian cyberattacks.These emails contained a link to a supposedly legitimate government website where users could download software containing a malicious file. The execution of malicious files mimics the process of scanning computers for viruses, making it potentially hard for victims to detect. Hackers also placed the malicious file on a fake website rather than in an email attachment to avoid detection, the report said.  CERT-UA said the payloads allowed hackers to take screenshots of the victim's computer, scan the desktop folder for files with the specified extensions, and exfiltrate user data. A spokesperson for the agency said they could not share details about how many devices were infected or what information was stolen.This is not the first time WinterVivern has used fake websites to attack users in Ukraine and Poland. In previous campaigns, they lured victims to bogus webpages of Ukraine’s Ministry of Defense, Ukraine’s Security Service, and Polish police.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-09",
      "title": "US NIST unveils winning encryption algorithm for IoT data protection",
      "text": " The National Institute of Standards and Technology (NIST) announced that ASCON is the winning bid for the \"lightweight cryptography\" program to find the best algorithm to protect small IoT (Internet of Things) devices with limited hardware resources.Small IoT devices are becoming increasingly popular and omnipresent, used in wearable tech, \"smart home\" applications, etc. However, they are still used to store and handle sensitive personal information, such as health data, financial details, and more.That said, implementing a standard for encrypting data is crucial in securing people's data. However, the weak chips inside these devices call for an algorithm that can deliver robust encryption at very little computational power.\"These algorithms should cover most devices that have these sorts of resource constraints.\"ASCON was selected as the best of the 57 proposals submitted to NIST, several rounds of security analysis by leading cryptographers, implementation and benchmarking results, and feedback received during workshops. The whole program lasted for four years, having started in 2019.ASCON was eventually picked as the winner for being flexible, encompassing seven families, energy efficient, speedy on weak hardware, and having low overhead for short messages.NIST also considered that the algorithm had withstood the test of time, having been developed in 2014 by a team of cryptographers from Graz University of Technology, Infineon Technologies, Lamarr Security Research, and Radboud University, and winning the CAESAR cryptographic competition's \"lightweight encryption\" category in 2019.Two of ASCON's native features highlighted in NIST's announcement are AEAD (Authenticated Encryption with Associated Data) and hashing.AEAD is an encryption mode that provides confidentiality and authenticity for transmitted or stored data, combining symmetric encryption and MAC (message authentication code) to prevent unauthorized access or tampering.Hashing is a data integrity verification mechanism that creates a string of characters (hash) from unique inputs, allowing two data exchange points to validate that the encrypted message has not been tampered with.NIST still recommends the AES technique for AEAD and SHA-256 for hashing; however, these are unsuitable for smaller, weaker devices.Despite ASCON's lightweight nature, NIST says the scheme is powerful enough to offer some resistance to attacks from powerful quantum computers at its standard 128-bit nonce. However, this is not the goal or purpose of this standard, and lightweight cryptography algorithms should only be used for protecting ephemeral secrets."
   },
   {
      "time": "2023-02-09",
      "title": "Developers in China, Russia had access to Facebook user data for years, senators say  | SC Media",
      "text": "  Meta is again being called out for its dubious privacy practices, this time over allegations that “significant amounts of sensitive user data” was available for access to “hundreds of thousands of developers” from what Facebook classified as “high-risk jurisdictions,” like China and Russia.An audit of Meta’s privacy practices revealed “nearly 90,000 separate developers” in China and over 42,000 developers in Russia, and thousands of developers in other high-risk jurisdictions, including Iran and North Korea, had access to user information. The letter was sent after the company’s own investigation revealed the apparent data sharing. The internal audit was brought on after the Cambridge Analytica fallout in 2018, where a New York Times report found Facebook handed privileged API access to Huawei, OPPO, TCL, and other China-backed device makers for at least eight years.The Times report confirmed the “device manufacturers were permitted to access a wealth of information on Facebook’s users, including profile data, user IDs, photos, as well as contact information and even private messages.” The news prompted a host of lawsuits.“We were startled to learn recently, as a result of this ongoing litigation and discovery, that Facebook had concluded that a much wider range of foreign-based developers, in addition to the PRC-based device-makers, also had access to this data,” the senators wrote.In fact, Facebook’s own internal materials warned that the high-risk jurisdictions “may be governed by potentially risky data storage and disclosure rules or be more likely to house malicious actors,” including “states known to collect data for intelligence targeting and cyber espionage,” the letter continues.Warner and Rubio have “grave concerns about the extent to which this access could have enabled foreign intelligence service activity, ranging from foreign malign influence to targeting and counterintelligence activity.”Based on the unsealed documents that showed Facebook performed separate reviews on the risky developers, Zuckerberg is asked to explain the review process and conclusions, the precise percentage of the developers located in China and Russia, and “what communications, if any, has Facebook had with these developers since its initial identification.”The senators asked for logs into the frequency of the data sharing, as well as the criteria used to evaluate risk associated with operating in those countries, the exact information they had access to, and for how long. Zuckerberg is also asked to estimate just how many users were impacted this time around.Meta has consistently been in the hot seat over its data practices even before the Cambridge Analytica scandal, particularly over its handling of health data.In October, Warner issued another letter to Zuckerberg demanding: “Where required by law, does Meta always comply with any and all notification requirements when the Meta Pixel handles or transmits protected information, in the manner and time required by such laws?”The company is currently defending itself against well over 1,000 lawsuits, more than a dozen of which are tied to the Pixel tracking tool alone. But with $480.21 billion in market capital, it’s unclear just what impact, if any, these measures will incur.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.TechCrunch reports that more than a million Maine residents were confirmed by state government officials to have had their personal data compromised as part of the widespread MOVEit file transfer system hack conducted by the Cl0p ransomware operation.U.S. advanced electronic components manufacturer Kyocera AVX Components Corporation has disclosed that 39,111 individuals around the world had their data compromised following a ransomware attack earlier this year, which has been claimed by the LockBit ransomware operation, reports BleepingComputer.TechCrunch reports that two-factor authentication has been required by major U.S. genetic testing and genealogy firms 23andMe, Ancestry, and MyHeritage in the aftermath of the significant 23andMe breach, which resulted in the theft of data from more than a million of its Jewish Ashkenazi and Chinese users.On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-09",
      "title": "Malicious Dota 2 game modes infected players with malware",
      "text": " Security researchers have discovered four malicious Dota 2 game modes that were used by a threat actor to backdoor the players' systems.\"These game modes were named Overdog no annoying heroes (id 2776998052), Custom Hero Brawl (id 2780728794), and Overthrow RTZ Edition X10 XP (id 2780559339),\" Avast malware researcher Jan Vojtěšek said.The attacker also included a new file named evil.lua that was used to test server-side Lua execution capabilities. This malicious snippet could be used for logging, executing arbitrary system commands, creating coroutines, and making HTTP GET requests.The backdoor enabled the threat actor to remotely execute commands on the infected devices, potentially allowing the installation of further malware on the device.​\"This backdoor permits the execution of any JavaScript acquired through HTTP, providing the attacker the power to both conceal and modify the exploit code at their discretion without undergoing the game mode verification process, which can be dangerous, and updating the entire custom game mode,\" Vojtěšek said.On players' compromised systems, the backdoor was also used to download a Chrome exploit known to be abused in the wild.\"Since V8 was not sandboxed in Dota, the exploit on its own allowed for remote code execution against other Dota players,\" Vojtěšek added.The JavaScript exploit for CVE-2021-38003 was injected in a legitimate file that added scoreboard functionality to the game likely to make it harder to detect.Valve also took down the malicious game modes and alerted all players impacted by the attack.\"One way or another, we can say that this attack was not very large in scale. According to Valve, under 200 players were affected,\" Vojtěšek added.The cheat dev removed the features in a new version on January 21 and apologized for the chaos caused by the cheat's users. "
   },
   {
      "time": "2023-02-09",
      "title": "Toyota Global Supply Chain Portal Flaw Put Hacker in the Driver's Seat",
      "text": " [This article was updated on 2/13/2023 with an update from the researcher's report stating that the Toyota portal was created and is maintained by the automaker.]An ethical hacker found a backdoor in a Web app used by Toyota employees and suppliers for coordinating tasks related to the automaker's global supply chain, gaining control of the global system merely by knowing the email address of one of its users.Once acting as an administrator, Zveare said he had \"full access\" to internal Toyota projects, documents, and user accounts, including some of those that belonged to Toyota external partners and suppliers such as Michelin, Continental, Stanley Black & Decker, and Harman.All in all, the researcher gained read/write access to Toyota's global user directory of more than 14,000 users. Zveare also could access corporate user account details, confidential documents, projects, supplier rankings/comments, and other sensitive data related to those users, he said.Indeed, had a threat actor discovered the issue before him, \"the consequences could have been severe,\" Zveare observed.The issue could have allowed attackers to create their own user account with an elevated role to retain access should the issue ever be discovered and fixed, or download and leak all the data to which they had access, he said.They also could have deleted or modified data in a way to be disruptive to global Toyota operations, or crafted a highly targeted phishing campaign to attempt to capture \"real corporate login details, which could have exposed other Toyota systems to attacks,\" Zveare wrote.The researcher reported the issue to Toyota on Nov. 3 and the company reported back 20 days later that it had been fixed — a speedy response with which Zveare was \"impressed,\" he said.\"Out of all the security issues I have reported so far to various vendors, Toyota’s response was the fastest and most effective,\" he said.Fortunately for Toyota, the latest breach was an ethical one and, thanks to Zveare's responsible disclosure, the company could fix it before there was any impact on the company or its partners' business, notes one security professional.However, the GSPIMS API appeared to be secure, which inspired Zveare to further dig into the application code to see what else might be cooking. What he eventually found was that JSON Web Tokens — or session tokens representing the users' valid authenticated sessions on the website — were being generated based on a user's email without requiring a password.Zveare Googled for Toyota supply chain users and made an educated guess to formulate the email of someone who he thought would be a user of the GSPIMS portal. \"Then I fired off the createJWT HTTP request, and it returned a valid JWT!\" he wrote.His discovery gave him the ability to generate a valid JWT for any Toyota employee or supplier registered in GSPIMS, \"completely bypassing the various corporate login flows, which probably also enforce two-factor authentication options,\" Zveare wrote.Though the user whose email he accessed the system with did not have system administrator privileges, he eventually searched within the GSPIMS to find the email of someone who did, and using that he gained full control of the system as an administrator.Enterprises have work to do to in order to block the issue Zveare found, security experts say. For starters, security administrators must take a more holistic approach to security and realize the wider impact their overall security posture — or lack thereof — can have on all of the partners and customers with whom they do business.\"What are perceived as 'internal systems' to organizations, no longer are,\" Dror Liwer, co-founder of cybersecurity firm Coro said in an email statement to Dark Reading. \"With partners, suppliers, and employees collaborating via the Internet — all systems should be considered external, and as such, protected against malicious intrusion.\"Developing this big-picture perspective and security strategy is not so simple, as most enterprises already have their hands full managing their own company's risk, notes Lorri Janssen-Anessi, director of external cyber assessments for BlueVoyant.However, considering how easy it was for Zveare to gain access to a system that serves Toyota's global supply chain, companies need to get their heads around this risk to maintain security across any third party that touches their network, she says.\"What today's organizations should take from the reported vulnerability in Toyota's supplier management network is a firm reminder to look at their own vendor and supplier cybersecurity,\" Janssen-Anessi says.Among the key measures to consider include shoring up access control and user account privileges, ensuring that they only provide employees and third-parties with access to the data needed for their particular role, she notes. \"This helps to control what data can be accessed in the event of a breach,\" Janssen-Anessi says.Indeed, a more data-centric approach overall to security could help enterprises avoid or mitigate a scenario that Zveare demonstrated, Comforte AG's Horst observes. He advises that organizations find ways to protect data as soon as it enters their corporate data ecosystem, thus protecting \"the data itself rather than perimeters and borders around the data.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-09",
      "title": "Android 14 to block malware from abusing sensitive permissions",
      "text": " Google has announced the release of the first developer preview for Android 14, the next major version of the world's most popular mobile operating system, which comes with security and privacy enhancements, among other things.Starting with Android 14, apps will have to declare precisely how they plan to use certain phone features, data exchange between them will be limited, and additional files downloaded by apps will be read-only.A highlighted security feature in Android 14 is to block the installation of malicious apps that target older API levels (Android versions), which allows easier abuse of sensitive permissions.Starting with the \"Runtime receivers,\" which enable apps to receive intents broadcast by the system or other applications, all apps targeting Android 14 must declare if they need to receive information from other apps or if they should be limited to system \"broadcasts.\"This new security measure continues the \"Context.registerReceiver()\" feature introduced in previous Android releases. It aims to prevent malicious apps on the device from intercepting or misusing broadcasts meant to reach other apps.To further tighten up the information exchange between apps and prevent malware from gripping sensitive user data, Android 14 will also restrict the sending of \"intents\" that don't have a specified recipient.With this new security enhancement, malware can no longer intercept intents sent from other apps and read their contents.The third security feature that will land on Android 14 is \"safer dynamic code loading,\" which limits all files downloaded by an application to read-only mode.This would help prevent some code-injection scenarios involving manipulated executables that are meant to be run by privileged apps.Finally, Android 14 will block the installation of harmful apps that target SDK versions lower than 23 (Android 6.0) to achieve easier permissions abuse.\"Malware often targets older API levels to bypass security and privacy protections that have been introduced in newer Android versions,\" explains Google.\"To protect against this, starting with Android 14, apps with a targetSdkVersion lower than 23 cannot be installed.\"In Android 6.0 (2015), Google introduced a runtime permission model that required apps to request the user to grant permission access requests for sensitive operations like the device's camera, microphone, GPS sensors, phone calls, and SMS access upon the app's launch.Malware targeting previous SDK versions can specify it in the manifest XML file and request access to sensitive permissions upon installation, which is easier for users to overlook and approve.The new permissions protection system will also make it impossible for users to install apps that haven't been updated for some time. However, Google says older apps already installed on devices that upgrade to Android 14 will continue to work.Android 14 is still far from its final form, and we may see more security features land on the second developer preview in March 2023."
   },
   {
      "time": "2023-02-09",
      "title": "Money Lover for Android & iOS leaked email addresses, transactions",
      "text": " A flaw in the Money Lover financial app for Android, iOS, and Windows allowed any logged-in member to see the email addresses and live transaction metadata for other users' shared wallets.Money Lover is a finance app allowing users to manage their expenses and budgets that has been downloaded five million times on the Play Store, with the app also available for iOS and Windows.Money Lover allows users to create \"shared wallets\" with specific users, like family members or coworkers, to log transactions to collaborate in expense logging and monitoring.Users invited to a shared wallet typically know each other, so sharing data and email addresses are expected.However, Trustwave's analyst and Money Lover user, Troy Driver, found that transaction data and email addresses associated with shared wallets are exposed to any authenticated users of the app.\"The email address and shared wallet name can be viewed via the Web Sockets tab of the browser's \"Developer Tools.\" All Money Lover users who make use of the Shared Wallet feature are affected by this issue.\"The analyst discovered the information disclosure flaw while examining the app's traffic using a proxy and the Web Sockets view in the browser's Developer Tools.The exposed data included email addresses, wallet names, and limited transaction data.The analyst thought these might have been the emails of the developers of a JavaScript library. However, when the list got quickly populated with more addresses, it became clear that the app's server was leaking sensitive information.Trustwave reported the issue to the publisher of Money Lover, Finsify, who released a fixing update on January 27, 2023.The report did not clarify when the flaw was discovered or how long Money Lover users remained exposed.It is essential to clarify that the information disclosure bug only impacted users who used the shared wallet feature.The main repercussion of this flaw is that an attacker accessing email addresses and transaction metadata could perform targeted phishing attacks against the exposed users to gain access to further sensitive information.Money Lover users are recommended to update their app to the latest available version using their operating system's app store."
   },
   {
      "time": "2023-02-09",
      "title": "CERT-UA Alerts Ukrainian State Authorities of Remcos Software-Fueled Cyber Attacks",
      "text": " The mass phishing campaign has been attributed to a threat actor it tracks as UAC-0050, with the agency describing the activity as likely motivated by espionage given the toolset employed.The bogus emails that kick-start the infection sequence claim to be from Ukrainian telecom company Ukrtelecom and come bearing a decoy RAR archive. Of the two files present in the file, one is a password-protected RAR archive that's over 600MB and the other is a text file containing the password to open the RAR file.Embedded within the second RAR archive is an executable that leads to the installation of the Remcos remote access software, granting the attacker full access to commandeer compromised computers.The Italian company calls it a \"lightweight, fast and highly customizable Remote Administration Tool with a wide array of functionalities.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-02-08",
      "title": "CISA says Killnet DDoS attacks on U.S. hospitals had little effect",
      "text": " The Cybersecurity and Infrastructure Security Agency said it helped dozens of hospitals respond to a series of distributed denial-of-service (DDoS) incidents last week that were launched by a pro-Kremlin hacking group.A spokesperson for CISA told The Record that several of the incidents temporarily reduced the availability of the hospitals’ public-facing websites, but there were no reports of unauthorized access to hospital networks, disruption to health care delivery or impacts on patient safety.On their popular Telegram channel, the hackers boasted of launching DDoS attacks on hospitals in more than 25 states. Less than half of the attacks — which involved routing a deluge of page requests at hospital websites — were successful in knocking websites offline, CISA said. The agency said DDoS incidents have become a priority issue. The spokesperson added that for much of the past year, CISA has been helping organizations mitigate DDoS attacks, particularly those launched by Killnet. The agency also worked with several tech companies to provide free resources to under-funded organizations that can help them reduce the impact of DDoS attacks. CISA plans to continue working with the U.S. Department of Health and Human Services (HHS) to communicate with hospitals about government assistance and third-party services.Cybersecurity firm Cloudflare said hospitals have reached out in recent days looking for help in addressing Killnet’s DDoS campaign. Cloudflare experts said the attacks are not originating from a single botnet — a group of Internet-connected devices taken over by hackers and used to amplify DDoS attacks. Omer Yoachimik, product manager at Cloudflare, told The Record that attacks have come in several waves over the last week and so far have been relatively small, in the range of the range of 10,000 to 100,000 HTTP requests per second (rps). The largest attack on a hospital reached 1.6 million rps, with the peak lasting less than 10 seconds and the entire attack taking about six minutes. Cloudflare did not name the hospital.“That’s a large attack that would degrade services and affect application usability,” he said, adding that most sites would not be able to withstand that without a DDoS protection service.Yoachimik explained that their research into the DDoS campaign indicates that the attacks are being crowdsourced – meaning Killnet operators are reaching out to other groups and individuals that are either using multiple botnets or different attack methods. “It is likely that pro-Russian ransomware groups or operators, such as those from the defunct Conti group, will heed Killnet’s call and provide support. This likely will result in entities Killnet targeted also being hit with ransomware or DDoS attacks as a means of extortion, a tactic several ransomware groups have used,” HHS warned. Akamai’s Patrick Sullivan said attacks on Eastern Europe have skyrocketed from 1% to as high as 30% of all observed attacks on its DDoS platform in 2022.“There has been a surge in politically motivated DDoS attacks in the past year due to heightened geopolitical tensions,” he said. “Threat actors have targeted a variety of sectors, including government institutions and private companies, across Western Europe, in addition to US healthcare organizations most recently.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-08",
      "title": "First Linux variant of Clop ransomware targeted universities, colleges but was flawed",
      "text": " The first Linux variant of the Clop ransomware was rife with issues that allowed researchers to create a decryptor tool for victims.Terefos explained that the new Linux variant was mostly used to target educational institutions – including a university in Colombia – but had issues that defenders could exploit to help victims. “We discovered a flaw in the Linux version of Clop ransomware which enabled us to create a decryptor tool. We have not seen any new versions of the ransomware in the wild. However, we predict that the ransomware authors will likely attempt to fix the flaw in future versions, so organizations should take steps to protect themselves against the ransomware,” Terefos said. “We found that the Linux version of the Cl0p ransomware is in an early stage of development, suggesting that the threat actors are still manually operating and tweaking the ransomware to target specific victims. We also noticed that the ransomware had hardcoded victim-specific details, such as file paths for encryption, indicating that the threat actors had knowledge of the victim environment before launching the attack.”The researchers noted that the developers likely did not invest much time or resources into improving the obfuscation or evasiveness of the Linux version because many security systems could not detect it. The Windows version allowed the ransomware group to list out what folders and files should not be encrypted, but that functionality was not seen with the Linux version. The Linux version was used to target specific folders and all file types. “Rather than simply port the Windows version of Cl0p directly, the authors have chosen to build bespoke Linux payloads. We understand this to be the primary reason for the lack of feature parity between the new Linux version and the far more established Windows variant,” Terefos explained.“SentinelLabs expects future versions of the Linux variant to start eliminating those differences and for each updated functionality to be applied in both variants simultaneously.”The Linux version also leaves the ransom note in a .txt format while the Windows version leaves the ransom note in .rtf.In spite of the June 2021 arrests, Clop has not stopped operating and the development of a Linux version should prompt defenders to be ready for anything, Terefos said. “Ransomware groups are constantly seeking new targets and methods to maximize their profits. Being widely used in enterprise environments, Linux and cloud devices offer a rich pool of potential victims,” Terefos told The Record. “In recent years, many organizations have shifted towards cloud computing and virtualized environments, making Linux and cloud systems increasingly attractive targets for ransomware attacks. Therefore, ransomware groups targeting Linux and cloud systems is a natural progression in their quest for higher profits and easier targets.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-08",
      "title": "Florida hospital still diverting some EMS patients 5 days after cyberattack | SC Media",
      "text": "  Tallahassee Memorial Health is continuing to divert some emergency care patients five days after a reported IT security issue, despite making progress in its recovery efforts.TMH has been “proactively working to solve” the incident with support from law enforcement, which has brought some of its care services back online. Notably, the health system canceled surgeries between Thursday and Monday, but is now “performing limited surgeries and procedures.”The networks for its labor and delivery facility, as well as its connected physician practices, are operational. However, clinicians are still leveraging paper processes for registration, admission, and during care, which is causing expected delays in care. “Our teams are working around the clock in collaboration with outside consultants to investigate the cause of the event and safely restore all computer systems as quickly as possible,” according to the latest notice. But as with most healthcare security incidents, recovery is often slow-going. For some of the largest health systems, EHR downtime can last up to four weeks.But all hospital services remained open, outside of its pharmacy, outpatient imaging, and pulmonary function testing services. A website notice shows imaging and walk-in lab services remain closed. The hospital has not provided an update outside of the initial report.A successful phishing attack against a Highmark employee in December potentially compromised the data of 300,000 patients.The notice shows an employee was sent an email with a malicious link, which compromised their email account for two days between Dec. 13 and Dec. 15. Upon discovery, Highmark immediately shut down the account, reset passwords, and implemented network blocking.However, the compromise enabled the threat actor to access emails within the account, some of which contained patient data.The data varied by patient and could include names and Social Security numbers, as well as enrollment information like group names, identification numbers, claims data, treatment information, dates of service, procedures, and prescription information. For some patients, financial information, contact details, and email addresses were also compromised.Highmark is continuing to bolster its email security controls, as it provides employees with further cyber and phishing training to help prevent future attempts.Sharp Healthcare is notifying 62,777 patients of a recent website hack that potentially compromised their protected health information. Sharp Health is a nonprofit healthcare group based in San Diego.On Dec. 12, a hack was detected on a server that supports the Sharp Health website. The IT team took the affected servers offline and launched incident response protocols. The forensics later determined the activity was tied to a threat actor accessing a website server for several hours, which led to the access of a single file containing patient data. The data varied by patient and could include patient ID numbers, invoice numbers, payment amounts, and provider names. No financial data or further identifiers were compromised during the incident. Sharp Health stressed that only patients “who paid a bill or invoice using the online bill payment service between Aug. 12, 2021, and Jan. 12, 2023” were affected.”The health group has since enhanced its website security tools and is continuing to monitor its “systems to proactively identify additional safeguards.”A network hack against Cardiovascular Associates led to the theft of data for 441,640 patients tied to its Alabama care sites.First discovered on Dec. 5, a threat actor gained access to “certain systems” within the CA network. After securing the impacted systems, an investigation was launched with support from an outside forensic firm. The forensic evidence revealed the access enabled the actor to copy some personal and health data from the network for a week between Nov. 28 and Dec. 5. The stolen information could include demographic details, SSNs, health insurance information, treatment information, medical record numbers, dates of service, provider names, diagnoses, health assessment information, tests and imaging, and billing and claims data. Some passports, driver’s licenses, credit and debit card information, and other financial account details were also affected.In response to this incident, Cardiovascular Associates has added further security and monitoring enhancements to minimize the risk of a recurrent incident.Regal Medical Group, Lakeside Medical Organization, ADOC Medical Group, and Greater Covina Medical in New York was hit with a ransomware attack on Dec. 8, which led to the exfiltration of data tied to over 3.3 million patients. It's the biggest healthcare data breach reported so far this year and impacts more patients than the third-largest incident reported in 2022.The health group is known collectively as Regal, and its notice shows the cyberattack began on Dec. 1 but went undetected for one week.After experiencing “difficulty in accessing some servers,” Regal performed an extensive review that found malware on some of its servers. The subsequent investigation later found the incident was caused by a threat actor accessing and exfiltrating data from its systems.A third-party team helped the medical group with its response to the incident, including restoring access to the systems and analyzing the impacted data. The stolen data could include names, SSNs for some patients, dates of birth, contact details, diagnoses, treatments, lab test results, prescriptions, radiology reports, and health plan numbers.Regal is providing all impacted patients with a year of free credit monitoring and has since bolstered its security and protocols.A network hack deployed against Howard Memorial Hospital in December led to the exfiltration of data tied to 53,668 patients. HMH detected the hack on Dec. 4 after the actor publicly claimed to have stolen patient data from its network.An investigation confirmed the allegations and determined the threat actor first gained access on Nov. 14. Upon discovery, HMH secured the network and performed a comprehensive review to identify the potentially stolen information.But “ultimately, HMH made the decision to notify all current or former patients and employees, in an abundance of caution, due to a potential impact to their information,” according to the notice. The data possibly accessed or stolen by the attacker could include SSNs, contact details, dates of birth, health insurance information, medical record numbers, medical histories, diagnoses, treatments, and physician names.Update: This story was updated on Feb 10 to include the number of patients affected by the Regal incident, newly reported to the Department of Health and Human Services.Update 2: This story was updated on Feb. 21 to include the number of patients impacted by the Cardiovascular Associates incident as reported to HHS.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Okta had 4,961 current and former employees' data, including names, health insurance plan numbers, and Social Security numbers, compromised following a breach at its third-party vendor Rightway Healthcare, reports The Register.Threat actors using private keys and passphrases from LastPass databases stolen in cyberattacks last August and December were reported by ZachXBT and MetaMask developer Taylor Monahan to have been able to exfiltrate $4.4 million worth of cryptocurrency on Oct. 25, BleepingComputer reports.The three companies claim no sensitive customer data was lost despite being targeted after the breach of the identity and access management firm.On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-08",
      "title": "New QakNote attacks push QBot malware via Microsoft OneNote files",
      "text": " A new QBot malware campaign dubbed \"QakNote\" has been observed in the wild since last week, using malicious Microsoft OneNote' .one' attachments to infect systems with the banking trojan.Qbot (aka QakBot) is a former banking trojan that evolved into malware that specializes in gaining initial access to devices, enabling threat actors to load additional malware on the compromised machines and perform data-stealing, ransomware, or other activities across an entire network.Threat actors can embed almost any file type when creating malicious OneNote documents, including VBS attachments or LNK files. These are then executed when a user double-clicks on the embedded attachment in a OneNote Notebook.However, it is necessary to introduce social engineering to convince users to click on a particular spot to launch the embedded attachment, usually done with a 'Double Click to View File' button or some other call to action, as shown below.Once launched, the embedded attachments can execute commands on the local machine to download and install malware.This switch in QBot's distribution was first publicly reported by Cynet's researcher Max Malyutin on Twitter on January 31, 2023.A script in the HTA file will use the legitimate curl.exe application to download a DLL file (the Qbot malware) to the C:\\ProgramData folder and is then executed using Rundll32.exe.The QBot payload injects itself into the Windows Assistive Technology manager (“AtBroker.exe”) to conceal its presence and evade detection from AV tools running on the device.Sophos reports that QBot’s operators employ two distribution methods for these HTA files: one that sends emails with an embedded link to the weaponized .one file and one where the “thread injections” method is used.The latter is a particularly tricky technique where the QBot operators hijack existing email threads and send a “reply-to-all” message to its participants with a malicious OneNote Notebook file as the attachment.To make these attacks even more deceptive for the victims, the threat actors use a fake button in the Notebook file that supposedly downloads the document from the cloud, but if clicked, it instead runs the embedded HTA attachment.While this action will generate a warning dialog for the victim warning about the risks of running attachments, there's always a chance that it will be ignored.As a defense against this new attack vector, Sophos suggests that email administrators consider blocking all .one file extensions, as they are not commonly sent as attachments. "
   },
   {
      "time": "2023-02-08",
      "title": "Microsoft launches new AI chat-powered Bing and Edge browser",
      "text": " Microsoft announced on Tuesday a new version of its Bing search engine powered by a next-generation OpenAI language model more powerful than ChatGPT and specially trained for web search.\"AI will fundamentally change every software category, starting with the largest category of all – search,\" Microsoft Chairman and CEO Satya Nadella said today at a Redmond press event.\"Today, we're launching Bing and Edge powered by AI copilot and chat, to help people get more from search and the web.\"Once you reach the top of the list and are accepted, you will receive an email notification indicating that you can now access the new Bing by going to Bing.com.You can then start using it via the standard search box. The new Bing engine will also be available through the chat experience, which can be found at the top of the search user interface.\"Bing searches for relevant content across the web and then summarizes what it finds to generate a helpful response. It also cites its sources, so you're able to see links to the web content it references,\" Microsoft explains.However, the company warns that \"Bing will sometimes misrepresent the information it finds, and you may see responses that sound convincing but are incomplete, inaccurate, or inappropriate. Use your own judgment and double check the facts before making decisions or taking action based on Bing's responses.\"​The new Edge browser provides users with two new features named 'chat' and 'compose' available in the sidebar that will allow them to summarize the contents of the currently loaded page or generate content based on a prompt, respectively.This feature is currently only in the Microsoft Edge Developer channel and can be accessed by clicking on the Bing logo above the sidebar. However, it requires being part of the preview, which is slowly adding new users.Microsoft says that users can \"get ahead in the line\" by downloading the 'Microsoft Defaults' program, which sets Edge and Bing as your default browser and search engine, and by installing the Microsoft Bing app.In BleepingComputer's tests, this did not allow us to immediately get access to Bing's AI chat feature but allegedly moved us up on the waiting list.For those that can't yet access the preview, Microsoft has shared the following chat queries that you can test today to see how the new AI-powered search engine works:For example, if you ask Bing to suggest a 3-course menu, it will generate a menu using recipes from the search index. When generating the AI-chat answer, each sourced item will link to the original source.Microsoft also uses the AI model with the core Bing search-ranking engine, which, according to the company, has led to \"the largest jump in relevance in two decades,\" making searches more relevant and accurate."
   },
   {
      "time": "2023-02-08",
      "title": "Russian crypto exchange exec pleads guilty to laundering Ryuk ransomware funds",
      "text": " A Russian man pleaded guilty on Monday in an Oregon court on charges related to laundering funds for the Ryuk ransomware group. Dubnikov pleaded guilty to one count of conspiracy to commit money laundering, which according to the Department of Justice is punishable by up to 20 years in federal prison, three years’ supervised release, and a $500,000 fine. Dubnikov is specifically accused of receiving 35 Bitcoin – part of a ransom paid to threat actors by a U.S.-based company – in exchange for approximately $400,000 in July 2019. He then converted the Bitcoin into Tether coins, before sending the currency on to a co-conspirator, who converted it to Chinese yuan. James Reddick has worked as a journalist around the world, including in Lebanon and in Cambodia, where he was Deputy Managing Editor of The Phnom Penh Post. He is also a radio and podcast producer for outlets like Snap Judgment.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-08",
      "title": "DPRK Using Unpatched Zimbra Devices to Spy on Researchers",
      "text": " A recent round of compromises that exploited unpatched Zimbra devices was an effort sponsored by the North Korean government and intended to steal intelligence from a collection of public and private medical and energy sector researchers.\"The campaign targeted public and private sector research organizations, the medical research, and energy sector as well as their supply chain,\" the W Labs report added. \"The motivation of the campaign is assessed to be most likely for intelligence benefit.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-08",
      "title": "Remcos software deployed in spying attempt on Ukraine’s government, CERT says",
      "text": " In a recent phishing campaign against Ukrainian government agencies, hackers attempted to install Remcos surveillance software on victims’ computers, according to a recent alert.One of the archives attached to the email contained an executable file of more than 600MB in size. Running this file installed the Remcos program on the victim's computer. CERT-UA did not disclose which Ukrainian government services were targeted by phishing emails or whether hackers managed to successfully install the spyware. The agency pinned the effort on a group labeled UAC-0050 that has been active in Ukraine since 2020. The hackers carried out previous attacks using remote desktop software Remote Utilities, CERT-UA said.A possible goal of the group is espionage, according to CERT-UA, as its members mostly targeted Ukraine’s government services.Breaking Security openly advertises Remcos on its website, describing it as “a lightweight, fast, and highly customizable remote administration tool with a wide array of functionalities.” Users can download the free version of the software or buy the premium version for €58 ($62). This Excel file displayed a yellow security bar warning the victim about dangerous macro code. The file message lured the victim into clicking the button to bypass the warning and execute the malicious macro code, Fortinet explains.With Remcos software, hackers can steal user credentials, gain control over online accounts and deploy additional malware variants on an infected computer, researchers said.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-08",
      "title": "Over 12% of analyzed online stores expose private data, backups",
      "text": " Many online stores are exposing private backups in public folders, including internal account passwords, which can be leveraged to take over the e-commerce sites and extort owners.The study examined 2,037 stores of various sizes and found that 250 (12.3%) exposed ZIP, SQL, and TAR archives on public web folders that can be freely accessed without requiring authentication.The archives appear to be backups containing database passwords, secret administrator URLs, internal API keys, and customer PII (personally identifiable information).In the same report, Sansec explains that its analysts observe constant activity from attackers who launch automated scans trying to pinpoint these backups and perform breaches.“Exposed secrets have been used to gain control of stores, extort merchants and intercept customer payments.”Threat actors try out various combinations of possible backup names on target sites based on the site name and public DNS data, such as “/db/staging-SITENAME.zip.”Because these probes are inexpensive to run and do not affect the target store’s performance, threat actors can conduct them for entire weeks until they find a backup.Sansec reports seeing multiple source IPs for these attacks, so threat actors are well aware of the existence of exposed backups, and many of them are attempting to take advantage.If the exposed backups contain administrator details, master database passwords, or staff accounts, the attackers can use them to gain access to the site and steal data or perform destructive attacks.Sansec urges website owners to routinely check their sites for accidentally exposed data and backup.If you have exposed a website backup publicly, immediately reset admin accounts and database passwords, and enable 2FA on all staff accounts.Additionally, check the web server logs to see if the backup was downloaded by a third party, and check admin account activity logs to identify signs of external access and malicious behavior.Sansec suggests that website administrators configure the webserver to restrict access to archive files if not needed in daily operations to prevent data leaks. Additionally, those using the Adobe Commerce platform should use the “immutable storage” feature."
   },
   {
      "time": "2023-02-08",
      "title": "Medusa botnet returns as a Mirai-based variant with ransomware sting",
      "text": " A new version of the Medusa DDoS (distributed denial of service) botnet, based on Mirai code, has appeared in the wild, featuring a ransomware module and a Telnet brute-forcer.Moreover, Medusa is now promoted as a MaaS (malware-as-a-service) for DDoS or mining via a dedicated portal. It promises service stability, client anonymity, support, an easy-to-use API, and adjustable cost based on specific needs.What's particularly interesting in this new Medusa variant is a ransomware function that enables it to search all directories for valid file types for encryption. The list of target file types includes mainly documents and vector design files.Valid files are encrypted using AES 256-bit encryption, and the .medusastealer extension is appended to the encrypted files' nameHowever, the encryption method appears broken, turning the ransomware into a data wiper.After encrypting files on the device, the malware sleeps for 86,400 seconds (24 hours) and deletes all files on the system drives.Only after deleting files does it display a ransom note that asks for the payment of 0.5 BTC ($11,400), which is counter-intuitive for a successful extortion attempt.Cyble believes this is an error in the code as the destruction of system drives makes it impossible for the victims to use their systems and read the ransom note. This bug also indicates that the new Medusa variant, or at least this feature, is still in development.It's worth noting that while the new version of Medusa features a data exfiltration tool, it does not steal user files before encryption. Instead, it focuses on collecting basic system information that helps in identifying victims and estimating resources that can be used for mining and DDoS attacks.Medusa also features a brute forcer that tries out commonly used usernames and passwords against internet-connected devices. Then, if successful, it attempts to download an additional payload that Cyble hasn't been able to retrieve and analyze.Next, Medusa executes the \"zmap\" command to find other devices with Telnet services running on port 23 and then tries to connect to them using the retrieved IP addresses and a combination of usernames and passwords.Finally, upon establishing a Telnet connection, the malware infects the system with the primary Medusa payload (\"infection_medusa_stealer\").The final Medusa payload also has incomplete support for receiving the “FivemBackdoor” and “sshlogin” commands.However, the corresponding code isn’t present in the client Python file yet, which is another sign of its ongoing development."
   },
   {
      "time": "2023-02-07",
      "title": "HPE, NetApp warn of critical open-source bug | SC Media",
      "text": "  Image shows the HPE OneView dashboard, courtesy of HPE.Hewlett Packard Enterprise (HPE) issued a critical alert Wednesday tied to its OneView infrastructure management platform warning of a use-after-free vulnerability that allows remote attackers to execute arbitrary code on targeted systems, leak data or create conditions ripe for a denial-of-service (DoS) attack.There are no public reports that the vulnerability is being exploited in the wild or that a public proof-of-concept attack exists.Both IBM and NetApp offer remediation, however the vendors indicate there is no workarounds or mitigations to the specific Expat flaw. Alternatively, both vendors offer upgrades that secure effected products. Last week NetApp warned users that the Expat flaw impacted eleven of its enterprise products. NetApp indicated it is still investigating whether any host utilities for SAN for Windows may also impacted. In October IBM warned its Tivoli Monitoring solution was impacted by the bug.A successful exploitation of the bug, NetApp warned, “could lead to disclosure of sensitive information, addition or modification of data, or Denial of Service.”HPE explained that Expat is used by its OneView platform to parse various XMLs. The bug, HPE said, only impacts versions of HPE OneView prior to 8.1. In a technical summary, HPE explained vulnerable systems allow an “attacker to triage a denial of service or potentially arbitrary code execution.”NIST wrote, versions of Expat (libexpat) before 2.4.9 have a use-after-free in the doContent function in xmlparse.c. It rates the bug as high severity, based on the CVSS 3.x metrics. Other vendors have rated the vulnerability as critical.Tom Spring is Editorial Director for SC Media and is based in Boston, MA. For two decades he has worked at national publications in the leadership roles of publisher at Threatpost, executive news editor PCWorld/Macworld and technical editor at CRN. He is a seasoned cybersecurity reporter, editor and storyteller that aims always for truth and clarity.The new PCI DSS standard puts more focus on application security, with more tools, testing and documentation required of developers.After exploiting MOVEit, GoAnywhere and PaperCut vulnerabilities the prolific Clop ransomware gang pivots and targets a SysAid zero-day server bug.Atlassian has confirmed exploitation of an already addressed Confluence Data Center and Server flaw, tracked as CVE-2023-22518, to facilitate ransomware deployment after a Rapid7 report observed related infections with the Cerber ransomware, which is long believed to be defunct, reports The Record, a news site by cybersecurity firm Recorded Future.Tue Oct 22On-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-07",
      "title": "Lazarus campaign exploits unpatched Zimbra devices, targets medical data | SC Media",
      "text": "  By exploiting the unpatched devices, the threat actors are able to gain network compromise and escalate privileges. The researchers have observed other possible victims from other verticals, which also led to data exfiltration.WithSecure has identified the ongoing campaign’s victims in healthcare research, a manufacturer of technology used in energy, research, defense, and healthcare verticals, and a chemical engineering department of a leading research university.Dubbed \"No Pineapple,\" the attacks leave an error message in a backdoors appended with the name “in the event data exceeds segmented byte size.” The report shows it appears these attacks are designed to gather intelligence from victim organizations. “The victimology follows the established pattern of high-value targets in medical research and energy, additionally WithSecure believes the threat actor has intentionally targeted the supply chain of these verticals,” according to the report.As reported in the fall of 2022, a critical remote code vulnerability listed as CVE-2022-41352 and rated a 9.8 in severity was reported as actively exploited in the wild beginning in mid-September. The flaw is caused by the devices using an antivirus engine that employs a cpio utility to scan inbound emails. A vulnerability in the utility can enable an attacker to create an archive to access any files within the Zimbra devices.The WithSecure report suggests that this is exactly what happened.Its researchers responded to a cyberattack leveraging these tactics during Q4 2022, which has been attributed with high confidence to the Lazarus Group. The forensic evidence shows signs of characteristics leveraged by the North Korea state-sponsored threat actors in other  campaigns.The attack was deployed against a Zimbra mail server in August, where the attackers exploited a local privilege escalation vulnerability in the Zimbra server. After a week of dwell time, the threat actor exfiltrated approximately 100GB of data from the mail server without taking any “destructive action by the point of disruption.”After one month, the threat actor laterally moved to a vulnerable domain joined by a Windows XP device. Over a monthlong period, the attacker continued to move laterally across the network, performing reconnaissance, and deploying multiple custom tools and malware. Dtrack was one variant used, which the researchers believe is an updated version of GREASE.In the observed campaign, the threat actor used readily available, off-the-shelf webshells and custom binaries, in addition to abusing legitimate Windows and Unix tools. A successful exploit can enable an attacker to install tools for proxying, tunneling, and relaying connections.The “actor used many built-in commands to enumerate the network and compromised devices,” the report notes. “Some of these commands were hardcoded into binaries, but others were run manually by the operators. Many commands used were standard Windows command line tools, though two PowerShell cmdlets were also run.”Its C2 behavior suggests that it employs a small number of C2 servers, which are connected through multiple relays and endpoints. The report notes that “some C2 servers appear to themselves be compromised victims.”What’s more, “web shells and Cobalt Strike beacons were observed which served as persistence mechanisms, the report authors wrote. Legitimate accounts were also compromised, and the threat actors created illegitimate accounts. The actor also created auto-run services and scheduled tasks, commonly used to persist on a network.The researchers warned that the actor also attempted to remove artifacts and indicators of their presence, such as deleting files and tools and clearing logs, to evade detection. They also tried “to give dropped files innocent names which would blend into the system.” In one instance, they named files the same as directories within a parent network of exploited Zimbra servers.The report contains a long list of tactics and methods deployed during the observed campaign that can support identification and possible remediation.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Ukraine had experienced a less than a day-long power outage in October 2022 following an attack by Russian state-sponsored hacking operation Sandworm targeted at an electrical substation amid the ongoing Russia-Ukraine war, marking the first cyberattack-related power interruption in the country since 2017, CyberScoop reports.Attacks deployed by Iranian state-backed threat operation MuddyWater against Israel saw the utilization of the new MuddyC2Go command-and-control framework, which replaced the PhonyC2 custom platform following the exposure of its source code, reports The Hacker News.Israel had its technology, logistics, and transportation industries targeted by Iranian advanced persistent threat operation Charming Kitten, also known as APT35 and Imperial Kitten, last month amid its ongoing war with Palestinian militant group Hamas, according to The Record, a news site by cybersecurity firm Recorded Future.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-07",
      "title": "HHS urges OpenEMR patch to close remote code execution vulnerabilities | SC Media",
      "text": "  OpenEMR is a popular electronic health records system with an estimated 5,000 downloads each month by 100,000 global providers and serving over 200 million patients. Maintained by a community of volunteers and support professionals, OpenEMR is notably used by PeaceCorps, IPPF, and the Siaya District Hospital in Kenya. The Sonar report details the unauthenticated file read, authenticated local file inclusion, and an authenticated reflected XSS. Without the patch, “a rogue MySQL server can read arbitrary files from an OpenEMR instance,” according to the report. Further, the installer fails to delete itself after a successful installation and, as the setup is divided into parts, an unauthenticated user can perform some actions through a user-controlled parameter state.As a result, an unauthenticated attacker would be able to perform a database query on their own server by enabling the MySQL statement LOAD DATA to load the contents of a file into a database table.“If the modifier LOCAL is given, the file is read from the client instead of the server,” Sonar researchers wrote.An attacker-controlled MySQL configuration can lead to the compromise of the arbitrary file read vulnerability. And when combined with the two other flaws, an unauthorized attacker can take over the device and deploy remote code execution.The HC3 alert warns that each of these flaws “represent opportunities for cybercriminals to launch ransomware attacks and data breaches — both of which are persistent threats to the health sector, among other types of attacks.”Although providers can completely reinstall OpenEMR, the alert warns that attackers can specify a configuration during the setup steps via the properties of the Installer class to take over any OpenEMR instance.As noted, OpenEMR maintainers addressed all of these serious vulnerabilities and further hardened the application in its November 2022 update to version 7.0.0 of the platform.The EMR now includes a series of CSRF checks and sessions to patch the arbitrary file read vulnerability, which also further restricts the installation process. Now, even an unauthenticated attacker would need to go through the installation steps in the correct order. And “when a config file already exists in an installed OpenEMR instance, the setup process fails in the first step.”OpenEMR also strengthened the PHP function to encode important characters and blocks the ability of an attacker to escape the context and prevents the XSS vulnerability. The update also sanitized the user-controlled parameter, which now only allows alphanumeric characters to prevent path traversal.OpenEMR intends to bolster this process to reduce the risk of potential exploit, as well.Maintainers of the OpenEMR are notoriously responsive to any potential vulnerabilities. In one notable instance from 2018, when researchers found nearly 30 critical vulnerabilities in the platform that left millions of patient records vulnerable to attack. It was the second round of security flaws found that year.Those bugs included flaws that could enable an attacker to bypass the patient portal authentication and navigate to the registration page, as well as change the URL. A number of SQL injection bugs were also found that could be used to view data from targeted databases. The round of disclosures included other remote code execution vulnerabilities.Much like the latest vulnerability disclosure, OpenEMR was quick to provide an update that eliminated these risks.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Atlassian has confirmed exploitation of an already addressed Confluence Data Center and Server flaw, tracked as CVE-2023-22518, to facilitate ransomware deployment after a Rapid7 report observed related infections with the Cerber ransomware, which is long believed to be defunct, reports The Record, a news site by cybersecurity firm Recorded Future.SecurityWeek reports that patches have been released by Veeam to remediate four security vulnerabilities impacting its Veeam ONE IT monitoring and analytics solution.It’s clear iLeakage presents itself as a major flaw with no known mitigation and it’s a real problem for iOS devices – here are some ideas on how to respond. Tue Oct 22On-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-07",
      "title": "CISA adds Oracle, SugarCRM bugs to exploited vulnerabilities list",
      "text": " On Thursday, CISA added CVE-2022-21587 – affecting Oracle's E-Business suite – and CVE-2023-22952 – which affects multiple products from SugarCRM – to its Known Exploited Vulnerabilities Catalog. As with all additions to the list, CISA explained that the vulnerabilities are “frequent attack vectors for malicious cyber actors and pose significant risks to the federal enterprise.”SugarCRM released a report on January 13 claiming that “no intrusion has been detected in any instances of Sugar Sell, Enterprise, Professional, Serve, and Ultimate software solutions running in the SugarCloud.” Andrew Barratt, vice president at Coalfire, told The Record that SugarCRM is a hugely popular customer relations management product often used by small and medium enterprises as well as middle market organizations.“The vulnerability announced allows for remote code execution which creates substantial amounts of risk,” he said. “CRM tools typically have large amounts of both personal data and commercially sensitive information. Often these are a treasure trove of deals and opportunities. There is downstream risk though if a CRM is compromised whilst the data might be considered to belong to the user. That data is probably relevant to many of their customers creating an amplification of the issue.”Netenrich’s John Bambenek noted that the two vulnerabilities represented two very different market segments, illustrating the wide array of targets nation-states and cybercriminals now have access to. “SugarCRM is going after the small business market and those who don’t have the resourcing to pay for and fully realize the value of SalesForce,” he said. “Oracle is on the other end of that spectrum with many enterprise users. This highlights that all market segments attract APT and nation-state risks that should enforce the need to make sure updates are applied as quickly as they come out.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-07",
      "title": "Iran-Backed Actor Behind 'Holy Souls' Cyberattack on Charlie Hebdo, Microsoft Says",
      "text": " A recent attack where a threat group calling itself \"Holy Souls\" accessed a database belonging to satirical French magazine Charlie Hebdo and threatened to dox more than 200,000 of its subscribers was the work of Iranian state-actor Neptunium, Microsoft said on Feb. 3.Many of the actions that Neptunium took in executing the attack, and following it, were consistent with tactics, techniques, and procedures (TTPs) that other Iranian state actors have employed when carrying out influence operations, Microsoft said. This included the use of a hacktivist identity (Holy Souls) in claiming credit for the attack, the leaking of private data, and the use of fake — or \"sockpuppet\" — social media personas to amplify news of the attack on Charlie Hebdo.For instance, following the attack, two social media accounts (one impersonating a senior French tech executive and the other an editor at Charlie Hebdo) began posting screenshots of the leaked information, Microsoft said. The company said its researchers observed other fake social media accounts tweeting news of the attack to media organizations, while others accused Charlie Hebdo of working on behalf of the French government.The FBI has described the group's MO as including first-stage reconnaissance on potential targets via Web searches, and then using the results to scan for vulnerable software that the targets could be using. \"In some instances, the objective may have been to exploit a large number of networks/websites in a particular sector as opposed to a specific organization target,\" the FBI has noted. \"In other situations, Emennet would also attempt to identify hosting/shared hosting services.\"When attempting to break into a target network, Neptunium first verifies if the organization might be using default passwords for specific applications, and it tries to identify admin or login pages. \"It should be assumed Emennet may attempt common plaintext passwords for any login sites they identify,\" the FBI said.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-07",
      "title": "Hive takedown illustrates FBI's evolution towards victim-recovery efforts | SC Media",
      "text": "  FBI Director Christopher Wray, center, joined by Attorney General Merrick Garland, right, and Assistant Attorney General Lisa Monaco, delivers remarks on an international ransomware enforcement action at the U.S. Justice Department on Jan. 26, 2023, in Washington. (Photo by Kevin Dietsch/Getty Images)The bureau was pilloried by much of the broader cybersecurity community, as well as members of Congress, for seemingly prioritizing its own investigative and law enforcement activities while leaving hundreds of Kaseya customers twisting in the wind, agonizing over whether to pay millions of dollars in ransom or refuse and see their data lost or leaked on the internet.Former Rep. Jim Langevin, D-R.I., co-founder of the Congressional Cybersecurity Caucus who built a reputation as one of the most cyber-savvy House legislators, echoed the frustration of many on the Hill and within the private sector when he chided Wray for the bureau’s response, analogizing it to the police blocking firefighters from putting out a house fire because it might damage forensic evidence that would help them investigate the arsonist. “I would just push back and say that asset response has to be higher on the priority list. So much could have been prevented had those decryption keys been given to businesses that were impacted,” said Langevin.The reaction from former critics like Langevin — as well as the details of the Hive takedown, public comments by FBI leadership and interviews with former government officials — indicate that the bureau may be internalizing some of the hard lessons it took from the fallout of the Kaseya incident when it comes to prioritizing victim recovery.Austin Berglas, a former FBI cyber official, said the Kaseya and Hive operations “are things that are new situations that law enforcement and the FBI have been put into” over the past half decade as cybercrime, state-backed hacks and other forms of digital crime have become higher priorities for law enforcement and policymakers.“I think that when you look at what happened with Kaseya and now Hive — [there were] huge lessons learned,” said Berglas, now global head of professional services at BlueVoyant, in an interview.That learning curve includes a renewed emphasis on victim recovery, both in operational priorities and public messaging.Whereas during the Kaseya episode the FBI opted to keep their possession of REvil’s decryptor key a secret from victims, a search warrant used to seize two U.S.-based Hive servers on Jan. 11 this year disclosed that agents had actually infiltrated the ransomware group’s network six months earlier, spending part of that time stealing over 1,000 decryptors that they then quietly passed along to over 300 victims and businesses.Wray and others practically treated their press conference announcing the takedown as a commercial to advertise the unique benefits that businesses and victims could potentially reap by picking up the phone and calling the FBI in the wake of an incident.“Our actions in this investigation should speak clearly to those victims: it pays to come forward and to work with us…we need your help to stop cyber criminals to prevent future victims and in exchange, we pledge our tireless efforts to help you protect your systems and to prevent or recover losses,” Deputy Attorney General Lisa Monaco said at one point.To be clear, there is still a fair bit we do not know about the precise circumstances behind the Hive operation, such as what pushed the FBI to move on seizing the servers and shutting down Hive’s dark net sites in January, how early the FBI used its access to Hive’s network to pilfer victim keys (Monaco said the activities went on “for months”) or precisely how the bureau balanced those needs with other investigative and disruptive priorities.I think a lot of this is a reaction to things that they didn’t quite get right, or at least the perception that they didn’t get right, in the Kaseya case,” said Bryan Ware, a former assistant director at the Cybersecurity and Infrastructure Security Agency and is now CEO of LookingGlass Cyber Solutions. “You can’t just tell businesses not to pay the ransom but then they’re left to their own devices. This [incident] shows…that the bureau has some teeth here and is willing to be a good partner.”The Department of Justice will likely always need to walk a fine line between helping victims and gathering intelligence or moving to dismantle ransomware infrastructure before a group is potentially tipped off that their network is compromised. However, the renewed public focus on recovering lost data and getting organizations back up and running is “absolutely a message of success and something that they will use as a foundation going forward.”“Private companies want to know, [if I] share my intelligence and share my information, what am I going to get back? That’s the question always,” said Berglas, relaying feedback the government frequently hears from cooperating businesses. “Often times we’re giving indicators of compromise and domains and IP addresses and all this stuff, but I never hear anything back from you guys. This is the [FBI’s] message, this is saying if you report these things to us, our aperture can open up, we can start helping you.”One of the reasons the FBI and Department of Justice are increasingly emphasizing their remediation and recovery efforts these days may be because they have lost ground over the past few years to other federal agencies when it comes to being the cybersecurity communication gateway to the private sector.Chiefly, the elevation of the Cybersecurity and Infrastructure Security Agency over the past five years has eaten into the FBI’s role as the primary federal entry point for hacked organizations.There remain large and meaningful differences between the writs of FBI’s and CISA over cybersecurity issues. For instance, CISA has little if any authorities over traditional law enforcement investigations or prosecution of cybercrime, focusing mainly on coordinating with private sector entities and providing technical assistance to insecure organizations. It’s also far smaller, less resourced and lacks the authorities or capabilities to do anything like the Hive takedown.Wray often likes to note that the FBI has well-staffed field offices in every state and can often be at the door of a hacked business “within an hour” of getting a call. Ware noted that despite the increased authorities and funding from Congress, CISA still lacks anything close to that kind of reach and presence, with approximately 150 cybersecurity advisors spread out across all 50 states.“I think there is a desire to have that single front door [for the private sector] but there’s some practical challenges. One of those is that if it’s a criminal matter, CISA is not a law enforcement agency, it doesn’t have the criminal authorities, it can’t do the same kind of investigations, it can’t recover lost funds, it can’t bring the bad guys to justice,” said Ware.The flip side is that while the FBI and Wray have far more resources to bring to bear, the bureau also have a much larger mission portfolio and their top cyber officials tend to operate lower in departmental hierarchy. By contrast, CISA and its director, Jen Easterly, essentially function as the top cybersecurity authorities within the Department of Homeland Security (although technically other officials, like undersecretary Rob Silvers, sit above Easterly and wield influence over policy), allowing for a sharper focus on cyber issues.That hasn’t stopped FBI officials from continuing to insist, as Wray did at the end of the Hive presser, that the agency still has a unique federal role and capabilities that should incentivize the private sector to reach out when they are hit with a cyberattack.“Today’s lesson for businesses large and small, for hospitals and police departments and really all the other many victims of ransomware is this: reach out to your local FBI field office today. Introduce yourself so that you know who to call if you become the victim of a cyber attack,” said Wray. “We are ready to help you build a crisis response plan so that when an intruder does come knocking, you’ll be prepared and like the Hive victims here, when you talk to us in advance…you will know how we operate quickly and quietly, giving you the assistance, the intelligence and the technical information that you want and you need.”Derek is a senior editor and reporter at SC Media, where he has spent the past three years providing award-winning coverage of cybersecurity news across the public and private sectors. Prior to that, he was a senior reporter covering cybersecurity policy at Federal Computer Week. Derek has a bachelor’s degree in print journalism from Hofstra University in New York and a master’s degree in public policy from George Mason University in Virginia.A family-owned Ohio business was hit by ransomware during a holiday weekend — and was able to get back up and running within a few hours. Here's how they did it.Put awareness training at the center of a strategy to secure employee devices.Keeping our devices secure: Reflecting on 20 years of Patch Tuesday.On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-07",
      "title": "How the Cloud Is Shifting CISO Priorities",
      "text": " The challenges facing chief information security officers (CISOs) have evolved dramatically in the past decade. Today, they must align their security efforts — and budgets — with the business goals of their organization, which may range from maintaining customer confidence that their data is safe to protecting intellectual property from theft.As a key member of the executive management team, CISOs often have board-level reporting responsibilities. They must manage a new and daunting level of technical complexity introduced by the cloud, where identities are virtually the first and last line of defense. And the job doesn't end there. To be successful, they must also put substantial effort into building a team with skills in a variety of disciplines, and choosing the right defensive technologies.Data-center-oriented companies that have transitioned to the cloud obviously face a new set of security concerns that conventional firewalls were never designed to handle. Hence, the now commonly heard refrain \"Identity is the new perimeter.\" This is certainly true. While firewalls and other network-based controls shouldn't be abandoned, CISOs need to focus on identity issues. The following three-step process can deliver results in this area quickly and efficiently.Correlate excess privileges and misconfigurations. Cloud misconfigurations are another serious risk. But when a privileged identity has access to a misconfigured cloud resource, the results can be disastrous. Fortunately, automated tools are now available to help detect misconfigurations, as well as excessive privileges, and remediate them to eliminate threats.Cloud engineering. The security team also needs to handle the day-to-day requirements of cloud security, which may include management, maintenance, and more. Competent cloud engineering is essential for \"keeping the lights on\" in the security sphere.One approach that works well as a supplement to hiring is development from within through training. This may occur in-house or through third-party certification programs. Also, in choosing vendors, organizations should favor those whose offerings include a strong training component. If possible, CISOs may find ways to get non-security employees to work on some security tasks.To sum up, the challenges facing today's CISOs are largely driven by the cloud, which creates a greatly expanded attack surface that needs to be protected. Meanwhile, mastering the management model and tools used by each cloud platform requires security expertise that is in extremely short supply. Solutions are available that provide the visibility and platform knowledge needed to help security teams implement best practices for protecting their cloud infrastructure, while helping them up-skill analysts in the process.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-07",
      "title": "Is Your EV Charging Station Safe? New Security Vulnerabilities Uncovered",
      "text": " Two new security weaknesses discovered in several electric vehicle (EV) charging systems could be exploited to remotely shut down charging stations and even expose them to data and energy theft.\"The lack of a clear guideline for multiple active connections can be exploited by attackers to disrupt and hijack the connection between the charge point and the CSMS.\"This also means that a cyber attacker could spoof a connection from a valid charger to its CSMS provider when it's already connected, effectively leading to either of the two scenarios:The forging is made possible owing to the fact that CSMS providers are configured to solely rely on the charging point identity for authentication.\"Combining the mishandling of new connections with the weak OCPP authentication and chargers identities policy could lead to a vast Distributed DoS (DDoS) attack on the [Electric Vehicle Supply Equipment] network,\" the researchers said.OCPP 2.0.1 remediates the weak authentication policy by requiring charging point credentials, thereby closing out the loophole. That said, mitigations for when there are more than one connection from a single charging point should necessitate validating the connections by sending a ping or a heartbeat request, SaiFlow noted.\"If one of the connections is not responsive, the CSMS should eliminate it,\" the researchers explained. \"If both connections are responsive, the operator should be able to eliminate the malicious connection directly or via a CSMS-integrated cybersecurity module.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-02-07",
      "title": "Finland’s Most-Wanted Hacker Nabbed in France – Krebs on Security",
      "text": " Julius “Zeekill” Kivimäki, a 25-year-old Finnish man charged with extorting a local online psychotherapy practice and leaking therapy notes for more than 22,000 patients online, was arrested this week in France. A notorious hacker convicted of perpetrating tens of thousands of cybercrimes, Kivimäki had been in hiding since October 2022, when he failed to show up in court and Finland issued an international warrant for his arrest.In late October 2022, Kivimäki was charged (and “arrested in absentia,” according to the Finns) with attempting to extort money from the Vastaamo Psychotherapy Center. In that breach, which occurred in October 2020, a hacker using the handle “Ransom Man” threatened to publish patient psychotherapy notes if Vastaamo did not pay a six-figure ransom demand.Vastaamo refused, so Ransom Man shifted to extorting individual patients — sending them targeted emails threatening to publish their therapy notes unless paid a 500-euro ransom.When Ransom Man found little success extorting patients directly, they uploaded to the dark web a large compressed file containing all of the stolen Vastaamo patient records.“It was a huge opsec [operational security] fail, because they had a lot of stuff in there — including the user’s private SSH folder, and a lot of known hosts that we could take a very good look at,” Kurittu told KrebsOnSecurity, declining to discuss specifics of the evidence investigators seized. “There were also other projects and databases.”Police responding to the scene were admitted by another woman — possibly a roommate — and found the man inside still sleeping off a long night. When they roused him and asked for identification, the 6′ 3″ blonde, green-eyed man presented an ID that stated he was of Romanian nationality.The French police were doubtful. After consulting records on most-wanted criminals, they quickly identified the man as Kivimäki and took him into custody.Kivimaki and other HTP members were involved in mass-compromising web servers using known vulnerabilities, and by 2012 Kivimäki’s alias Ryan Cleary was selling access to those servers in the form of a DDoS-for-hire service. Kivimäki was 15 years old at the time.The DDoS-for-hire service allegedly operated by Kivimäki in 2012.In 2013, investigators going through devices seized from Kivimäki found computer code that had been used to crack more than 60,000 web servers using a previously unknown vulnerability in Adobe’s ColdFusion software.As KrebsOnSecurity reported at the time, this small ColdFusion botnet of data broker servers was being controlled by the same cybercriminals who’d assumed control over ssndob[.]ms, which operated one of the underground’s most reliable services for obtaining Social Security Number, dates of birth and credit file information on U.S. residents.Kivimäki also was involved in calling in multiple fake bomb threats and “swatting” incidents — reporting fake hostage situations at an address to prompt a heavily armed police response to that location.Kivimäki’s apparent indifference to hiding his tracks drew the interest of Finnish and American cybercrime investigators, and soon Finnish prosecutors charged him with an array of cybercrime violations. At trial, prosecutors presented evidence showing he’d used stolen credit cards to buy luxury goods and shop vouchers, and participated in a money laundering scheme that he used to fund a trip to Mexico.Kivimäki was ultimately convicted of orchestrating more than 50,000 cybercrimes. But largely because he was still a minor at the time (17) , he was given a 2-year suspended sentence and ordered to forfeit EUR 6,558.“The danger in such a decision is that it emboldens young malicious hackers by reinforcing the already popular notion that there are no consequences for cybercrimes committed by individuals under the age of 18.Kivimäki is now crowing about the sentence; He’s changed the description on his Twitter profile to “Untouchable hacker god.” The Twitter account for the Lizard Squad tweeted the news of Kivimäki’s non-sentencing triumphantly: “All the people that said we would rot in prison don’t want to comprehend what we’ve been saying since the beginning, we have free passes.”Something tells me Kivimäki won’t get off so easily this time, assuming he is successfully extradited back to Finland. A statement by the Finnish police says they are seeking Kivimäki’s extradition and that they expect the process to go smoothly.“Same thing,” Kivimäki replied. “Shall we start some kind of club? A support organization for wanted persons?”\r\n         This entry was posted on Sunday 5th of February 2023 11:14 AM \r\n         Interesting  article,   a guy  with  anger  issues  , that  does swatting, bomb threats  and  domestic violence , hacks into  a psychotherapy practice without  any remorse Who  see’s  the irony  here ?Fantastic news, and well done to all of the investigators involved! Kivimaki has been a menace to society, stealing money and blackmailing ever since he got a slap on the wrist for 50,000 counts of hacking. There are many reformed hackers, but Kivimaki is not one of them.Yes — string this career hacker criminal up by his thumbs, in Solitary Confinement, for the rest of his twisted life.  Far too many times these cybercrooks get a mild slap on the wrist and they’re back on the cyber highway after spreading their knowledge to anyone smart enough with whom they’re incarcerated.Make an example of this punk!I totally agree. All hackers need to be held accountable and given serious prison sentences.  Additionally, they should be prohibited from using any technology for their entire sentence.  They should be limited to only writing letters and sending them by snail mail or 5 minute monitored plain old trlephone calls  home.   Confinement should ensure that their technical skills go down the toilet forever.  Do not pamper these criminals.  I would rather see minor drug abusers be given a break and rehabilitation and let all these cyber criminals rot in prison.  These criminals are attacking medical organizations and that makes the violent criminals against the sick.Gutter criminal. Off with his head. (Not kidding)Zut alors!\nAleksanteri, bienvenue a la belle France!!!I have often traversed Romania with a “New Jersey passport”, but have yet to meet a 6’-3” Romanian male who resembled a blond, green-eyed, Nordic giant…Understood that this was a bad “fast guess” by you, when those gendarmerie rudely interrupted your slumber.\n(Aren’t the only blonds in Romania from a bleach bottle?)However, keep your spirits up and positive.\nLike the rest of us, into every data thug’s life, a little rain must fall…Remember, you are very lucky to be in the EU/Finland justice system. But in case you are extradited to the US, a few tips…\nEmphasize that you never used a gun for your alleged ill-gotten gains.\nNo gun in your crime, means 6 hours in a US jail unless the fraud was above US$1 million.\n(If you used a gun to rob $3.14 in the street, that’s 15 years for openers.)Yes, then you will get 3 hots and a cot, plus almost good health and dental care.\nBut avoid “Fat Albert” in cell block B…The wheels of human justice grind slowly Aleks, but inexorably…\nWe will somehow recover from missing you on Tik Tok…Weird spam is weird.like those he hurts & everyone else, dude has embarrassing secrets.\npls, someone, put him in his place & spill it.I wish he wouldn’t of gotten caught!!! All of the governments including there officials have been robbing the people. Modern day slavery. FREE HIM UNTIL ITS READ BACKWARDSGrow up. He destroyed people’s lives and if governments were not providing basic infrastructure people that need the Internet would not exist. The real survivalist live off the grid.This is really good news. I hope it will bring some kind of closure to the individuals affected especially by the absolutely shameless Vastaamo data breach and patient record publication.Who among us hasn’t accidentally uploaded our entire /home to the dark web? His arrogance seems unwarranted. Glad he’ll be out of circulation.Its honestly a wonder why he didn’t get caught sooner, being that stupid. Im legitimately bewildered as to how that happensGlad to see some of the worst of humans get a little suffering too, for a change.He used his keyboards/computers just like a gun in the back! He is a COWARD and a THUG that sneeks into our private and professional lives. It’s time for raising the amount of time and TRUTH in SENTENCING for CYBER CRIMINALS. Onec the thief is released keep him/them on paper for 10 yrs. C if these looser laugh at that!“I’d rather not be paid in imaginary money”…I enjoy these stories. Thank you Brian Krebs.Sadly, the Finnish criminal law system is notoriously lenient and understanding to criminals. If he gets 2 years (let alone more), that would be extraordinary. After that, the system is heavily geared towards integrating this PoS back into society.But of course things like this – bullying, abusing and extorting the vulnerable – is not something that is generally kindly looked on by hardcore criminals. Recently, a suspected child molester (who was apparently innocent, however) was beaten and tortured to death by other prisoners while in police custody in Finland.\nIt is entirely possible that Julius Kivimäki might have a very interesting jail time, involving one or more peculiar ‘accidents’.You cannot put child molesting on the same level as extortion. No one in prison will do that lolWho would attack a healthcare organization? That is really low. This is where folks are struggling to stay alive and you will go over and pull the plug to buy Gucci socks?  Even Satan stopped that. Lock him up for a long time and update the laws that allow these acts to persist. If you are truly smart with computers, use your skills for good and you will be rewarded by society.kyllästyi patonkiin? vois kirjottaa kirjan ja kääntyä uskoon tiilenpäitä lueskellessa?I think this kid needs a job and a wife. I say cut his index fingers clean off, tattoo a big shlong on his forhead and mutilate his toung. He will soon then seek mental health he saught to abuse in the passed. then release him. Let the world and life be his punishment“shifted to extorting individual patients — sending them targeted emails threatening to publish their therapy notes”\nThreatening psy patients? I wish for him some of them were not hard-boiled psychopath…It’s concerning to see the extent of damage that one individual can inflict through cybercrime. The fact that Julius Kivimäki has been involved in numerous hacking incidents, including the extortion and leak of therapy notes for thousands of patients, is alarming.\nHopefully, his arrest will serve as a warning to others who engage in similar activities, and reinforce the importance of cybersecurity measures to protect sensitive information.Comments are closed.Mailing ListSearch KrebsOnSecurityRecent PostsStory CategoriesWhy So Many Top Hackers Hail from Russia"
   },
   {
      "time": "2023-02-07",
      "title": "Linux version of Royal Ransomware targets VMware ESXi servers",
      "text": " Royal Ransomware is the latest ransomware operation to add support for encrypting Linux devices to its most recent malware variants, specifically targeting VMware ESXi virtual machines.It also comes with support for multiple flags that will give the ransomware operators some control over the encryption process:When encrypting files the ransomware will append the .royal_u extension to all encrypted files on the VM.Royal Ransomware is a private operation comprised of seasoned threat actors who previously worked with the Conti ransomware operationWhile they initially utilized encryptors from other operations, such as BlackCat, they transitioned to using their own, starting with Zeon which dropped ransom notes similar to those generated by Conti.In mid-September, the group rebranded as \"Royal\" and began deploying a new encryptor in attacks that produces ransom notes with the same name. The gang demands ransom payments ranging from $250,000 to tens of millions after encrypting their targets' enterprise network systems. The ransomware groups' shift towards targeting ESXi virtual machines aligns with a trend where enterprises have transitioned to VMs as they come with improved device management and much more efficient resource handling. After deploying their payloads on ESXi hosts, the ransomware operators use a single command to encrypt multiple servers.\"The reason why most ransomware groups implemented a Linux-based version of their ransomware is to target ESXi specifically,\" Wosar told BleepingComputer last year.These systems will only receive technical support from now on but no security updates, which exposes them to ransomware attacks."
   },
   {
      "time": "2023-02-06",
      "title": "New APT34 Malware Targets The Middle East",
      "text": " BusinessImprove your risk posture with attack surface managementSecurity that enables business outcomesGain visibility and meet business needs with securityConnect with confidence from anywhere, on any deviceSecure users and key operations throughout your environmentMove faster than your adversaries with powerful purpose-built XDR, attack surface risk management, and zero trust capabilitiesMaximize effectiveness with proactive risk reduction and managed servicesUnderstand your attack surface, assess your risk in real time, and adjust policies across network, workloads, and devices from a single consoleDrive business value with measurable cybersecurity outcomesSee more, act fasterEvolve your security to mitigate threats quickly and effectivelyEnsure code runs only as intendedGain visibility and control with security designed for cloud environmentsProtect patient data, devices, and networks while meeting regulationsProtecting your factory environments – from traditional devices to state-of-the-art infrastructuresICS/OT Security for the oil and gas utility industryICS/OT Security for the electric utilityBridge threat protection and cyber risk managementOperationalize a zero trust strategyStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformDefend the endpoint through every stage of an attackOptimized prevention, detection, and response for endpoints, servers, and cloud workloadsThe most trusted cloud security platform for developers, security teams, and businessesLeverage complete visibility and rapid remediationSimplify security for your cloud-native applications with advanced container image scanning, policy-based admission control, and container runtime protectionSecurity for cloud file/object storage services leveraging cloud-native application architecturesAdvanced cloud-native network security detection, protection, and cyber threat disruption for your single and multi-cloud environments.Visibility and monitoring of open source vulnerabilities for SecOpsAs your organization continues to move data and apps to the cloud and transform your IT infrastructure, mitigating risk without slowing down the business is critical.Expand the power of XDR with network detection and responseProtect against known, unknown, and undisclosed vulnerabilities in your networkDetect and respond to targeted attacks moving inbound, outbound, and laterallyRedefine trust and secure digital transformation with continuous risk assessmentsStop phishing, malware, ransomware, fraud, and targeted attacks from infiltrating your enterpriseOn-premises and cloud protection against malware, malicious applications, and other mobile threatsKeep ahead of the latest threats and protect your critical data with ongoing threat prevention and analysisStop threats with comprehensive, set-it-and-forget-it protectionAugment security teams with 24/7/365 managed detection, response, and supportAugment threat detection with expertly managed detection and response (MDR) for email, endpoints, servers, cloud workloads, and networksOur trusted experts are on call whether you're experiencing a breach or looking to proactively improve your IR plansStop breaches with the best response and detection technology on the market and reduce clients’ downtime and claim costsGrow your business and protect your customers with the best-in-class complete, multilayered securityDeliver modern security operations services with our industry-leading XDRPartner with a leading expert in cybersecurity, leverage proven solutions designed for MSPsAdd market-leading security to your cloud service offerings – no matter which platform you useIncrease revenue with industry-leading securityDiscover the possibilitiesWe work with the best to help you optimize performance and valueContent has been added to your FolioAPT & Targeted AttacksWe analyze an infection campaign targeting organizations in the Middle East for cyberespionage in December 2022 using a new backdoor malware. The campaign abuses legitimate but compromised email accounts to send stolen data to external mail accounts controlled by the attackers.By: Mohamed Fahmy, Sherif Magdy, Mahmoud Zohdy\n\t\t\n\t\t\tFebruary 02, 2023\nRead time:  ( words)\n\tSave to FolioOn December 2022, we identified a suspicious executable (detected by Trend Micro as Trojan.MSIL.REDCAP.AD) that was dropped and executed on multiple machines. Our investigation led us to link this attack to advanced persistent threat (APT) group APT34, and the main goal is to steal users’ credentials. Even in case of a password reset or change, the malware is capable of sending the new credentials to the threat actors. Moreover, after analyzing the backdoor variant deployed, we found the malware capable of new exfiltration techniques — the abuse of compromised mailbox accounts to send stolen data from the internal mail boxes to external mail accounts controlled by the attackers. While not new as a technique, this is the first instance that APT34 used this for their campaign deployment. Following this analysis, it is highly likely that this campaign’s routine is only a small part of a bigger chain of deployments. Users and organizations are strongly advised to reinforce their current security measures and to be vigilant of the possible vectors abused for compromise.RoutineIn this section, we describe the attack infection flow and its respective stages, as well as share details on how the group uses emails to steal and exfiltrate critical information.First Stage: Initial DroppersWe found the initial stage .Net dropper malware called MrPerfectInstaller (detected by Trend Micro as Trojan.MSIL.REDCAP.AD) responsible for dropping four different files, with each component stored in a Base64 buffer inside the main dropper. It drops the following: The dropper also adds the following registry key to assist in implementing the password filter dropped earlier:HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Control\\Lsa \n Notification Packages = scecli, psgfilterThe main .Net binary implements two arguments for its operation: the first argument for installing the second stage, and the second argument for uninstalling it and unregistering the password filter dropped.Second Stage:  Abusing The Dropped Password Filter PolicyThese password filters can be abused by a threat actor as a method to intercept or retrieve credentials from domain users (domain controller) or local accounts (local computer). This is because for password filters to perform, password validation requires the password of the user in plaintext from the Local Security Authority (LSA). Therefore, installing and registering an arbitrary password filter could be used to harvest credentials every time a user changes his password. This technique requires elevated access (local administrator) and can be implemented with the following steps:Using this technique, the malicious actor can capture and harvest every password from the compromised machines even after the modification. The DLL has three export functions to implement the main functionality of support for registering the DLL into the LSA, as follows:When implementing the password filter export functions, the malicious actor took great care working with the plaintext passwords. When sent over networks, the plaintext passwords were first encrypted before being exfiltrated.Data Exfiltration Through Legitimate Mail TrafficThe main backdoor function (detected by Trend Micro as Backdoor.MSIL.REDCAP.A) receives the valid domain credentials as an argument and uses it to log on to the Exchange Server and use it for data exfiltration purposes. The main function of this stage is to take the stolen password from the argument and send it to the attackers as an attachment in an email. We also observed that the threat actors relay these emails via government Exchange Servers using vaild accounts with stolen passwords. First, the .Net backdoor parses a config file dropped in the main root path where it is executing from and checks for a file callled ngb inside <%ProgramData%\\WindowsSoftwareDevices\\DevicesTemp\\> to extract three parameters:However, the malware also supports for the modification of old passwords to new ones, which are sent through the registered DLL password filter. The malware proceeds to initialize an ExchangeService object in the first step and supplies the stolen credentials as WebCredentials to interface with the victim mail server in the second step. Using these Exchange Web Service (EWS) bindings, the malicious actor can send mails to external recipients on behalf of any stolen user and initialize a new instance of the WebCredentials class with the username and password for the account to authenticate.The malware then iterates through the files found under the target path. For each file found, it adds its path to a list, which will be exfiltrated later in the last step.The final stage is to iterate over the collected list of file paths. For each path, it prepares an EmailMessage object with the subject “Exchange Default Message”, and a mail body content of “Exchange Server is testing services.” The iteration attaches the whole file to this EmailMessage object and sends it using the previous initalized EWS form (Steps 1 and 2 in Figure 10), which already authenticated the user account.APT34 Targeting and Arsenal EvolutionFrom three previously documented attacks, we observed that while the group uses simple malware families, these deployments show the group's flexibility to write new malware based on researched customer environments and levels of access. This level of skill can make attribution for security researchers and reverse engineers more difficult in terms of tracking and monitoring because patterns, behaviors, and tools can be completely different for every compromise.While not at the top of the group’s list, other countries in the Middle East considered as targets are Qatar, Oman, Kuwait, Bahrain, Lebanon, and Egypt.Attribution AnalysisThere are several data points and indicators that suggest APT34 carried out this attack, and that this group is still active in targeting countries in the Middle East with a special focus on compromising government entities.1.     The first stage dropper2.     Leveraging exchange servers for communications (Uni- and bidirectional)3.      The victim targetedConclusionsAt first glance, security teams can mistakenly tag the sample as safe or as a benign activity given the validity of the domains and mail credentials. It will take more experienced analysts to see that the domains abused is part of a bigger active directory domain “forest”, which share a trust relationship with each other to allow different government ministries or agencies to communicate. Considering we found a compromised account from one entity inside a sample sourced from a different agency indicates APT34 now has a deep foothold in the government domain forest.Following the stages executed, APT34’s repeated use of the Saitama backdoor technique in the first stage indicates a confidence that even the dated malware’s technique will continue to work and initiate compromise.The next stages for exfiltrating data, however, are considerably new and are considered exploratory for the group. Despite the routine's simplicity, the novelty of the second and last stages also indicate that this entire routine can just be a small part of a bigger campaign targeting governments. We continue tracking and monitoring the abuse of this threat to determine the depth and breadth of this compromise.Indicators of Compromise (IOCs)Emails abusedAdditional insights provided by AbdelRahman Yasser.Mohamed FahmyThreat Intelligence AnalystSherif MagdyThreat Intelligence AnalystMahmoud ZohdyThreat Intelligence AnalystTry our services free for 30 daysSelect a country / regionCopyright ©2023 Trend Micro Incorporated. All rights reserved"
   },
   {
      "time": "2023-02-06",
      "title": "Dashlane password manager open-sourced its Android and iOS apps",
      "text": " Dashlane announced it had made the source code for its Android and iOS apps available on GitHub under the Creative Commons Attribution-NonCommercial 4.0 license.The popular subscription-based password manager and digital wallet have decided to release the code of its mobile apps to increase transparency in how they operate while also promoting a more collaborative and open development approach going forward.By making its mobile app's code available to anyone for exploration and auditing, the company hopes to receive feedback from the community on improving it and increased security vulnerability reports from cybersecurity researchers.The password manager maker says this \"opening up\" will also incentivize its engineers to \"level up\" the quality of the code and make it suitable for the masses to read and understand.Dashlane plans to update these code snapshots on GitHub every three months, but it might do it more frequently if the associated processes are enhanced accordingly.Open-sourcing software means making its code available to anyone for scrutiny, inherently increasing trust in the product.Moreover, it gives software engineers another example of how things are done, which is especially important when this example comes from a successful project.However, it's important to note that Dashlane has not transitioned to becoming an open-source project overnight, and for the time being, no direct contributions from the community can be accepted. Suggestions will still be welcomed and listened to, though.We should also clarify that the source code release concerns only the client apps for Android and iOS, so those of macOS and Windows remain closed-source.It's also worth noting that while the source code for the mobile client applications has been made publicly available, a significant portion of the password management system operates on Dashlane's servers and has not been released. This means that a substantial part of the product remains proprietary.This, of course, does not degrade the importance of this first step taken by Dashlane, and the software vendor has already promised that more will follow.The next product to be open-sourced, according to Dashlane, is its web browser extension, but this will happen after it has fully transitioned to meeting the Google Chrome MV3 requirements."
   },
   {
      "time": "2023-02-06",
      "title": "New Dingo crypto token found charging a 99% transaction fee",
      "text": " Researchers at IT security company Check Point security have flagged Dingo Token as a potential scam after finding a function that allows the project's owner to manipulate trading fees up to 99% of the transaction value.The warning from Check Point comes after company researchers have already witnessed this malicious fee change 47 times.The transaction fees are analyzed as 95% tax and 4% liquidity fees, leaving the investors with the remaining 1% and no way to reverse the transaction.Check Point says that in one case they observed, a user spent $26.89 to purchase 427 million Dingo Tokens but instead received 4.27 million, which is exactly 1%.While the 47 cases seen by Check Point aren't enough to impact the broader investors' base of Dingo Tokens, they could be a test run by the operator, who can apply the function change on all holders and cash out quickly when the token reaches its maximum price.BleepingComputer has found multiple reports from users that took it to social media to complain about trouble in swapping freely the tokens they have, with no response from the official Dingo Token accounts.Check Point's findings are certainly alarming, so we reached out to the project owners for comment. At publishing time we had yet to receive a reply.Before you put your money into any cryptocurrency project, research the token and the team behind it and look for red flags like incomplete data or too little information on the official website.Cryptocurrency investors should openly ask about a project in the community to hear the experience of other users. If you're getting into this trading game, it is recommended to use only reputable exchange services and diversify investments across different coins."
   },
   {
      "time": "2023-02-06",
      "title": "Energy and Healthcare Firms Are The Focus of The Lazarus Group Once Again - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2023-02-06",
      "title": "LexisNexis' Virtual Crime Center: Making Millions from Sales to the U.S. Government - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2023-02-06",
      "title": "New High-Severity Vulnerabilities Discovered in Cisco IOx and F5 BIG-IP Products",
      "text": " F5 has warned of a high-severity flaw impacting BIG-IP appliances that could lead to denial-of-service (DoS) or arbitrary code execution.Tracked as CVE-2023-22374 (CVSS score: 7.5/8.5), security researcher Ron Bowes of Rapid7 has been credited with discovering and reporting the flaw on December 6, 2022.F5 noted that it has addressed the problem in an engineering hotfix that is available for supported versions of BIG-IP. As a workaround, the company is recommending users restrict access to the iControl SOAP API to only trusted users.The disclosure comes as Cisco released updates to fix a flaw in Cisco IOx application hosting environment (CVE-2023-20076, CVSS score: 7.2) that could open the door for an authenticated, remote attacker to execute arbitrary commands as root on the underlying host operating system.Cybersecurity firm Trellix, which identified the issue, said it could be weaponized to inject malicious packages in a manner that can persist system reboots and firmware upgrades, leaving which can only be removed after a factory reset.While the exploit requires the attacker to be authenticated and have admin privileges, it's worth noting that adversaries can find a variety of ways to escalate privileges, such as phishing or by banking on the possibility that users may have failed to change the default credentials.The networking equipment major, which has since remediated the defect, said the vulnerability poses no immediate risk as \"the code was put there for future application packaging support.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-02-06",
      "title": "NY attorney general forces spyware vendor to alert victims",
      "text": " The New York attorney general's office has announced a $410,000 fine for a stalkerware developer who used 16 companies to promote surveillance tools illegally.Stalkerware (or spyware) platforms allow their customers to monitor other people's phones without the users' knowledge. In some, if not most cases, they're also used to monitor the targets' online activity and collect sensitive user information like their location that later could be used for blackmail or various other malicious purposes.Patrick Hinchy, the spyware vendor, also agreed to alert his customers' victims that their phones are being secretly monitored using one of his multiple apps, including Auto Forward, Easy Spy, DDI Utilities, Highster Mobile, PhoneSpector, Surepoint, or TurboSpy.These surveillance apps enabled Hinchy's customers to secretly monitor what other individuals were doing on their mobile devices, including location, browsing history, call logs, text messages, photos and videos, email activity, WhatsApp and Skype chats, and social media activity.The stalkerware ads were also used to trick customers into believing that spying was legal even though installing such software on someone else's device without consent violates numerous state and federal laws.Snooping on a partner's phone without consent isn’t just a sign of an unhealthy relationship, it's against the law.\nToday, we stopped several companies from illegally promoting products that allowed spying on:\nCalls and texts\nPhotos and videos\nEmails and social media\"Snooping on a partner and tracking their cell phone without their knowledge isn't just a sign of an unhealthy relationship, it is against the law,\" Attorney General James said.\"These apps and products put New Yorkers at risk of stalking and domestic abuse, and were aggressively promoted by Patrick Hinchy through 16 different companies.\"Today's agreement will block these companies from allowing New Yorkers to be monitored without their awareness, and will continue our ongoing fight to protect New Yorkers' rights, safety, and privacy.\"This happened three years after an August 2018 data breach caused by an unprotected Amazon S3 bucket containing several terabytes of data harvested from over 3,600 devices."
   },
   {
      "time": "2023-02-06",
      "title": "Truffle Security relaunches XSS Hunter tool with new features | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondPopular hacking aid now available with CORS misconfig detection function following end-of-life announcementXSS Hunter now has a home at Truffle Security, which has launched a new version of the tool after its original creator declared that he will be deprecating it in February.XSS is a very common vulnerability, accounting for 23% of bug reports submitted to bug bounty platform HackerOne, for example.“As long as Mandatory was in charge of the service, I wasn’t concerned with what the platform might do with that data collected,” Ayrey said.“But we were concerned after the EOL [end of life] was announced, another tool might have come along to replace it with operators that may have had different intentions with the data collected.”The new XSS Hunter tool blurs screenshots captured by the platform to protect sensitive information rendered by the XSS payload. It has also removed support for full DOM capture and enforces Google SSO login to improve account security.Regarding the deprecation of the old service, Mandatory told The Daily Swig that he had become “increasingly uncomfortable with the amount of vulnerability information stored in the service.“Ideally I’d like to be storing zero vulnerability information for XSS hunter users, which this deprecation will achieve,” he said.Mandatory described Truffle Security’s fork as “a step in the right direction” and said: “I think the fact that Truffle Security is starting out with an eye on balancing privacy and bug bounty research interests is a good sign.”“We saw an opportunity to both address privacy concerns as well as give the cybersecurity community new capabilities within the XSS Hunter tool,” Ayrey said.Ayrey said Mandatory was supportive of the effort and helped out in the process. Truffle Security plans to add more features to XSS Hunter in the future, including adding a more complete version of TruffleHog.“When I first built the service many people didn’t really believe that blind XSS was a ‘real’ concern,” he said. “Today I don’t think anyone doubts the pervasiveness and severity of these vulnerabilities, so it has pretty much achieved what it was meant to do.”Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2023-02-06",
      "title": "PixPirate: New Android Banking Trojan Targeting Brazilian Financial Institutions",
      "text": " A new Android banking trojan has set its eyes on Brazilian financial institutions to commit fraud by leveraging the PIX payments platform.Italian cybersecurity company Cleafy, which discovered the malware between the end of 2022 and the beginning of 2023, is tracking it under the name PixPirate.It is also the latest addition in a long list of Android banking malware to abuse the operating system's accessibility services API to carry out its nefarious functions, including disabling Google Play Protect, intercepting SMS messages, preventing uninstallation, and serving rogue ads via push notifications.Besides stealing passwords entered by users on banking apps, the threat actors behind the operation have leveraged code obfuscation and encryption using a framework known as Auto.js to resist reverse engineering efforts.The dropper apps used to deliver PixPirate come under the garb of authenticator apps. There are no indications that the apps were published to the official Google Play Store.\"The introduction of ATS capabilities paired with frameworks that will help the development of mobile applications, using flexible and more widespread languages (lowering the learning curve and development time), could lead to more sophisticated malware that, in the future, could be compared with their workstation counterparts,\" the researchers said.The development also comes as Cyble shed light on a new Android remote access trojan codenamed Gigabud RAT targeting users in Thailand, Peru, and the Philippines since at least July 2022 by masquerading as bank and government apps.The web inject modules, mainly used for harvesting credentials and sensitive data, are designed to single out banking, mobile payment services, cryptocurrency exchanges, and mobile e-commerce applications spanning Asia, Europe, Middle East, and the Americas.The technique entails employing social engineering methods such as approaching victims through dating apps like Tinder to entice them into downloading fraudulent investment apps with the goal of stealing their money.The malicious iOS apps in question are Ace Pro and MBM_BitScan, both of which have since been removed by Apple. An Android version of MBM_BitScan has also been taken down by Google.Cybersecurity firm Sophos, which made the discovery, said the iOS apps featured a \"review evasion technique\" that enabled the malware authors to get past the vetting process.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-02-06",
      "title": "Iranian OilRig Hackers Using New Backdoor to Exfiltrate Data from Govt. Organizations",
      "text": " The Iranian nation-state hacking group known as OilRig has continued to target government organizations in the Middle East as part of a cyber espionage campaign that leverages a new backdoor to exfiltrate data.While the technique in itself is not unheard of, the development marks the first time OilRig has adopted it in its playbook, indicating the continued evolution of its methods to bypass security protections.The starting point of the latest activity is a .NET-based dropper that's tasked with delivering four different files, including the main implant (\"DevicesSrv.exe\") responsible for exfiltrating specific files of interest.The most notable aspect of the .NET backdoor is its exfiltration routine, which involves using the stolen credentials to send electronic missives to actor-controlled email Gmail and Proton Mail addresses.\"The threat actors relay these emails via government Exchange Servers using vaild accounts with stolen passwords,\" the researchers said.If anything, the growing number of malicious tools associated with OilRig indicates the threat actor's \"flexibility\" to come up with new malware based on the targeted environments and the privileges possessed at a given stage of the attack.\"Despite the routine's simplicity, the novelty of the second and last stages also indicate that this entire routine can just be a small part of a bigger campaign targeting governments,\" the researchers said.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-02-06",
      "title": "New Wave of Ransomware Attacks Exploiting VMware Bug to Target ESXi Servers",
      "text": " VMware ESXi hypervisors are the target of a new wave of attacks designed to deploy ransomware on compromised systems.\"Notably, the group behind the Nevada ransomware is also buying compromised access by themselves, the group has a dedicated team for post-exploitation, and for conducting network intrusions into the targets of interest.\"Users are recommended to upgrade to the latest version of ESXi to mitigate potential threats as well as restrict access to the OpenSLP service to trusted IP addresses.OVHcloud, over the weekend, confirmed that the ransomware attacks leveraged a vulnerability in OpenSLP as an initial compromise vector. The company, however, said it cannot confirm if it entailed the abuse of CVE-2021-21974 at this stage. It also backtracked on initial findings that suggested a plausible link to Nevada ransomware.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-02-03",
      "title": "Operation Ice Breaker Targets The Gam(bl)ing Industry Right Before It's Biggest Gathering",
      "text": " Since this is a new threat actor, we are tracking it as Ice Breaker APT. Although research is still ongoing, we are releasing this article to reveal the attacker's Modus Operandi, attack chain, ways to mitigate the threat and supported IOCs, TTPs and Yara.\"Ice Breaker is using a very specific social engineering technique that somewhat sacrifices their identity\", said Senior Threat Researcher, Felipe Duarte.Although we haven't yet discovered Ice Breaker's whereabouts or preferred language, we are still interested in sharing the information we have with infosec community and the IT security of the gambling/gaming industry, as we are approaching the ICE London conference in February. This is the industry's largest conference in the world, hosting over 35,000 people. Our aim is to block the campaign while still researching more about its maker, Ice Breaker.The name \"Ice Breaker\" was born from the name of the main conference of this industry, \"ICE\", and the proximity of the campaign to its starting date, February 6th, 2023.Social engineering prior to sending malicious links to hide executables is a clever tactic, as this threat actor was well-aware of the fact that the customer service is human-operated. Without proper guidance for the teams on the other end, it almost seemed logical that an unregistered user would be having trouble logging in or registering, and thus the attacker sends links to images instead of embedding them in the chat.Convincing the human operator to open the ZIP or LNK file, the threat actor was only steps away from harvesting credentials, open a reverse shell and start the 2nd stage of the attack. Out of four incidents we've investigated, only one used DropBox as trusted downloader link. It was an option the attacker didn't choose initially, but following his frustration over transcripts of the conversation, when his screenshot lure did not follow through he had no other choice. The main payload they chose was something that hadn't been documented before. In this blog post, our team reveals pieces from the investigations to share the complexity of the 2nd stage, involving Node.js compiled binaries (.jsc) which are embedded in the malware executable and are being decoded at run-time. We were able to find the tool that is responsible for generating the bytecode of the .jsc, called Bytenode. As far as we know, generating a malware using this technique is easy; however, reverse engineering this bytecode back to the original source code is highly complex. While our team keeps researching ways to reverse engineer the bytecode, we are sharing this information with the infosec community in an attempt to gain more understanding into the process of creating that malware.It is important to highlight that many operators in the gaming/gambling industry provide support to their clients via dedicated channels handled by them, or in some cases they outsource this operation to specialized companies (BPOs) in an attempt to reduce the operational costs. Depending on the nature of this customer-business relationship, there are several risks associated that we cannot leave aside, and this is exactly what this APT actor is trying to exploit here.According to the infection attempts we've investigated, this attack vector could result in major damage if not properly protected and company's personnel not being trained to act against such scenarios and report immediately to security staff.The Modus Operadi of the attacker is to pretend to be a customer of the website with an issue, such logging in or registering, when in reality the \"visitor\" does not have an account. This should be the first indicator that something is not right.Based on the evidence collected by our team, it seems that all of the individuals carrying out the attacks are not English speakers, who intentionally choose to speak with non-native English customer service representatives, probably to reduce their chances of being detected as scams. As an example, in one of the incidents handled by our team, the attacker even asks for a Spanish speaker, and when approached with one, he immediately changes back to broken English.Incident #1 - Pretending to have a registration issue.Incident #2: The attacker chooses the French language in the customer service portal and shares links to ZIP files supposedly containing images. The proxy from which the attacker is connecting appears to be located in Japan. Incident #3: The attacker is requesting a Spanish-speaking agent, but continues to speak in English. In this example, it is easy to pick up the IDN Homograph Attack.Looking at the intrusions of this threat actor from the outside, without going into the details, we are dealing with a fairly simple control flow.The control flow consists of only two stages, each one with a clear objective.The threat actor is distributing two different types of payloads to the victim during the conversation. According to the data we have, the LNK file is the primary payload and it is the first one presented to the customer service agent. The VBS file, on the other hand, is only shared as a backup option in case the agent is unable to open the first file. Depending on the malicious file executed by the victim, either the LNK or the VBS, a different payload is provided. If the victim executes the LNK downloader, it will fetch and execute an additional MSI package containing an IceBreaker Backdoor, which is a new threat has not been previously described, as far as we know, in any other publicly available threat intelligence report. However, if the victim executes the VBS downloader, it will fetch the infamous Houdini RAT, a VBS-based Remote Access Trojan that has been active at least since since 2013. The threat actor is distributing LNK files via a set of domain names that mimic the legitimate domain \"screenshot[.]net\". Once the victim accesses it, the website presents a very simple view to download the allegedly \"screenshot\", in an attempt to deceive the customer service agent to download the malicious content (see Figure below).Once the customer service agent downloaded the decoy file supposedly to be the screenshot reported by the threat actor in the conversation, he/she was required to unzip its content and run the extracted LNK file on the machine. To make the threat more convincing to the victim, the icon of this Windows Shortcut was changed to match the default Windows picture icon, as shown in the image below.The purpose of the LNK file is fairly simple to understand, it downloads an additional MSI payload from its C2 server by abusing the trusted Windows binary msiexec.exe. Below, an example of the command executed by a malicious LNK file is provided, in it, it is also clear the attempt to impersonate one more time the official website screenshot[.]net by abusing some characters of the Unicode standard. The arguments in the command line are the following:/i : this argument is used to specify that the installer should perform an install operation./passive : this argument is used to display progress bar only, it does not prompt the user with any user interface./quiet : this argument runs the installer in quiet mode, with no user interaction./qn : this argument is used to run the installer with no user interface.Once that file was launched, our team was able to capture the execution flow, isolate the machine and begin the investigation. Having the knowledge of that user belonging to customer service immediately triggered a suspicion that this executable's origin is from an external service. The string that will contain the URL of the malicious server is initialize. It contains the \"http://\" string and some random data that will be removed later.The request object that will be used later to submit the data to the malicious server is initialized, and the malicious URL is completed. It contains the IP address of the malicious server hardcoded in an octal representation.The \"User-Agent\" header is set to the local time of the infected machine.The response of the server is gotten and executed. Once the connection has been established, it sends a POST request to an IP address converted in Octal which represents the value 178[.]63[.]65[.]51.Two different payloads are being used by this treat actor during the second stage of the attack. Among them only one stood out because it implements several techniques never seen before, in a public available report. We provide the details of each threat found during the investigation in the following subsections.Only when the victim downloaded and executed the secondary payload distributed during the conversation with the attacker, this threat is launched. The threat found during our research matches perfectly the behavior described by Mandiant in their report, the only difference is the C2 hardcoded in the script, which in this case was set to 194[.]5[.]97[.]17, as presented in the following picture.The MSI file downloaded and executed by the Windows shortcut is the starting point of this second stage. If the reader wants to follow the analysis of this threat, the details below could be used to download it from the OSINT platform of his/her preference.  The only relevant file inside this MSI package is a CAB archive, which acts as a second layer of protection and contains a compressed version of the malicious backdoor. The installer extracts this archive to the Temp folder, and finally, the third layer of the attack is executed.It doesn't really matter what modifications are made to the MSI package; its purpose is always the same: to drop and execute an embedded PE file called \"Port.exe.\" This embedded resource is the most interesting part of the attack. It is a PE file written in C++ and compiled for 64-bit systems. Its size is larger than the average malware sample typically handled by our team, and it contains many references to Node.js, including but not limited to its icon, several strings, and additional software properties.After a close inspection, something unusual was found in the overlay of this file. To clarify, the overlay of a PE file is a portion of data that is appended to the end of the original executable. This data is not loaded automatically by Windows when the file is executed because it is outside the PE structure. However, it is a fast and easy way to add additional resources required by the software without affecting the structure of the PE.Storing data in the overlay is not inherently malicious, but it is a technique commonly used by threat actors to:Bypass signature-based detectors by easily changing the hash of a PE file without modifying its structure or functionality.Make the process of analyzing the file more difficult by dramatically increasing the size of the file with random data, making it harder for analysis tools to handle.Hide additional resources such as other PE files and binaries that will be loaded during the execution of the file, particularly in droppers and packers.In this case, however, a very characteristic structure was found in the overlay. It wasn't just random data or highly obfuscated binaries that were left there by a packer or dropper. In this case, we were dealing with something additional: a type of binary data used by the JavaScript engine to speed up the parsing process of JavaScript code.Several attempts have been made to decompile this kind of code, but there is still a lack of tools that can keep up with these developments. In fact, based on our research, we have identified only two different projects that try to tackle this challenge using two different perspectives. According to our research, we found:None of the solutions above are suitable for analyzing this sample because they are incompatible with the Node.js version found in the samples (above 8.16.0). Our researchers are currently conducting additional analyses to address this issue and to help the community deal with this type of threat. However, we still obtained relevant results about the capabilities of the malicious JSC artifact by looking at its strings after extracting its contents from the overlay. As seen in the image below, which contains a snippet of the compiled JavaScript extracted from the sample, there are several strings that give us an idea about the scope of the malicious actions that this sample could execute on an infected machine.Based on the abovementioned, we concluded that we are dealing with a new modular backdoor written completely in Node.js and provides threat actors with a set of functionalities such as: Customization via plugins that extend the build-in features of the threat.Process discovery.Steal passwords and cookies from the local storage. It particularly targets Google Chrome.Persistence is achieved by creating a new LNK file in the startup folder \"\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\WINN.lnk\".Exfiltrate files to the remote server via web sockets.Run custom VBS scripts in the infected machine.Take screenshots from the victim's machine.Generate remote shell sessions.All these capabilities in addition to the very low detection rate of the payload, which during this investigation, has remained close to zero even after 3 months of its first report (see image below), are the perfect recipe for the success of this threat actor. We are currently tracking this tool as the IceBreaker Backdoor, and we continue researching it to help community understand, identify and effectively respond against this new threat.We provide the following set of ideas to the infosec community in an attempt to help hunting this threat on your environments, feel free to test them and improve them if required.Look for LNK files created in the startup folder, and specially search for the name WINN.lnk.Look for any unauthorized execution of the open-source tool tsocks.exe in your environment. You can hunt this by looking for new processes created with that name or following the structure of the commands used by this tool. Monitor closely the creation of msiexec.exe processes receiving URLs as parameters.Monitor closely the execution of VBS scripts and LNK files launched from the Temp folder. TacticTecniqueSub-techniqueTA0001: Initial AccessT1566: PhishingT1566.003: Spearphishing via ServiceTA0002: ExecutionT1204: User ExecutionT1204.001: Malicious LinkTA0002: ExecutionT1204: User ExecutionT1204.002: Malicious FileTA0002: ExecutionT1059: Command and Scripting InterpreterT1059.005: Visual BasicTA0002: ExecutionT1059: Command and Scripting InterpreterT1059.005: JavaScriptTA0003: PersistenceT1547: Boot or Logon Autostart Execution​T1547.001: Registry Run Keys / Startup FolderTA0005: Defense EvasionT1036: MasqueradingT1036.007: Double File ExtensionTA0005: Defense EvasionT1218: System Binary Proxy ExecutionT1218.007: MsiexecTA0006: Credential AccessT1555: Credentials from Password StoresT1555.003: Credentials from Web BrowsersTA0006: Credential AccessT1539: Steal Web Session Cookie​TA0007: DiscoveryT1057: Process Discovery​TA0007: DiscoveryT1087: Account DiscoveryT1087.001: Local AccountTA0007: DiscoveryT1518: Software Discovery​TA0007: DiscoveryT1082: System Information Discovery​TA0009: CollectionT1113: Screen Capture​​TA0011: Command and ControlT1572: Protocol Tunneling​​TA0011: Command and ControlT1571: Non-Standard Port​​TA0011: Command and ControlT1105: Ingress Tool Transfer​​TA0011: Command and ControlT1071: Application Layer ProtocolT1071.001: Web ProtocolsThis section contains different indicators of compromise gathered during this investigation.IndicatorTypeDetailsscreenshotcap[.]comDomainIceBreaker Backdoor Distribution Sitescreenshotlite[.]comDomainIceBreaker Backdoor Distribution Sitescreenshot[.]icuDomainOld domain (2019), related to the IceBreaker Backdoor Distribution Sites based on HTML similaritiesxn--screnshot-iib[.]netDomainIceBreaker Backdoor C2xn--screnshot-jib[.]netDomainIceBreaker Backdoor C2ponzix[.]netDomainIceBreaker Backdoor C2178[.]63[.]65[.]51IP AddressHoudini RAT Distribution Server​194[.]5[.]97[.]17IP AddressHoudini RAT C2a857fbb06f493cd63f2c8128038bf78d1467295e89be0c9848edd8a2dd8b44e8SHA256Houdini RAT VBS Downloader185182f369edcb96118a91dcad39eb5b63239112ed6963a8c274178bf1b55394SHA256Houdini RAT0f043b90f6fa68551221ec560068aac4abb90749ca42a63dd62664e483940ec3SHA256IceBreaker Backdoor MSI Package24df9651a38ab5328d59ab1c448a98afb3df8209b8877bbde63d49308e0d8c68SHA256IceBreaker Backdoor EXE31d03d305354eb92f3ea0420b0f674bf6414422b24bb717ec28dfacdc2647a1dSHA256IceBreaker Backdoor LNK Downloader3b86fb030c0d1b440307b8d2ca7bbe2590d58e5a28118985e9774990a1c74d21SHA256IceBreaker Backdoor LNK Downloader978940d9785d3ade9f1c9b13ce35d67af2f47091740c2a4a5978e512543e6d76SHA256IceBreaker Backdoor MSI Packagea0a5a12f4781433ef3c0abd89186bd987f5d02c4e643803d92ff0413852d2486SHA256IceBreaker Backdoor MSI Packagea2047deac9bb8af7107e35b6e3c8617bec01dd9121a76f4fbca1fa8c760ba40eSHA256IceBreaker Backdoor EXEa6e97bdbd841c9ac8bdad6145cbe65f38a31d74eb9c00346bb5b3a005508b544SHA256IceBreaker Backdoor LNK Downloaderaa2521bf540a4070ebf4ad340051d4df1b9608eff22e0110a0a49e1289cdbf03SHA256IceBreaker Backdoor EXEb8791cc1ec61e61b59cb8c251b49c644a597025fe1d1195e960212980822a93dSHA256IceBreaker Backdoor MSI Packagef97ee203a3dd08ac38d16295dbf9cb0c7476690ba03a05afefed34d7e8cfd44eSHA256IceBreaker Backdoor LNK Downloaderfee0935cec808fe27112cf3c40e91d4702872f43064e9e9f71f9f1e6a8894eafSHA256IceBreaker Backdoor LNK Downloader9ea31ef8ee5abaae8752f1db783431cbb9e691a457ae2cfe648210adeefb8effSHA256IceBreaker Backdoor LNK Downloaderf3645c8b04fe683ade9b5a46db8af6428c15e94730a25f05bf2378a4b28ad065SHA256IceBreaker Backdoor LNK Downloader8727e8759232721413c038e45c5e05cbfe5194489c060875f273329db2aa7c08SHA256IceBreaker Backdoor EXEe3a7c1c8b8fe7a2fce89318015187adb672c31747d966218c962c91248179553SHA256IceBreaker Backdoor EXEb5ab83ceacfa4fba714d515248f166900f1b21e9a946e684be1e415439677309SHA256IceBreaker Backdoor MSI PackageEfraim Katzir 2/40 Hod Hasharon, IsraelISRAEL​CROATIA​UNITED STATES​CANADA​COLOMBIA​BRAZIL​NEW ZEALAND​AUSTRALIA​PHILLIPINES​SOUTH KOREA  © Security Joes LTD 2023   All rights reserved"
   },
   {
      "time": "2023-02-03",
      "title": "CERT-UA",
      "text": " "
   },
   {
      "time": "2023-02-03",
      "title": "Scammers managed to slip crypto apps onto Apple, Google app stores",
      "text": " Scammers were able to get two fraudulent apps onto the app stores run by both Google and Apple that allowed them to push users into making fake cryptocurrency investments, according to a new report. Researchers from Sophos said they discovered Ace Pro and MBM_BitScan on both Google’s Play Store and Apple’s App Store. The apps are part of a scheme – now known colloquially as “pig butchering” – where scammers develop a relationship with victims, get them to download an app and then eventually get them to deposit money onto the app.Jagadeesh Chandraiah, senior threat researcher at Sophos, said in one case, the scammers created a fake profile of a woman living a lavish life in London. They developed a relationship with a victim and urged them to download the Ace Pro app – which masquerades as a QR code scanner.But once the app is downloaded, users see a fraudulent crypto trading platform that urges them to deposit currency. All of the funds deposited go directly to the scammers. One victim that contacted Sophos only discovered the apps were fraudulent after losing $4,000.Chandraiah said it was most surprising that the apps made it onto Apple’s App Store considering how hard it generally is to get malware past the company’s security review process. While other malicious apps have been found on the Play Store, this is the first time Sophos found fraudulent apps on Apple’s store in their two years examining pig butchering scams.Scammers previously had to go through far more technical trouble to get Apple users to download fake apps, and many victims figured out something was wrong when they couldn't simply download an app directly. “By getting an application onto the App Store, the scammers have vastly increased their potential victim pool, particularly since most users inherently trust Apple,” Chandraiah said. “Both apps are also not affected by iOS’ new Lockdown mode, which prevents scammers from loading mobile profiles helpful for social engineering. In fact, these CryptoRom scammers may be shifting their tactics—i.e., focusing on bypassing the App Store review process—in light of the security features in Lockdown.” But once the app was approved, the scammers were able to redirect it to a domain registered in an unnamed country in Asia. The other app, MBM_BitScan, is known as BitScan on Google Play and both apps communicate with the same Command and Control (C2) infrastructure which communicates with a server that resembles a legitimate Japanese crypto firm. Both Google and Apple were notified by Sophos about the apps and both companies said they removed them. Apple did not respond to requests for comment. A Google spokesperson told The Record: “The Android app identified as malicious in the report has been removed from Google Play and the developer has been banned.\"Sophos was initially alerted to the scam apps by victims, kicking off their two-year investigation into the trend. “Pig butchering” scams have become wildly popular among cybercriminals as online dating has exploded and more people have become comfortable with sending money digitally. “CryptoRom and other forms of “pig butchering” initially targeted people in China and Taiwan. Early scams focused on online gambling with insider information, using similar tactics to CryptoRom. Over the course of the COVID-19 pandemic, the scams expanded globally and evolved into fraudulent foreign exchange and cryptocurrency trading. We are tracking this threat actor as the ‘ShaZhuPan’ group,” Chandraiah said. “When Chinese authorities started cracking down on these scams and prosecuted some perpetrators, some of the gangs behind them fled to smaller southeast Asian countries, including Cambodia, where they now operate in special economic zones (SEZ).”Many – being trafficked from countries like India, China and Malaysia – had their passports confiscated and were forced to work for these operations to get their passports back. They are given scripts to follow when approaching victims and instructions on how to get victims to send money. Sophos noted that while it may seem far-fetched that anyone would fall for these scams, the victims they spoke to were almost always well-educated. Most victims noted that their relationships with the scammers lasted months and that they were allowed to make small profits from their initial transactions on the fraudulent financial websites or apps. Many of the scammers also share fake screenshots of the money they are purportedly making from the fraudulent platforms. Most of the victims who spoke to Sophos said they had recently dealt with a major life change and were emotionally vulnerable to this kind of operation, where scammers contacted them daily and shared mundane life updates.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-03",
      "title": "Google ads push ‘virtualized’ malware made for antivirus evasion",
      "text": " An ongoing Google ads malvertising campaign is spreading malware installers that leverage KoiVM virtualization technology to evade detection when installing the Formbook data stealer.KoiVM is a plugin for the ConfuserEx .NET protector that obfuscates a program's opcodes so that the virtual machine only understands them. Then, when launched, the virtual machine translates the opcodes back to their original form so that the application can be executed.\"Virtualization frameworks such as KoiVM obfuscate executables by replacing the original code, such as NET Common Intermediate Language (CIL) instructions, with virtualized code that only the virtualization framework understands,\" explains a new report by SentinelLabs.\"A virtual machine engine executes the virtualized code by translating it into the original code at runtime.\"\"When put to malicious use, virtualization makes malware analysis challenging and also represents an attempt to evade static analysis mechanisms.\"Sentinel Labs comments that while KoiVM virtualization is popular for hacking tools and cracks, it is seldom used in malware distribution.Instead, the security firm believes the new trend in its use might be one of the multiple side effects of Microsoft's disabling of macros in Office.In the ongoing campaign seen by SentinelLabs, threat actors push the MalVirt loaders in ads pretending to be for the Blender 3D software.The downloads offered by these fake sites utilize invalid digital signatures impersonating Microsoft, Acer, DigiCert, Sectigo, and AVG Technologies USA.While these invalid signatures will not trick Windows into showing them as signed, the MalVirt loaders still pack features to avoid detection.\"For example, some samples patch the AmsiScanBuffer function implemented in amsi.dll to bypass the Anti Malware Scan Interface (AMSI) that detects malicious PowerShell commands,\" explains researcher A. Milenkoski.\"Further, in an attempt to evade static detection mechanisms, some strings (such as amsi.dll and AmsiScanBuffer) are Base-64 encoded and AES-encrypted.\"The loaders can also detect if they run in a virtualized environment by querying specific registry keys, and if they do, the execution stops to evade analysis.MalVirt also uses a signed Microsoft Process Explorer driver loaded at system start-up as \"TaskKill,\" enabling it to modify running processes to dodge detection.To also evade the decompilation of the virtualized code, the loaders also use a modified version of KoiVM that features additional obfuscation layers, making its decyphering even more challenging.SentinelLabs says this custom KoiVM implementation confuses standard devirtualization frameworks like the 'OldRod' by obfuscating its routine through arithmetic operations instead of using straightforward assignments.Milenkoski says it's possible to defeat the obfuscation in these MalVirt loaders and restore the original order of KoiVM's 119 constant variables.However, the additional obfuscation makes it difficult, requiring hefty manual labor since existing automated tools cannot help.In addition to all detection avoidance systems used in the malware loader, a new trick is employed by Formbook itself that helps disguise its real C2 (command and control) traffic and IP addresses.The info-stealing malware mixes its real traffic with various \"smokescreen\" HTTP requests whose content is encrypted and encoded so they don't stand out.The malware communicates with those IPs randomly, picking them out of a hardcoded list with domains hosted by various companies.SentinelLabs says that in the samples it analyzed, it saw Formbook communicating with 17 domains, only one of which was the actual C2 server, and the rest serving as mere decoys to confuse network traffic monitoring tools.This is a novel system on a pretty old malware strain, indicating that its operators are interested in empowering it with new features that will make it better at staying hidden from security tools and analysts.Whether or not threat actors have completely switched malspam distribution of Formbook to Google search advertisements remains to be seen, but it's another example that users need to be very careful of the links they click in search results."
   },
   {
      "time": "2023-02-03",
      "title": "QNAP warns of new bug prompting worries of potential Deadbolt ransomware exploitation",
      "text": " Data-storage hardware vendor QNAP is warning customers to update their devices after the discovery of a vulnerability that exposes thousands to attacks. “The vulnerability is not actively exploited now,” a spokesperson for QNAP told The Record.The bug was discovered by a third-party researcher and reported through the company's Security Bounty Program, the spokesperson said.“Censys has observed 67,415 hosts with indications of running a QNAP-based system; unfortunately, we could only obtain the version number from 30,520 hosts. But, if the advisory is correct, over 98% of identified QNAP devices would be vulnerable to this attack,” Censys senior security researcher Mark Ellzey said. “We found that of the 30,520 hosts with a version, only 557 were running QuTS Hero greater than or equal to ‘h5.0.1.2248’ or QTS greater than or equal to ‘5.0.1.2234,’ meaning 29,968 hosts could be affected by this vulnerability.”The country with the most vulnerable hosts was the United States, which had more than 3,200. Italy, Taiwan, Germany and Japan were not far behind. Mark Ellzey, senior security researcher at Censys, told The Record on Friday that the number of vulnerable devices moved up to 31,567.\"There is good reason for this; most of these devices live on residential networks (a residential network is an ISP that people use in their homes, (FIOS, Comcast, etc),\" he said. \"For example, HINET Data Communications provides broadband services to small businesses and local residents. HINET saw 322 new QNAP devices come online. Networks like these are the networks of normal everyday people, not high-availability server farms, so you're going to see an ebb and flow of listening services as people log in and log out of their internet.\"\"There is no indication of Deadbolt infections so far -- but given that the group was targeting QNAP devices before, there is a decent chance they are working on finding this vulnerability now,\" Ellzey said.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-03",
      "title": "Hackers linked to North Korea targeted Indian medical org, energy sector",
      "text": " “One of the victims was in the health care research vertical within India. In recent years the Indian research and technology sector has been a common target of those North Korean threat groups with a focus on intelligence collection,” the researchers said. “Other victims of this campaign identified by WithSecure included health care research, a manufacturer of technology used in energy, research, defense, and health care verticals, as well as the chemical engineering department of a leading research university.”The researchers named the campaign “No Pineapple” due to an error message that was found in the code of a backdoor tool found during their investigation. The hackers used the bugs to gain access to a Zimbra mail server at the end of August 2022 and likely exfiltrated the contents of the mailboxes. By October 2022, the group moved laterally to another vulnerable device on the network and used malware to eventually steal 100 GB of data on November 5. Despite the massive amounts of data stolen, the group never took destructive actions while in the victim network.The researchers attributed the attack to the Lazarus Group based on the malware used and several operational mistakes made by the group during their intrusion. The infrastructure used by the group during the attack has been tied to previous Lazarus campaigns identified by other security companies.“The overall toolkit of the threat actor is very similar to other reported instances of North Korean groups,” the researchers said. “The usage of Dtrack and Grease malware has been previously associated with Kimsuky, while Dtrack is also in the Lazarus arsenal. The toolkit aligns with other reporting of this campaign from Talos Intelligence and Symantec.”The researchers were also able to tie the activity to North Korea based on the hours of operation, noting that most of the actions took place between 00:00 to 15:00 UTC (09:00 and 21:00 UTC +9) and between Monday and Saturday – a work pattern common for those in North Korea. They also found connections to a North Korea IP address that WithSecure concluded was “an operational security failure by the threat actor.”“This is significant as the only North Korean IP addresses are three /24 networks which are directly controlled and used by the North Korean government, and as such it is extremely likely that this activity was initiated by a North Korean state actor,” they said. WithSecure said Lazarus group operates within the 3rd Bureau of North Korean People’s Army – a unit tasked with intelligence gathering and technological/commercial espionage.The report on the incident also notes that there is significant overlap in the tools used by different hacking groups within the North Korean military. The attack used tools typically deployed by Kimsuky – a group attributed to North Korea’s 5th Bureau that focuses on hacking targets in South Korea – as well as APT37 which is based within the Ministry of State Security and also focuses on South Korea. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-03",
      "title": "Hackers weaponize Microsoft Visual Studio add-ins to push malware",
      "text": " Security researchers warn that hackers may start using Microsoft Visual Studio Tools for Office (VSTO) more often as method to achieve persistence and execute code on a target machine via malicious Office add-ins.The technique is an alternative to sneaking into documents VBA macros that fetch malware from an external source. However, using VSTO introduce an attack vector that allows building .NET-based malware and embedding it into the Office add-in.VSTO is a software development kit, part of Microsoft's Visual Studio IDE. It is used to build VSTO add-ins, which are extensions for Office applications that can execute code on the machine.These add-ins can be packaged with the document files or downloaded from a remote location and are executed when launching the document with the associated Office app (e.g. Word, Excel)Threat actors prefer using the local VSTO approach, which does not require bypassing trust-related security mechanisms to execute the add-in code. However, Deep Instinct noticed some attacks using remote VSTO add-ins.A sign of these payload-carrying documents is the presence of a \"custom.xml\" parameter that gives the Office application instructions on where to locate the add-in and to install it.The dependencies of the add-in payload are stored together with the document, typically inside an ISO container. The threat actors set these extra files to \"hidden,\" hoping that the victim misses them and assumes the archive only contains a document.After launching the document, a prompt appears asking to install the add-in. Attackers can trick the victim to allow the action in a similar way as with the \"enable content\" pop-up for enabling malicious VBA macros to execute.In one attack that Deep Instinct saw targeting users in Spain, the add-in payload executed an encoded and compressed PowerShell script on the computer.In another example that involved a remote VSTO-based add-in, the threat actors set the .DLL payload to download a password-protected ZIP archive and drop it into the \"%\\AppData\\Local\\ folder.\" Deep Instinct could not retrieve the final payload due to the server being offline at the time of its investigation.Deep Instinct researchers expect more threat actors to integrate VSTO into their attacks. They believe that \"nation-state and other 'high caliber' actors\" will jump at the opportunity as they are more likely to have the means to bypass trust mechanism used in Windows by using valid code signing certificates."
   },
   {
      "time": "2023-02-03",
      "title": "Former Ubiquiti dev pleads guilty to trying to extort his employer",
      "text": " Nickolas Sharp, a former Ubiquiti employee who managed the networking device maker's cloud team, pled guilty today to stealing gigabytes worth of files from Ubiquiti's network and trying to extort his employer while posing as an anonymous hacker and a whistleblower.\"Adding insult to injury, when Sharp wasn't given his ransom demands, he retaliated by causing false news stories to be published about the company, which resulted in his company's market capitalization plummeting by over $4 billion.\"Sharp was arrested and charged with data theft and extortion attempts on December 1, 2021. The ransom note asked for 50 bitcoins (around $1.9 million at the time) in exchange for revealing the vulnerability used to breach the network and for returning the stolen files.Ubiquiti refused to pay and, instead, changed all employee credentials, discovered and disabled a second backdoor from its systems, and issued a security breach notification on January 11.After the extortion attempt failed, Sharp shared information regarding the incident with the media while pretending to be a whistleblower, accusing Ubiquiti of downplaying the breach.Sharp also claimed that Ubiquiti did not have a logging system that would've prevented them from verifying systems or data were accessed by the \"attacker.\" However, his claims line up with the Justice Department info on him tampering with the company's logging systems.While stealing the data, he tried hiding his home IP address using the Surfshark VPN service, but his location was exposed after a temporary Internet outage.In further efforts to hide his malicious activity, Sharp also modified log retention policies on Ubiquiti's servers and other files that would have exposed his identity during the incident investigation.\"Among other things, SHARP applied one-day lifecycle retention policies to certain logs on AWS which would have the effect of deleting certain evidence of the intruder's activity within one day,\" the court documents read.Sharp's charges carry a maximum sentence of 37 years in prison if found guilty. He is scheduled to be sentenced on May 10 by U.S. District Judge Katherine Polk Failla."
   },
   {
      "time": "2023-02-03",
      "title": "Last year was the worst on record for crypto hacks, as North Korean groups cash in",
      "text": " Nearly $4 billion was stolen in cyberattacks on cryptocurrency platforms in 2022, fueled in large part by hackers working on behalf of the North Korean government. Chainalysis researchers told The Record that hackers especially targeted cross-chain bridge protocols – tools that let users port their cryptocurrency from one blockchain to another. Of the $3.1 billion stolen from DeFi platforms, 64% came from cross-chain bridge protocols.“These events target the sinew between blockchains and DeFi projects, and often, they successfully compromise hundreds of millions of USD equivalent value,” they said.Hackers with North Korea’s Lazarus Group and others were responsible for $1.7 billion worth of cryptocurrency theft in 2022, shattering their own records. Chainalysis noted that in 2020, the country’s total exports were just $142 million, making the crypto hacks a “sizable chunk of the nation’s economy.”Following the sanctions, Chainalysis found that North Korean actors began to diversify their use of mixing services. While some funds are still laundered through Tornado Cash, the country’s hackers also use services like Sinbad, a relatively new Bitcoin mixer.“As we’ve seen in many North Korea-directed hacks, the hackers bridge the stolen funds from the Ethereum blockchain — including a portion of the funds stolen in the Axie Infinity hack — to Bitcoin, then send that Bitcoin to Sinbad,” Chainalysis researchers said. In December and January, North Korea-linked hackers sent $24.2 million worth of Bitcoin to Sinbad. The researchers said there is no indication that cryptocurrency hacks will slow down in 2023. “However, over time we hope to see hacking decrease not just as it becomes more difficult to steal funds, but also launder and cash them out, given the transparency of the blockchain,” they said.“Similar to how our industry came together after the endless hacking of centralized exchanges in 2019, we need to do the same in DeFi. Given the losses and the promise of DeFi as an antidote to some of the shortcomings that lead to the collapse of FTX, I believe we’ll see a great deal of collaboration and progress in this space.”The report from Chainalysis coincided with a hack on a cryptocurrency platform named BonqDAO, in which $120 million was allegedly stolen.Blockchain research firm PeckShield confirmed to The Record that they believe $98 million worth of the Bonq Euro (BEUR) coin and $11 million in AllianceBlock (ALBT) coin was stolen. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-03",
      "title": "North Korean hackers stole research data in two-month-long breach",
      "text": " A new cyber espionage campaign dubbed 'No Pineapple!' has been attributed to the North Korean Lazarus hacking group, allowing the threat actors to stealthily steal 100GB of data from the victim without causing any destruction.The campaign lasted between August and November 2022, targeting organizations in medical research, healthcare, chemical engineering, energy, defense, and a leading research university.WithSecure was able to attribute the activity based on multiple pieces of evidence but also noticed some new developments for Lazarus, like:The campaign is named after the '< No Pineapple! >' error seen transmitted by a remote access malware when uploading stolen data to the threat actor's servers.The Lazarus hackers compromised the victim's network on August 22nd, 2022, by leveraging the CVE-2022-27925 (remote code execution) and CVE-2022-37042 (authentication bypass) Zimbra vulnerabilities to drop a webshell on the target's mail server.After successfully breaching the network, the hackers deployed the tunneling tools 'Plink and '3Proxy' to create reverse tunnels back to the threat actors' infrastructure, allowing the threat actors to bypass the firewall.Less than a week after, WithSecure says the intruders began utilizing modified scripts to extract approximately 5GB of email messages from the server and save them to a locally stored CSV file, which was later uploaded to the attacker's server.Over the next two months, the threat actors spread laterally through the network, acquiring administrator credentials and stealing data from devices.While spreading through the network, Lazarus deployed multiple custom tools, such as Dtrack and what is believed to be a new version of the GREASE malware, used to locate Windows administrator accounts.Dtrack is an information-stealing backdoor known to be used by Lazarus, while the GREASE malware is associated with Kimusky, another North Korean state-sponsored hacking group.The attack culminated on November 5th, 2022, with the actors lurking in the network for over two months and ultimately stealing 100GB of data from the compromised organization. WithSecure was able to analyze the work patterns of the threat actors, stating that they worked Monday through Saturday from 9 AM to 10 PM.\"Time zone attribution analysis concluded that the time zone aligns with UTC +9. Reviewing activity by time of day finds that most threat actor activity occurred between 00:00 to 15:00 UTC (09:00 and 21:00 UTC +9),\" shared WithSecure.\"Analysing activity by day of the week suggests that the threat actor was active Monday to Saturday, a common work pattern for DPRK.\"The first notable change found in this Lazarus campaign is that they now rely solely on IP addresses without domain names for their infrastructure.This change has advantages for the threat actors, including reduced need for renewal maintenance and greater IP flexibility.Instead, it relies on a separate backdoor to transfer the data it has gathered locally on the compromised machine, storing them in a password-protected archive.\"The staging and exfiltration host was likely carefully chosen by the threat actor to be a host where endpoint security monitoring tools were not deployed,\" explains WithSecure in the report.Its main difference compared to previous versions is that it now uses RDPWrap to install an RDP service onto the host to create a privileged user account with the help of net user commands.WithSecure's investigation of retrieved network logs from the victim revealed that one of the web shells planted by the intruders was communicating with a North Korean IP address (\"175.45.176[.]27\").This isolated incident occurred at the beginning of that day, preceded by connections from a proxy address, indicating that the threat actor likely exposed themselves by an error at the start of their workday.Additionally, WithSecure observed that various commands executed on the breached network devices were very similar to those hardcoded inside Lazarus malware but often contained mistakes and didn't execute, indicating that the threat actors were typing them manually using the Impacket 'atexec' module.Apart from the mistakes, WithSecure was able to link these operations to Lazarus based on TTP overlaps detailed in previous reports by Symantec and Cisco Talos, the employed malware strains, the profiles of the targets, infrastructure overlaps, and time-zone analysis.WithSecure's report is another indication of Lazarus' activity, with the threat group continuing its efforts to gather intelligence and exfiltrate large amounts of data from high-profile victims."
   },
   {
      "time": "2023-02-03",
      "title": "Cisco fixes bug allowing backdoor persistence between reboots",
      "text": " Cisco has released security updates this week to address a high-severity vulnerability in the Cisco IOx application hosting environment that can be exploited in command injection attacks.The security flaw (CVE-2023-20076) is due to the incomplete sanitization of parameters passed during the app activation process. It was found and reported by security researchers Sam Quinn and Kasimir Schulz with the Trellix Advanced Research Center.Successful exploitation in low-complexity attacks that don't require user interaction enables remote authenticated threat actors to execute commands with root permissions on the underlying operating system.The company says the vulnerability affects Cisco devices running IOS XE software, but only if they don't support native docker.Besides IOS XE-based devices configured with IOx, the list of impacted devices also includes 800 Series Industrial ISR routers, CGR1000 compute modules, IC3000 industrial compute gateways, IR510 WPAN industrial routers, and Cisco Catalyst access points (COS-APs).The company also confirmed that the CVE-2023-20076 flaw doesn't affect Catalyst 9000 Series switches, IOS XR and NX-OS software, or Meraki products.Attackers can only exploit this vulnerability if they have authenticated administrative access to the vulnerable systems.However, the Trellix researchers explained that threat actors exploit other security flaws allowing privilege escalation, or can use various tactics to obtain admin credentials.For instance, to gain admin access to the targeted devices, they can use:\"Side-stepping this security measure means that if an attacker exploits this vulnerability, the malicious package will keep running until the device is factory reset or until it is manually deleted.\"This is possible because the command injection enables bypassing mitigations put in place by Cisco to prevent vulnerability persistence between system reboots or system resets.Cisco's Product Security Incident Response Team (PSIRT) says it found no evidence that this vulnerability is being exploited in the wild."
   },
   {
      "time": "2023-02-03",
      "title": "Data breach at Vice Media involved SSNs, financial info",
      "text": " A data breach involving Vice Media leaked the sensitive information and financial data of more than 1,700 people, according to filings with Maine’s Attorney General.The media company hired a cybersecurity firm to investigate the incident and found that hackers managed to break into an internal Vice e-mail account. The company said that the effort to figure out what personal information was involved and find up-to-date addresses for all victims lasted until January 25, 2023.The company did not respond to requests for comment about why it took nearly a year to complete this process. In the January 26 filing, Vice Media said Social Security numbers were involved in the breach – which affected 1,724 people.In a second filing five days later, the company said the breach also involved financial account numbers, credit and debit card numbers as well as security codes, access codes, passwords and PINs for accounts. The letters do not say if any other information was leaked during the incident. It is unclear whether the letters reference different events or one cyberattack. The January 26 filing said the breach was discovered on April 4 but the January 31 filing said it was discovered on December 19. Victims are being offered 12 months of credit and identity monitoring services as well as identity restoration services through Equifax. The plan includes $1 million in identity theft insurance. The breach notification letters were sent to victims on Monday.News outlets continue to be frequent targets for hackers due to the information they hold not only on subscribers but employees. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   }
]