[
   {
      "time": "2022-08-10",
      "title": "Adobe Patch Tuesday: Code Execution Flaws in Acrobat, Reader - SecurityWeek",
      "text": " Hi, what are you looking for?Software maker Adobe has released patches for at least 25 documented security vulnerabilities that expose Windows and macOS users to malicious hacker attacks.The most urgent fix affects the ubiquitous Adobe Acrobat and Reader software used to create, view and manage PDF files across platforms.ByFlipboardRedditWhatsappWhatsappEmailRyan Naraine is Editor-at-Large at SecurityWeek and host of the popular Security Conversations podcast series. He is a security community engagement expert who has built programs at major global brands, including Intel Corp., Bishop Fox and GReAT. Ryan is a founding-director of the Security Tinkerers non-profit, an advisor to early-stage entrepreneurs, and a regular speaker at security conferences around the world.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-08-10",
      "title": "CISA warns of Windows and UnRAR flaws exploited in the wild",
      "text": " The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has added two more flaws to its catalog of Known Exploited Vulnerabilities, based on evidence of active exploitation.One of them has spent more than two years as a zero-day bug in the Windows Support Diagnostic Tool (MSDT) and it has exploit code publicly available.Both security issues have received a high-severity score and are directory traversal vulnerabilities that could help attackers plant malware on a target system.The problem came back to public attention this year by security researcher j00sean, who summarized what an attacker could achieve by exploiting it and provided video proof:An attacker could leverage it to plant a malicious file on the target system by extracting it to an arbitrary location during the unpack operation.Exploit code has been added to the Metasploit penetration testing software earlier this month.For both vulnerabilities, federal agencies in the U.S. are expected to apply the updates from the vendors by August 30."
   },
   {
      "time": "2022-08-10",
      "title": "Dragos: 125 ransomware attacks on industrial systems in Q2 after Conti shutdown",
      "text": " Ransomware attacks on industrial systems continued unabated in the second quarter of the year according to data collected by security company Dragos, which counted 125 incidents during that time.Through publicly disclosed incidents, network telemetry, and dark web postings, the company tracks 43 different ransomware groups, noting that only 23 groups were active in the second quarter. The 125 attacks tracked by the firm was less than the 158 seen in the first quarter. Dragos attributed the decline to the shutdown of Conti, which previously accounted for about 25% of attacks on industrial organizations and infrastructures that they tracked.Nearly 40% of all ransomware attacks on industrial organizations and infrastructures took place in Europe during the second quarter, with North America coming in second with 36 incidents. There were about 32 incidents in Asia and other attacks across South America, the Middle East and Africa. According to Dragos data, 86 attacks targeted systems at manufacturing organizations while 10 were aimed at the food and beverage industry as well as energy companies. When broken down, most attacks on the manufacturing industry involved automotive companies, metal products organizations and others working with building materials and clothing. The attacks on manufacturing companies also had several downstream effects on other organizations that rely on materials and goods produced by these factories. “Analysis of ransomware data shows Lockbit 2.0 made 33 percent of the total ransomware attacks in Q2; Conti comes in next with 13 percent; Black Basta made 12 percent; Quantum made 7 percent; AlphaV and Hive made 4 percent each,” Dragos researchers said.“Lockbit 2.0 maintained the same number of ransomware incidents as last quarter, showing that the group continues to maintain the same level of operation. Whereas the Conti, Lockbit 2.0, and Black Basta groups continue to target different sectors of industrial organizations, most of the victims are within the manufacturing sector.”Dragos found several other trends in the quarter related to what organizations each ransomware group targeted, noting that LockBit was the only group that went after the pharmaceutical, mining, and water treatment sectors.Black Basta, Ransomhouse, and Everest only targeted entities in the U.S. and Europe while several groups – LAPSUS$, CL0P LEAKS, and Rook – were not seen at all throughout Q2. For the third quarter, Dragos said it expected ransomware groups to continue targeting industrial operations, either \"through the integration of OT kill processes into ransomware strains, flattened networks allowing for ransomware to spread into OT environments, or through precautionary shutdowns of OT environments by operators to prevent ransomware from spreading to OT systems.\"Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-10",
      "title": "All ICS Vendors Impacted by OT:Icefall Vulnerabilities Have Released Advisories - Industrial Control Systems (ICS) Cyber Security Conference",
      "text": " SecurityWeek’s ICS Cyber Security Conference is the conference where ICS users, ICS vendors, system security providers and government representatives meet to discuss the latest cyber-incidents, analyze their causes and cooperate on solutions.The security holes impact various types of ICS products, including engineering workstations, PLCs, distributed control systems, building controllers, safety instrumented systems, remote terminal units, and SCADA systems. Exploitation of the flaws can lead to remote code execution, DoS attacks, firmware manipulation, compromised credentials, and authentication bypass.Affected vendors include Baker Hughes (Bentley Nevada), Emerson, Honeywell, JTEKT, Motorola, Omron, Phoenix Contact, Siemens, and Yokogawa. One of the impacted vendors has not been named as the disclosure process is still ongoing.JTEKTThe mitigations recommended by the vendor include the use of VPNs for remote access, using firewalls to protect control systems, minimizing network exposure, and using LAN port locks to prevent unauthorized devices from being connected to the network.Phoenix ContactMitigations recommended by the vendor include network segmentation to protect industrial controllers, protecting connections between engineering tools and controllers, and saving or transmitting project data securely.SiemensExploitation can be prevented by ensuring that server-side authentication or Kerberos authentication is enabled.YokogawaThe vendor has released an advisory describing the two credentials-related vulnerabilities, to which a “medium severity” rating has been assigned. Mitigations include preventing MitM attacks, and only allowing trusted hosts to connect to the controller.OmronMotorolaBently NevadaHoneywellEmerson*updated on June 29, 2022 with Omron and Motorola advisories, on July 8 with Bently Nevada advisory, on July 27 with Honeywell advisories, and on August 9 with Emerson advisoriesSecurityWeek’s Industrial Control Systems (ICS) Cyber Security Conference is the largest and longest-running event series focused on industrial cybersecurity. Since 2002, the conference has gathered ICS cyber security stakeholders across various industries and attracts operations and control engineers, IT, government, vendors and academics.Stay informed about the latest events.\n\nReach a large audience of enterprise cybersecurity professionals© 2023 SecurityWeek, a Wired Business Media Publication"
   },
   {
      "time": "2022-08-10",
      "title": "Collective of anti-disinformation 'Elves' offer a bulwark against Russian propaganda | CyberScoop",
      "text": " \n\nAugust 9, 2022\n\nWeeks after Russia launched its war in Ukraine in February, stories began circulating via Facebook and YouTube that President Vladimir Putin invaded only to destroy a secret U.S. and NATO-run lab making a deadly virus.The messages portrayed Putin as the anti-Western hero saving Eastern Europe from an American ploy: “Washington’s unprecedented rage. Destroyed laboratories in Ukraine where the United States was developing advanced biological weapons against Russia. Reasons for launching Russian ‘Special Operations.’ What to believe? They didn’t admit it in Wuhan either!”The biological weapons storyline that spread online and via email chain letters in Central and Eastern Europe is just one example of the propaganda coming out of Moscow to justify the war in Ukraine and turn public opinion against the West. While Meta, Twitter and Google say they are working hard to remove these kinds of fake stories from their platforms, it’s nearly impossible to find and dispute all the disinformation circulating online before thousands of people read, share, like or comment on the phony narratives.This is where the Elves come in. A loosely organized collective of researchers, activists, technology experts and volunteers from across Central and Eastern Europe, the Elves are ordinary citizens who have banded together to fight Russian disinformation about the war. “The only cure is that you communicate the facts, but this [virus] narrative works really well because it scares people,” said Bleise, a 38-year-old Czech disinformation researcher working to debunk storylines such as the fake bio-lab posts. (Bleise asked CyberScoop not to use her real name due to security concerns).Her goal along with other Elves is to flag articles or videos for social media platforms as well as to create and publicize an archive of disinformation from Russian troll groups so that researchers and disinformation watchdogs can better detect — and more quickly remove — posts in the future.“Trolls are ugly; elves are bright creatures confronting them,” Hawk, the nom de guerre for a founding father of the movement, told CyberScoop. “To be an elf is quite fashionable and we have a lot of supporters,” Hawk said. “Because you’re fighting against evil.”Today, there are several thousand Elves in chapters in Finland, Germany and 11 other countries across the former Eastern bloc, including Estonia, the Czech Republic, Ukraine and Poland. The community includes cybersecurity threat researchers, psychologists, lawyers, marketing experts and intelligence experts. “They get more citizens involved in defending democratic values and the integrity of their own information space, but also help to amplify and augment the everyday work of civil society counter-disinformation responders.” The Elves also team up with tech companies offering data analytics and threat intelligence. One member of the Elves said he works for Trend Micro, the global cybersecurity company, and is able to use his expertise to help members mask their real identities.Disinformation experts say the Elves are playing an increasingly important role in monitoring and debunking Russian disinformation. In fact, the Elves may be the most important and effective citizen-led response to disinformation in existence, said Kevin Sheives, an associate director at the International Forum for Democratic Studies at the National Endowment for Democracy and formerly a State Department official specializing in Chinese disinformation.“They get more citizens involved in defending democratic values and the integrity of their own information space, but also help to amplify and augment the everyday work of civil society counter-disinformation responders,” Sheives said.While the Elves have grown since the Ukraine war, the group has existed since 2014, shortly after the Russian invasion of Crimea. In the beginning, the Elves were just a group of three friends responding to Russian disinformation in the comments section of newspaper websites. “It was a pretty primitive way, but it’s where we started,” said Hawk. “Putin pushed us to stop discussions and start to do something,” he said.To date, the Elves have cataloged and worked to disrupt thousands of Russian information operations, pioneering a model for squelching disinformation that experts said has informed the work of organizations such as the Atlantic Council’s Digital Forensic Research Lab and the State Department’s Global Engagement Center.Eto Buziashvili, a Georgia-based disinformation researcher for the Atlantic Council’s Digital Forensic Research Lab, said “the Kremlin is quite aware of the Elves Army and that they have a huge network and of course they are worried because these people are located in many countries and they can detect the Kremlin operations early.”Once a year, the Elves meet in Lithuania’s capital Vilnius at what is known as the Elves Academy, a conference where members are trained on the latest techniques and tactics for taking down their troll adversaries. It’s a place where members of the Elves such as Bleise can share their research and approach to hunting disinformation. A mother of two, Bleise spent years lecturing and writing about disinformation before becoming an Elf. The work is exhausting, she said. But the community of like-minded people working together with a common goal keeps her going. She said that while some people think the Elves are “crazy activists,” those in the know realize they are largely skilled professionals donating their time to the cause. She said she occasionally meets other Elves for coffee to “arrange some hackathon” and finds herself marveling at the fact that she is working with “some of the best brains in my country.”  Ultimately, said Klečková, the Elves just want to make a difference and use the tools at their disposal — the internet, their community and their intellects — to make a difference. “It is smart, educated people who simply care about values such as freedom of speech and democracy.”"
   },
   {
      "time": "2022-08-10",
      "title": "Argentinian health services plan hit by LockBit",
      "text": " The Office of Inadequate SecurityOn June 27, Clarin reported that OSDE had suffered a cyberattack on June 25.The attack reportedly resulted in OSDE being unavailable online for a few hours.On June 27, OSDE confirmed the attack, but without confirming it was a ransomware incident.Machine translation of notice on OSDE’s site reads, in part: “Hello! We would like to inform you that our online management services are out of service for the moment. We are working to restore them as soon as possible.” Email inquiries to OSDE on June 26 by DataBreaches seeking clarification on how services were being affected went unanswered.“Can you tell me if that’s true? Is OSDE a LockBit victim?” they were asked.LockBitSupp responded, “idk” (“I don’t know”).On July 22, LockBit added OSDE to their dedicated leak site on the dark web with a price tag of $300,000 to purchase or remove all the data, a proof pack (sample of files), and a deadline of August 6.DataBreaches reached out to LockBit again on July 25 to determine how much personal or sensitive information Lockbit had exfiltrated about employees, affiliates, and members. They never answered that inquiry by August 8, when they dumped what they claim was 139.07 GB of files.DataBreaches also reached out to OSDE again on July 25 to repeat inquiries about whether the attack affected functions or patient care, but again, got no reply.Inspection of files in the leak revealed folders with names of people who appear to be affiliates of OSDE, audit-related files, billing and collection-related files, taxes, and “rescues. The “rescue” folder had subfolders for 2020, 2021, and 2022, and affiliate-related files. Some of these files involved Binaria Seguros, a life insurance company owned by OSDE.  Many of the folders listed in the file-tree were empty.All in all, DataBreaches saw very little personal information in the files that were reviewed, and no real patient data. (SEE CORRECTION AND UPDATE BELOW)So what in this data leak could possibly be worth $300,000? As far as DataBreaches has seen, this leak is mostly a big nothing.DataBreaches sent one more email to OSDE asking them if LockBit acquired any patient data, if it acquired any personal or sensitive employee or affiliate information, and if it notified any patients, employees or affiliates, or the data protection regulator.  Other than an auto-responder to acknowledge receipt, no reply was received.Editing by Dissent.  CORRECTION AND UPDATE:  A threat analyst, Mauro Eldritch, who reviewed all the data informed Clarin that he found sensitive information:…. there are files that refer to fragments of medical records, medical studies, patient lists, PCR test results and absolutely private and intimate medical information, such as serious diseases and treatments.Regarding the affected users, the expert said: “Scanned copies of DNI, data and procedures of Politically Exposed Persons (PEP) were leaked, including politicians, journalists and celebrities, as well as their relatives.This site doesn’t accept sponsored posts and doesn’t respond to requests about them.Email:Signal: +1 516-776-7756© 2009 – 2023, DataBreaches.net and DataBreaches LLC. All rights reserved.“You translate “Nerd” into understandable “English” — Victor Gevers of GDI Foundation, talking about DataBreaches.net"
   },
   {
      "time": "2022-08-10",
      "title": "ÆPIC Leak: Architectural Bug in Intel CPUs Exposes Protected Data - SecurityWeek",
      "text": " Hi, what are you looking for?A group of researchers from several universities and companies has disclosed a new Intel CPU attack method that could allow an attacker to obtain potentially sensitive information.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-08-10",
      "title": "Microsoft August 2022 Patch Tuesday fixes exploited zero-day, 121 flaws",
      "text": " Today is Microsoft's August 2022 Patch Tuesday, and with it comes fixes for the actively exploited 'DogWalk' zero-day vulnerability and a total of 121 flaws.Seventeen of the 121 vulnerabilities fixed in today's update are classified as 'Critical' as they allow remote code execution or elevation of privileges.The number of bugs in each vulnerability category is listed below:The above counts do not include twenty vulnerabilities previously fixed in Microsoft Edge.This month's Patch Tuesday fixes two zero-day vulnerabilities, with one actively exploited in attacks.Microsoft classifies a vulnerability as a zero-day if it is publicly disclosed or actively exploited with no official fix available.Security researcher Imre Rad discovered this vulnerability in January 2020, but Microsoft decided not to fix it after deeming it not to be a security vulnerability.Microsoft says that the CVE-2022-30134 vulnerability is publicly disclosed but has not been detected in attacks.Other vendors who released updates in August 2022 include:"
   },
   {
      "time": "2022-08-10",
      "title": "Cloudflare employees also hit by hackers behind Twilio breach",
      "text": " Cloudflare says some of its employees' credentials were also stolen in an SMS phishing attack similar to the one that led to Twilio's network being breached last week.However, although the attackers got their hands on Cloudflare employees' accounts, they failed to breach its systems after their attempts to log in using them were blocked since they didn't have access to their victims' company-issued FIDO2-compliant security keys.\"While individual employees did fall for the phishing messages, we were able to thwart the attack through our own use of Cloudflare One products, and physical security keys issued to every employee that are required to access all our applications.\"While the attacker attempted to log in to our systems with the compromised username and password credentials, they could not get past the hard key requirement.\"As Cloudflare also revealed, after entering their credentials on the phishing pages, AnyDesk remote access software was automatically downloaded on their computers to allow the threat actors to take control of their computers remotely if installed.The phishing messages sent to 76 employees and their families from T-Mobile phone numbers redirected the targets to a Cloudflare Okta login page clone hosted on the cloudflare-okta[.]com domain.This domain was registered via the Porkbun domain registrar, also used to register web domains used to host landing pages seen in the Twilio attack.The company took multiple measures in response to this attack, including to:Unlike Cloudflare, the company said the attackers were able to access some of its customers' data after breaching internal systems using stolen employee credentials in an SMS phishing attack.Twilio also revealed that it coordinated its incident response efforts with other companies targeted by similar attacks around the same time.\"We have heard from other companies that they, too, were subject to similar attacks, and have coordinated our response to the threat actors – including collaborating with carriers to stop the malicious messages, as well as their registrars and hosting providers to shut down the malicious URLs,\" Twilio said.\"Despite this response, the threat actors have continued to rotate through carriers and hosting providers to resume their attacks.\""
   },
   {
      "time": "2022-08-10",
      "title": "Maui ransomware operation linked to North Korean 'Andariel' hackers",
      "text": " The Maui ransomware operation has been linked to the North Korean state-sponsored hacking group 'Andariel,' known for using malicious cyber activities to generate revenue and causing discord in South Korea.State-sponsored North Korean hackers are notorious for orchestrating campaigns with financial motives, so running their own ransomware operation matches their overall strategic goals.The link between Maui and Andariel was made by researchers at Kaspersky, who attribute it with medium confidence.The group has been operating since at least 2015, targeting state, government, and army organizations and financial service providers.Maui ransomware started attacks in April 2021 (based on build timestamps), maintaining an apparent focus on healthcare organizations in the United States.According to Kaspersky, the Japanese victim was hit by the DTrack malware mere hours before encryption, while subsequent log analysis revealed the presence of the \"3Proxy\" tool in the firm's network months earlier.DTrack (also known as Preft) is a modular malware specializing in data theft and HTTP exfiltration via Windows commands. 3Proxy is a free open-source proxy server utility observed in various Andariel past campaigns.The particular DTrack variant used in the attacks against the Japanese, Russian, Indian, and Vietnamese firms features a code similarity of 84% to samples directly linked to previous Andariel operations.Additionally, the initial network compromise methods noticed in these attacks also feature typical Andariel characteristics, like exploiting vulnerable Weblogic servers (CVE-2017-10271). Kaspersky notes that its analysts have seen identical exploits and methods of compromise used by Andariel in mid-2019.While the above isn't enough for concrete attribution, the APT and the ransomware operation appear to have a connection, which could help with early detection and prevention."
   }
]