[
   {
      "time": "2022-09-21",
      "title": "Ask.FM user database with 350m user records has shown up for sale (UPDATED with Denial from Ask.FM)",
      "text": " The Office of Inadequate Security“I think it’s probably one of the biggest breaches in a long time, can’t think of any bigger ones,” Pompompurin, the owner of Breached.to, wrote when asked about a new for-sale listing that appeared on his forum.A seller called “Data,” who Pompompurin says he will “vouch all day and night for” listed user data from Ask.FM (ASKfm), the social networking site.“I’m selling the users database of Ask.fm and ask.com,” Data wrote. “For connoisseurs, you can also get 607 repositories plus their Gitlab, Jira, Confluence databases.”There are about 350 million records in the database, with about 45 million of them using Single Sign-On login.The fields in the user database include: “user_id, username, mail, hash, salt, fbid, twitterid, vkid, fbuid, iguid” and the hashes are reportedly crackable.Data, who joined the forum in March, also provided a list of repositories, and sample git and sample user data.DataBreaches reached out to Data to ask some questions about when the data were acquired and how. DataBreaches also reached out to Ask.FM last night to ask them some questions.Ask.FM didn’t reply to either of two inquiries over a 24 hour period, but Data did respond to this site’s questions, with two prefacatory remarks. The first was to berate yours truly for having a protonmail account. The second was a request to please add “Marine Le Pen is a racist fraudster.”Having dealt with those remarks, let’s turn to the clarification Data provided on the Ask.FM incident.In response to the first query about initial access, Data replied that there was a vulnerability in Safety Center: the server contained a WordPress site on their ASKFM-NET network.As to when the hack occurred, Data replied that the server was first accessed in 2019 and the database was obtained on 2020-03-14. Data provided this site with users on the Safety Center and wrote insultingly about a certain ‘lazy’ administrator who allegedly used the same password everywhere.[Note: Data provided specific and technical details that DataBreaches is not reproducing in this post out of concern that they might encourage or enable others to re-attack Ask.FM. According to Data, Ask.FM is still vulnerable due to a poor response to the 2020 incident.“Specific parts were taken in 2021, although they assumed the aggressors were kicked off,” Data wrote.  “The buyer will get specific details on how piss easy it is to compromise the morons.”]How easy is “piss easy,” you wonder? “Just need to open 10 source files and spot either a vulnerability or peek at the heavy password re-use,” Data told DataBreaches.When asked whether Ask.FM knew about the breach in 2020, Data was unequivocal in stating that they knew. Ask.FM noticed the March 2020 breach circa June 2020, Data claims, but “was apparently too busy laying off employees to give Answers to the attempt to contact them.”Data’s claim that Ask.FM knew was based, in part, on Ask.FM burning some specific access the hackers had played around with, like several production AWS credentials provided to DataBreaches.DataBreaches could find no media coverage or other indication that Ask.FM ever disclosed the March 2020 breach or notified users of it.  If anyone ever received a notification about it, please contact DataBreaches. If Ask.FM replies to inquiries, this post will be updated. Because Data invited contacts by private message, it’s not clear how many purchase offers they have received at this point, but they tell DataBreaches that they are now looking more at a single (exclusive) sale.Updated 9/21/2022: Because there has still been no reply by AskFM, DataBreaches  sent an inquiry to the Irish DPC asking whether AskFM ever reported the March 2020 incident to them under the GDPR. This post will be updated when a reply to that inquiry is received.Update and Correction of September 23: To my surprise, DataBreaches discovered that this site had already contacted Ask.fm about the claimed breach back in December 2021.  They responded, and for some reason (probably linked to a neurological event last year that seriously impacted my memory), I never published anything about it.  Today, I found my draft post from that time still in Drafts, unpublished.Today, Ask.fm responded to my recent inquiries:As you were advised in December 2021, Askfm has not suffered any security incidents. We can confirm that this is still the case from our last communication until the present time.DataBreaches sincerely apologizes to Ask.FM for not remembering the December contact or their response at all. That said, DataBreaches does not apologize for trying to investigate such a large claimed breach. In light of their response today, DataBreaches is now publishing what was sitting in my Drafts folder since December.Part of previously unpublished draft from December 2021:….  Over the past week, DataBreaches.net reached out Ask.fm several times — by email and via their Twitter team — to try to verify or refute claims about a hack that allegedly acquired more than 340 million records. The person who informed DataBreaches.net about the alleged hack provided this site with samples of data that were purportedly from the firm’s internal network.As this site routinely does, Ask.fm were given a sample of the records from the larger sample this site had received so they had some sense of the data this site had been provided — at least, in part. If it was not their data, they could have simply responded that they investigated and found it wasn’t their data. But they didn’t respond. Because stonewalling is often an indication that there really has been a breach and the company is trying to cover it up or delay disclosure, DataBreaches.net asked them why they had not posted anything on their website or notified anyone. While the sample data appeared to be old data to DataBreaches.net, knowing that people re-use passwords and that the hacker claimed to have internal reports meant that this might need to be disclosed and/or reported to regulators, especially since the hacker claimed to have data on 350 million users that included usernames, email addresses, and easy-to-crack passwords.Ask.fm has headquarters in California and Latvia, and is registered in Dublin for GDPR purposes.When Ask.fm finally responded, their reply was as follows:Hi.\nThank you for sharing this information. We have provided it to law enforcement as it appears to be aiding and abetting an extortion attempt which has no valid foundation; we have had no security incidents and law enforcement has been made aware of your email.Best regards,\nCommunications DepartmentSo why didn’t they simply respond to the initial inquiry by saying that they have had no security incident? Or ask for more data so they could investigate?This site replied:Thanks for your response. Journalists attempt to verify claims. That is not aiding and abetting anything. I will include your reply if and when I report on the claimed attack.… End of previously unpublished draft.But I never did report on the claim or their response, it seems, and truly had no memory of any of it. To say that I was shocked to receive their email referring to past communication would be an understatement.So Ask.FM denies that there was any breach at all. DataBreaches will not publish the technical details that this site had been provided, but it will be interesting to see if “Data” reveals them. For now, however, DataBreaches considers this claimed breach as “disputed.”They have a very rude team; I discovered multiple vulnerabilities in Ask.FM website during 2021, and then I reported my findings. Unfortunately, I think they throw my report in the garbage, nothing fixed, and even there is no MFA option for all 350 million users! That means a disaster if the leaked data is accurate.Comments are closed.This site doesn’t accept sponsored posts and doesn’t respond to requests about them.Email:Signal: +1 516-776-7756© 2009 – 2023, DataBreaches.net and DataBreaches LLC. All rights reserved.“You translate “Nerd” into understandable “English” — Victor Gevers of GDI Foundation, talking about DataBreaches.net"
   },
   {
      "time": "2022-09-21",
      "title": "Imperva mitigated long-lasting, 25.3 billion request DDoS attack",
      "text": " Internet security company Imperva has announced its DDoS (distributed denial of service) mitigation solution has broken a new record, defending against a single attack that sent over 25.3 billion requests to one of its customers.The target was a Chinese telecommunications service provider often at the receiving end of DDoS attacks with unusually large volumes.The DDoS attack unfolded on June 27, 2022, peaking at 3.9 million requests per second (RPS) and averaging 1.8 million RPS.Attacks peaking above one million RPS typically last between several seconds and a few minutes, but the one Imperva mitigated lasted over four hours.According to the company, only about one in ten DDoS attacks last for over an hour, and an even smaller percentage comes with notable firepower sustained for so long.The DDoS attack that Imperva mitigated was launched by a massive botnet spread across 180 countries, with most IP addresses located in the U.S., Brazil, and Indonesia.The botnet used 170,000 captured devices, including modem routers, smart security cameras, vulnerable servers, and poorly protected IoTs.Imperva comments that some of the servers from where the malicious traffic originated are hosted on public clouds and cloud security service providers, indicating large-scale abuse.Cloudflare says that Mantis relies on a smaller number of devices, just over five thousand, focusing mainly on enlisting powerful servers and virtual machines.Still, both Mēris and Mantis have previously delivered quick blows in short-burst attacks, not multi-hour long DDoS, so this might be a novel, not yet identified botnet."
   },
   {
      "time": "2022-09-21",
      "title": "Windows 11 22H2 adds kernel exploit protection to security baseline",
      "text": " Microsoft has released the final version of security configuration baseline settings for Windows 11, version 22H2, downloadable today using the Microsoft Security Compliance Toolkit.\"This release includes numerous changes to further assist in the security of enterprise customers,\" Microsoft security consultant Rick Munck said.\"Changes have been made for additional protections around hardware and driver security, credential theft, printers, DNS, and account lockout.\"While the new baseline adds extra defenses focusing on multiple areas, the highlight of the latest Windows 11 security baseline is the addition of Kernel Mode Hardware-enforced Stack Protection that provides additional hardware-level protection for kernel code against malware threats.It works on systems featuring chipsets that support hardware shadow stacks like Intel's Control-flow Enforcement Technology (CET) or AMD shadow stacks.It secures the kernel from common exploit techniques, including Return-Oriented Programming (ROP) and Jump Oriented Programming (JOP), by automatically triggering exceptions when it detects that a process' natural flow has been modified.Attackers regularly use such exploitation tactics to hijack a program's intended control flow, for instance, attempting to execute malicious code to escape a web browser's sandbox or remotely running code when visiting maliciously crafted web pages.\"There is a hardware dependency for this new feature that requires Intel Tiger Lake and beyond or AMD Zen3 and beyond.\"This setting has a dependency on HVCI (Virtualization Based Protection of Code Integrity). There shouldn't be any issues as long as enterprises are following the baselines but, if the organization deviates from HVCI, then Kernel Mode Hardware Enforced Stack Protection cannot be enabled.\"The new baseline adds protection against phishing attacks with the addition of Windows Defender SmartScreen Enhanced Phishing Protection for users still relying on username and password Windows authentication.\"These new features, located in Windows Components\\Windows Defender SmartScreen\\Enhanced Phishing Protection, ensure that enterprise credentials cannot be used for malicious or unintended purposes,\" Munck explained.\"Because this is an end-user option, the security baseline enforces enablement of the service (the Service Enabled setting) to ensure that the enterprise credentials used in the system are appropriately monitored and audited.\"Several new settings are enabled under Administrative Templates\\Printers to protect enterprises, including 'Configure RPC over TCP port,' support for 'RedirectionGuard,' the enforcement of TCP for the 'Configure RPC connection' and 'Configure RPC listener settings.'The Windows 11 22H2 security baseline also includes credential theft protection via the 'Allow Custom SSPs and APs to be loaded into LSASS,' 'Configure LSASS to run as a protected process,' and 'Enable MPR notifications for the system' to restrict the loading of custom security packages and block password disclosure to providers.The operating system baseline reduces attack surface through the new 'Block abuse of exploited vulnerable signed drivers' rule, which helps prevent apps from writing vulnerable signed drivers to disk, and brute-force authentication attack mitigation via the new 'Allow Administrator account lockout' rule.Microsoft also recommends enabling 'Configure DNS over HTTPS (DoH) name resolution' under Administrative Templates\\Network\\DNS Client. While not yet in the baseline, enterprises who wish to use encrypted DNS can enable it manually.The Windows security baseline enables enterprise security admins to use Microsoft-recommended Group Policy Object (GPO) baselines to reduce the attack surface and to improve the security posture of Windows enterprise endpoints.\"Please download the content from the Microsoft Security Compliance Toolkit, test the recommended configurations, and customize / implement as appropriate,\" Munck added."
   },
   {
      "time": "2022-09-21",
      "title": "Scoop: Tift Regional Medical Center victim of ransomware attack in July",
      "text": " The Office of Inadequate SecurityAccording to communications shared exclusively with DataBreaches, the breach started on July 14 and ended on August 8. During that time, Hive claims they were able to download about 1 TB of data, allegedly consisting of:-company private info (budgets, plans, taxes, contracts, NDA, other agreements, etc)\n-medical records (patient name, address, gender, SSN, insurance, diagnosis included)\n-employee private info (payrolls, contracts, NDA, SSN, salaries, addresses, passports, etc)\n-emails between your companies and patients/partnersOn August 25, Hive first emailed Tift to introduce themselves and tell them about the breach and how to reach them for negotiations. In that email, Hive provided the hospital with a link to where they could see 25% of the downloaded data and provided a timeline of what they did and how (some details below redacted by DataBreaches):On August 26, someone from Tift contacted Hive and asked what they wanted. To cut to the chase, the amount was $1,150,000.00. “We know that you have cyber insurance policy with a limit of $6M. Our financial experts have estimated what losses you will incur in the event of a leak of your personal data.,” Hive wrote.In response to the negotiator’s request, Hive provided them with a list of all the files they had exfiltrated. Tift then asked for more time for the board to meet to consider everything and what they could offer.On September 2, Tift’s negotiator wrote:Hello. Our board has made the approval to offer $100,000 to you. Because of the time left today and banking holiday on Monday, this payment can likely be made on Tuesday if you agree.Hive responded:Thank you for your offer. Tell the board that they can keep 100k for lawyers. We will publish the data.On September 8, Tift’s negotiator wrote, in part:Our board is asking if you can please accept $225k. We are a small network without much funding.Hive promptly responded:Rejected. You have cyber insurance that will cover all your expenses. If you can pay in 48 hours than we can give you 20% discount. It’s final. Accept it or tell me that you reject it.Tift responded that they would pass that along, but the board would have to meet again on Monday (September 12).That was the last communication Hive received from them.DataBreaches was given access to the 25% of the files Hive shared with Tift. It contained employee and patient information, audits, accounting, and internal files. Whether Hive will leak the data remains to be seen. Tift’s negotiator seems to have used the same unsuccessful strategy that others have used: claiming that an entity is not-for-profit and doesn’t have the means to pay even though the threat actors have done their homework and know how much cyberinsurance the victim has and how much the executives of the hospital earn each year.Tift did not reply to an inquiry about what Tift is doing in response to this incident. This post will be updated if a reply is received.There are inaccuracies about the incident in what has been reported, and the investigation into the incident and claims is ongoing. We will be providing notice to individuals whose personal information is determined to be impacted.DataBreaches sent a second inquiry to Tift asking exactly what they thought was inaccurate in the reporting. DataBreaches hopes that Southwell will respond this time.This site doesn’t accept sponsored posts and doesn’t respond to requests about them.Email:Signal: +1 516-776-7756© 2009 – 2023, DataBreaches.net and DataBreaches LLC. All rights reserved.“You translate “Nerd” into understandable “English” — Victor Gevers of GDI Foundation, talking about DataBreaches.net"
   },
   {
      "time": "2022-09-21",
      "title": "Hive ransomware claims attack on New York Racing Association",
      "text": " The Hive ransomware operation claimed responsibility for an attack on the New York Racing Association (NYRA), which previously disclosed that a cyber attack on June 30, 2022, impacted IT operations and website availability and compromised member data.NYRA is the operator of the three largest thoroughbred horse racing tracks in New York, namely the Aqueduct Racetrack, the Belmont Park, and the Saratoga Race Course.The data breach notifications also include details on how to enroll for a 24-month long identity protection service through Experian, the cost for which is covered by NYRA.Additionally, the letter recipients should consider placing a credit freeze or ordering credit reports frequently and reviewing them carefully.BleepingComputer has reached out to NYRA for more details on the incident, but we have not received a response yet.From what seems to be the case, horse racing hasn't been impacted by the incident because there have been no changes in the calendar, and race betting continues as usual.However, the association's website remains out of reach, which sends the message that the effects of the attack haven't been wholly mitigated yet.Yesterday, the Hive ransomware gang took responsibility for the attack on NYRA by listing them as a victim on their extortion site.The hackers have also published a link to freely download a ZIP archive containing all of the files they allegedly stole from NYRA's systems, so we can only assume that negotiations for a ransom payment have reached a dead end.Update 9/21/2022 - A NYRA spokesperson has shared the following comment with BleepingComputer:On June 30, 2022, NYRA discovered suspicious network activity that had the markings of a potential cyber-attack. In response, NYRA immediately suspended the connectivity of all affected systems, notified the relevant law enforcement and regulatory authorities, and mobilized cyber-security professionals to investigate the nature and scope of the attack.Over the ensuing weeks, NYRA and its team of experts performed detailed forensic analysis of the NYRA network and systems to determine the extent of the breach and exposure of customer information.Fortunately, the damage done to the NYRA network was not connected to -day-to-day racing operations, customer wagering activity, NYRA Bets or NYRA television. As a result, there was no interruption to NYRA’s core operations.There is currently no evidence to suggest that sensitive customer data or information was compromised by the data breach. However, NYRA discovered that those responsible for the attack gained access to files containing personally identifiable information of a group of NYRA employees and their beneficiaries.NYRA has notified all individuals who may have been impacted as required under applicable state laws."
   },
   {
      "time": "2022-09-21",
      "title": "",
      "text": " "
   },
   {
      "time": "2022-09-21",
      "title": "2K game support hacked to email RedLine info-stealing malware",
      "text": " Hackers have compromised the support system of American video game publisher 2K and now are sending support tickets to gamers containing the RedLine password-stealing malware.2K is the publisher behind numerous popular game franchises, including NBA 2K, Borderlands, WWE 2K, PGA Tour 2K, Bioshock, Civilization, and Xcom.Soon after the tickets were opened, the gamers received another email containing a reply to their ticket from an alleged 2K support representative named 'Prince K.' This email includes an attached file named '2K Launcher.zip' hosted directly on 2ksupport.zendesk.com, which pretended to be a new game launcher.\"Thank you for reaching out to 2K Support! The download for the new 2K games launcher can be found below,\" read the support tickets sent to 2K customers.The downloaded archive contains a 107 MB executable named '2K Launcher.exe,' and based on its file properties, you can see that it is not an official 2K executable.For example, the file is not digitally signed by the company and has a name of 'Plumy' and a file description of '5K Player,'RedLine Stealer is an information-stealing malware that attempts to steal a wide variety of data, including browser history, browser cookies, saved browser passwords, credit cards, VPN passwords, IM content, system information, and cryptocurrency wallets.Analysis of the 2K Launcher.exe by BleepingComputer shows various folders targeted by the malware, including FileZilla, Discord, Steam, and web browsers, as seen below.If you have downloaded the fake 2K Launcher and executed it on your Windows device, you should immediately scan your computer with antivirus software and remove what is detected.Furthermore, it is strongly suggested that you change your passwords at any sites you frequent to a unique and strong one.At this time, 2K appears to have taken their support system offline, with users unable to access their tickets with their login credentials.Both Rockstar Games and 2K are subsidiaries of Take-Two Interactive, one of the largest game publishers in the Americas and Europe.It is unclear if the attack on 2K's support system is related to the attack on Rockstar Games, but the timing is suspicious.BleepingComputer has reached out to 2K about the hack of their support systems but has not received a reply,"
   },
   {
      "time": "2022-09-21",
      "title": "The 25 most popular programming languages and trends - Help Net Security",
      "text": " TypeScript overtakes JavaScript as the most popular language due to its developer-friendly features.TypeScript projects rank higher than JavaScript projects in success rate and throughput, suggesting that TypeScript helps developers catch smaller errors locally, allowing them to commit working code more frequently and reliably than JavaScript developers.Productivity and confidence-boosting benefits are a key driver of TypeScript’s adoption at the enterprise level and are a natural complement to the developer experience improvements that continuous integration provides.Usage of HashiCorp Configuration Language (HCL) on CircleCI has grown steadily over the past several years, climbing three spots since 2019 to become the ninth-most popular language used on the platform. HCL also appeared on the list of fastest-growing languages in GitHub’s 2018 and 2019 State of the Octoverse reports suggesting that infrastructure as code (IaC) has crossed the chasm from individual practitioners to widespread adoption among organizations delivering software at scale.Gherkin projects had the fastest mean time to recovery of all languages measured in CircleCI’s report, implying that Cucumber’s detailed error reporting gives developers highly actionable information on which to focus their debugging efforts."
   },
   {
      "time": "2022-09-21",
      "title": "Hackers steal $162 million from Wintermute crypto market maker",
      "text": " Digital assets trading firm Wintermute has been hacked and lost $162.2 million in DeFi operations, the company CEO, Evgeny Gaevoy, announced earlier today.Wintermute provides liquidity to over 50 cryptocurrency exchanges and trading platforms, including Binance, Coinbase, Kraken, and Bitfinex.The company remains solvent, holding twice the stolen amount in equity. A service disruption in the following days, though, is to be expected as the platform will work to restore all its operations.Gaevoy has also stated that they’re willing to treat the security incident as a “white hat” event, meaning they are open to pay the attacker a bounty for successfully exploiting the vulnerability, without any legal consequences.However, it’s unknown if the threat actor is interested in returning the stolen funds to Wintermute.The company CEO has clarified that Wintermute’s CeFi (centralized finance) and OTC (over-the-counter) operations have not been impacted by the security breach.To ease lender anxiety on investors, Gaevoy has offered them the opportunity to recall loans if they wanted to.What the Profanity tools allows users is generate addresses that are not completely randomized but contain a  an Ethereum vanity address generation tool that allows users to create a personalized address that contains a predefined string of numbers and letters (A through F).More specifically, it was estimated that someone could brute-force private keys of every 7-character vanity address using roughly a thousand GPUs for 50 days.Although such a collection of GPUs requires a significant investment, many cryptocurrency mining farms work with a larger number of GPUs.They called everyone holding funds on wallets created with Profanity to move the assets elsewhere immediately.The compromised Wintermute wallet appears to have been created with the buggy vanity address generator, so the Profanity weakness looks like a valid possibility for stealing the money."
   },
   {
      "time": "2022-09-21",
      "title": "Google tool for e-commerce sites being abused by hackers stealing card data, personal info",
      "text": " Thousands of e-commerce sites use Google Tag Manager containers for data on website usage metrics, customer tracking and marketing purposes. But Recorded Future experts have found three significant variants of malicious scripts that cybercriminals are hiding within GTM containers that allow them to exfiltrate the personal information of shoppers. “As of this writing, over 165,000 payment card records attributed to victims of GTM container abuse attacks have been posted to dark web carding shops,” the researchers said. “The total number of payment cards compromised via GTM-based e-skimmers is likely higher.” The Record is an editorially independent unit of Recorded Future.The researchers found 569 e-commerce domains infected with e-skimmers. According to the report, 314 were confirmed to have been infected by a GTM-based e-skimmer variant while 255 had infections that exfiltrated stolen data to malicious domains associated with GTM abuse. Nearly 90 of these e-commerce domains were still infected as of August 25 and on average, researchers found it took more than three months for the infections to be remediated.Stas Alforov, director of fraud research at Recorded Future, said that based on dark web chatter, the abuse of GTM goes back as far as 2018 and was used by a variety of cybercriminals.  “We first highlighted the use of GTM in a report in 2021, and it has continued to be in active use to this date, in some cases still using the same malicious GTM buckets made public last year,” Alforov said. “Thus we believe that the use of GTM will remain unchanged unless Google remediates it by implementing active scanning for skimmer payloads inside the GTM-hosted buckets.”By abusing legitimate tools like GTM, hackers can avoid security software that often does not scan GTM containers because website administrators typically whitelist trusted source domains, especially those coming from Google.Recorded Future said it began tracking the use of the three GTM-based e-skimmer variants since March 2021 and noted that newly infected e-commerce domains have been observed every month since then.The first and third variants the researchers found have similarities that suggest they may be used by the same cybercriminals — indicating that hackers are updating their tools to avoid detections. “All 3 variants use separate e-skimmer scripts and exfiltration domains. All 3 variants are currently in use for active infections and have been deployed to infect new e-commerce domain(s) in August 2022, indicating that all 3 variants pose an active risk to e-commerce websites and their customers — and by extension, to financial institutions and card networks,” the researchers said.When the researchers examined the attacks, they found that the hackers were not exclusively targeting “high-value” e-commerce domains with more than 1 million monthly visitors. Some of the sites that were abused only saw about 10,000 monthly visitors. Most of the websites are based in the U.S., which accounted for more than 66% of infections. The rest were based in Canada, the UK, Argentina, India, Italy, Australia, Brazil, Greece, Indonesia and others. “We were surprised to see the abuse of GTM containers given the prior abuse of Google analytics,” Alforov explained. “Additionally, the use of look-alike domains in some of the variants was odd as most large companies employ detection and remediation activities against look-alikes for security and brand protection reasons.”Recorded Future suggested e-commerce sites perform a full scan of files used within their webpages to catch any unauthorized changes.According to the researchers, hackers are likely to continue leveraging these publicly available, and often free-to-use, services in an effort to maintain infections. This kind of abuse also allows hackers to avoid detection and keep their anonymity, the report adds. “As security tools may be configured to save resources by whitelisting files hosted on ‘trusted’ source domains, this same optimization may be self-defeating for e-commerce websites, leaving websites open to exploitation and persistent infection with malicious files,” the researchers said.“The abuse of GTM containers also enables threat actors to update Magecart campaign infrastructure and software without the need to access the victim server.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   }
]