[
   {
      "time": "2022-12-12",
      "title": "Samsung Galaxy S22 hacked again on second day of Pwn2Own",
      "text": " Contestants hacked the Samsung Galaxy S22 again during the second day of the consumer-focused Pwn2Own 2022 competition in Toronto, Canada.They also demoed exploits targeting zero-day vulnerabilities in routers, printers, smart speakers, and Network Attached Storage (NAS) devices from HP, NETGEAR, Synology, Sonos, TP-Link, Canon, Lexmark, and Western Digital.Security researchers representing the vulnerability research company Interrupt Labs were the ones to demonstrate a successful exploit against Samsung's flagship device on Wednesday.They executed an improper input validation attack and earned $25,000, 50% of the total cash award, because this was the third time the Galaxy S22 was hacked during the competition.The second day of Pwn2Own Toronto wrapped up with Trend Micro's Zero Day Initiative awarding $281,500 for 17 unique bugs across multiple categories. This brings the first two days of Pwn2Own total to $681,250 awarded for 46 unique zero-days, as ZDI's Head of Threat Awareness Dustin Childs revealed.The mobile phone category comes with the highest cash prizes, with researchers earning up to $200,000 for hacking Apple iPhone 13 and Google Pixel 6 smartphones.Hacked Google and Apple devices also come with $50,000 bonuses if the exploits execute with kernel-level privilege, with the maximum reward for a single challenge going up to $250,000 for a full exploit chain with kernel-level access.This year's Pwn2Own Toronto consumer-focused hacking competition has been extended to four days (between December 6th and December 8th) after 26 individual contestants and teams registered to exploit 66 targets across all contest categories.On the third day of the competition, Samsung Galaxy S22 will once again be put to the test by hackers with the Pentest Limited and Qrious Secure teams."
   },
   {
      "time": "2022-12-12",
      "title": "WAFs of Several Major Vendors Bypassed With Generic Attack Method - SecurityWeek",
      "text": " Hi, what are you looking for?Researchers at industrial and IoT cybersecurity firm Claroty have identified a generic method for bypassing the web application firewalls (WAFs) of several major vendors.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-12",
      "title": "For Cyberattackers, Popular EDR Tools Can Turn into Destructive Data Wipers",
      "text": " Many trusted endpoint detection and response (EDR) technologies may have a vulnerability in them that gives attackers a way to manipulate the products into erasing virtually any data on installed systems.Or Yair, a security researcher at SafeBreach who discovered the issue, tested 11 EDR tools from different vendors and found six — from a total of four vendors — were vulnerable. The vulnerable products were Microsoft Windows Defender, Windows Defender for Endpoint, TrendMicro ApexOne, Avast Antivirus, AVG Antivirus, and SentinelOne.Three of the vendors have assigned formal CVE numbers for the bugs and issued patches for them prior to Yair disclosing the issue at the Black Hat Europe conference on Wednesday, Dec 7.In comments to Dark Reading, Yair says he reported the vulnerability to the affected vendors between July and August. \"We then worked closely with them over the next several months on the creation of a fix prior to this publication,\" he says. \"Three of the vendors released new versions of their software or patches to address this vulnerability.\" He identifies the three vendors as Microsoft, TrendMicro and Gen, the maker of the Avast and AVG products. \"As of today, we have not yet received confirmation from SentinelOne about whether they have officially released a fix,\" he says.Yair describes the vulnerability as having to do with how some EDR tools delete malicious files. \"There are two crucial events in this process of deletion,\" he says. \"There is the time the EDR detects a file as malicious and the time when the file is actually deleted,\" which sometimes can require a system reboot. Yair says he discovered that between these two events an attacker has the opportunity to use what are known as NTFS junction points to direct the EDR to delete a different file than the one that it identified as malicious.Yair says that to trigger the issue on vulnerable systems he first created a malicious file — using the permissions of an unprivileged user — so the EDR would detect and attempt to delete the file. He then found a way to force the EDR to postpone deletion until after reboot, by keeping the malicious file open. His next step was to create a C:\\TEMP\\ directory on the system, make it a junction to a different directory, and rig things so that when the EDR product attempted to delete the malicious file — after reboot — it followed a path to a different file altogether. Yair found he could use the same trick to delete multiple files in different places on a computer by creating one directory shortcut and putting specially crafted paths to targeted files within it, for the EDR product to follow.Yair says that with some of the tested EDR products, he was not able to do arbitrary file deletion but was able to delete entire folders instead.Yair says that in most cases, organizations can recover deleted files. So, getting an EDR to delete files on a system by itself, while bad, isn't the worst case. \"A deletion is not exactly a wipe,\" Yair says. To achieve that, Yair designed Aikido so it would overwrite files it had deleted, making them unrecoverable as well.He says the exploit he developed is an example of an adversary using an opponent's strength against them — just as with the Aikido martial art. Security products, such as EDR tools have super-user rights on systems, and an adversary that is able to abuse them can execute attacks in a virtually undetectable manner. He likens the approach to an adversary turning Israel's famed Iron Dome missile defense system into an attack vector instead.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-12",
      "title": "El Salvador Government is Employing Pegasus to Spy on Journalists - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-12-12",
      "title": "Iranian Hackers Strike Diamond Industry with Data-Wiping Malware in Supply-Chain Attack",
      "text": " An Iranian advanced persistent threat (APT) actor known as Agrius has been attributed as behind a set of data wiper attacks aimed at diamond industries in South Africa, Israel, and Hong Kong.The wiper, referred to as Fantasy by ESET, is believed to have been delivered via a supply-chain attack targeting an Israeli software suite developer as part of a campaign that began in February 2022.Victims include HR firms, IT consulting companies, and a diamond wholesaler in Israel; a South African entity working in the diamond industry; and a jeweler based in Hong Kong.Agrius, the Iran-aligned group behind the intrusions, has been active since at least December 2020 and leverages known security flaws in internet-facing applications to drop web shells that are, in turn, used to facilitate reconnaissance, lateral movement, and the delivery of final-stage payloads.The Slovak cybersecurity company said the first attack was detected on February 20, 2022, when the actor deployed credential harvesting tools in the IT network of the South African organization.Agrius subsequently initiated the wiping attack via Fantasy on March 12, 2022, before striking other companies in Israel and Hong Kong on the same date.Fantasy is executed by means of another tool called Sandals, a 32-bit Windows executable written in C#/.NET. It's said to be deployed on the compromised host through a supply-chain attack using the Israeli developer's software update mechanism.The wiper, for its part, works by recursively retrieving the directory listing for each drive, overwriting every file in those directories with garbage data, assigning a future timestamp to the files, and then deleting them.\"This is presumably done to make recovery and forensic analysis more difficult,\" Burgher explained.In a further attempt to erase all traces of the activity, Fantasy clears all Windows event logs, recursively purges all files in the system drive, overwrites the system's Master Boot Record, self-deletes itself, and finally reboots the machine.The campaign, which lasted no more than three hours, was ultimately unsuccessful, with ESET stating that it was able to block the wiper's execution. The developer of the software has since pushed out clean updates to plug the attacks.\"Since its discovery in 2021, Agrius has been solely focused on destructive operations,\" Burgher concluded.\"To that end, Agrius operators probably executed a supply-chain attack by targeting an Israeli software company's software updating mechanisms to deploy Fantasy, its newest wiper, to victims in Israel, Hong Kong, and South Africa.\"Agrius is far from the first threat group linked to Iran that has been spotted deploying destructive wiper malware.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-12",
      "title": "NodeBB prototype pollution flaw could lead to account takeover | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyond‘Not a prototype pollution vulnerability as you might normally understand it’However, NodeBB developers had used an object definition that could allow attackers to misuse Socket.IO’s objects. The maintainers of NodeBB told The Daily Swig that they have released only limited information about the bug to give developers some time to update their applications.However, Barış Uşaklı, one of those maintainers, did confirm that “the issue has a big impact since it allows an attacker to impersonate other users or make Socket.IO calls as an administrator”.On a default NodeBB installation, the vulnerability could allow an unauthenticated user to obtain admin access to the application. If the instance had enabled plugins with additional checks, such as two-factor authentication, then the impact would be more limited and require authenticated access to the application.Uşaklı said there is no evidence that the bug has been exploited in the wild. The maintainers patched the issue on the same day it was reported and on their hosted clients the next day.However, the NodeBB bug differs from typical flaws in this bug class.“This is not a prototype pollution vulnerability as you might normally understand it,” Stephen Bradshaw, the security researcher who discovered and reported the bug, told The Daily Swig.“In this case, access to the prototype of an object that was responsible for whitelisting functions run through the Socket.IO interface could be abused to modify the application’s environment in such a way that elevation of privileges was possible.”Per agreement with NodeBB maintainers, Bradshaw has delayed publication of his write-up and full exploitation details until January.The patch for the bug was a simple one-line modification that changed the method used to declare one of the objects.“The main takeaway from the issue and the fix is that it is a bad idea to use a plain JavaScript object (i.e., const someObj = {};) if the properties of this object are going to be accessed by values provided by the end user,” Uşaklı said.The silver lining is that patching NodeBB instances is fairly easy. In case developers can’t upgrade their applications to the latest version, they can cherry-pick the patch commit and just receive the security fix.Bradshaw said that it’s important for security assessors and developers to “understand ‘weird’ features of the programming language” when coding and reviewing an application.“Prototype inheritance in JavaScript is a prime example of this – it’s a language-specific issue that could lead to vulnerabilities, so devs writing JavaScript in particular need to be aware of it,” Bradshaw said.Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2022-12-12",
      "title": "Lighting Giant Acuity Brands Discloses Two Data Breaches - SecurityWeek",
      "text": " Hi, what are you looking for?Lighting and building management giant Acuity Brands has publicly disclosed two data breaches suffered by the company in recent years, including one that may have involved ransomware.The Atlanta, Georgia-based firm employs roughly 13,000 people and has operations in North America, Europe and Asia.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-12",
      "title": "Cyberattack on Top Indian Hospital Highlights Security Risk - SecurityWeek",
      "text": " Hi, what are you looking for?The leading hospital in India’s capital limped back to normalcy on Wednesday after a cyberattack crippled its operations for nearly two weeks.ByFlipboardRedditWhatsappWhatsappEmailAFP 2023Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-12",
      "title": "New Go-based Botnet Exploiting Exploiting Dozens of IoT Vulnerabilities to Expand its Network",
      "text": " A novel Go-based botnet called Zerobot has been observed in the wild proliferating by taking advantage of nearly two dozen security vulnerabilities in the internet of things (IoT) devices and other software.The campaign, which is said to have commenced after November 18, 2022, primarily singles out Windows and Linux operating systems to gain control of vulnerable devices.Zerobot gets its name from a propagation script that's used to retrieve the malicious payload after gaining access to a host depending on its microarchitecture implementation (e.g., \"zero.arm64\").The malware is designed to target a wide range of CPU architectures such as i386, amd64, arm, arm64, mips, mips64, mips64le, mipsle, ppc64, ppc64le, riscv64, and s390x.Two versions of Zerobot have been spotted to date: One used before November 24, 2022, that comes with basic functions and an updated variant that includes a self-propagating module to breach other endpoints using 21 exploits.This comprises vulnerabilities impacting TOTOLINK routers, Zyxel firewalls, F5 BIG-IP, Hikvision cameras, FLIR AX8 thermal imaging cameras, D-Link DNS-320 NAS, and Spring Framework, among others.Zerobot, upon initialization in the compromised machine, establishes contact with a remote command-and-control (C2) server and awaits further instructions that allow it to run arbitrary commands and launch DDoS attacks for different network protocols like TCP, UDP, TLS, HTTP, and ICMP.\"Within a very short time, it was updated with string obfuscation, a copy file module, and a propagation exploit module that make[s] it harder to detect and gives it a higher capability to infect more devices,\" Lin said.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-12",
      "title": "'Scattered Spider' Cybercrime Group Targets Mobile Carriers via Telecom, BPO Firms - SecurityWeek",
      "text": " Hi, what are you looking for?A threat actor tracked as ‘Scattered Spider’ is targeting telecommunications and business process outsourcing (BPO) companies in an effort to gain access to mobile carrier networks and perform SIM swapping, cybersecurity firm CrowdStrike warns.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   }
]