[
   {
      "time": "2022-09-16",
      "title": "",
      "text": " "
   },
   {
      "time": "2022-09-16",
      "title": "DPRK Job Opportunity Phishing via WhatsApp | PuTTY Utility",
      "text": " Explore our multi-vendor XDR platform, delivering Mandiant products and integrating with a range of leading security operations technology.Solve your toughest cyber security challenges with combinations of products and services.Mitigate threats, reduce risk, and get back to business with the help of leading experts.Mandiant specializes in cyber threat intelligence, offering products, services, and more to support our mission to defend against cyber crime.Get the latest insights from cyber security experts at the frontlines of threat intelligence and incident responseLearn more about us and our mission to help organizations defend against cyber crime. UNC4034 established communication with the victim over WhatsApp and lured them to download a malicious ISO package regarding a fake job offering that led to the deployment of the AIRDRY.V2 backdoor through a trojanized instance of the PuTTY utility.This activity was identified by our Mandiant Intelligence: Staging Directories mission, which searches for anomalous files written to directories commonly used by threat actors.The techniques used by UNC4034 in this compromise, along with the techniques used in countless intrusions investigated by Mandiant, are used to continuously develop and refine threat hunting hypotheses within Managed Defense. These provide high fidelity and actionable leads that are informed by evolving threat actor tradecraft.The initial lead was a file downloaded to the host named amazon_assessment.iso. ISO and IMG archives have become attractive to threat actors because, from Windows 10 onwards, double-clicking these files automatically mounts them as a virtual disk drive and makes their content easily accessible. This reduces the effort needed to view the embedded files compared to other formats such as RAR archives. Detecting malicious IMG and ISO archives served via phishing attachments is routine for Mandiant Managed Defense. The payloads contained within such archives range from commodity malware to advanced backdoors like the sample analyzed in this blog post.Mandiant Managed Defense performed an investigation on the host to determine how the file amazon_assessment.iso was created. Based on the available data, Mandiant assesses that UNC4034 initiated communication with the victim by offering them a job opportunity at Amazon via email. Subsequently, UNC4034 communicated with them over WhatsApp and shared the file amazon_assessment.iso, which the user downloaded using the web version of WhatsApp.The amazon_assessment.iso archive held two files: an executable and a text file. The text file named Readme.txt had connection details for use with the second file: PuTTY.exe.Server:      137.184.15[.]189User: testPass: [Redacted by Mandiant]The size of the PuTTY binary downloaded by the victim is also substantially larger than the legitimate version. Upon closer inspection, it has a large, high entropy .data section in comparison to the officially distributed version (Figure 3). Sections like these are typically indicative of packed or encrypted data.The suspicious nature of the PuTTY.exe embedded in the ISO file prompted Managed Defense to perform a deeper investigation on the host and the file itself. The execution of the malicious PuTTY binary resulted in the deployment of a backdoor to the host. The deployed backdoor is an evolution of the malware family Mandiant tracks as AIRDRY. Mandiant Managed Defense successfully investigated the compromise and contained the host before follow-on activity resulting from the deployed backdoor could occur. While Mandiant detected and responded to the compromise on 2022-07-05, the same PuTTY executable was seen on VirusTotal as early as 2022-06-27.In addition, Mandiant discovered a second ISO archive named amazon_test.iso uploaded to VirusTotal on 2022-06-17. Mandiant found the second archive by pivoting from the IP address contained in the Readme.txt file. This ISO file also had a Readme.txt with the same IP address and a similar trojanized PuTTY executable.Both ISO files found by Mandiant appear to use the same lure theme by posing as a recruitment assessment for Amazon. They also contained similarly constructed malware that resulted in a final AIRDRY.V2 backdoor payload.Each sample contains malicious code that writes an embedded payload to disk and launches it. However, the malicious code was inserted at different locations in each of the trojanized PuTTY samples. In the PuTTY sample discovered by Mandiant, the code resides in the connect_to_host function, which is in the source file putty-0.77\\ssh\\ssh.c. To trigger the code, the user must attempt an SSH connection to the host IP address provided in the Readme.txt file (Figure 1). In the PuTTY sample discovered on VirusTotal, the malicious code was inserted into the ssh2_userauth_process_queue function (source file: putty-0.77\\ssh\\userauth2-client.c). The code resides in the part of the function responsible for performing password authentication, as opposed to other methods such as public key or keyboard-interactive authentication. Once the user establishes a connection and enters their username and password, the malicious code is executed regardless of the authentication result. These execution guardrails are likely an attempt by UNC4034 to avoid unnecessarily dropping the next stage of their malware. The part of the malicious code that drops and executes a payload is nearly identical between the two samples. The legitimate Windows executable C:\\Windows\\System32\\colorcpl.exe is copied to the new directory C:\\ProgramData\\PackageColor and the embedded payload is written to C:\\ProgramData\\PackageColor\\colorui.dll. The PuTTY binary observed in the compromise launches colorui.dll via DLL search order hijacking using the command shown in Figure 5.In the VirusTotal sample, cmd.exe is not used to launch colorcpl.exe. Instead, the Windows API function WinExec launches the process shown in Figure 6.In both instances, the command-line argument passed to colorcpl.exe is not related to the legitimate function of the Windows executable. Instead, each argument is utilized by the malicious DLL as described below.Persistence is established for C:\\ProgramData\\PackageColor\\colorcpl.exe via schtasks.exe. A scheduled task named PackageColor executes colorcpl.exe at 10:30AM local time every day.The colorui.dll samples were packed using the commercial software protector Themida. The unpacked samples contain file paths that reveal their purpose. An example path is shown in Figure 7.Both samples contain an identical shellcode payload named DAVESHELL. The payload is decrypted using a custom XOR-based algorithm with a dynamically generated key. The key is the result of concatenating the following strings:1. Parent process name (COLORCPL.EXE)2. Malicious DLL filename (COLORUI.DLL)3. Command-line argument passed to colorcpl.exe by the PuTTY executableThe necessary decryption key for the VirusTotal sample is shown in Figure 8.The inclusion of this key also serves as an anti-analysis mechanism: without the correct key, nothing of significance happens when the DLL is executed. The command-line argument passed to colorcpl.exe also dictates how the decrypted shellcode is executed. Based on this argument, colorui.dll may execute the shellcode from within colorcpl.exe or inject it into a new instance of a legitimate Windows process. In the case of process injection, the injection target is chosen randomly between credwiz.exe or iexpress.exe.The backdoor’s configuration is AES-128 encrypted in CBC mode with the hard-coded key KAA5M8MNDKLJB8PI. An integrity check is performed on both the encrypted and decrypted configuration. The backdoor exits if the check fails.The decrypted configuration contains the backdoor’s communication mode. Supported modes are listed in Table 1 along with their corresponding internal class names, where applicable. All three modes are centralized around a class named CSinSocket.ModeClass NameDescriptionHTTPCHTTP_ProtocolCommunication via HTTPFileCFileRWCommunication via a fileSMBN/ACommunication via SMB over a named pipeThe structure of the embedded configuration is dependent on the communication mode. The observed sample is configured to use HTTP. The structure of its 0x24B0-byte configuration is outlined in Table 2. No SMB or file mode versions of AIRDRY.V2 have been identified and thus their configuration structure is unknown.OffsetDescription0x0000Operation mode0x0002C2 URL count0x0006C2 URL #10x020EC2 URL #20x0416C2 URL #30x061EC2 URL #40x0826C2 URL #50x0A2EProxy enabled flag0x0A32Proxy server0x0C3AProxy port0x0C3CProxy credentials available0x0C40Proxy username0x0E48Proxy password0x1050Unknown0x1054Maximum beacon count0x1056Report if disk space is available0x105AReport if there is an active RDP session0x105EBeacon interval in seconds0x1060Start date and time (empty)0x1068System ID0x106CUnknown0x18A0c:\\windows\\system32\\cmd.exe0x1AA8%temp%0x1CB0UnknownBy default, the backdoor is not configured to use a proxy server. It is also not configured to report the status of available disk space (offset 0x1056) or the presence of an active RDP session (offset 0x105E). However, these features could be enabled via a configuration update issued by a C2 server.The configuration strings at offsets 0x18A0 and 0x1AA8 are not referenced in the code but have been seen in previous AIRDRY configurations. It’s possible these strings remain in the configuration for use by a downloaded plugin.The configuration value at offset 0x1060 reflects the date and time after which the backdoor should begin communicating with its C2 servers. This value is empty in the current configuration, which results in communication beginning immediately. However, the value can be updated via a command from a C2 server, which could result in the backdoor being inactive for a period of time.The backdoor’s C2 URL count is five; however, the configuration only has three distinct URLs (Figure 9).hxxps://hurricanepub[.]com/include/include.phphxxps://turnscor[.]com/wp-includes/contacts.phpThe backdoor issues an HTTP POST request to a randomly selected C2 URL. An example request is shown in Figure 10.AIRDRY.V2’s file mode uses the same HTTP request format but writes each request to a file. The file path is built based on elements found in the backdoor’s configuration. Because a file mode version of AIRDRY.V2 has not been identified, the purpose behind writing HTTP requests to a file has yet to be determined. In SMB mode, the backdoor communicates by sending an SMB2 WRITE request to a named pipe. The host name and pipe name are specified in the configuration. Like previous AIRDRY backdoors, AIRDRY.V2 utilizes the value 0x2040 to request a command from a C2 server. Supported command IDs are listed in Table 3.Command IDDescription0x2009Upload basic system information0x2028Update the beacon interval based on a value provided by the C2 server0x2029Deactivate until new start date and time0x2031Upload the current configuration0x2032Update the configuration0x2037Keep-alive0x2038Update the beacon interval based on a value in the configuration0x2052Update the AES key used to encrypt C2 requests and configuration data0x2057Download and execute a plugin in memoryAIRDRY.V2 supports nine commands. Prior versions of AIRDRY supported nearly thirty commands. Of the nine commands, only two were not present in previous AIRDRY samples: 0x2052 and 0x2057. Command 0x2052 can be used to update the 32-byte sequence used to derive the AES-256 key described above. Command ID 0x2057 represents the shift from a backdoor that supports numerous commands to the new plugin-based approach in AIRDRY.V2. Downloaded plugins are executed in memory and provided with a structure that includes a copy of the decrypted configuration, the system ID, and an object that facilitates communication with the configured C2 servers. Notably the backdoor itself has the necessary logic to function as a plugin.Mandiant identified several overlaps between UNC4034 and threat clusters we suspect have a North Korean nexus. The AIRDRY.V2 C2 URLs belong to compromised website infrastructure previously leveraged by these groups and reported in several OSINT sources. Of note is the prior use of this compromised infrastructure to deliver the AIRDRY backdoor via CUTELOOP downloaders embedded in malicious documents.The investigation into this compromise revealed new leads and indicators to pivot from in future hunting efforts. An important caveat to these hunting leads is that they are not indicators of compromise. Instead, they are interesting activity that may call for further investigation by an analyst.These include ISO and IMG archive files downloaded from sources such as WhatsApp, email providers, and cloud storage services. On Windows 10 and later, the origin URL of a downloaded file is stored in the Zone.Identifier alternate data stream. Mandiant routinely observes archive files delivered as phishing attachments that originate from those sources.The second hunting lead is the execution of colorcpl.exe from an unusual directory like C:\\ProgramData\\PackageColor. Most often, the executable runs from its standard location in C:\\Windows\\System32 or C:\\Windows\\SysWOW64.The third hunting lead found for future hunting efforts is the execution of colorcpl.exe with command-line arguments. By default, colorcpl.exe executes with no command line arguments. In this scenario, colorcpl.exe was executed with a command-line argument that consisted of hexadecimal characters. The argument was ultimately evaluated by a malicious DLL that was loaded into the process.Mandiant consistently finds new and novel threat actor activity such as the one described in this blog post. To ensure our customers are protected, Mandiant’s detection and threat hunting capabilities are continuously evolving and are fueled by our experiences on the frontlines.Malware FamilyMD5SHA256ISO Attachment90adcfdaead2fda42b9353d44f7a8ceb8cc60b628bded497b11dbc04facc7b5d7160294cbe521764df1a9ccb219bba6bISO Attachment6d1a88fefd03f20d4180414e199eb23ae03da0530a961a784fbba93154e9258776160e1394555d0752ac787f0182d3c0Trojanized PuTTY Dropper8368bb5c714202b27d7c493c9c0306d71492fa04475b89484b5b0a02e6ba3e52544c264c294b57210404b96b65e63266 Trojanized PuTTY Dropper18c873c498f5b90025a3c33b17031223cf22964951352c62d553b228cf4d2d9efe1ccb51729418c45dc48801d36f69b4Themida-Packed Dropper for DAVESHELLc650b716f9eb0bd6b92b0784719081cdaaad412aeb0f98c2c27bb817682f08673902a48b65213091534f96fe6f5494d9Themida-Packed Dropper for DAVESHELL4914bcbbe36dfa9d718d02f162de3da13ac82652cf969a890345db1862deff4ea8885fe72fb987904c0283a2d5e6aac4TypeValueCommentIPv4 Address137.184.15[.]189IP address seen in Readme.txtURLhttps://hurricanepub[.]com/include/include.phpAIRDRY.V2 C2URLhttps://turnscor[.]com/wp-includes/contacts.phpAIRDRY.V2 C2URLhttps://www.elite4print[.]com/support/support.aspAIRDRY.V2 C2FileC:\\ProgramData\\PackageColor\\colorcpl.exeMicrosoft binary used for DLL search order hijackFileC:\\ProgramData\\PackageColor\\colorui.dllThemida packed dropper for DAVESHELLScheduled TaskTask Name: PackageColorPersistence mechanismATT&CK Tactic CategoryTechniquesInitial AccessT1566.001: Phishing: Spearphishing AttachmentT1566.003: Phishing: Spearphishing via ServiceExecutionT1059.003: Command and Scripting Interpreter: Windows Command ShellT1053.005: Scheduled Task/Job: Scheduled TaskPersistenceT1574.001: Hijack Execution Flow: DLL Search Order HijackingT1053.005: Scheduled Task/Job: Scheduled TaskDefense EvasionT1574.001: Hijack Execution Flow: DLL Search Order HijackingT1055.001: Process Injection: Dynamic-link Library InjectionT1218: System Binary Proxy ExecutionT1620: Reflective Code LoadingT1027.002: Obfuscated Files or Information: Software PackingCommand and ControlT1071.001: Application Layer Protocol: Web ProtocolsT1071.002: Application Layer Protocol: File Transfer ProtocolsT1132.001: Data Encoding: Standard EncodingT1573.001: Encrypted Channel: Symmetric EncryptionT1573.002: Encrypted Channel: Asymmetric EncryptionGet the Google Cloud Cyberseurity Forecast 2024 report to explore the latest trends on the horizon.Mandiant experts are ready to answer your questions.REPORTLearn about the 4 critical areas.© Copyright 2023 Mandiant. All rights reserved."
   },
   {
      "time": "2022-09-16",
      "title": "Opsec Mistakes Reveal COBALT MIRAGE Threat Actors | Secureworks",
      "text": " Artifacts exposed personas and companies associated with the Iranian threat group.The threat actors attempted to remove traces of their activities, deleting web shells, tools, and audit logs. However, several tools and artifacts were recoverable. The TunnelFish sample was configured to communicate with two command and control (C2) domains: gupdate . us and msupdate . top. While investigating these domains, CTU researchers discovered additional infrastructure linked to COBALT MIRAGE: mssync . one, upmirror . top, 104 . 168 . 117 . 149,  172 . 245 . 26 . 118, and 193 . 142 . 59 . 174. CTU researchers also discovered copies of a ransom note in the victim’s environment that referenced a Telegram account (@BuySafety) and email address (buysafety @ onionmail . org) observed in prior intrusions.COBALT MIRAGE usually leaves a ransom note in the form of a .txt text file. However, in this case the threat actors copied a PDF file containing the ransom text (Hi.pdf) into the victim’s environment. Based on evidence from recovered log files, it appears multiple copies of the PDF file were created alongside multiple .txt files with the same content. While other copies of the PDF were deleted, a copy remained in the threat actor’s staging directory. This oversight resulted in the disclosure of information that could reveal the identity of an individual engaged in COBALT MIRAGE activity. The metadata of the Hi.pdf ransom note indicates that the document was created on December 17, 2021 by “ahmad khatibi” in a UTC +3.30 time zone (see Figure 1). This time zone corresponds to Iran Standard Time (IRST). The timestamp appears to be authentic.\nFigure 1. Metadata from Hi.pdf showing creator name and time zone. (Source: Secureworks)\nFigure 2. Lab_Dookhtegan tweet on June 23, 2022 referencing Ahmad Khatibi and Afkar System. (Source: Secureworks)Lab_Dookhtegan’s allegations appear to reinforce that the creator reference in the ransom note is legitimate and is not a false flag implicating an unrelated individual. Operational security failures revealing attribution is not uncommon with Iranian cyber operations. Past examples documented by CTU researchers include the identification of a developer linked to malicious Iranian activity, and Iranian malware developers infecting their own system and disclosing screenshots of their development environments on the internet.In April 2022, Lab_Dookhtegan reported via their Telegram and Twitter channels that Iranian company Najee Technology and Secnerd also operate on behalf of the IRGC-IO (see Figure 3).\nFigure 3. Tweet alleging connections among Najee Technology, Secnerd, and the IRGC. (Source: Secureworks)The source of Lab_Dookhtegan's information is unknown, but CTU researchers independently identified links between known COBALT MIRAGE infrastructure and Najee Technology. DNS resolution data, WHOIS data, and website analysis reveal a series of connections between two COBALT MIRAGE domains (newdesk . top and symantecserver . co) and an IP address (185 . 208 . 77 . 164) hosting two Iranian (.ir) domains: secnerd . ir and najee . ir (see Figure 4). Najee . ir was an official website for Najee Technology but no longer hosts content promoting the company’s presence.\nFigure 4. Connections between COBALT MIRAGE infrastructure and Najee Technology. (Source: Secureworks)The uk7 . updates . icu domain hosts an instance of the GitLab code collaboration platform that reveals an account for a user named unkn19wn (see Figure 5). This detail links updates . icu to secnerd . ir and najee . ir.\nFigure 5. GitLab interface showing unkn19wn account. (Source: Secureworks)This same alias appears in an email address (unkn19wn @ gmail . com) that was used to register najee . ir and secnerds . com. WHOIS records show the domain registrant as Mansour Ahmadi. Public records of Iranian companies list Mansour Ahmadi as the CEO of Najee Technology. Mansour Ahmadi also appears in the WHOIS registrant information for the domain misaq . me, which has resolved to COBALT MIRAGE IP address 148 . 251 . 71 . 182. \nFigure 6. Potential relationships between Najee, Secnerd, Afkar System, and the IRGC-IO. (Source: Secureworks)The model of Iranian government intelligence functions using contractors blurs the lines between the actions tasked by the government and the actions that the private company takes on its own initiative. While part of COBALT MIRAGE activity appears espionage-focused, a significant portion is focused on opportunistic revenue generation through its ransomware activities. While these companies may work with the IRGC-IO, the ransomware attacks could be another source of revenue that they can pursue without fear of prosecution by Iranian law enforcement. Other Iranian threat groups such as COBALT SAPLING (also known as Moses Staff) and COBALT SHADOW (also known as Agrius and BlackShadow) have made use of ransomware in their attacks. However, the primary intent of these attacks appeared to be disruption and harassment of the victim rather than revenue generation. Although the ProxyShell vulnerabilities were disclosed in August 2021, COBALT MIRAGE continues to have success exploiting them to compromise organizations. CTU researchers advise organizations to routinely validate that all internet-facing systems are appropriately patched and take swift mitigating actions where gaps are found.To mitigate exposure to this malware, CTU researchers recommend that organizations use available controls to review and restrict access using the indicators listed in Table 1. Note that IP addresses can be reallocated. The domains and IP address may contain malicious content, so consider the risks before opening them in a browser.See for yourself: Request your demo to see how Taegis can reduce risk, optimize existing security investments, and fill talent gaps.Get the latest updates and news from Secureworks.©2023 Secureworks, Inc."
   },
   {
      "time": "2022-09-16",
      "title": "Iranian Islamic Revolutionary Guard Corps-Affiliated Cyber Actors Exploiting Vulnerabilities for Data Extortion and Disk Encryption for Ransom Operations | CISA",
      "text": " An official website of the United States governmentHere’s how you know\nOfficial websites use .gov\n A .gov website belongs to an official government organization in the United States.\n              \nSecure .gov websites use HTTPS\n A lock (LockA locked padlock) or https:// means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n              SearchActions to take today to protect against ransom operations:This joint Cybersecurity Advisory (CSA) is the result of an analytic effort among the Federal Bureau of Investigation (FBI), the Cybersecurity and Infrastructure Security Agency (CISA), the National Security Agency (NSA), U.S. Cyber Command (USCC) - Cyber National Mission Force (CNMF), the Department of the Treasury (Treasury), the Australian Cyber Security Centre (ACSC), the Canadian Centre for Cyber Security (CCCS), and the United Kingdom’s National Cyber Security Centre (NCSC) to highlight continued malicious cyber activity by advanced persistent threat (APT) actors that the authoring agencies assess are affiliated with the Iranian Government’s Islamic Revolutionary Guard Corps (IRGC). Note: The IRGC is an Iranian Government agency tasked with defending the Iranian Regime from perceived internal and external threats. Hereafter, this advisory refers to all the coauthors of this advisory as \"the authoring agencies.\"The IRGC-affiliated actors are actively targeting a broad range of entities, including entities across multiple U.S. critical infrastructure sectors as well as Australian, Canadian, and United Kingdom organizations. These actors often operate under the auspices of Najee Technology Hooshmand Fater LLC, based in Karaj, Iran, and Afkar System Yazd Company, based in Yazd, Iran. The authoring agencies assess the actors are exploiting known vulnerabilities on unprotected networks rather than targeting specific targeted entities or sectors.This advisory provides observed tactics, techniques, and indicators of compromise (IOCs) that the authoring agencies assess are likely associated with this IRGC-affiliated APT. The authoring agencies urge organizations, especially critical infrastructure organizations, to apply the recommendations listed in the Mitigations section of this advisory to mitigate risk of compromise from these IRGC-affiliated cyber actors.The IRGC-affiliated actors have used their access for ransom operations, including disk encryption and extortion efforts. After gaining access to a network, the IRGC-affiliated actors likely determine a course of action based on their perceived value of the data. Depending on the perceived value, the actors may encrypt data for ransom and/or exfiltrate data. The actors may sell the data or use the exfiltrated data in extortion operations or “double extortion” ransom operations where a threat actor uses a combination of encryption and data theft to pressure targeted entities to pay ransom demands.IRGC-affiliated actor activity observed by the authoring agencies includes:The authoring agencies assess the following tactics and techniques are associated with this activity.The following IOCs, observed as of March 2022, are indicative of ProxyShell vulnerability exploitation on targeted entity networks:The following IOCs, observed as of December 2021, are indicative of Log4j vulnerability exploitation on targeted entity networks:The authoring agencies have observed the IRGC-affiliated actors dumping and subsequently exfiltrating the Local Security Authority Subsystem Service (LSASS) process memory on targeted entity networks in furtherance of credential harvesting. The following IOCs are associated with data exfiltration from targeted entity networks:The authoring agencies recommend that organizations using Microsoft Exchange servers, Fortinet devices, and/or VMware Horizon applications investigate potential suspicious activity in their networks.The authoring agencies urge network defenders to prepare for and mitigate potential cyber threats immediately by implementing the mitigations below.In addition to applying mitigations, the authoring agencies recommend exercising, testing, and validating your organization's security program against the threat behaviors mapped to the MITRE ATT&CK for Enterprise framework in this advisory. The authoring agencies recommend testing your existing security controls inventory to assess how they perform against the ATT&CK techniques described in this advisory.To get started:The authoring agencies recommend continually testing your security program, at scale, in a production environment to ensure optimal performance against the MITRE ATT&CK techniques identified in this advisory.If a ransomware or extortion incident occurs at your organization:Note: The authoring agencies strongly discourage paying ransoms as doing so does not guarantee files and records will be recovered and may pose sanctions risks.This advisory was developed by U.S., Australian, Canadian, and UK cybersecurity authorities in furtherance of their respective cybersecurity missions, including their responsibilities to develop and issue cybersecurity specifications and mitigations.The information in this report is being provided “as is” for informational purposes only. FBI, CISA, NSA, USCC-CNMF, DoT, ACSC, CCCS, and NCSC do not endorse any commercial product or service, including any subjects of analysis. Any reference to specific commercial products, processes, or services by service mark, trademark, manufacturer, or otherwise, does not constitute or imply endorsement, recommendation, or favoring.Note: Some of these observed IP addresses may be outdated. The authoring agencies recommend organizations investigate or vet these IP addresses prior to taking action, such as blocking.Filename:Wininet[.]xmlPath:C:\\Windows\\Temp\\wininet[.]xmlMD5:d2f4647a3749d30a35d5a8faff41765eSHA-1:0f676bc786db3c44cac4d2d22070fb514b4cb64cSHA-256:559d4abe3a6f6c93fc9eae24672a49781af140c43d491a757c8e975507b4032eFilename:Wininet’[.]xmlMD5:2e1e17a443dc713f13f45a9646fc2179SHA-1:e75bfc0dd779d9d8ac02798b090989c2f95850dcFilename:WinLogon[.]xmlPath:C:\\Windows\\Temp\\WinLogon[.]xmlMD5:49c71178fa212012d710f11a0e6d1a30SHA-1:226f0fbb80f7a061947c982ccf33ad65ac03280fSHA-256:bcc2e4d96e7418a85509382df6609ec9a53b3805effb7ddaed093bdaf949b6eaFilename:Wininet[.]batPath:C:\\Windows\\wininet[.]batMD5:5f098b55f94f5a448ca28904a57c0e58SHA-1:27102b416ef5df186bd8b35190c2a4cc4e2fbf37SHA-256:668ec78916bab79e707dc99fdecfa10f3c87ee36d4dee6e3502d1f5663a428a0Filename:Winlogon[.]batPath:C:\\Windows\\winlogon[.]batMD5:7ac4633bf064ebba9666581b776c548fSHA-1:524443dd226173d8ba458133b0a4084a172393efSHA-256:d14d546070afda086a1c7166eaafd9347a15a32e6be6d5d029064bfa9ecdede7Filename:CacheTask[.]batPath:C:\\\\ProgramData\\Microsoft\\CacheTask[.]batMD5:ee8fd6c565254fe55a104e67cf33eaeaSHA-1:24ed561a1ddbecd170acf1797723e5d3c51c2f5dSHA-256:c1723fcad56a7f18562d14ff7a1f030191ad61cd4c44ea2b04ad57a7eb5e2837Filename:Task_update[.]exePath:C:\\Windows\\Temp\\task_update[.]exeMD5:cacb64bdf648444e66c82f5ce61caf4bSHA-1:3a6431169073d61748829c31a9da29123dd61da8SHA-256:12c6da07da24edba13650cd324b2ad04d0a0526bb4e853dee03c094075ff6d1aFilename:Task[.]exeMD5:5b646edb1deb6396082b214a1d93691bSHA-1:763ca462b2e9821697e63aa48a1734b10d3765eeSHA-256:17e95ecc7fedcf03c4a5e97317cfac166b337288562db0095ccd24243a93592fFilename:dllhost[.]exePath:C:\\Windows\\dllhost[.]exeMD5:0f8b592126cc2be0e9967d21c40806bc9a3703f9c532ae2ec3025840fa449d4eSHA-1:3da45558d8098eb41ed7db5115af5a2c6 1c543af8ece87086e8b5aba0d1cc4ec3804bf74e 0b45beeSHA-256:724d54971c0bba8ff32aeb6044d3b3fd57 1b13a4c19cada015ea4bcab30cae261604e69d17c0f26182a3e3ff65694a49450aafd56a7e8b21697a932409dfd81eFilename:svchost[.]exePath:C:\\Windows\\svchost[.]exeMD5:68f58e442fba50b02130eedfc5fe4e5b298d41f01009c6d6240bc2dc7b769205SHA-1:76dd6560782b13af3f44286483e157848efc0a4e6ca62f4244994b5fbb8a46bdfe62aa1c95 8cebbdSHA-256:b04b97e7431925097b3ca4841b894139 7b0b88796da512986327ff66426544ca8aa3530540ba023fb29550643beb00c9c 29f81780056e02c5a0d02a1797b9cd9Filename:User[.]exePath:C:\\Windows\\Temp\\user[.]exeMD5:bd131ebfc44025a708575587afeebbf3f0be699c8aafc41b25a8fc0974cc4582SHA-1:8b23b14d8ec4712734a5f6261aed40942 c9e0f686bae2d45bbd8c4b0a59ba08892692fe86 e596154SHA-256:b8a472f219658a28556bab4d6d109fdf3 433b5233a765084c70214c973becbbd7b5fbbd90eab5bee6f3c25aa3c2762104 e219f96501ad6a4463e25e6001eb00bFilename:Setup[.]batPath:C:\\Users\\DefaultAccount\\Desktop\\New folder\\setup[.]batMD5:7fdc2d007ef0c1946f1f637b87f81590Filename:Ssasl[.]pmdPath:C:\\Windows\\Temp\\ssasl[.]pmdFilename:Ssasl[.]zipPath:C:\\Windows\\Temp\\ssasl[.]zipFilename:netscanold[.]exePath:C:\\Users\\DefaultAccount\\Desktop\\netscanold\\netscanold[.]exeFilename:scan[.]csvPath:C:\\Users\\DefaultAccount\\Desktop\\scan[.]csvFilename:lsass[.]dmpPath:C:\\Users\\DefaultAccount\\AppData\\Local\\Temp\\lsass[.]dmpFilename:lsass[.]zipPath:C:\\Users\\DefaultAccount\\AppData\\Local\\Temp\\lsass[.]zip Table 2 identifies MITRE ATT&CK Tactics and techniques observed in this activity. TacticTechnique   September 14, 2022: Initial Version"
   },
   {
      "time": "2022-09-16",
      "title": "NY: Empress EMS hit by Hive ransomware",
      "text": " The Office of Inadequate SecurityCorrespondence from Hive to Empress shared exclusively with DataBreaches showed that Hive contacted Empress on July 14 and 15 by email. In their first email, they wrote, in part:! ! ! DO NOT TRY TO DECRYPT OR CHANGE ENCRYPTED FILES ON YOUR COMPUTERS, IT WILL COMPLETELY DESTROY THEM ! ! !Ladies and gentlemen! Attention, please!\nThis is HIVE ransomware team.We infiltrated your network and stayed there for 12 days (it was enough to study all your documentation and gain access to your files and services),\nencrypted your servers.\nDownloaded most important information with a total size over 280 GB\nFew details about information we have downloaded:\n– contracts, nda and other agreements documents\n– company private info (budgets, plans, investments, company bank statements, etc.)\n– employees info (SSN numbers, emails, addresses, passports, phone numbers, payments, working hours, etc.)\n– customers info (SSN numbers, emails, addresses, passports, phone numbers, payments, working hours, etc.)\n– SQL databases with reports, business data, customers data, etc.\n– approximate number of personal records including addresses and ssn’s data is above 10000 unitsA sample of files provided to Empress with Hive’s July 15 email, also provided to DataBreaches, included protected health information of some of Empress EMS’s patients. Hive claimed to have more than 100,000 Social Security numbers as part of the data they exfiltrated. DataBreaches had reached out to Empress in July to ask them about the incident and about whether the encryption was impairing their ability to provide emergency medical care. They never replied, but DataBreaches never saw any alerts on their website about any interruptions or delays in service.This site doesn’t accept sponsored posts and doesn’t respond to requests about them.Email:Signal: +1 516-776-7756© 2009 – 2023, DataBreaches.net and DataBreaches LLC. All rights reserved.“You translate “Nerd” into understandable “English” — Victor Gevers of GDI Foundation, talking about DataBreaches.net"
   },
   {
      "time": "2022-09-16",
      "title": "Hackers trojanize PuTTY SSH client to backdoor media company",
      "text": " North Korean hackers are using trojanized versions of the PuTTY SSH client to deploy backdoors on targets' devices as part of a fake Amazon job assessment.A novel element in this campaign is the use of a trojanized version of the PuTTY and KiTTY SSH utility to deploy a backdoor, which in this case, is 'AIRDRY.V2'.\"In July 2022, during proactive threat hunting activities at a company in the media industry, Mandiant Managed Defense identified a novel spear phish methodology employed by the threat cluster tracked as UNC4034,\" explained Mandiant.The attack starts with threat actors approaching their targets via email with a lucrative job offer at Amazon and then take communication to WhatsApp, where they share an ISO file (\"amazon_assessment.iso\").While it is unclear what discussions occurred between the threat actors and victims, the hackers likely told the victim to open the ISO and use the enclosed SSH tool and credentials to connect to the host and perform a skills assessment.However, the PuTTY shared by the hackers was modified to include a malicious payload in its data section, making the tampered version significantly larger than the legitimate version.As the PuTTY executable was compiled from the legitimate program, it is fully functional and looks exactly like the legitimate version.To make the launch of the shellcode stealthy, the malicious PuTTY uses a search order hijacking vulnerability in \"colorcpl.exe,\" the legitimate Windows Color Management tool, to load the malicious DLL.DAVESHELL operates as the dropper of the final payload, the AIRDRY.V2 backdoor malware, which is executed directly in memory.AIRDRY.V2 can communicate via HTTP, file, or SMB over a named pipe, trying to connect to one of the three hard-coded C2 addresses five times before going to a 60-second sleep.While the backdoor has the technical capacity to use a proxy server and monitor for active RDP sessions, the version examined by Mandiant has these features disabled by default.Compared to the previous version of AIRDRY, the new variant supports fewer commands, but the plugin execution in memory and updating the AES key for C2 communications are new capabilities.Reducing the number of supported commands doesn't impact the backdoor's versatility because fetching plugins from the C2 opens up new potential for more surgical attacks.To check for trojanized versions of PuTTY, you can look at the properties of the executable and make sure that it is digitally signed by 'Simon Tatham.'Unfortunately, the legitimate KiTTY program is not normally signed by the developer and should instead be uploaded to a virus scanning service, such as VirusTotal, to check for malicious detections."
   },
   {
      "time": "2022-09-16",
      "title": "Hive ransomware claims cyberattack on Bell Canada subsidiary",
      "text": " The Hive ransomware gang claimed responsibility for an attack that hit the systems of Bell Canada subsidiary Bell Technical Solutions (BTS).BTS is an independent subsidiary with more than 4,500 employees, specializing in installing Bell services for residential and small business customers across the Ontario and Québec provinces.While the Canadian telecommunications company didn't reveal when its network was breached or the attack happened, Hive claims in a new entry added to its data leak blog that it encrypted BTS' systems almost a month ago, on August 20, 2022.\"The unauthorized party accessed information that may include the name, address and phone number of residential and small business customers in Ontario and Québec who booked a technician visit.\"Bell Technical Solutions took immediate steps to secure affected systems and we want to assure you that no database containing customer information such as credit and debit card numbers, banking or other financial data was accessed in the incident.\"BTS is currently investigating the incident with the help of the Royal Canadian Mounted Police's cybercrime unit and has notified the Office of the Privacy Commissioner of the breach.The Bell subsidiary warned customers of the possibility of being targeted in phishing attacks following this incident and advised them to monitor their accounts for any suspicious activity.\"We will directly notify any individuals whose private information may have been accessed. Bell Technical Solutions operates independently from Bell on a separate IT system; other Bell customers or other Bell subsidiaries were not impacted,\" the company added.\"We are pursuing our investigation and working with third-party cybersecurity experts on the matter, as well as implementing solutions to further enhance the security of our systems.\"Like many other ransomware gangs that use double extortion, the FBI said that Hive operators would also steal any files they consider valuable before encryption to pressure their victim to pay the ransom under the threat of a data leak.Due to an ongoing investigation, Bell Senior Communications Manager Jacqueline Michelis didn't provide more details when asked to confirm Hive's claims.The shared statement rehashed the main points of the alert, saying that the compromised servers contained \"operational company and employee information\" and that no customer financial data was accessed during the incident."
   },
   {
      "time": "2022-09-16",
      "title": "Akamai stopped new record-breaking DDoS attack in Europe",
      "text": " A new distributed denial-of-service (DDoS) attack that took place on Monday, September 12, has broken the previous record that Akamai recorded recently in July.DDoS attacks are cyberattacks that flood servers with fake requests and garbage traffic, rendering them unavailable to legitimate visitors and customers.The cybersecurity and cloud services company Akamai reports that the recent attack appears to originate from the same threat actor, meaning that the operators are in the process of empowering their swarm further.On September 12, these attacks culminated at unprecedented levels when the “garbage” traffic sent to the target network peaked at 704.8 Mpps, roughly 7% higher than the July attack.Apart from the volume of the attack, the threat actors also expanded their targeting, which was previously rather narrow, focusing on the company’s primary data center.This time, the threat actors spread their firepower to six data center locations in Europe and North America.Additionally, Akamai detected and blocked 201 cumulative attacks, compared to 75 in July, and recorded traffic sources from 1813 IPs, compared to 512 previously.This expansion in the targeting scope aims at hitting resources that are not prioritized as critical and thus inadequately protected but whose downtime will still cause trouble to the firm.“An attack this heavily distributed could drown an underprepared security team in alerts, making it difficult to assess the severity and scope of the intrusion, let alone fight the attack.” - AkamaiThe particular company, however, had taken precautions due to the July attack and had secured all their 12 datacenters, resulting in 99.8% of the malicious traffic being pre-mitigated.The motivation behind these persistent and massive-scale attacks remains unknown, but the region of Eastern Europe has been at the epicenter of hacktivism since the start of the year."
   },
   {
      "time": "2022-09-16",
      "title": "Stay informed with cybersecurity videos",
      "text": " \n      Award-winning news, views, and insight from the ESET security community\n    \n        Award-winning news, views, and insight from the ESET security community\n      VideoSafeguarding ports from the rising tide of cyberthreats – Week in security with Tony AnscombeVideoSafeguarding ports from the rising tide of cyberthreats – Week in security with Tony AnscombeAn attack against a port operator that ultimately hobbled some 40 percent of Australia’s import and export capacity highlights the kinds of supply chain shocks that a successful cyberattack can causeEditor • 17 Nov 2023VideoSpyware disguised as a news app – Week in security with Tony AnscombeVideoSpyware disguised as a news app – Week in security with Tony AnscombeThe Urdu version of the Hunza News website offers readers the option to download an Android app – little do they know that the app is actually spywareEditor • 10 Nov 2023VideoThe mysterious demise of the Mozi botnet – Week in security with Tony AnscombeVideoThe mysterious demise of the Mozi botnet – Week in security with Tony AnscombeVarious questions linger following the botnet's sudden and deliberate demise, including: who actually initiated it?Editor • 03 Nov 2023VideoRoundcube Webmail servers under attack – Week in security with Tony AnscombeVideoRoundcube Webmail servers under attack – Week in security with Tony AnscombeThe zero-day exploit deployed by the Winter Vivern APT group only requires that the target views a specially crafted message in a web browserEditor • 27 Oct 2023VideoSpearphishing targets in Latin America – Week in security with Tony AnscombeVideoSpearphishing targets in Latin America – Week in security with Tony AnscombeESET's analysis of cybercrime campaigns in Latin America reveals a notable shift from opportunistic crimeware to more complex threats, including those targeting enterprises and governmentsEditor • 20 Oct 2023VideoStaying on top of security updates – Week in security with Tony AnscombeVideoStaying on top of security updates – Week in security with Tony AnscombeWhy keeping software up to date is a crucial security practice that should be followed by everyone from individual users to SMBs and large enterprisesEditor • 13 Oct 2023VideoDinodasRAT used against governmental entity in Guayana – Week in security with Tony AnscombeVideoDinodasRAT used against governmental entity in Guayana – Week in security with Tony AnscombeThe backdoor can exfiltrate files, manipulate Windows registry keys, and execute commands that are capable of performing various actions on a victim’s machineEditor • 06 Oct 2023VideoHow Lazarus impersonated Meta to attack a target in Spain – Week in security with Tony AnscombeVideoHow Lazarus impersonated Meta to attack a target in Spain – Week in security with Tony AnscombeDuring the attack, the group deployed several tools, most notably a newly-discovered sophisticated backdoor that ESET named LightlessCanEditor • 29 Sep 2023VideoESET's cutting-edge threat research at LABScon – Week in security with Tony AnscombeVideoESET's cutting-edge threat research at LABScon – Week in security with Tony AnscombeTwo ESET malware researchers took to the LABScon stage this year to deconstruct sophisticated attacks conducted by two well-known APT groupsEditor • 22 Sep 2023\n            Award-winning news, views, and insight from the ESET security community\n          "
   },
   {
      "time": "2022-09-16",
      "title": "New malware bundle self-spreads through YouTube gaming videos",
      "text": " A new malware bundle uses victims' YouTube channels to upload malicious video tutorials advertising fake cheats and cracks for popular video games to spread the malicious package further.The self-spreading malware bundle has been promoted in YouTube videos targeting fans playing FIFA, Final Fantasy, Forza Horizon, Lego Star Wars, and Spider-Man.These uploaded videos contain links to download the fake cracks and cheats, but in reality, they install the same self-spreading malware bundle that infected the uploader.In a new report by Kaspersky, researchers found a RAR archive containing a collection of malware, most notably RedLine, currently one of the most massively distributed information stealers.RedLine can steal information stored in the victim’s web browser, such as cookies, account passwords, and credit cards, access instant messenger conversations, and compromise cryptocurrency wallets.Additionally, a miner is included in the RAR archive, taking advantage of the graphics card of the victim, which they are very likely to have since they’re watching gaming videos on YouTube, to mine cryptocurrency for the attackers.The bundled infections and executables by themselves are not particularly interesting and are commonly used by threat actors in other malware distribution campaigns.However, Kaspersky discovered an unusual and interesting self-propagation mechanism hiding in the archive that allows the malware to self-propagate to other victims on the Internet.Specifically, the RAR contains batch files that run three malicious executables, namely “MakiseKurisu.exe”, “download.exe”, and “upload.exe”, which perform the bundle’s self-propagation.The first one, MakiseKurisu, is a modified version of a widely available C# password stealer, used solely to extract cookies from browsers and store them locally.The second executable, “download.exe”, is used for downloading a video from YouTube, which is a copy of the videos promoting the malicious bundle.The videos are downloaded from links fetched from a GitHub repository to avoid pointing to video URLs that were reported and removed from YouTube.Finally, “upload.exe” is used for uploading the malware-promoting videos to YouTube, using the stolen cookies to log in to the victim’s YouTube account and spread the bundle via their channel.“When the video is successfully uploaded to YouTube, upload.exe sends a message to Discord with a link to the uploaded video.”While the threat actor gets informed about the new upload, the channel owner is unlikely to realize they’re promoting malware on YouTube if they’re not very active on the platform.This aggressive distribution method makes scrutiny and take-downs on YouTube even harder, as videos pointing to malicious downloads are uploaded from accounts that likely have a long-standing clean record."
   },
   {
      "time": "2022-09-16",
      "title": "Congressional inquiry reveals secret Customs and Border Protection database of U.S. phone records | CyberScoop",
      "text": " \n\nSeptember 15, 2022\n\nCustoms and Border Protection is conducting warrantless searches of the phones and other electronic devices of up to 10,000 Americans each year and uploading information from those devices to a massive government database, according to information shared by the agency with Sen. Ron Wyden, D-Ore.“Innocent Americans should not be tricked into unlocking their phones and laptops,” Wyden said in a press release accompanying the letter. “CBP should not dump data obtained through thousands of warrantless phone searches into a central database, retain the data for fifteen years, and allow thousands of DHS employees to search through Americans’ personal data whenever they want.”CBP did not detail the exact number of Americans included in the database, but said in a June briefing with Wyden’s office that it examines and saves data from “less than 10,000” devices a year.According to agency data, CBP processed more than 179 million travelers at U.S. ports of entry in fiscal year 2021. During that same period, CBP conducted approximately 37,000 border searches of electronic devices, representing less than 0.02 percent of international travelers. “At this time, no additional statistics have been publicly available due to law enforcement sensitivities and national security implications,” CBP spokesperson Lawrence Payne wrote in an email to CyberScoop. “CBP is currently reviewing whether additional information specific to border searches of electronic devices, may be made publicly available without negative impacts to law enforcement operations and national security.”Searches at the border have long been exempt from the warrant process, though agents are still expected to have “reasonable suspicion” before conducting the search. According to CBP guidelines, a device cannot be intentionally used to access information that is “solely stored remotely.”According to Laperruque, the database is a clear abuse of a loophole for border searches. “It really is just a clear example of how different the system is from the justification,” he said. “This is about creating a mass surveillance apparatus, not border security.”Other surveillance experts agreed the search exploits a lapse in oversight.“CBP is abusing this constitutional loophole to do an end-run around the 4th Amendment,” Albert Fox Cahn, executive director for the Surveillance Technology Oversight Project, said in a statement. “This sprawling database proves that CBP’s searches were never about finding contraband, but were always just a way to avoid the Constitution. The Biden Administration and Congress must act to stop these searches and purge this database.”“CBP has imposed certain policy requirements, above and beyond prevailing legal requirements, to ensure that the border search of electronic devices is exercised judiciously, responsibly, and consistent with public trust,” CBP’s Payne wrote.Wyden has pushed for the passage of his legislation, the Fourth Amendment is Not for Sale Act, which would require law enforcement to get a warrant to obtain Americans’ personal data. His letter requests a response from CBP no later than Oct. 31 with a plan for addressing the issues raised in the letter.Updated 9/15/2022: To include additional information from CBP."
   },
   {
      "time": "2022-09-16",
      "title": "Attackers Abuse Facebook Ad Manager in Credential-Harvesting Campaign - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-09-16",
      "title": "US, UK, Canada and Australia Link Iranian Government Agency to Ransomware Attacks - SecurityWeek",
      "text": " Hi, what are you looking for?Government agencies in the US, UK, Canada, and Australia say that threat groups associated with Iran’s Islamic Revolutionary Guard Corps (IRGC) have been engaging in data encryption and extortion operations.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.WASHINGTON - Cyberattacks are the most serious threat facing the United States, even more so than terrorism, according to American defense experts. Almost half...Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-09-16",
      "title": "Russian hackers use new info stealer malware against Ukrainian orgs",
      "text": " Russian hackers have been targeting Ukrainian entities with previously unseen info-stealing malware during a new espionage campaign that is still active.Security researchers at Cisco Talos attribute the campaign to Gamaredon, a Russian state-backed threat group with a long history of targeting mainly organizations in the Ukrainian government, critical infrastructure, defense, security, and law enforcement.Also known as Primitive Bear, Shuckworm, IronTiden, and Callisto, Gamaredon relies on social engineering and spear phishing to establish long-term access to victim systems.The threat group is known for developing malware (e.g. malicious scripts, info stealers, backdoors) that is used exclusively in its campaigns.Cisco Talos attributed a newly observed espionage campaign (August 2022) to Gamaredon and noticed the use of a new info stealer that can extract from victim computers specific file types as well as deploy additional malware.“This is a new infostealer that Gamaredon has not previously used in other campaigns. We suspect it may be a component of Gamaredon’s “Giddome'' backdoor family, but we are unable to confirm that at this time” - Cisco TalosThe new piece of malware has clear instructions to steal files with the following extensions: .DOC, .DOCX, .XLS, .RTF, .ODT, .TXT, .JPG, .JPEG, .PDF, .PS1, .RAR, .ZIP, .7Z AND .MDB. Cisco Talos says that Gamaredon’s new infostealer can exfiltrate files from attached storage devices (local and remote), making for each stolen file a POST request with metadata and its content.During the recursive enumeration of all files in directories, the malware avoids system folders to focus only on files of interest to the threat actor.The researchers noticed that the infostealer can also download additional files from the command and control (C2) server, which delivers instructions on how the delivered data should be treated.If the payload is an executable (flagged with “1”), the file is written to disk and run. An alternative is a VBS file (flagged with “2”), which is also written to disk and launched using Windows Script Host (wscript.Exe).A third option is a blob of data, which is flagged with any other value than “1” or “2” and gets stored in the Windows temporary folder.Cisco Talos notes that an indication of Gamaredon’s malware being present on the system is a registry key called “Windows Task“ to run at logon, and a mutex named ”Global\\flashupdate_r.“Gamaredon’s infostealer has been added to the Virus Total database about a little over a month ago and is currently detected by at least 50 antivirus engines.The hackers deliver the malware through phishing emails that carry Microsoft Office documents with malicious VBS macros.The VBS code is hidden in remote templates and executed when opening the document, downloading RAR archives with LNK files.Both LNK files and Microsoft Office documents have names referring to the Russian invasion of Ukraine.The purpose of LNK files is to run mshta.exe to download and parse a remote XML that executes a malicious PowerShell script from a Russian domain (xsph[.]ru) that Gamaredon has used for past espionage campaigns.Another PowerShell script is downloaded and executed to collect data (computer name, volume serial number, base64-encoded screenshot) from the victim and send it to a remote server.Cisco Talos has provided a list of indicators of compromise for malicious documents, LNK files, RAR archives, the new infostealer, URLs, and payload drop sites.Organizations can use the IoCs to defend their organizations from espionage campaigns Gamaredon may deploy."
   }
]