[
   {
      "time": "2022-08-31",
      "title": "Ukraine takes down cybercrime group hitting crypto fraud victims",
      "text": " The National Police of Ukraine (NPU) took down a network of call centers used by a cybercrime group focused on financial scams and targeting victims of cryptocurrency scams under the guise of helping them recover their stolen funds.The fraudsters behind these illegal call centers were also allegedly involved in scamming citizens of Ukraine and European Union countries interested in cryptocurrency, securities, gold, and oil investments.Throughout this cross-border fraud operation, they used software and high-tech equipment that made it possible to spoof the phone numbers of state banking organizations.\"The organizers of the scheme used previously created websites and platforms for exchange trading of currency and cryptocurrency, securities, gold and oil to attract funds from foreign citizens, guaranteeing the receipt of excess profits in a short time.\"While claiming to be members of a so-called \"Community of cryptocurrency brokers,\" the attackers also used contact information belonging to previous victims of other cryptocurrency scammers to deceive them that they could help them recover their stolen funds for a \"commission.\"However, they interrupted all communications after tricking the targets into transferring the money to attacker-controlled accounts.​Ukrainian law enforcement officers confirmed these illegal activities following authorized searches at the location of multiple \"call centers\" linked to this cybercrime operation and the seizure of computer equipment, mobile phones, and data records.Those linked to this fraud scheme are investigated for being part of an organized criminal group, fraud, and using malicious software, and are facing up to 12 years in prison.They used VoIP (Voice over Internet Protocol) phone numbers to hide their actual location while scamming thousands of foreign investors."
   },
   {
      "time": "2022-08-31",
      "title": "Hackers hide malware in James Webb telescope images",
      "text": " Threat analysts have spotted a new malware campaign dubbed ‘GO#WEBBFUSCATOR’ that relies on phishing emails, malicious documents, and space images from the James Webb telescope to spread malware.The malware is written in Golang, a programming language that is gaining popularity among cybercriminals because it is cross-platform (Windows, Linux, Mac) and offers increased resistance to reverse engineering and analysis.In the recent campaign discovered by researchers at Securonix, the threat actor drops payloads that are currently not marked as malicious by antivirus engines on the VirusTotal scanning platform.The infection starts with a phishing email with an attached malicious document, “Geos-Rates.docx”, which downloads a template file.That file contains an obfuscated VBS macro that auto-executes if macros are enabled in the Office suite. The code then downloads a JPG image (“OxB36F8GEEC634.jpg”) from a remote resource (“xmlschemeformat[.]com”), decodes it into an executable (“msdllupdate.exe”) using certutil.exe, and launches it.In an image viewer, the .JPG shows the galaxy cluster SMACS 0723, published by NASA in July 2022.However, if opened with a text editor, the image reveals additional content disguised as an included certificate, which is a Base64-encoded payload that turns into the malicious 64-bit executable.The payload’s strings are further obfuscated using ROT25, while the binary uses XOR to hide the Golang assemblies from analysts. On top of that, the assemblies use case alteration to avoid signature-based detection by security tools.Based on what could be deduced via dynamic malware analysis, the executable achieves persistence by copying itself to '%%localappdata%%\\microsoft\\vault\\' and adding a new registry key.Upon execution, the malware establishes a DNS connection to the command and control (C2) server and sends encrypted queries.“In the case with GO#WEBBFUSCATOR, communication with the C2 server is implemented using `TXT-DNS` requests using `nslookup` requests to the attacker-controlled name server. All information is encoded using Base64.”The C2 may respond to the malware by setting time intervals between connection requests, changing the nslookup timeout, or sending out commands to execute through the Windows cmd.exe tool.During testing, Securonix observed the threat actors running arbitrary enumeration commands on its test systems, a standard first reconnaissance step.The researchers note that the domains used for the campaign were registered recently, the oldest one on May 29, 2022.Securonix has provided a set of indicators of compromise (IoCs) that includes both network and host-based indicators."
   },
   {
      "time": "2022-08-31",
      "title": "Russian streaming platform confirms data breach affecting 7.5M users",
      "text": " Russian media streaming platform ‘START’ (start.ru) has confirmed rumors of a data breach impacting millions of users.The platform’s administrators shared that network intruders managed to steal a 2021 database from its systems and are now distributing samples online.The stolen database contains email addresses, phone numbers, and usernames. START characterizes it as uninteresting to most cybercriminals as it can’t be used for taking over accounts.Financial information, bank card data, browsing history, or user passwords have not been impacted because these details were not present in the database.Even though a global reset isn’t enforced by START, it is recommended that all users change their passwords.The rumors about a data breach impacting START first appeared on Sunday, August 28, when a 72GB MongoDB JSON dump containing information of almost 44 million users started to be distributed over a social network.Many of these entries concern test accounts. However, the dump contains 7,455,926 unique email addresses, which is likely close to the real number of exposed users.The records date as recently as on September 22, 2021, so this incident doesn’t impact users who registered with the service after that date.One discrepancy between START’s statement and the leaked dump is that the latter contains md5crypt-hashed passwords, IP addresses, login logs, and subscription details, which have not been included in the official statement from the platform.Due to the increased cyber-offensive activity against Russian online platforms, the Moscow is implementing methods to defend user data from unauthorized access and to protect its citizens from exposure.The presented draft law suggests a fine of 3% of the breached company’s annual turnover to introduce an incentive for firms to develop and apply sound security practices."
   },
   {
      "time": "2022-08-31",
      "title": "Hackers Sell Classified Data of Missile Firm MBDA, NATO Launches Investigation  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " A cybercrime gang is selling confidential data which was stolen from MBDA Missile Systems (A European Firm.) For the users' information, MBDA is a European company that makes missiles and other weapons. It was established in 2001 from a merger of British, Italian, and French companies. MBDA is the world's second largest missile maker, the first being Boeing. The company has three main product lines- air-to-surface missiles, air-to-air missiles, and surface-to-air missiles. The weapons are used by the militaries of more than 40 countries. MBDA's headquarters are in Paris, France. The company has manufacturing setups in Britain, Spain, France, and Italy. It has more than 13,000 employees. Unknown hackers claim that they have confidential military data accessed from MBDA after a successful data attack. As observed by HackRead.com, in the beginning, threat actors using Russian and English hacking platforms were selling around 80 GB of stolen data for 15 BTC (approx $294,000).But, on August 29th, the gang lowered the price to 1BTC ($19,000) for data worth 70GB. On the other hand, BBC, MBDA, has admitted that part of its data were hacked after breaching an external hard disk. NATO has launched an investigation into selling top-secret weapon and missile data files online. MBDA is collaborating with investigation authorities in Italy, as it is the place where the data attacks happened. The investigation is focusing on one of the firm's suppliers. One should note that NATO is among MBDA's clients. A NATO representative said that they are assessing claims relating to data allegedly stolen from MBDA. He also said that there's no confirmation that the NATO network was compromised. The firm says that it followed all required measures to protect its networks. It insists that the data compromise happened many weeks ago and the breached data is not sensitive or classified. MBDA denies the hacking group's claims that they are selling confidential military data. No hacking of our secure networks has occurred. MBDA can confirm that there is no protectively marked data from MBDA involved, said MBDA. HackRead reports, \"MBDA further explained that it refused to yield to the hackers’ ransom demands, which is why they are spreading misinformation on the internet to force the company to pay the ransom. However, the company won’t give in and vowed to take all legal actions against the blackmailers.\"The data was still on sale, during the time this article was written. your nameYour Emailyour message"
   },
   {
      "time": "2022-08-31",
      "title": "Akasa Air Confirmed a Data Breach to CERT-In - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-08-31",
      "title": "HHS Alerts Healthcare Workers on Karakurt Ransomware Group - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-08-31",
      "title": "Microsoft Azure outage knocks Ubuntu VMs offline after buggy update",
      "text": " Microsoft Azure customers' virtual machines (VMs) running Ubuntu 18.04 have been taken offline by an ongoing outage caused by a faulty systemd update.The outage started nine hours earlier, around 06:00 UTC, after the affected customers upgraded to systemd version 237-3ubuntu10.54 and their VMs started experiencing DNS errors, with no DNS resolver addresses available on impacted systems.Microsoft says in an incident report published on the Azure status page that these DNS issues only affect VMs running Ubuntu 18.04 (Bionic Beaver).\"Starting at approximately 06:00 UTC on 30 Aug 2022, a number of customers running Ubuntu 18.04 (bionic) VMs recently upgraded to systemd version 237-3ubuntu10.54 reported experiencing DNS errors when trying to access their resources. Reports of this issue are confined to this single Ubuntu version,\" the company revealed.Microsoft has confirmed downstream impact to other Azure services, with Azure Kubernetes Service (AKS) being the most affected across multiple regions. Microsoft provides an additional workaround for affected Azure customers that involves rebooting the impacted Ubuntu virtual machines.\"An additional potential workaround customers can consider is to reboot impacted VM instances so that they receive a fresh DHCP lease and new DNS resolver(s),\" the company said.Redmond also implies that those who haven't yet been affected should consider disabling security updates until the bug has been mitigated.The company's Azure customers were hit by another global scale outage (tracking ID 0NC_-L9G on the status page) that took down Windows-based Azure VMs for roughly eight hours on October 13, 2021, due to resource migration issues."
   },
   {
      "time": "2022-08-31",
      "title": "COVID-19 data put for sale on the Dark Web - Help Net Security",
      "text": " The data was put for sale on several Dark Web marketplaces and was available for further purchase via a Telegram channel created by the bad actors.Based on the acquired samples and additional insights related to the security incident, the bad actors were able to gain unauthorized access to the government portal allowing them to manage users and records illegally.The access was possible due to an active SQL injection vulnerability in an authorization module of the Web app used for online-surveys.At the time of breach identification, the bad actors could have accessed at least 5,151 detailed records with potential exposure of 15,000 in total.Thailand is not the only region where cybercriminals hunt for personal and medical data. Most healthcare services in Thailand are available in digital form for citizens, that’s why they’re always an attractive target for cyberespionage groups, and other Dark Web actors collecting information for malicious purposes, one example is to use the stolen data for further identity theft. This year similar incidents occurred in Indonesia and India leading to the theft of COVID-19 patient records.Resecurity has shared the exposed leaked data with the relevant authorities and law enforcement to ensure the affected citizens will be protected in the scope of the existing privacy laws and data protection regulations in Thailand.To prevent yourself from being a victim of identity theft – subscribe to Resecurity Identity Protection (IDP), a mobile app and interactive Web service featuring a dashboard for continuous 24/7 protection. Resecurity enables Dark Web monitoring, leaked credentials detection, and timely alerts about other identified threats targeting your persona online."
   },
   {
      "time": "2022-08-31",
      "title": "Graph-based JavaScript bug scanner discovers more than 100 zero-day vulnerabilities in Node.js libraries | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondODGen tool was presented at this year’s Usenix Security SymposiumResearchers at Johns Hopkins University have developed a graph-based code analysis tool that can detect a wide range of vulnerabilities in JavaScript programs.Graph-based scanners parse source code files to build a graph structure that represents the different properties and execution branches of an application. This graph can then be used to model and find vulnerabilities in the source code.Graph query-based approaches have proven to be very effective in detecting vulnerabilities in some programming languages. One technique in particular, Code Property Graph (CPG), has proven to be successful in securing C/C++ and PHP code.“JavaScript, particularly Node.js, is becoming a vital community with millions of packages these days,” Yinzhi Cao, co-author of the paper and assistant professor of computer science at Johns Hopkins University, told The Daily Swig.However, their initial findings showed that CPG is not very effective in JavaScript due to the language’s dynamic structure, which makes it much more difficult to parse and analyze object relations and program branches prior to execution.In their paper, the researchers propose Object Dependence Graph (ODG) as a novel method to build graphs from JavaScript code. ODG uses some of the components of CPG, such as Abstract Syntax Trees (AST), and adds features that are specific to JavaScript, including fine-grained data dependency between objects. Accordingly, the researchers created ODGen, a tool for creating and querying ODGs.“Our proposed ODGen abstractly interprets JavaScript code and generates a so-called Object Dependence Graph to capture such dynamic features including object relations so that a graph query-based approach can easily obtain such information and detect vulnerabilities,” Cao said.The tool was able to detect 13 types of vulnerabilities with very high accuracy, discovering 302 of the 330 bugs.They expanded their test by crawling 300,000 NPM packages and applying ODGen with graph queries to detect queries. ODGen reported nearly 3,000 security bugs, of which the researchers verified 264 that belonged to libraries with more than 1,000 weekly downloads. They were able to confirm and report 180 security bugs, many of which were in libraries that are used widely in web applications. Of the discovered vulnerabilities, 70 were assigned CVEs.ODGen shows how much more needs to be done to secure the open source JavaScript ecosystem and how the adaptation of existing tools can help in developing holistic approaches to securing Node.js libraries.In the future, Cao said, the team might extend ODGen to other programming languages used in web applications, including PHP and Java.Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   }
]