[
   {
      "time": "2022-07-19",
      "title": "\r\n\tDCMS Sets Out Proposal For New AI Rulebook - Infosecurity Magazine\r\n",
      "text": " JournalistThis comes as the Data Protection and Digital Information Bill is introduced to Parliament, which includes measures to use AI responsibly while reducing compliance burdens on businesses to boost the economy. Regulators like Ofcom and the Competition and Markets Authority (CMA) will oversee AI in a range of contexts.The proposals set out “an ambitious ten-year plan” for the UK to remain a globally leading AI superpower, with the country already dominant in the sector evidenced by its notable history of innovation. The paper asserts, however, that more can be done to utilize the significant “economic and societal benefits of AI” while concurrently addressing the “complex challenges it presents.” The paper continued by highlighting that while the UK has a distinguished and effective regulatory system - highly regarded in its “rule of law and support for innovation” - there’s a need to keep up with the ever-evolving challenges and opportunities that AI presents, which is paramount in remaining globally competitive.The policy paper’s pro-innovation framework for regulating AI is underpinned by four cross-sectoral principles, tailored to the “specific characteristics of AI”. These are:This new framework was welcomed by industry experts such as Professor Dame Wendy Hall, acting chair of the AI Council, who said: \"This is critical to driving responsible innovation and supporting our AI ecosystem to thrive. The AI Council looks forward to working with government on the next steps to develop the whitepaper.”The paper culminated in inviting stakeholders’ views on the proposed approach to regulating AI and how the UK can maximize the rules for AI regulation in a way that encourages innovation and growth while protecting core values. These views will then be used to inform the development of the forthcoming whitepaper."
   },
   {
      "time": "2022-07-19",
      "title": "FBI warns about fake cryptocurrency investment apps used to steal millions",
      "text": " In one scheme uncovered by the FBI, unidentified digital fraudsters hijacked the name and logo of a U.S. financial institution to convince them to download a fake app and deposit their cryptocurrency. In that scam — which ran between December 2012 and May of this year — 13 of 28 victims also paid additional supposed “tax” when attempting to get their funds out, but “remained unable to withdraw” it.Another scam, operating under the name “YitBit1,” pulled a similar fake tax scheme while defrauding at least four victims of some $5.5 million with a fraudulent crypto investment app between October 2021 and May 2022, according to the warning.The schemes now rely on human trafficking and local people caught in dire economic circumstances due to the decline of tourism during the pandemic to run call center-style operations, Vice reported. The operations lure victims to hoax cryptocurrency apps at scale, at times draining their life savings.Andrea Peterson (they/them) is a longtime cybersecurity journalist who cut their teeth covering technology policy at ThinkProgress (RIP) and The Washington Post before doing deep-dive public records investigations at the Project on Government Oversight and American Oversight.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-19",
      "title": "Indian flight booking site Cleartrip announces data breach",
      "text": " Popular Indian flight booking site Cleartrip announced a data breach on Monday involving the information of an unknown number of victims.The site, which is owned by e-commerce giant FlipKart, told The Record that it is still conducting an investigation into the issue and has hired an outside forensic firm to help with the situation. FlipKart's majority owner is Walmart.“The investigation so far has indicated that limited information like name, email id and phone number are suspected to have been impacted,” a company spokesperson said. The company added that cyber authorities in India have been contacted and that they are preparing legal action in the event that it is necessary.  The company sent customers an email on Monday informing them of the data breach. Cleartrip said a “security anomaly” gave hackers “unauthorized access to a part of Cleartrip’s internal systems.”Cleartrip representatives did not answer questions about when the breach occurred, how many victims were involved and whether any vulnerabilities in their platform were resolved.Security researcher Sunny Nehra shared screenshots on Twitter of stolen files a hacker posted to a private forum. The hacker's files included troves of data on customers and vendors. The information shown in the screenshot indicates the hack took place recently, with several file names referencing May 2022. Companies involved in the airline industry in India have been frequent targets for hackers in recent years. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-19",
      "title": "CISA Urges Patch of Exploited Windows 11 Bug by Aug. 2 | Threatpost",
      "text": " Share this article:Feds urge U.S. agencies to patch a Microsoft July Patch Tuesday 2022 bug that is being exploited in the wild by August 2. A Windows 11 vulnerability, part of Microsoft’s Patch Tuesday roundup of fixes, is being exploited in the wild, prompting the U.S. Cybersecurity and Infrastructure Security Agency (CISA) to advise patching of the elevation of privileges flaw by August 2.That said, an attacker who has previously gained remote access to a computer system (via malware infection) could exploit the vulnerability remotely.“Although there is no further information on exploitation released by Microsoft, it can be surmised that an unknown remote code execution allowed for an attacker to perform lateral movement and escalate privileges on machines vulnerable to CVE-2022-22047, ultimately allowing for SYSTEM privileges,” FortiGuard Labs wrote.“Bugs of this type are typically paired with a code execution bug, usually a specially crafted Office or Adobe document, to take over a system. These attacks often rely on macros, which is why so many were disheartened to hear Microsoft’s delay in blocking all Office macros by default,” wrote ZDI author Dustin Childs.Microsoft recently said it would block the use of Visual Basic for Applications (VBA) macros by default in some of its Office apps, however set no timeline enforce the policy.Image: Courtesy of MicrosoftShare this article:Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP. Infosec Insider content is written by a trusted community of Threatpost cybersecurity subject matter experts. Each contribution has a goal of bringing a unique voice to important cybersecurity topics. Content strives to be of the highest quality, objective and non-commercial.Sponsored Content is paid for by an advertiser. Sponsored content is written and edited by members of our sponsor community. This content creates an opportunity for a sponsor to provide insight and commentary from their point-of-view directly to the Threatpost audience. The Threatpost editorial team does not participate in the writing or editing of Sponsored Content."
   },
   {
      "time": "2022-07-19",
      "title": "Russia fines Google $358 million for not removing banned info",
      "text": " A court in Moscow has imposed a fine of $358 million (21 billion rubles) on Google LLC for failing to restrict access to information considered prohibited in the country.The Roskomnadzor has tried over the past months to enforce sanctions based on various parts of the Code of Administrative Offenses in Russia.Roskomnadzor clarifies that the massive fine of $358 million was indeed calculated on the basis of the company's annual business turnover in Russia.In addition to the fine, Russian users of Google Search and YouTube will now see a warning about the firm violating the law and won't be allowed to place advertisements or use them as information sources.Google's non-paid services in Russia remain accessible, albeit with some restrictions, but firms or individuals can purchase no advertising campaigns in the country."
   },
   {
      "time": "2022-07-19",
      "title": "Albania shuts down government websites, services due to wide ranging cyberattack",
      "text": " The government of Albania has been forced to take its websites offline due to a cyberattack, just a few months after shifting most public sector services to an online portal.\"In order to withstand these unprecedented and dangerous strikes, we have been forced to shut down government systems until the enemy attacks are neutralized,” the agency said. The statement adds that the government is working with Microsoft, cybersecurity consulting company Jones International Group and several Albanian security companies “to prevent this cyber attack from damaging or compromising Albanian information systems.”NetBlocks, which tracks internet outages around the world, said real-time network data showed that service was first cut on Saturday, around 9 pm local time.“Metrics tend to support the Prime Minister's Office statement that describes this as a defensive measure to protect AKSHI against a targeted threat, rather than a direct impact of the kind we might see in a distributed denial of service attack,” NetBlocks Director Alp Toker explained. “Several government services including Parliament, the Prime Minister's Office, and e-government gateway used by businesses and citizens are hosted on the government network and have been sent offline.”As of Monday afternoon, all government websites are still unreachable. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-19",
      "title": "Хакеры RaHDIt выявили россиян, сотрудничающих с военной разведкой Украины - РИА Новости, 18.07.2022",
      "text": " Ваш браузер не поддерживает данный формат видео."
   },
   {
      "time": "2022-07-19",
      "title": "Roaming Mantis hits Android and iOS users in malware, phishing attacks",
      "text": " After hitting Germany, Taiwan, South Korea, Japan, the US, and the U.K. the Roaming Mantis operation moved to targeting Android and iOS users in France, likely compromising tens of thousands of devices.In a recently observed campaign, the threat actor uses SMS communication to lure users into downloading malware on their Android devices. If the potential victim uses iOS, they are redirected to a phishing page for Apple credentials.The ongoing Roaming Mantis campaign is targeting French users and starts with an SMS sent to prospective victims, urging them to follow a URL.The text message informs about a package that has been sent to them and which they need to review and arrange its delivery.If the user is located in France and are using an iOS device, they are directed to a phishing page that steals Apple credentials. Android users are pointed to a site that delivers the installation file for a mobile app, (an Android Package Kit - APK).For users outside France Roaming Mantis' servers show a 404 error and the attack stops.The APK executes and mimics a Chrome installation, requesting risky permissions such as SMS interception, making phone calls, reading and writing storage, handling system alerts, getting accounts list, and more.The command and control (C2) configuration is retrieved from hardcoded Imgur profile destinations which are encoded in base64 to evade detection.SEKOIA confirmed that over 90,000 unique IP addresses have requested XLoader from the main C2 server so far, so the victim pool might be significant.The number of iOS users who have handed over their Apple iCloud credentials on the Roaming Mantis phishing page is unknown and could be the same or even higher.SEKOIA’s analysts report that the infrastructure of Roaming Mantis hasn’t changed much since its last analysis from team Cymru last April.The servers still have open ports at TCP/443, TCP/5985, TCP/10081, and TCP/47001, while the same certificates seen in April are still in use.The intrusion set uses over a hundred subdomains, and dozens of FQDN resolve each IP address.Interestingly, the smishing (SMS phishing) operation relies on separate C2 servers from those used by XLoader, and the analysts could identify nine of those hosted on EHOSTIDC and VELIANET Autonomous Systems."
   },
   {
      "time": "2022-07-19",
      "title": "Researchers Say Thai Pro-Democracy Activists Hit by Spyware - SecurityWeek",
      "text": " Hi, what are you looking for?Cybersecurity researchers reported details Monday of cases where Thai activists involved in the country’s pro-democracy protests had their cell phones or other devices infected and attacked with government-sponsored spyware.ByFlipboardRedditWhatsappWhatsappEmailSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...WASHINGTON - Cyberattacks are the most serious threat facing the United States, even more so than terrorism, according to American defense experts. Almost half...Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The three primary drivers for cyber regulations are voter privacy, the economy, and national security – with the complication that the first is often...Russian espionage group Nomadic Octopus infiltrated a Tajikistani telecoms provider to spy on 18 entities, including government officials and public service infrastructures.The NSA and FBI warn that a Chinese state-sponsored APT called BlackTech is hacking into network edge devices and using firmware implants to silently...Infonetics Research has shared excerpts from its Mobile Device Security Client Software market size and forecasts report, which tracks enterprise and consumer security client...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   }
]