[
   {
      "time": "2022-09-02",
      "title": "Malicious Word Files Targeting Specific Individuals Related to North Korea - ASEC BLOG",
      "text": " The ASEC analysis team has discovered the continuous distribution of malicious Word files targeting specific individuals related to national defense and North Korea. Most of the confirmed Word files had filenames that included the names of individuals related to North Korea. It is likely that this attack is being perpetrated on those related to the field. The filenames of the recently confirmed Word files are as follows:The macro code in the most recently discovered file titled Discussion on Security of the Korean Peninsula and Strategy for North Korea (Mr. Kim).doc is shown below.After this script uses the following commands to collect the user’s PC information, it encodes and saves the data in %APPDATA%\\Ahnalb\\Ahnlab.hwp, eventually sending it to ‘hxxp://vjdif.mypressonline[.]com/ho/post.php’.If a registry named AhnlabUpdate exists in HKCU:\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run, then the script does not collect information and immediately sends the log file. This is likely done to collect the keylogging data as it will use the same filename (Ahnlab.hwp) for log later in future keylogging attempts.Once the data is sent, the script accesses hxxp://vjdif.mypressonline.com/ho/ng.down to download and run additional encoded scripts.The additionally downloaded file ng.down is encoded and executed as a PowerShell background process through the Start-Job command. The script performs the following features:It creates a file named HncSerial.log in the C:\\windows\\temp folder saved with PowerShell commands. It also creates a shortcut for the file in the Startup folder so that the malware can continuously function.The following PowerShell command is run by the shortcut.The script changes the Office security settings to run the macro at all times by changing the registry values.User’s key inputs are saved to %APPDATA%\\Ahnalb\\Ahnlab.hwp. When a user starts their PC, the previously created shortcut is run and accesses hxxp://vjdif.mypressonline[.]com/ho/ng.txt to execute the PowerShell commands on that page, ultimately sending the saved information to hxxp://vjdif.mypressonline[.]com/ho/post.php.As Word files targeting individuals related to North Korea have been consistently discovered, users need to take extra caution. They should refrain from opening email attachments from unknown senders and files from unknown sources. Furthermore, they should ensure to maintain their security settings so that the malicious macros in Word files are not automatically executed.[File Detection]Downloader/DOC.KimsukyTrojan/PowerShell.FileUpload[IOC]cbafe2d6c3b36087220fe63129a1e611 (VBA)hxxp://vjdif.mypressonline[.]com/ho/ng.txthxxp://vjdif.mypressonline[.]com/ho/ng.downhxxp://vjdif.mypressonline[.]com/ho/post.phpSubscribe to AhnLab’s next-generation threat intelligence platform ‘AhnLab TIP’ to check related IOC and detailed analysis information.[Important] Consent to Collection and Use of Personal InformationΔ[Important] Consent to Collection and Use of Personal InformationΔ[…] ASEC analysis team discovered that the Word document type identified in the blog, ‘Malicious Word Files Targeting Specific Individuals Related to North Korea,’ has recently been using FTP to leak user credentials. The filename of the identified Word […][…] Aug. 19, 2022 Malicious Word Files Targeting Specific Individuals Related to North Korea Link […][…] final attack graph is based on two reports published by AhnLab in November 2022 and September […]"
   },
   {
      "time": "2022-09-02",
      "title": "First Known Phishing Attack Against PyPi Users | Checkmarx.com",
      "text": " A few hours ago, PyPi disclose information on the first seen phishing attack aimed at a Python contributor.Right now, we are aware of hundreds of malicious packages that were related to this attack based on the known indicator.This recent incident, carried out by the threat actor dubbed “JuiceLedger”,  includes two attack vectors against the open source ecosystem:As it seems, these phishing attempts succeeded at least twice as two existing, previously legitimate, python packages were poisoned with malicious payloads. This was probably a result of an account takeover of the owners of the packages after their credentials to PyPi were stolen.The infected packages, version 0.1.6 of “exotel” (over 480,000 total downloads) and versions 2.0.2 and 4.0.2 of “spam” (over 200,000 total downloads) were taken down by now.Not long after, PyPi’s official Twitter account reported that this phishing attack was related to a broader incident that included several hundred malicious python packages. These malicious packages were removed from the registry at that point.The phishing attempt and the malicious packages are linked by the domain linkedopports[.]com, which appears in the malicious package code and also functions as the location to which the phishing site tries to send the stolen credentials.Looking into this incident, and specifically into the malicious packages, we notice the following details.The malicious packages are trying to download and execute a file from the URL hxxps://python-release[.]com/python-install.scrThis malware is untypically large, ~63MB, (possibly in an attempt to evade AV detection) and has a valid signature (signed on August 23rd, 2022).The website hosted on hxxps://python-release[.]com looks like an attempt to imitate a legitimate source for python installation files:During our investigation, we found another unreported domain related to this attacker’s infrastructure.Registered at the same timeframe, under the same IP as hxxps://python-release[.]com is the domain “ledgdown[.]com”. This domain is hosting a website trying to imitate the legitimate website of the crypto assets app “ledger live.”Under this domain is the URL hxxps://ledgdown[.]com/LedgerSetup.zip.This large zip file (~170MB) includes 3 files, one of them is “LedgerSetup.scr” (24/68 detection rate on VT) which in itself is large (~63MB) and, from the looks of it, bears a striking resemblance to the “python-install.scr” file.We recommend checking your network traffic against the IOCs listed below, and as always, encouraging contributors to use 2FA.This is another evolution into supply chain attacks when we see established threat actors starting to use the open source ecosystem as a way to increase the impact of their attacks. We believe this trend will continue to grow in the future.The entrance of these kinds of actors emphasizes the need of collaboration between the defenders in order to keep the ecosystem safeWorking together to keep the ecosystem safe…hxxps://python-release[.]comhxxps://python-release[.]com/python-install.scrhxxps://ledgdown[.]comhxxps://ledgdown[.]com/LedgerSetup.ziphxxps://linkedopports[.]comhxxps://linkedopports[.]com/pyp/resp.php?live=Installationpython-install.scr — 60434af3ebe924efabc96558e6c8d8176bf4eb06dd6cc47b4c491da9964be874LedgerSetup.scr — 8e97c6883e7af5cc1f88ac03197d62298906ac4a35a789d94cc9fde45ee7ea13©2023 Checkmarx Ltd. All Rights Reserved. iISO/IEC 27001:2013 CertifiedAccessibility"
   },
   {
      "time": "2022-09-02",
      "title": "Experts warn of more Ragnar Locker attacks, days after group targets airline",
      "text": " The Ragnar Locker ransomware gang is likely to continue targeting critical infrastructure with attacks, according to a new study from researchers at cybersecurity firm Cybereason.The report comes just days after the group took credit for one such attack — on TAP Air Portugal, the country's largest airline.The Cybereason report explained that the group’s ransomware first checks whether a potential victim is located within the Commonwealth of Independent States — a group of states formerly in the Soviet bloc — and what kind of security software they have on their devices.If a victim is in Russia, Belarus or other former Soviet countries, it does not deploy. Once the ransomware confirms a victim is outside of those countries, it begins to extract data before encrypting everything and building a ransom note. Since 2019, the group has used the double extortion tactic — freezing access to systems and threatening to release stolen data — to extract as much money out of victims.While the extent of the attack is unclear, TAP Air Portugal confirmed that it was a target, writing on Twitter that it managed to block the attempt. The company denied that any customer data was accessed during the incident.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-02",
      "title": "Google says it cut off Russian disinformation sites from its vast ad display network | CyberScoop",
      "text": " \n\nSeptember 1, 2022\n\nGoogle says it took additional steps in the past week so that brands would no longer see their ads on Russian state-owned websites that are a regular source of Ukraine war propaganda. The move comes after a software developer tweeted screenshots of ads from major Western companies placed through Google’s display advertisement service alongside headlines spreading disinformation about the war. “Continuing to run ads on these sites means Google — and the brands whose ads are run — are funding sites publishing this propaganda,” Vickers told CyberScoop. “Even when the sites aren’t dependent on this revenue to survive, having ads from well-known brands lends credibility to the sites, and what they’re pushing.”The ads Vickers found and posted to Twitter are just the latest examples of Google-placed ads appearing on Russian-backed websites, a practice that congressional leaders and disinformation experts have long condemned because the ads provide money to the Russian government and bolster the propaganda it’s delivering to support the war. “It is unacceptable for Google to keep placing ads on Russian websites that funnel money to Russian companies, months after it pledged to stop,” Sen. Ron Wyden, D-Ore., said in a statement to CyberScoop. “Google is either flouting its promises, or it doesn’t even know where it is selling ads.”Senate Intelligence Committee Chairman Mark Warner, D-Va., told CyberScoop in a statement that “all companies have a responsibility to ensure that they are not helping to fund or even inadvertently support Vladimir Putin’s invasion of Ukraine. … It’s extremely disappointing to see an American company continue to financially support websites pushing Putin’s propaganda.”Most if not all the problematic ads placed by Google are an example of what’s known as “programmatic” ad buying, which refers to the use of algorithmic software to buy and sell online display space. Google is by far the world’s biggest programmatic ad tech company in terms of the number of sites it works with. Vickers said that of the almost 1 million sites he tracks, 99.8% of them authorize at least one Google account to sell their ad inventory.Vickers said Google often appears to “demonetize” ads it places by removing them from specific problematic articles as opposed to cutting off whole sites.Google has long been under fire for how its advertising practices fuel Russian propaganda. A day after Russia’s February invasion of Ukraine, Warner sent the company a letter encouraging it to “at a minimum” audit Google and Google sister brand YouTube’s advertising practices, including its compliance with sanctions. “It is unacceptable for Google to keep placing ads on Russian websites that funnel money to Russian companies, months after it pledged to stop. Google is either flouting its promises, or it doesn’t even know where it is selling ads.”Asked on Thursday about the latest example of Google ads appearing on Russian-backed disinformation sites, Aciman told CyberScoop in a prepared statement that Google employees had “reviewed the sites in question and have taken appropriate enforcement actions.” Aciman’s statement said that after Russia’s invasion of Ukraine, Google “also stopped the monetization of Russian state-funded media across our platforms. Since then, our teams have continued to monitor our network for additional state-funded actors and have demonetized them when detected.”Aciman added that Google has updated its advertising and monetization policies in response to the war in Ukraine.“Shortly after the war started, we stopped monetization on Russian state-funded media across our platforms, including YouTube,” he said. “This was not a singular action, and we’ve continued to demonetize state-funded media as we’ve detected it.”“Our ad should not have appeared on this website — it clearly doesn’t align with who we are as a company,” Mark Molzan, Global Issues Director for the telecom company Lumen, which owns CenturyLink, told CyberScoop. “We have proactively turned off all the campaigns within Google Display until we can gain confidence the safeguards we have in place to prevent this type of placement are working as intended.”Google did not say which of the sites running ads Vickers posted had been removed from its network but confirmed those removed were determined to be state-owned. Examples of the advertising Vickers posted from across the Russian sites made clear that state-owned or not many of the Google-served ads appear next to propaganda. “Zelensky’s plans to resign revealed,” said a headline appearing on one of the websites next to a large Adidas ad. Another headline appearing below a CenturyLink ad said, “West in shock: Russia has confirmed its status as a great power.”Disinformation activists and digital advertising experts questioned why a company as powerful and well-resourced as Google continues to struggle to manage a problem that an individual software engineer detected and posted on Twitter. “Propaganda needs three things to thrive: legitimacy, money, and data,” said Claire Atkin, co-founder of Check My Ads Institute, an independent watchdog. “It gets everything it needs from Google’s ad exchange. If Google cared about national security, they’d stop handing Russia the most powerful propaganda weapon to use against us.”While most brands don’t want to send their money or credibility to these sites, by continuing to monetize them, Google makes it hard to avoid, Vickers said.The full list of brands Adalytics found on sanctioned Russian sites in April included Adidas, Citibank, CVS, Facebook and Google itself, among many others, according to Adalytics CEO Krzysztof Franaszek.“There’s been several incidents where journalists have notified Google of potentially illegal activities on Google’s ad network,” Franaszek said. “In each case, Google’s spokesperson gives a response such as: ‘We have strict policies’ or ‘If we find a site or partner violates our policies, we take immediate action.'” He said in each case the websites or ad tech platforms explicitly mentioned by the journalist in their request for comment to Google appear to be removed within a few days of contact. However, after each of these incidents, he said, “researchers have noted that other similar cases not explicitly mentioned were not removed from Google’s ad network, even months or years later.”"
   },
   {
      "time": "2022-09-02",
      "title": "\r\n\tSource Code of Over 1800 Android and iOS Apps Gives Access to AWS Credentials - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe Symantec Threat Hunter team has spotted 1859 apps across Android and iOS containing hard-coded Amazon Web Services (AWS) access tokens that permitted access to private AWS cloud services.Of all the apps analyzed by the security researchers, roughly 50% were seen using the same AWS tokens found in other apps (maintained by other developers and companies).As for why app developers were using hard-coded access keys, Symantec said reasons included the necessity of downloading or uploading assets and resources required for the app (usually large media files), accessing configuration files for the app, and accessing cloud services that require authentication.The Symantec Threat Hunter team concluded its advisory by providing a series of recommendations to help companies defect against this type of supply chain issues.“Adding security scanning solutions to the app development lifecycle and, if using an outsourced provider, requiring and reviewing Mobile App Report Cards, which can identify any unwanted app behaviors or vulnerabilities for every release of a mobile app, can all be helpful in highlighting potential issues,” wrote the team.“As an app developer, look for a report card that both scans SDKs and frameworks in your application and identifies the source of any vulnerabilities or unwanted behaviors.”"
   },
   {
      "time": "2022-09-02",
      "title": "Hacker's Spread ModernLoader, XMRig Miner Malware - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-09-02",
      "title": "Researchers Detail Emerging Cross-Platform BianLian Ransomware Attacks",
      "text": " The operators of the emerging cross-platform BianLian ransomware have increased their command-and-control (C2) infrastructure this month, a development that alludes to an increase in the group's operational tempo.Besides leveraging living-off-the-land (LotL) techniques for network profiling and lateral movement, the group is also known to deploy a custom implant as an alternative means for maintaining persistent access to the network.The main goal of the backdoor, per [redacted], is to retrieve arbitrary payloads from a remote server, load it into memory, and then execute them.BianLian, similar to Agenda, is capable of booting servers in Windows safe mode to execute its file-encrypting malware while simultaneously remaining undetected by security solutions installed on the system.The earliest known C2 server associated with BianLian is said to have appeared online in December 2021. But the infrastructure has since witnessed a \"troubling explosion\" to surpass 30 active IP addresses.BianLian is yet another indication of cybercriminals' dedicated efforts to continue hopping tactics so as to avoid detection. It also adds to a growing number of threats using Go as the foundational language, enabling adversaries to make swift changes in a single codebase that can then be compiled for multiple platforms.\"BianLian have shown themselves to be adept with the Living of the Land (LOL) methodology to move laterally, adjusting their operations based on the capabilities and defenses they encountered in the network,\" the researchers said.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-09-02",
      "title": "Thousands lured with blue badges in Instagram phishing attack",
      "text": " A new Instagram phishing campaign is underway, attempting to scam users of the popular social media platform by luring them with a blue-badge offer.Blue badges are highly coveted as Instagram provides them to accounts it verified to be authentic, representing a public figure, celebrity, or brand.The spear emails in the recently observed phishing campaign inform recipients that they Instagram reviewed their accounts and deemed them eligible for a blue badge.Users falling for the scam are urged to fill out a form and claim their verification badge in the next 48 hours.While the campaign shows signs of fraud, the threat actor bets on the carelessness and enthusiasm Instagram users have when faced with the opportunity to upgrade the status of their social account.The new campaign was spotted by threat analysts at Vade, an AI-based email security service, who reported that the first messages to targets were sent out on July 22.During the deployment, email distribution volumes spiked twice, once on July 28 and again on August 9, 2022, with more than 1,000 phishing messages per day.The messages feature Instagram and Facebook logos and inform the recipient that their account is eligible for a blue badge, urging them to click on an embedded button that would take them to the relevant submission form.The users are warned that if they ignore the message, the form will be permanently deleted in 48 hours, creating a sense of urgency and the illusion of a limited opportunity.The phishing form is hosted on a domain named “teamcorrectionbadges”, to make it appear as if Instagram uses a separate, dedicated domain to verify users.The phishing process on that site relies on a three-stage form, each step showing Instagram, Facebook, WhatsApp, Messenger, and Meta logos, in an attempt to create a sense of legitimacy.The first form requests “username”, the second asks the victim to enter “name”, “email”, and “phone number”, while the third and final step requests entering the user “password”, to supposedly verify that they own the account.Once the victim completes the process, a message informs them that their account is now verified and that the Instagram team will contact them in the next two days. A phony case ID is also presented at this final step.First, the social media platform will never contact you offering a blue badge. Users can only get it by applying themselves."
   },
   {
      "time": "2022-09-02",
      "title": "Neopets says hackers had access to its systems for 18 months",
      "text": " Neopets has released details about the recently disclosed data breach incident that exposed personal information of more than 69 million members.Findings of the investigation launched on July 20, 2022 revealed that attackers had access to the Neopets IT systems from January 3, 2021 until July 19, 2022.The hacker claimed the database contained 460MB of source code and sensitive personal information for 69 million members.\"We have determined that for past and present Neopets players, affected information may include the data provided when registering for or playing Neopets, including name, email address, username, date of birth, gender, IP address, Neopets PIN, hashed password, as well as data about a player's pet, game play, and other information provided to Neopets.\"\"For players that played prior to 2015, the information also could have included non-hashed, but inactive, passwords,\" the company added.Neopets has taken a series of measures to improve their systems' security and to minimize the impact future incidents would have on the players.The company says that it enhanced network monitoring to catch threats earlier and strengthened the authentication schemes for better account access protection.Passwords have now been reset and Neopets is now working on implementing multi-factor authentication as an added defense layer.Finally, the announcement recommends that all Neopets players change their passwords if they're recycling them for other online platforms or services.Neopets players should remain vigilant for emails that urge them to take immediate action or ask them to provide sensitive information, such as that related to banking accounts."
   }
]