[
   {
      "time": "2022-11-15",
      "title": "New KmsdBot Malware Hijacking Systems for Mining Crypto and Launch DDoS Attacks",
      "text": " Dubbed KmsdBot by the Akamai Security Intelligence Response Team (SIRT), the Golang-based malware has been found targeting a variety of companies ranging from gaming to luxury car brands to security firms.The malware gets its name from an executable named \"kmsd.exe\" that's downloaded from a remote server following a successful compromise. It's also designed to support multiple architectures, such as Winx86, Arm64, mips64, and x86_64.KmsdBot comes with capabilities to perform scanning operations and propagate itself by downloading a list of username and password combinations. It's also equipped to control the mining process and update the malware.\"This botnet is a great example of the complexity of security and how much it evolves,\" Cashdollar said. \"What seems to have started as a bot for a game app has pivoted into attacking large luxury brands.\"The findings come as vulnerable software is being increasingly used to deploy cryptocurrency miners, jumping from 12% in Q1 2022 to 17% in Q3, according to telemetry data from Kaspersky. Nearly half of the analyzed samples of malicious mining software (48%) secretly mine Monero (XMR).Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-15",
      "title": "Australia Declares War on Cybercrime Syndicates",
      "text": " Australian authorities have announced a new offensive against cybercrime, standing up a a joint operation between the Australian Federal Police and the Australian Signals Directorate to disrupt cybercriminal operations. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-11-15",
      "title": "Thales Denies Getting Hacked as Ransomware Group Reveals Gigabytes of Information - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-11-15",
      "title": "Whoosh confirms data breach after hackers sell 7.2M user records",
      "text": " The Russian scooter-sharing service Whoosh has confirmed a data breach after hackers started to sell a database containing the details of 7.2 million customers on a hacking forum.Whoosh is Russia's leading urban mobility service platform, operating in 40 cities with over 75,000 scooters.On Friday, a threat actor began selling the stolen data on a hacking forum, which allegedly contains promotion codes that can be used to access the service for free, as well as partial user identification and payment card data.The company confirmed the cyberattack via statements on Russian media earlier this month but claimed that its IT experts had managed to thwart it successfully.\"The leak did not affect sensitive user data, such as account access, transaction information, or travel details,\" stated a Whoosh spokesperson.\"Our security procedures also exclude the possibility of third parties gaining access to full payment data of users' bank cards.\"On Friday, a user on the 'Breached' hacking forums posted a database containing details about 7.2 millionWhoosh customers, including email addresses, phone numbers, and first names.The database also contained partial payment card details for a subset of 1,900,000 users.The seller also claimed that the stolen data included 3,000,000 promo codes, which people can use to rent Whoosh scooters without paying.The seller says they are selling the data to only five buyers for $4,200 each, or .21490980 bitcoins, and according to the SatoshiDisk platform used for the transaction, no one has yet to purchase the database.In a separate sale of the data on Telegram, the threat actor claims it was stolen during a November 2022 attack on Whoosh."
   },
   {
      "time": "2022-11-15",
      "title": "42,000 sites used to trap users in brand impersonation scheme",
      "text": " A malicious for-profit group named 'Fangxiao' has created a massive network of over 42,000 web domains that impersonate well-known brands to redirect users to sites promoting adware apps, dating sites, or 'free' giveaways.The imposter domains are used as part of what appears to be a massive traffic generation scheme that creates ad revenue for Fangxiao's own sites or more visitors for 'customers' who purchase traffic from the group.Examples given in the report include Coca-Cola, McDonald's, Knorr, Unilever, Shopee, Emirates, and more, with many fake sites featuring extensive localization options.To generate massive traffic for its customers and its own sites, Fangxiao registers approximately 300 new brand impersonation domains daily.Since the start of March 2022, the malicious operators have used at least 24,000 landing and survey domains to promote their fake prizes to victims.Most of these sites use the \".top\" TLD, followed by \".cn\", \".cyou\", \".xyz\", \".work\", and \".tech\". The sites are hidden behind Cloudflare and registered through GoDaddy, Namecheap, and Wix.Users arrive on these sites through mobile advertisements or after receiving a WhatsApp message containing the link, typically making a special offer or informing the recipient they won something.These landing domains redirect visitors to a survey domain with a timer that adds urgency to help keep the victims concentrated away from the signs of fraud.In some cases, completing the survey leads to downloading an app, which the victim is requested to launch and keep open for at least thirty seconds, likely to allow enough time to register a new user from a Fangxiao referral.The landing sites also host advertisements from ylliX, which Google and Facebook have marked as \"suspicious\" while clicking on them results in a separate redirection chain.The redirection path depends on the user's location (IP address) and user agent, leading to Triada trojan downloads, Amazon via affiliate links, fake dating sites, and SMS micropayment scams.Another observed destination of the Fangxiao campaign is the Play Store page of the 'App Booster Lite – RAM Booster' app, a performance booster for Android devices with over 10 million downloads.Cyjax says the app does not feature malicious functionality, but it asks users to approve access to risky permissions, and it serves above average amount of ads through hard-to-close popups.The app's publisher, LocoMind, shares an IP address with another app developer named Holacode, who has been previously linked to adware distribution.Cyjax's investigation yielded several indications that Fangxiao is a Chinese operator, like using Mandarin on one of the exposed controlled panels.Also, it is currently unknown if this massive baiting operation using many fake sites to draw victims is related to the final destinations or if Fangxiao is merely collaborating with those sites to make a profit."
   },
   {
      "time": "2022-11-15",
      "title": "Australia to consider banning ransomware payments",
      "text": " Australia will consider banning ransomware payments in a bid to undermine the cybercriminal business model, a government minister said on Sunday.Clare O’Neil, the minister for home affairs and cybersecurity, confirmed to Australia’s public broadcaster ABC that the government was looking at criminalizing extortion payments as part of the government’s cyber strategy.The announcement follows several large security incidents affecting the country, including most significantly the data breach of Medibank, one of the country’s largest health insurance providers.All of the data which the criminals accessed “could have been taken,” the company said. This includes sensitive health care claims data for around 480,000 individuals, including information about drug addiction treatments and abortions.Similar proposals to ban ransomware payments have been floated internationally to deal with the growing threat of cyber extortion, but there are concerns that doing so could be unsuccessful.Criminalizing extortion payments could push visibility of attacks further underground by forcing companies to keep quiet about incidents to avoid regulatory scrutiny. It could also provide the ransomware gangs with another lever to extort their victims — if a company does pay a demand to save the business, the hackers could potentially demand a second extortion payment to keep the first one quiet.In most current cases, making ransomware payments is not a criminal offense. However, some hacking groups have been sanctioned by the U.S. Treasury’s Office of Foreign Assets Control, meaning that payments to them could be a crime.The minister’s comments came a day after she announced a new permanent joint standing operation between the Australian Federal Police (AFP) and the Australian Signals Directorate (ASD) — the country’s cyber and signals intelligence agency — to tackle cybercrime.The new initiative would see 100 offices work “day in, day out, hunt down the scumbags who are responsible for these malicious crimes against innocent people,” according to O’Neil.She confirmed that the standing operation will be \"offensively attacking\" the groups responsible for ransomware incidents and said they wouldn't be waiting \"for a crime to be committed\" before trying to “understand who it is and do something to the people who are responsible. We are offensively going to find these people, hunt them down, and debilitate them before they can attack our country.\"Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-15",
      "title": "Apple Gets Sued Over App Store User Data Collection  ",
      "text": " Apple is facing a proposed class-action lawsuit that accuses it of violating user privacy by tracking, collecting, and monetizing the personal data of iPhone users, even when the iPhone Analytics setting is turned off.The lawsuit comes days later after Gizmodo published a report on Apple’s App Store data collection based on the research by two independent security researchers, Tommy Mysk and Talal Haj Bakry, at the software company Mysk, in November.The findings by the researchers expose how Apple’s own apps — including the App Store Apple Music, Apple TV, Books, and Stocks — collect data about users’ interactions with apps, even when they have not agreed to share analytics information with the Cupertino giant.Elliot Libman, who is the plaintiff in the complaint hopes that the case will become a class action lawsuit against Apple. Case number 5:2022cv07069 was filed in the U.S. District Court for the Northern District of California on November 10, 2022.In the lawsuit, Libman cites research by the Mysk app developers and accuses Apple of violating the California Invasion of Privacy Act, including the one that prohibits the unauthorized recording of confidential communications.It further says that Apple assures users that they are in control of what information they share when it comes to mobile app activity, but those assurances and promises regarding privacy are “utterly false.”   “Privacy is one of the main issues that Apple uses to set its products apart from competitors,” plaintiff Libman says in the lawsuit. “But Apple’s privacy guarantees are completely illusory.”Interestingly, Apple’s iPhone and iPad Analytics settings make an explicit promise that if “Allow Apps to Request to Track” and/or “Share [Device] Analytics” settings are turned off, the tech giant will stop collecting and recording all of their app information or activity.However, even after disabling these options, the company continues to collect, track, and monetize its data, which is contrary to Apple’s own narrative of how privacy protection works.“Apple records, tracks, collects and monetizes analytics data — including browsing history and activity information — regardless of what safeguards or “privacy settings” consumers undertake to protect their privacy,” claims the lawsuit.“Even when consumers follow Apple’s own instructions and turn off ‘Allow Apps to Request to Track’ and/or ‘Share [Device] Analytics’ on their privacy controls, Apple nevertheless continues to record consumers’ app usage, app browsing communications, and personal information in its proprietary Apple apps, including the App Store, Apple Music, Apple TV, Books, and Stocks. The lawsuit cites “allow apps to request tracking” and “share analytics” settings as their main issues with Apple.“Apple’s practices violate consumer privacy; deliberately mislead consumers; give Apple and its employees the ability to learn deep information about people’s lives, interests, and application usage; and make Apple a potential victim of “one-stop shopping” is any government, private actor, or criminal that seeks to undermine the privacy, security, or freedom of individuals,” the lawsuit further says.For example, Apple’s “App Store” app harvests information about every action users take while using the app in real time, including what users tapped on, which apps users search for, what ads users see, and how long users looked at a given app and how users found it.Mysk’s tests on the App Store found out that the app sends details to Apple about users and their devices as well, including ID numbers, what kind of phone they are using, their screen resolution, their keyboard languages, and how you are connected to the internet — notably, the kind of information commonly used for device fingerprinting.“Through its pervasive and illegal business of tracking and data collection, Apple knows even the most intimate and potentially embarrassing aspects of a user’s app usage — regardless of whether the user accepts Apple’s false promise to keep such activities private,” it added.The lawsuit seeks “restitution and all other forms of equitable monetary relief,” and for injunctive relief, as the Court may deem proper. It has also demanded a jury trial.Apple hasn’t yet commented on the matter. As of now, there is no hearing date for the case and also no clarity if it will be heard."
   },
   {
      "time": "2022-11-15",
      "title": "New \"Earth Longzhi\" APT Targets Ukraine and Asian Countries with Custom Cobalt Strike Loaders",
      "text": " The first wave from May 2020 to February 2021 is said to have targeted government, infrastructure, and healthcare industries in Taiwan and the banking sector in China, whereas the succeeding set of intrusions from August 2021 to June 2022 infiltrated high-profile victims in Ukraine and several countries in Asia.This included defense, aviation, insurance, and urban development industries in Taiwan, China, Thailand, Malaysia, Indonesia, Pakistan, and Ukraine.Some of Earth Baku's malicious cyber activities have been tied to groups called by other cybersecurity firms ESET and Symantec under the names SparklingGoblin and Grayfly, respectively.Attacks orchestrated by the hacker group leverage spear-phishing emails as the initial entry vector. These messages are known to embed password-protected archives or links to files hosted on Google Drive that, when opened, launches a Cobalt Strike loader dubbed CroxLoader.In some cases, the group has been observed weaponizing remote code execution flaws in publicly exposed applications to deliver a web shell capable of dropping a next-stage loader referred to as Symatic that's engineered to deploy Cobalt Strike.Also put to use as part of its post-exploitation activities is an \"all in one tool,\" which combines several publicly available and custom functions in one package and is believed to have been available since September 2014.The second series of attacks initiated by Earth Longzhi follow a similar pattern, the main difference being the use of different Cobalt Strike loaders named CroxLoader, BigpipeLoader, and OutLoader to drop the red team framework on infected hosts.\"[Earth Longzhi's] target sectors are in industries pertinent to Asia-Pacific countries' national security and economies,\" the researchers said. \"The activities in these campaigns show that the group is knowledgeable on red team operations.\"\"The group uses social engineering techniques to spread its malware and deploy customized hack tools to bypass the protection of security products and steal sensitive data from compromised machines.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-15",
      "title": "Worok Hackers Abuse Dropbox API to Exfiltrate Data via Backdoor Hidden in Images",
      "text": " A recently discovered cyber espionage group dubbed Worok has been found hiding malware in seemingly innocuous image files, corroborating a crucial link in the threat actor's infection chain.Czech cybersecurity firm Avast said the purpose of the PNG files is to conceal a payload that's used to facilitate information theft.The Slovak cybersecurity company also documented Worok's compromise sequence, which makes use of a C++-based loader called CLRLoad to pave the way for an unknown PowerShell script embedded within PNG images, a technique known as steganography.PNGLoad, which is launched by CLRLoad (or alternatively another first-stage called PowHeartBeat), is said to come in two variants, each responsible for decoding the malicious code within the image to launch either a PowerShell script or a .NET C#-based payload.The PowerShell script has continued to be elusive, although the cybersecurity company noted it was able to flag a few PNG files belonging to the second category that dispensed a steganographically embedded C# malware.\"At first glance, the PNG pictures look innocent, like a fluffy cloud,\" Avast said. \"In this specific case, the PNG files are located in C:\\Program Files\\Internet Explorer, so the picture does not attract attention because Internet Explorer has a similar theme.\"This new malware, codenamed DropboxControl, is an information-stealing implant that uses a Dropbox account for command-and-control, enabling the threat actor to upload and download files to specific folders as well as run commands present in a certain file.Some of the notable commands include the ability to execute arbitrary executables, download and upload data, delete and rename files, capture file information, sniff network communications, and exfiltrate system metadata.Companies and government institutions in Cambodia, Vietnam, and Mexico are few of the prominent countries affected by DropboxControl, Avast said, adding the authors of the malware are likely different from those behind CLRLoad and PNGLoad owing to \"significantly different code quality of these payloads.\"Regardless, the deployment of the third-stage implant as a tool to harvest files of interest clearly indicates the intelligence-gathering objectives of Worok, not to mention serves to illustrate an extension to its killchain.\"The prevalence of Worok's tools in the wild is low, so it can indicate that the toolset is an APT project focusing on high-profile entities in private and public sectors in Asia, Africa, and North America,\" the researchers concluded.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-15",
      "title": "Over 15,000 WordPress Sites Compromised in Malicious SEO Campaign",
      "text": " The search engine poisoning technique is designed to promote a \"handful of fake low quality Q&A sites\" that share similar website-building templates and are operated by the same threat actor.A notable aspect of the campaign is the ability of the hackers to modify over 100 files per website on average, an approach that contrasts dramatically from other attacks of this kind wherein only a limited number of files are tampered with to reduce footprint and escape detection.Some of the most commonly infected pages consist of wp-signup.php, wp-cron.php, wp-links-opml.php, wp-settings.php, wp-comments-post.php, wp-mail.php, xmlrpc.php, wp-activate.php, wp-trackback.php, and wp-blog-header.php.The ultimate goal of the campaign is to \"drive more traffic to their fake sites\" and \"boost the sites' authority using fake search result clicks to make Google rank them better so that they get more real organic search traffic.\"It's not immediately clear how the WordPress sites are breached, and Sucuri said it did not notice any obvious plugin flaws being exploited to carry out the campaign.That said, it's suspected to be a case of brute-forcing the WordPress administrator accounts, making it essential that users enable two-factor authentication and ensure that all software is up-to-date.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]