[
   {
      "time": "2022-10-04",
      "title": "Microsoft confirms zero-day exploits against Exchange Server in ‘limited’ attacks | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyond‘ProxyNotShell’ abuse less severe than 2021 attack wave due to authentication requirementMicrosoft is developing a patch for two actively exploited zero-day vulnerabilities in Microsoft Exchange Server.As the vulnerabilities are yet to be patched, the full technical details have not been released – but proof-of-concept (PoC) code is expected to appear soon.“Authenticated access to the vulnerable Exchange Server is necessary to successfully exploit either vulnerability, and they can be used separately,” Microsoft noted.Unfortunately, the authentication required is nothing more than a standard user. As a result, cybercriminals could obtain these credentials via theft, credential stuffing, and brute-force attacks.According to Microsoft, fewer than 10 organizations worldwide have been targeted by what is likely a “state-sponsored organization”.The company is urging customers to disable remote PowerShell access for non-administrators immediately. If the Exchange Emergency Mitigation Service (EEMS) is enabled, further mitigations will be applied automatically.According to the tech giant, Exchange Online customers do not need to take any action. However, Beaumont has queried the wisdom of this statement, given that Microsoft Exchange Online migration involves using hybrid, internet-facing Exchange servers.“It is expected that similar threats and overall exploitation of these vulnerabilities will increase, as security researchers and cybercriminals adopt the published research into their toolkits and proof of concept code becomes available,” Microsoft commented.Microsoft told The Daily Swig that the company has nothing further to share beyond the published advisories.Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2022-10-04",
      "title": "CISA directive orders federal civilian agencies to regularly report software vulnerabilities | CyberScoop",
      "text": " \n\nOctober 3, 2022\n\nThe Cybersecurity and Infrastructure Security Agency announced a Binding Operational Directive on Monday ordering federal civilian agencies to enhance efforts to detect vulnerabilities in their networks, a move that CISA Director Jen Easterly hopes the private sector will emulate.“We have said consistently that we are on an urgent path to gain visibility into risks facing federal civilian networks,” Easterly told reporters. “This is a movement essentially to allow CISA, in its role as operational lead for federal cybersecurity, to manage federal cybersecurity as an enterprise.”By establishing baseline requirements for agencies to use in identifying assets and vulnerabilities, Easterly said the directive gives CISA a much more granular view of federal agencies’ disparate cybersecurity postures. "
   },
   {
      "time": "2022-10-04",
      "title": " Office of Public Affairs |  Landmark U.S.-UK Data Access Agreement Enters into Force | United States Department of Justice",
      "text": " An official website of the United States governmentHere's how you know\nOfficial websites use .gov\n\n              A .gov website belongs to an official government organization in the United States.\n            \nSecure .gov websites use HTTPS\n\n              A lock (   \n\nLock\nA locked padlock\n\n\n\n ) or https:// means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n            The Agreement between the Government of the United States of America and the Government of the United Kingdom of Great Britain and Northern Ireland on Access to Electronic Data for the Purpose of Countering Serious Crime (“Data Access Agreement” or “Agreement”) entered into force today. The Agreement is authorized by the Clarifying Lawful Overseas Use of Data (CLOUD) Act, a law enacted by Congress in 2018, and will be the first agreement of its kind, allowing each country’s investigators to gain better access to vital data to combat serious crime in a way that is consistent with privacy and civil liberties standards.Under the Data Access Agreement, service providers in one country may respond to qualifying, lawful orders for electronic data issued by the other country, without fear of running afoul of restrictions on cross-border disclosures. The Data Access Agreement fosters more timely and efficient access to electronic data required in fast-moving investigations through the use of orders covered by the Agreement. This will greatly enhance the ability of the United States and the United Kingdom to prevent, detect, investigate, and prosecute serious crime, including terrorism, transnational organized crime, and child exploitation, among others.The Data Access Agreement sets out numerous requirements that must be met for U.S. or UK authorities to invoke the Agreement. For example, orders submitted by U.S. authorities must not target persons located in the UK and must relate to a serious crime. Similarly, orders submitted by UK authorities must not target U.S. persons or persons located in the United States and must relate to a serious crime. U.S. and UK authorities must also abide by agreed requirements, limitations and conditions when obtaining and using data obtained under the Data Access Agreement. The United States and the United Kingdom have selected Designated Authorities responsible for implementation of the Data Access Agreement for each country. For the United States, the Designated Authority is the Department of Justice’s Office of International Affairs (OIA), and for the United Kingdom it is the Investigatory Powers Unit of the UK Home Office.Among its various functions as U.S. Designated Authority, OIA has created a CLOUD team to review and certify orders that comply with the Agreement on behalf of federal, state, local, and territorial authorities located in the United States, transmit certified orders directly to UK service providers, and arrange for the return of responsive data to the requesting authorities.The Justice Department announced today the seizure of nearly $9 million worth of Tether, a cryptocurrency pegged to the U.S. dollar. These seized funds were traced to cryptocurrency addresses allegedly...Binance Holdings Limited (Binance), the entity that operates the world’s largest cryptocurrency exchange, Binance.com, pleaded guilty today and has agreed to pay over $4 billion to resolve the Justice Department’s...Office of Public Affairs\r\nU.S. Department of Justice\r\n950 Pennsylvania Avenue, NW\r\nWashington DC 20530Office of Public Affairs Direct Line\r\n202-514-2007Department of Justice Main Switchboard\r\n202-514-2000Have a question about Government Services?"
   },
   {
      "time": "2022-10-04",
      "title": "CISA Warns of Attacks Exploiting Recent Atlassian Bitbucket Vulnerability - SecurityWeek",
      "text": " Hi, what are you looking for?The United States Cybersecurity and Infrastructure Security Agency (CISA) is warning of the active exploitation of a recent Atlassian Bitbucket vulnerability and two Microsoft Exchange zero-days.Atlassian Bitbucket is a Git-based repository management solution that provides source code hosting and sharing capabilities.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-04",
      "title": "Russian Scam Industry Expands as a Result of Mobilization - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-04",
      "title": "Web browser app mode can be abused to make desktop phishing pages",
      "text": " A new phishing technique using Chrome's Application Mode feature allows threat actors to display local login forms that appear as desktop applications, making it easier to steal credentials.The Application Mode feature is available in all Chromium-based browsers, including Google Chrome, Microsoft Edge and the Brave Browser. It can generate realistic-looking login screens that are hard to differentiate from a legitimate login prompt.Because desktop applications are generally harder to spoof, users are less likely to treat them with the same caution they reserve for browser windows that are more widely abused for phishing.Chrome's application mode allows web developers to create web apps with a native desktop appearance suitable for ChromeOS or users who want to enjoy a clean, minimalist interface, like watching YouTube.The app mode allows websites to launch in a separate window that doesn't display a URL address bar, browser toolbars, etc., while the Windows Taskbar displays the website's favicon instead of Chrome's icon.This can allow threat actors to create fake desktop login forms, and if the user isn't knowingly launching these \"apps,\" it could lead to sneaky phishing attacks.To conduct an attack using the technique, threat actors must first convince a user to run a Windows shortcut that launches a phishing URL using Chromium's App Mode feature.However, installing malware is very noisy and can easily be detected by security software running on the machine. On the other hand, opening a browser to a new phishing URL will less likely be detected.With Microsoft Edge now installed in Windows 10 and later by default, it is easier to conduct these attacks, as threat actors can simply distribute Windows shortcut files that launch Microsoft Edge.As mr.d0x explains in his post, using the following commands, a malicious attacker could create shortcuts that launch a phishing \"applet\" on the target's computer.Although this would require access to the target's machine, which is a strong prerequisite, this isn't the only way to abuse Chrome's app mode.Alternatively, the attacker can use a portable HTML file to launch the attack, embedding the \"-app\" parameter to point to a phishing site and distribute the files to targets.The researcher also claims it's possible to launch the attack on macOS and Linux using the appropriate commands for these operating systems.The phishing window can also receive action commands via JavaScript, like closing after the user enters their login credentials, accepting window resize requests, or rendering on a specific position on the screen.The attack's potential is limited due to the requirement that Chromium app mode is launched locally on a device. This local access means that there is already some degree of compromise of the device.However, once threat actors trick a target into launching a Windows shortcut, the potential for advanced phishing attacks is only limited by an attacker's creativity.Update 10/6/22: Google shared the following statement regarding using the Chromium Application Mode feature for phishing attacks:"
   },
   {
      "time": "2022-10-04",
      "title": "Russian retail chain 'DNS' confirms hack after data leaked online",
      "text": " Russian retail chain 'DNS' (Digital Network System) disclosed yesterday that they suffered a data breach that exposed the personal information of customers and employees.DNS is Russia's second-largest computer and home appliance store chain, with 2,000 branches and 35,000 employees.According to the scant details provided in the announcement, a group of hackers residing outside the Russian Federation exploited a security gap in the company's IT systems and accessed customer and employee details.While the firm has not provided details on what information was compromised, it clarified that the hackers didn't steal user passwords and payment card data, as that data isn't stored on their systems.DNS' disclosure of a security breach comes hours after a threat actor began leaking the company's data on a hacking forum, allegedly stolen by a hacking group known as 'NLB Team.'The data was allegedly stolen on September 19 and contains full names, usernames, email addresses, and phone numbers of DNS customers and employees for 16 million people.According to SimilarWeb data, DNS-shop.ru receives approximately 81.3 million visits per month, being in the top 30 most visited sites in the country, so the alleged number of impacted individuals seems plausible.Neither the volume of the stolen data nor the type of the information has been officially confirmed.It is worth noting that the same person leaking DNS' data had previously offered databases belonging to other Russian organizations, \"Cherlock.ru,\" a legal information portal, and \"CDEK.market,\" a consumer goods e-commerce platform.The attack against DNS is allegedly the work of pro-Ukrainian hackers, but new reports have surfaced over the weekend that put a new threat in the frame for Russian sites.Their first high-profile victim is allegedly \"Unisoftware,\" a software development firm that works closely with the Russian government, the Central Bank, and the federal tax service.Reportedly, the attack involved the deployment of a ransomware strain to cause damage, while the group also shared some screenshots with the publication as evidence of their access."
   },
   {
      "time": "2022-10-04",
      "title": "North Korean Hackers Exploit Dell Driver Vulnerability to Disable Windows Security - SecurityWeek",
      "text": " Hi, what are you looking for?North Korean state-sponsored hacking group Lazarus was seen exploiting a Dell DBUtil driver vulnerability to disable the security mechanisms on the targeted Windows machines.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-04",
      "title": "Optus Hack Exposes Data of Nearly 2.1 Million Australian Telecom Customers",
      "text": " Optus is fully owned by Singaporean telecommunications conglomerate Singtel, which also has a significant stake in Bharti Airtel, the second largest carrier in India.It also said the breach affected expired IDs and personal information of about 900,000 additional customers. It further emphasized that the exposed data did not contain valid or current document ID numbers for some 7.7 million customers.The leaked data is said to contain email addresses, phone numbers, and dates of births, necessitating that customers remain cautious about potential phishing and smishing attacks.Of the 9.8 million customer records exposed, 14,900 valid Medicare IDs and 22,000 expired Medicare card numbers are estimated to have been exposed, Optus previously disclosed on September 28.The security incident, which came to light on September 22, involved a malicious actor gaining unauthorized access to customer information. It's not immediately clear how and when the actual intrusion took place.The attacker, using the alias \"optusdata,\" subsequently published a published a small sample of the stolen data belonging to 10,200 users and demanded that Optus pay a $1 million ransom to avoid more leaks.The self-identified hacker has since withdrawn the extortion demand while apologizing for the crime and claiming that the \"only copy\" of stolen data had been destroyed, citing increased public attention.The latter, called Operation Guardian, offers \"multi-jurisdictional and multi-layered protection from identity crime and financial fraud,\" with the agency stating the impacted users had 100 points of identification released online.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]