[
   {
      "time": "2022-08-29",
      "title": "LockBit ransomware gang gets aggressive with triple-extortion tactic",
      "text": " LockBit ransomware gang announced that it is improving defenses against distributed denial-of-service (DDoS) attacks and working to take the operation to triple extortion level.The gang has recently suffered a DDoS attack, allegedly on behalf of digital security giant Entrust, that prevented access to data published on its corporate leaks site.Earlier this week, LockBitSupp, the public-facing figure of the LockBit ransomware operation, announced that the group is back in business with a larger infrastructure to give access to leaks unfazed by DDoS attacks.The DDoS attack last weekend that put a temporary stop to leaking Entrust data was seen as an opportunity to explore the triple extortion tactic to apply more pressure on victims to pay a ransom.LockBitSupp said that the ransomware operator is now looking to add DDoS as an extortion tactic on top of encrypting data and leaking it.“I am looking for dudosers [DDoSers] in the team, most likely now we will attack targets and provide triple extortion, encryption + date leak + dudos, because I have felt the power of dudos and how it invigorates and makes life more interesting,” LockBitSupp wrote in a post on a hacker forum.The gang also promised to share over torrent 300GB of data stolen from Entrust so “the whole world will know your secrets.”LockBit’s spokesperson said that they would share the Entrust data leak privately with anyone that contacts them before making it available over torrent.It appears that LockBit has kept its promise and released this weekend a torrent called “entrust.com” with 343GB of files.The operators wanted to make sure that Entrust's data is available from multiple sources and, besides publishing it on their site, they also shared the torrent over at least two file storage services, with one of them no longer making it available.One method already implemented to prevent further DDoS attacks is to use unique links in the ransom notes for the victims.“The function of randomization of links in the notes of the locker has already been implemented, each build of the locker will have a unique link that the dudoser [DDoSer] will not be able to recognize,” LockBitSupp posted.They also announced an increase in the number of mirrors and duplicate servers, and a plan to increase the availability of stolen data by making it accessible over clearnet, too, via a bulletproof storage service.After publishing this article, BleepingComputer learned that LockBit has made the stolen Entrust data available over clearnet, on a website that provides files for a limited period.LockBit ransomware operation has been active for almost three years, since September 2019. At the time of writing, LockBit’s data leak site is up and running.The gang is listing more than 700 victims and Entrust is one of them, with data for the company leaked on August 27.Update [August 29, 09:12]: Article updated with info on Entrust data being shared over clearnet."
   },
   {
      "time": "2022-08-29",
      "title": "Most top mobile carriers retain geolocation data for two years on average, FCC findings show | CyberScoop",
      "text": " \n\nAugust 26, 2022\n\nTen of the top 15 mobile carriers collect geolocation data and provide no way for consumers to opt-out, according to information from the telecom companies the Federal Communications Commission published Thursday.AT&T, Best Buy Health, Charter, Comcast, Consumer Cellular, C-Spire, DISH Network, Google FI, H2O Wireless, Lycramobile, Mint Mobile, Red Pocket, T-Mobile, U.S. Cellular and Verizon responded to the FCC inquiry. “Our mobile phones know a lot about us. That means carriers know who we are, who we call,and where we are at any given moment,” said FCC chairwoman Jessica Rosenworcel. “This information and geolocation data is really sensitive. It’s a record of where we’ve been and who we are. That’s why the FCC is taking steps to ensure this data is protected.”In their responses, companies generally cited the need to comply with law enforcement requests as well as FCC rules as their reason for being unable to allow consumers to opt-out of collection and retention. The responses also provided a window into data retention practices, which ranged from two months to five years for cellular tower data for the responding companies. Only seven of the companies explicitly mentioned protecting that data with encryption.Geolocation data offers a detailed window in the lives of users, including everything from where they shop to what medical providers they seek out. The agency isn’t relying on the carriers’ responses, however. Rosenworcel tasked the agency’s Enforcement Bureau with a follow-up investigation into making sure carriers follow the FCC rules that require them to disclose how they are using and sharing geolocation data.Justin Brookman, director of technology policy at Consumer Reports, said the order is an “appropriate step” but consumers still need more protections.“I’m glad that there’s some more transparency now but that transparency only goes so far,” said Brookman. “I think the next step is the FCC needs to say when is holding on too long, when are the secondary uses to which they’re using the data too much?”Carriers have misled consumers about how they use their geolocation data before. In 2020, the FCC proposed more than $200 million in fines against several major carriers for selling customer location data to bail bond companies and other third parties. "
   },
   {
      "time": "2022-08-29",
      "title": "Fake 'Cthulhu World' P2E project used to push info-stealing malware",
      "text": " Hackers have created a fake 'Cthulhu World' play-to-earn community, including websites, Discord groups, social accounts, and a Medium developer site, to distribute the Raccoon Stealer, AsyncRAT, and RedLine password-stealing malware infections on unsuspecting victims.As play-to-earn games rise in popularity, scammers and threat actors increasingly target these new platforms for malicious activities.When visiting the cthulhu-world.com site, which is now down, users are greeted with a well-designed website, containing information about the project and an interactive map of the game's environments.The Cthulhu World website also has a big difference; when a user clicks on the arrow in the upper right-hand corner of the site, the visitor will bring them to a webpage asking for a code to download the \"alpha\" test of the project.The threat actors share these codes with prospective victims as part of their DM conversations on Twitter. A list of the access codes is also found in the site's source code, as shown below.Depending on the code entered, one of three files will be downloaded from DropBox.The website for Cthulhu World is currently down, but their Discord remains active. It is unclear who on this Discord is aware that the site is distributing malware, but some users clearly believe this is a legitimate project.If you have visited Cthulhu-world.com and downloaded any of their software, you should immediately run an antivirus scan on your computer and remove anything detected.Furthermore, as these malware infections steal your saved passwords, cookies, and crypto wallets, you should reset all passwords and create new wallets to import your cryptocurrency.Ultimately, though, the wisest course of action is to reinstall your computer from scratch, as these malware infections provide full access to an infected computer, and other undetected malware may still be installed."
   },
   {
      "time": "2022-08-29",
      "title": "Montenegro Reports Massive Russian Cyberattack Against Govt - SecurityWeek",
      "text": " Hi, what are you looking for?Montenegro’s security agency warned Friday that hackers from Russia have launched a massive, coordinated cyberattack against the small nation’s government and its services.ByFlipboardRedditWhatsappWhatsappEmailSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailWASHINGTON - Cyberattacks are the most serious threat facing the United States, even more so than terrorism, according to American defense experts. Almost half...Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.Russian espionage group Nomadic Octopus infiltrated a Tajikistani telecoms provider to spy on 18 entities, including government officials and public service infrastructures.On the first anniversary of Russia’s invasion of Ukraine, cybersecurity companies summarize the cyber operations they have seen and their impact.Websites of German airports, administration bodies and banks were hit by DDoS attacks attributed to Russian hacker group KillnetSeveral hacker groups have joined in on the Israel-Hamas war that started over the weekend after the militant group launched a major attack.Ask any three people to define cyberwar and you will get three different answers. But as global geopolitics worsen and aggressive cyberattacks increase, this...The war in Ukraine is the first major conflagration between two technologically advanced powers in the age of cyber. It prompts us to question...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-08-29",
      "title": "DoorDash discloses new data breach tied to Twilio hackers",
      "text": " Food delivery firm DoorDash has disclosed a data breach exposing customer and employee data that is linked to the recent cyberattack on Twilio.In a security advisory released Thursday afternoon, DoorDash says that a threat actor gained access to the company's internal tools using stolen credentials from a third-party vendor that had access to their systems.\"DoorDash recently detected unusual and suspicious activity from a third-party vendor's computer network. In response, we swiftly disabled the vendor's access to our system and contained the incident,\" explains the DoorDash security notice.The hacker used this access to DoorDash's internal tools to access data for both consumers and employees.The exposed information includes the names, email addresses, delivery addresses, and phone numbers of consumers. In addition, for a small subset of customers, the hackers accessed basic order information and partial credit card information, including the card type and the last four digits of the card number.For employees of the company, known as Dashers, the hackers may have accessed names, phone numbers, and email addresses.Using this access, the threat actors could access the data of 163 Twilio customers and use that data in further supply-chain attacks.The campaign was discovered by cybersecurity firm Group-IB, which said that the threat actors breached over 130 organizations worldwide using an SMS phishing campaign.These SMS phishing texts utilized phishing domains containing the keywords \"OKTA,\" \"HELP,\" \"VPN,\" and \"SSO\" and told targets to click on a link to update their password or access other information.Other companies targeted in the attack include Coinbase, KuCoin, Binance, Microsoft, Telus, Verizon Wireless, T-Mobile, AT&T, Sprint, Rogers, Mailgun, Slack, Box, SendGrid, Yahoo, Sykes, BestBuy, and Infosys.However, none of these other companies have disclosed whether the attacks were successful.8/26/22 update: Story updated to clarify that the DoorDash breach was conducted by the same hackers as Twilio but not through Twilio"
   },
   {
      "time": "2022-08-29",
      "title": "Microsoft Alert: APT29 is Back With its New Tool MagicWeb - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " The attackers behind the Solar Winds supply chain attack APT29 are back and have included a latest weapon to their attack inventory. Known as MagicWeb, a post compromise capability, it is used to keep continuous access to breached environments and moves laterally. Experts at Microsoft noticed the Russia-backed Nobelium APT using the backdoor after gaining administrative rights to an Active Directory Federated Services (AD FS) server. With the help of privileged access, the hackers change a genuine DLL with the malicious MagicWeb DLL, to load the malware with AD FS and make it look legitimate. Similar to domain controllers, AD FS servers can verify users. MagicWeb enables this on the behalf of hackers by letting the manipulation of the claims that pass through verification tokens generated by an AD FS server, therefore, they can verify as any user on the system. As per Microsoft, MagicWeb is a better version of the earlier used FoggyWeb tool, which also makes a steady foothold inside the target networks. Researchers at Microsoft say that MagicWeb goes beyond the collection capabilities of FoggyWeb by facilitating covert access directly. It manipulates the user authentication certificates used for authentication, not the signing certificates used in attacks like Golden SAML.In the report, Microsoft mentioned that the hackers are targeting corporate networks with the latest verification technique MagicWeb. It is highly sophisticated and allows hackers to take control of the victim's network even after the defender tries to eject them. We should also note that the hackers are not depending on supply chain attacks, this time, they are exploiting admin credentials to execute MagicWeb. The backdoor secretly adds advanced access capability so that the threat actors can execute different exploits other than stealing data. For example, the threat actor can log in to the device's Active Director as any user. A lot of cybersecurity agencies have found sophisticated tools, this includes backdoors used by SolarWinds' hackers, among which MagicWeb is the latest one discovered and identified by Microsoft. To stay safe from such attacks Microsoft recommends \"practicing credential hygiene is critical for protecting and preventing the exposure of highly privileged administrator accounts. This especially applies on more easily compromised systems like workstations with controls like logon restrictions and preventing lateral movement to these systems with controls like the Windows Firewall.\"your nameYour Emailyour message"
   },
   {
      "time": "2022-08-29",
      "title": "Austria: Google Breached a EU Court Order  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-08-29",
      "title": "Atlassian Bitbucket Server vulnerable to critical RCE vulnerability",
      "text": " Atlassian has published a security advisory warning Bitbucket Server and Data Center users of a critical security flaw that attackers could leverage to execute arbitrary code on vulnerable instances.Bitbucket is a Git-based code hosting, management, and collaboration tool, with Jira and Trello integration.The vulnerability impacts all Bitbucket Server and Data Center versions after 6.10.17, including 7.0.0 and up to 8.3.0.The versions that address the problem are 7.6.17, 7.17.10, 7.21.4, 8.0.3, 8.1.3, 8.2.2, and 8.3.1. Unfortunately, older and unsupported versions of the 6.x branch will not receive a fix for this flaw.Those unable to apply the security updates are advised to apply temporary partial mitigation by turning off public repositories using “feature.public.access=false”.This way, the instances won’t be accessible to unauthorized users; however, authorized users, like threat actors who have compromised valid credentials, may still perform attacks.Atlassian notes that those accessing Bitbucket via bitbucket.org domains aren't impacted by the critical RCE, as the vendor hosts those instances.Yesterday, the young researcher promised on Twitter to release a proof-of-concept (PoC) exploit for the bug in 30 days, giving system admins a comfortable time margin to apply the available fixes.The release of the PoC is bound to cause a spike in active exploitation of the critical RCE flaw by hackers, but there’s no guarantee this won’t happen sooner.Garrett told BleepingComputer that reverse engineering Atlassian's patch shouldn't be too difficult for skillful hackers.Remote code execution is the most potent of all vulnerability types, enabling attackers to do extensive damage while bypassing all security measures, so the motive is there.That said, Bitbucket Server and Data Center users are advised to apply the available security update or mitigations as soon as possible."
   },
   {
      "time": "2022-08-29",
      "title": "Critical command injection vulnerability discovered in Bitbucket Server and Data Center | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondUpdate now to protect against flawBitbucket is a Git-based source code repository hosting service owned by Atlassian.Read more of the latest news about security vulnerabilitiesThis vulnerability could allow remote attackers with read permissions to a public or private Bitbucket repository to execute arbitrary code by sending a malicious HTTP request.All versions of the Server and Data Center released after 6.10.17 are affected, meaning that all instances running any versions between 7.0.0 and 8.3.0 inclusive are vulnerable.Users are urged to update to the latest version. For those who cannot, Bitbucket has offered a workaround.Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   }
]