[
   {
      "time": "2022-08-11",
      "title": "Cyble — Bitter APT group using \"Dracarys\" Android Spyware",
      "text": " The Bitter APT is actively involved in both desktop and mobile malware campaigns and uses techniques like spear phishing emails, exploiting known vulnerabilities to deliver Remote Access Trojan (RAT) and other malware families.Dracarys Android Spyware impersonates genuine applications such as Signal, Telegram, WhatsApp, YouTube, and other chat applications and distributes through phishing sites.During analysis, we observed that one of the phishing sites is still live and distributing Dracarys. The phishing site mimics the genuine Signal site and delivers a trojanized Signal app.Upon in-depth analysis of the malware, we observed that the Threat Actor (TA) had inserted the malicious code into the Signal app source code to avoid being detected. The below image showcases the extra added spyware module “org.zcode.dracarys” in the trojanized version of the Signal App.   Figure 3 shows the metadata information of the application.  The malicious application mentions 24 permissions, of which the TA exploits 10. The harmful permissions requested by the malware are:  The trojanized version of the Signal application has registered the Accessibility Service in the Manifest file. The malware abuses the Accessibility permissionssuch as auto granting permission to run the application in the background, activating Device Admin, and performing auto clicks.The malware connects to the Firebase server and receives the commands to execute operations for collecting the data from the victim’s device, as shown in the below image.The malware collects all the contacts from the infected device and sends them to the Command and Control (C&C) server “hxxps://signal-premium-app[.]org“.Similarly, the malware collects SMS data, call logs, installed applications list, and files present on the infected device after receiving a command from the C&C server, as shown in Figures 7 through 10.The malware registers the “DracarysReceiver” broadcast receiver, which receives the event from the Firebase server and starts collecting Personal Identifiable Information (PII) data from the infected device, as shown below.The malware can capture screenshots and record audio to spy on the victim’s device. The below figure shows the code used by the malware to send captured screenshots and recordings to its C&C server.The image below shows the C&C server and the URL path to which the stolen data is sent.According to our research, the TA has injected malicious code into genuine messaging applications such as Signal. The TA also distributed the malware through a phishing site masquerading as a genuine website that tricks users into downloading a trojanized version of popular messaging applications.We have observed Bitter APT continuously attacking South Asian countries and changing its mode of attack with each new campaign. In this campaign, Bitter APT used a sophisticated phishing attack to infect devices with Dracarys Android Spyware.In the coming days, we may observe a change in the Bitter APT group’s activities, with different malware variants, enhanced techniques, and distribution modes.We have listed some essential cybersecurity best practices that create the first line of control against attackers. We recommend that our readers follow the best practices given below:   How to prevent malware infection? How to identify whether you are infected? What to do when you are infected? What to do in case of any fraudulent transaction? What should banks do to protect their customers? MITRE ATT&CK® Techniques \n\t\t\t\tCyble's research team has found an uptick in phishing campaigns targeting multiple organizations, including financial institutes, by abusing the ngrok platform, a secure and introspectable…\t\t\t\n\t\t\t\tTwo Android spyware strains named Hornbill and SunBird were recently discovered with possible connections to the advanced persistent threat (APT) group called Confucius. The group…\t\t\tComments are closed."
   },
   {
      "time": "2022-08-11",
      "title": "Andariel deploys DTrack and Maui ransomware | Securelist",
      "text": " Solutions for:ThreatsCategories09 Aug 2022\n  minute read\t\t\t\t\t\t\t\tTable of ContentsAuthorsWe extend their “first seen” date from the reported May 2021 to April 15th 2021, and the geolocation of the target, to Japan. Because the malware in this early incident was compiled on April 15th, 2021, and compilation dates are the same for all known samples, this incident is possibly the first ever involving the Maui ransomware.While CISA provides no useful information in its report to attribute the ransomware to a North Korean actor, we determined that approximately ten hours prior to deploying Maui to the initial target system, the group deployed a variant of the well-known DTrack malware to the target, preceded by 3proxy months earlier. This data point, along with others, should openly help solidify the attribution to the Korean-speaking APT Andariel, also known as Silent Chollima and Stonefly, with low to medium confidence.We observed the following timeline of detections from an initial target system:Once this malware is spawned, it executes an embedded shellcode, loading a final Windows in-memory payload. This malware is responsible for collecting victim information and sending it to the remote host. Its functionality is almost identical to previous DTrack modules. This malware collects information about the infected host via Windows commands. The in-memory payload executes the following Windows commands:\nIn addition, the malware collects browser history data, saving it to the browser.his file, just as the older variant did. Compared to the old version of DTrack, the new information-gathering module sends stolen information to a remote server over HTTP, and this variant copies stolen files to the remote host on the same network.The Maui ransomware was detected ten hours after the DTrack variant on the same server.Multiple run parameters exist for the Maui ransomware. In this incident, we observe the actors using “-t” and “- x” arguments, along with a specific drive path to encrypt:\nIn this case, “-t 8” sets the ransomware thread count to eight, “-x” commands the malware to “self melt”, and the “E:” value sets the path (the entire drive in this case) to be encrypted. The ransomware functionality is the same as described in the Stairwell report.The malware created two key files to implement file encryption:Pivoting on the exfiltration information to the adjacent hosts, we discovered additional victims in India. One of these hosts was initially compromised in February 2021. In all likelihood, Andariel stole elevated credentials to deploy this malware within the target organization, but this speculation is based on paths and other artifacts, and we do not have any further details.The primary objective of this malware is the same as in the case of the aforementioned victim in Japan, using different login credentials and local IP address to exfiltrate data.Windows commands to exfiltrate dataFrom the same victim, we discovered additional DTrack malware (MD5 87e3fc08c01841999a8ad8fe25f12fe4) using different login credentials.\nThe mini.ps1 script is responsible for downloading and executing the above DTrack malware via bitsadmin.exe:\nThe other victim operated a vulnerable Weblogic server. According to our telemetry, the actor compromised this server via the CVE-2017-10271 exploit. We saw Andariel abuse identical exploits and compromise WebLogic servers in mid-2019, and previously reported this activity to our Threat Intelligence customers. In this case, the exploited server executes the Powershell command to fetch the additional script. The fetched script is capable of downloading a Powershell script from the server we mentioned above (hxxp://145.232.235[.]222/usr/users/mini.ps1). Therefore, we can summarize that the actor abused vulnerable Internet-facing services to deploy their malware at least until the end of 2020.The July 2022 CISA alert noted that the healthcare and public health sectors had been targeted with the Maui ransomware within the US. However, based on our research, we believe this operation does not target specific industries and that its reach is global. We can confirm that the Japanese housing company was targeted with the Maui ransomware on April 15, 2021. Also, victims from India, Vietnam, and Russia were infected within a similar timeframe by the same DTrack malware as used in the Japanese Maui incident: from the end of 2020 to early 2021.According to the Kaspersky Threat Attribution Engine (KTAE), the DTrack malware from the victim contains a high degree of code similarity (84%) with previously known DTrack malware.Based on the modus operandi of this attack, we conclude that the actor’s TTPs behind the Maui ransomware incident is remarkably similar to past Andariel/Stonefly/Silent Chollima activity:AuthorsAndariel deploys DTrack and Maui ransomwareYour email address will not be published. Required fields are marked *Name * Email * ΔAkshat Pradhan another variant 865078d080e594d1fb5c6985e4100f38Table of ContentsGReAT webinarsFrom the same authorsThe hottest research right in your inboxΔIn the same categoryAsian APT groups target various organizations from a multitude of regions and industries. We created this report to provide the cybersecurity community with the best-prepared intelligence data to effectively counteract Asian APT groups.We unveil a Lazarus campaign exploiting security company products and examine its intricate connections with other campaignsHow Kaspersky researchers obtained all stages of the Operation Triangulation campaign targeting iPhones and iPads, including zero-day exploits, validators, TriangleDB implant and additional modules.Nobody would even suspect the mining malware was merely a mask, masquerading behind an intricate modular framework that supports both Linux and Windows.  The amount of effort that went into creating the framework is truly remarkable, and its disclosure was quite astonishing.The hottest research right in your inboxΔThreatsCategories© 2023 AO Kaspersky Lab. All Rights Reserved.\nRegistered trademarks and service marks are the property of their respective owners.The hottest research right in your inboxΔ"
   },
   {
      "time": "2022-08-11",
      "title": "Intel Patches Severe Vulnerabilities in Firmware, Management Software - SecurityWeek",
      "text": " Hi, what are you looking for?Intel on Tuesday published 27 security advisories detailing roughly 60 vulnerabilities across firmware, software libraries, and endpoint and data center management products.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-08-11",
      "title": "New dark web markets claim association with criminal cartels",
      "text": " Several new marketplaces have appeared on the dark web, claiming to be the dedicated online portals for notorious criminal cartels from Mexico.Those markets offer drugs and hitman services just like they would in the real world and attempt to add legitimacy to their listed goods by alleging to be backed by “experienced” actors in their respective fields.The emergence of these markets was spotted by DarkOwl analysts, who identified a trend, shifting from large markets that drew law enforcement attention to smaller, less publicized sites.Some of the sites mentioned below were recently refreshed with new features and a user-friendly interface, trying to draw an audience interested in illicit offerings.Anything can be faked on the darknet, so all of the above marketplaces could easily be fakes created to increase their 'authenticity,' while scamming people and stealing their money for orders that are never fulfilled.Also, there have been multiple occasions of hitman services offered by law enforcement agencies on the dark web as part of honeypot operations to catch interested buyers.Many of these markets have been around since 2020 but have seen a sudden spike in activity lately due to the closure of large decentralized drug-focused markets where these alleged cartel site operators claimed to be successful vendors.Regardless of the authenticity of those novel or recently-awoken cartel markets, their new status on the dark web indicates a shift in the dynamics of the space, with larger markets closing down and being replaced by smaller, niche shops."
   },
   {
      "time": "2022-08-11",
      "title": "Automotive supplier breached by 3 ransomware gangs in 2 weeks",
      "text": " An automotive supplier had its systems breached and files encrypted by three different ransomware gangs over two weeks in May, two of the attacks happening within just two hours.The attacks followed an initial breach of the company's systems by a likely initial access broker (IAB) in December 2021, who exploited a firewall misconfiguration to breach the domain controller server using a Remote Desktop Protocol (RDP) connection.After the initial compromise, LockBit, Hive, and ALPHV/BlackCat affiliates also gained access to the victim's network on April 20, May 1, and May 15, respectively.On May 1, LockBit and Hive ransomware payloads were distributed across the network using the legitimate PsExec and PDQ Deploy tools within two hours to encrypt more than a dozen systems during each attack (the LockBit affiliate also stole data and exfiltrated it to the Mega cloud storage service.Two weeks later, on May 15, while the automotive supplier's IT team was still restoring systems, a BlackCat threat actor also connected to the same management server compromised by LockBit and Hive.After installing the legitimate Atera Agent remote access solution, they gained persistence on the network and exfiltrated stolen data.Within half an hour, the BlackCat affiliate delivered its own ransomware payloads on the network using PsExec to encrypt six machines after moving laterally through the network using compromised credentials.By deleting shadow copies and clearing out the Windows Event Logs on the compromised systems, this last attacker also complicated recovery attempts and the Sophos team's incident response efforts.The BlackCat affiliate erased evidence that Sophos could've used to retrace the three ransomware gangs' activity while in the victim's network.Sophos' incident responders assisting the victim with the attack investigation in mid-May found files encrypted three times with Lockbit, Hive, and BlackCat ransomware, as well as three different ransom notes on encrypted systems.\"In fact, as shown in the screenshot below, some files had even been encrypted five times,\" the Sophos team said.\"Because the Hive attack started 2 hours after Lockbit, the Lockbit ransomware was still running – so both groups kept finding files without the extension signifying that they were encrypted.\"Sophos also published a whitepaper sharing guidance on defending against similar attacks from multiple ransomware gangs.Organizations are advised to keep their systems up to date and investigate their environments for backdoors or vulnerabilities introduced by threat actors as a failsafe to regain access to the network if they are evicted.Sophos also recommends locking down services like VNC and RDP or remote access solutions accessible from the outside. They should be reachable via VPN and only via accounts with enforced multi-factor authentication (MFA) and strong passwords if remote access is needed.Networks should also be segmented by separating critical servers into VLANs, and the entire network should be scanned and audited for unpatched and vulnerable devices."
   },
   {
      "time": "2022-08-11",
      "title": "SCOOP: ista International takes systems offline in wake of ransomware attack; Daixin Team claims thousands of servers encrypted",
      "text": " The Office of Inadequate SecurityWe see the future of our success in the Internet of Things (IoT). Very soon billions of devices will talk directly to each other. This communication will largely take place in and around buildings. With our digital infrastructure, we are in an excellent position to support property owners and residents with smart and intelligent solutions. Today, we already have 400,000 gateways in use for our customers that link over 25 million connected devices to each other.Recently, though, ista fell prey to an attack by Daixin Team.  A notice now appears on their homepage:A detailed message and FAQ appear on their website. The notice begins:Dear ista customers, \ncurrently, ista’s IT-System have been the victim of an external cyber-attack. As an immediate measure and to help prevent damage to our IT infrastructure, all potentially affected IT systems of the company have been taken offline. As a result, you will temporarily be limited or unable to use certain functions and services. We are very sorry for the inconvenience that this may cause you and ask for your continued patience as we try to resolve the issue.We have informed the State Data Protection Authority and filed a report with the police. A specialist team of internal and external experts is currently conducting a thorough investigation of the incident and is working at full speed to remedy the disruption as quickly as possible. However, this may take some time.Yesterday, Daixin added ista’s name to their dark web leak site with three file lists. Today, they started leaking some of the data.In communications with DataBreaches, a spokesperson for Daixin wrote that in a matter of days, and from one unprivileged user access, Daixin easily obtained all the rights in the following domains: ROOT, DS, IT, PL, AT, ES, NL, BE, DEIn describing its company, ista writes, in part:With our digital infrastructure, we are in an excellent position to support property owners and residents with smart and intelligent solutions. Today, we already have 400,000 gateways in use for our customers that link over 25 million connected devices to each other.According to Daixin, they went through one of those gateways and took control of the entire system in two days.“We were not interested in users – we encrypted all servers,” their spokesperson wrote to DataBreaches, adding, “Encryption was a long process. We encrypted petabytes of data. (Servers and backups)We saw the panic of the administrators.They couldn’t log in and do something about it.All security features have been disabled, administrator accounts have been blocked.When asked, Daixin’s spokesperson estimated that more than three thousand of ista’s servers have been fully encrypted.“Maybe more, we went offline but the encryption continued,” they added.DataBreaches also inquired whether ista had attempted to negotiate any ransom at all.  It seems they had, but their offer was unacceptable to Daixin, who provided DataBreaches with a snippet from their chat on August 8:At this point, Daixin will continue to release more data, it seems.DataBreaches sent an inquiry to ista’s media relations email address, but no reply was immediately received. This site doesn’t accept sponsored posts and doesn’t respond to requests about them.Email:Signal: +1 516-776-7756© 2009 – 2023, DataBreaches.net and DataBreaches LLC. All rights reserved.“You translate “Nerd” into understandable “English” — Victor Gevers of GDI Foundation, talking about DataBreaches.net"
   },
   {
      "time": "2022-08-11",
      "title": "Cisco hacked by Yanluowang ransomware gang, 2.8GB allegedly stolen",
      "text": " August 14th, 2022 update below. This post was originally published on August 10th.Cisco confirmed today that the Yanluowang ransomware group breached its corporate network in late May and that the actor tried to extort them under the threat of leaking stolen files online.The company revealed that the attackers could only harvest and steal non-sensitive data from a Box folder linked to a compromised employee's account.\"Cisco experienced a security incident on our corporate network in late May 2022, and we immediately took action to contain and eradicate the bad actors,\" a Cisco spokesperson told BleepingComputer.\"Cisco did not identify any impact to our business as a result of this incident, including Cisco products or services, sensitive customer data or sensitive employee information, intellectual property, or supply chain operations.\"On August 10 the bad actors published a list of files from this security incident to the dark web. We have also implemented additional measures to safeguard our systems and are sharing technical details to help protect the wider security community.\"The Yanluowang threat actors gained access to Cisco's network using an employee's stolen credentials after hijacking the employee's personal Google account containing credentials synced from their browser.The attacker convinced the Cisco employee to accept multi-factor authentication (MFA) push notifications through MFA fatigue and a series of sophisticated voice phishing attacks initiated by the Yanluowang gang that impersonated trusted support organizations.MFA fatigue is an attack tactic where threat actors send a constant stream of multi-factor authentication requests to annoy a target in the hopes that they will finally accept one to stop them from being generated.The threat actors finally tricked the victim into accepting one of the MFA notifications and gained access to the VPN in the context of the targeted user.Once they gained a foothold on the company's corporate network, Yanluowang operators spread laterally to Citrix servers and domain controllers.\n\"They moved into the Citrix environment, compromising a series of Citrix servers and eventually obtained privileged access to domain controllers,\" Cisco Talos said.After gaining domain admin, they used enumeration tools like ntdsutil, adfind, and secretsdump to collect more information and installed a series of payloads onto compromised systems, including a backdoor malware. Ultimately, Cisco detected and evicted the attackers from its environment, but they continued trying to regain access over the following weeks.\"After obtaining initial access, the threat actor conducted a variety of activities to maintain access, minimize forensic artifacts, and increase their level of access to systems within the environment,\" Cisco Talos added.\"The threat actor was successfully removed from the environment and displayed persistence, repeatedly attempting to regain access in the weeks following the attack; however, these attempts were unsuccessful.\"To help network admins and security professionals detect the malware used in the attack, Cisco created two new ClamAV detections for the backdoor and a Windows exploit used for privilege elevation.While Cisco provided some information on the backdoor and how it was used to remotely execute commands, their writeup does not mention any info on the exploit executable that was discovered.While the threat actor attempted to use this exploit to raise privileges on Cisco's network, the company told BleepingComputer that the attempts were unsuccessful.Last week, the threat actor behind the Cisco hack emailed BleepingComputer a directory listing of files allegedly stolen during the attack.The threat actor claimed to have stolen 2.75GB of data, consisting of approximately 3,100 files. Many of these files are non-disclosure agreements, data dumps, and engineering drawings.The threat actors also sent a redacted NDA document stolen in the attack to BleepingComputer as proof of the attack and a \"hint\" that they breached Cisco’s network and exfiltrated files.Cisco also said that, even though the Yanluowang gang is known for encrypting their victims' files, it found no evidence of ransomware payloads during the attack.\"We assess with moderate to high confidence that this attack was conducted by an adversary that has been previously identified as an initial access broker (IAB) with ties to the UNC2447 cybercrime gang, Lapsus$ threat actor group, and Yanluowang ransomware operators.\"August 14th updateAfter publishing this story, the threat actor behind the breach told BleepingComputer that they stole source code during the cyberattack.As proof, the hackers shared a screenshot of a VMware vCenter administrator console at a cisco.com URL. This vCenter dash shows numerous virtual machines, including one named as a GitLab server used by Cisco's CSIRT.However, Cisco states that they have no evidence that source code was stolen during the attack.\"We have no evidence to suggest the actor accessed Cisco product source code or any substantial access beyond what we have already publicly disclosed,\" Cisco told BleepingComputer.Update: Added more info about Yanluowang activity within Cisco's corporate network.Update 8/11/22: Added info on ClamAV detections and exploit executable used in attack.Update 8/14/22: Added info about threat actor's claims of stealing source code and more info about Yanluowang."
   },
   {
      "time": "2022-08-11",
      "title": "Sierra Leone internet cut amid anti-government protests",
      "text": " The West African nation of Sierra Leone experienced a near-total internet blackout on Wednesday, in the midst of anti-government protests sparked by the rising cost of living. Internet governance watchdog NetBlocks found that, beginning at noon local time, “national connectivity” fell to about 5% of its normal level, with multiple mobile and fixed-line Internet operators going dark. Isik Mater, Netblocks’ director of research, said connectivity was “largely restored” after approximately two hours, but service remains “somewhat impacted.” According to Mater, the disruption affected providers routed through Sierra Leone Cable, which “controls the country’s internet gateway.” “Authorities announced a nationwide curfew just as service was restored, alleging an attempt by protesters to ‘overthrow’ the government, having raised concerns over content being shared online,” Mater said. James Reddick has worked as a journalist around the world, including in Lebanon and in Cambodia, where he was Deputy Managing Editor of The Phnom Penh Post. He is also a radio and podcast producer for outlets like Snap Judgment.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-11",
      "title": "Phishing attack abuses Microsoft Azure, Google Sites to steal crypto",
      "text": " A new large-scale phishing campaign targeting Coinbase, MetaMask, Kraken, and Gemini users is abusing Google Sites and Microsoft Azure Web App to create fraudulent sites.These phishing pages are promoted through comments posted to legitimate sites by a network of bots controlled by the threat actors. Posting links to phishing pages on various legitimate sites aims to increase traffic and boost the malicious site's search engine rankings.Furthermore, because the phishing sites are hosted in Microsoft and Google services, they aren't flagged by automated moderator systems, allowing promotional messages to stay in the comment section for longer.The new campaign was spotted by analysts at Netskope, who noted that this tactic has allowed some of the fraudulent sites to appear as the first result in Google Search.Even worse, as shown below, Google has also included the phishing pages as featured snippets, giving them the highest exposure possible in the search results.Google Sites is a free web page creation tool, part of Google's online service suite, allowing users to create websites and host them on Google Cloud or other providers.Similarly, Microsoft's Azure Web Apps is a platform helping users create, deploy, and manage web applications and websites.Both services are trusted by internet security tools, offer competitive pricing and high availability, so they are a good option for creating phishing pages.The  sites are just landing pages, and their visitors are redirected to the actual phishing sites when they click on the \"login\" buttons.The phishing campaign is currently attempting to steal MetaMask wallets and credentials for crypto exchanges, such as CoinBase, Kraken, and Gemini.The MetaMask phishing site attempts to steal the user's password and wallet's secret recovery phrase (seed phrase). This information allows the threat actor to import the wallet on their own devices and drain the contents.For the crypto exchange phishing pages, the threat actors attempt to steal their login credentials.In all four cases, users who enter their credentials are redirected to a fake 2FA (two-factor authentication) page that requests the victim to provide their phone number.After entering the code, the websites generate a fake error alleging unauthorized activity and authentication problems, prompting the victim to click on an \"Ask Expert\" button.This takes the victims to an online chat page where a scammer pretending to be a customer support agent promises to solve the problem by directing the victim to install the TeamViewer remote access tool.The remote access is likely to allow the threat actors to retrieve the multi-factor authentication codes required to log in to the exchanges with the stolen credentials.When attempting to log in to a crypto exchange, always make sure you are on the platform's official website and not on a clone.Users of locally installed cryptocurrency wallets, such as MetaMask, Phantom, and TrustWallet, should never share their recovery phrase on any website, regardless of the reason.It is also important to remember that Google Ads can be abused, and Google Search SEO can be manipulated, so the ranking of the results shouldn't be seen as a guarantee of safety.Finally, protect your cryptocurrency exchange accounts with MFA and keep most of your crypto investments on cold wallets that are much more challenging to hack."
   },
   {
      "time": "2022-08-11",
      "title": "https://twitter.com/vxunderground/status/1557401735383097347/photo/1",
      "text": " "
   },
   {
      "time": "2022-08-11",
      "title": "Google now blocks Workspace account hijacking attempts automatically",
      "text": " Google Workspace (formerly G Suite) now has stronger protections for risky account actions, automatically blocking hijacking attempts with identity verification prompts and logging them for further investigation.This added layer of security will block threat actors who gain access to a user's account to protect personal data and sensitive information belonging to their organization.The enhanced account protection capabilities are available to all Google Workspace customers, including legacy G Suite Basic and Business customers.\"Google will evaluate the session attempting the action, and if it's deemed risky, it will be challenged with a 'Verify it's You' prompt,\" Google said.\"Through a second and trusted factor, such as a 2-step verification code, users can confirm the validity of the action.\"For instance, this new feature would block sensitive actions such as attempts to change the account's name until \"the true account owner can verify that this was intentional.\"Google added that admins could also temporarily disable login challenges triggered on sensitive account actions for users who can't get past the verification prompts.\"We strongly recommend only using this option if contact with the user is credibly established, such as via a video call.\""
   },
   {
      "time": "2022-08-11",
      "title": "A New SolidBit Ransomware Variant Hit Famous Games  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   }
]