[
   {
      "time": "2022-11-10",
      "title": "Patch ASAP: Critical Citrix, VMware Bugs Threaten Remote Workspaces With Takeover",
      "text": " Critical authentication-bypass vulnerabilities in Citrix and VMware offerings are threatening devices running remote workspaces with complete takeover, the vendors warned this week.Citrix also noted in the advisory that its Application Delivery Controller (ADC) product, which is used to provide admin visibility into applications across multiple cloud instances, is vulnerable to remote desktop takeover (CVE-2022-27513, CVSS 8.3), and brute force protection bypass (CVE-2022-27516, CVSS 5.3).Tenable researcher Satnam Narang noted that Citrix Gateway and ADC, thanks to how many parts of an organization they provide entrée into, are always favorite targets for cybercriminals, so patching now is important.Users should update ASAP to Gateway versions 13.1-33.47, 13.0-88.12, and 12.1-65.21 to patch the latest issues.VMware meanwhile has reported three authentication-bypass bugs, all in its Workspace ONE Assist for Windows. The bugs (CVE-2022-31685, CVE-2022-31686, and CVE-2022-31687, all with CVSS 9.8) allow both local and remote attackers to gain administrative access privileges without the need to authenticate, giving them full run of targeted devices.Workspace ONE Assist is a remote desktop product that's mainly used by tech support to troubleshoot and fix IT issues for employees from afar; as such, it operates with the highest levels of privilege, potentially giving remote attackers an ideal initial access target and pivot point to other corporate resources.Users should update to version 22.10 of Workspace ONE Assist to patch all of the most recently disclosed problems.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-11-10",
      "title": "Cloud9 Malware Offers a Paradise of Cyberattack Methods",
      "text": " A malicious browser extension that works on both Google Chrome and Microsoft Edge allows attackers to remotely take over someone's browser session and carry out a full range of attacks. It's built to steal cookies and other info, mine cryptocurrency, install malware, or take over the entire device for use in a distributed denial-of-service (DDoS) attack — among other things.The malware is comprised of three JavaScript files and has been active since as far back as 2017, with an update in 2020 that proliferated as a single JavaScript that can be included on any website using script tags, researchers said.\"As it is quite trivial to use and available for free, it can be used by many malware groups or individuals for specific purposes,\" Zimperium zLabs malware analyst Nipun Gupta wrote in the post. \nThe malware offers a veritable buffet of nefarious activity, \"purposefully designed to target all kinds of users and serves its purpose of retrieving user information,\" Gupta wrote. This includes enterprise users, where the botnet can be used to infiltrate a user's machine to propagate further malicious activity.That said, \"the Cloud9 malware does not target any specific group, meaning it is as much an enterprise threat as it is a consumer threat,\" Gupta wrote. \"It is quite clear that this malware group is targeting all browsers and operating systems and thus trying to increase their attack surface.\"Core capabilities of Cloud9 include: the ability to send GET/POST requests, which can be used to fetch malicious resources; cookie stealing to compromise user sessions; keylogging for nabbing passwords and other info; and the ability to launch a Layer 4/Layer 7 hybrid attack, which can be used to perform DDoS attacks from victims' machines.Cloud9 also can detect a user's OS and/or browser to deliver next-stage payloads; inject ads by opening 'pop-unders'; execute JavaScript code from other sources for further malicious code delivery; silently load web pages for ad or malicious-code injection; mine cryptocurrency using the browser or the victim's device resources; or send a browser exploit to inject malicious code and take complete control of the device.Researchers walked through an example of a Cloud9 attack on a Chrome browser, outlining several steps that ultimately perform a slew of nefarious tasks — including mining cryptocurrency from a victim's machine, stealing cookies and clipboard data, and even using exploits to \"escape\" the browser and execute malware on the victim's device.The main functionality of the extension is available in a file named campaign.js, JavaScript that also can be used as a standalone and thus can redirect victims to a malicious website that contains the campaign.js script.The campaign.js starts by identifying the victim's OS and then injects a JavaScript file that mines cryptocurrency using the victim's computer resources, both diminishing the performance of the device while reducing hardware lifespan and increasing energy usage — \"which translates into a slow but steady monetary loss,\" Gupta noted.Cloud9 also can use its ability to send POST requests to any domain to carry out Layer 7 DDoS attacks if the attacker has a significant number of victims connected as botnets. In fact, true to its reputation, Keksec likely is selling the extension to provide a botnet service to perform DDoS, Gupta noted.Because of the broad capabilities of Cloud9 and the wide attack surface it can generate, enterprise customers should be on alert, researchers said. Indeed, traditional endpoint security solutions don't typically monitor this type of attack vector, which leaves browsers \"susceptible and vulnerable,\" Gupta observed. It's unclear how Cloud9 is being spread, but so far, Zimperium zLabs has seen no evidence of the malicious extension on the Google Play Store or any other legitimate mobile app shop. For this reason, enterprises should train users on the risks associated with browser extensions that they encounter outside of official repositories, he said. They also should consider what security controls they have in place for such risks in their security posture overall.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-11-10",
      "title": "Couple sentenced to prison for trying to sell nuclear warship secrets",
      "text": " A Navy nuclear engineer and his wife were sentenced to over 19 years and more than 21 years in prison for attempting to sell nuclear warship design secrets to what they believed was a foreign power agent. The two defendants, Jonathan and Diana Toebbe, however, tried selling restricted information (such as printouts, digital media files containing technical details, and operations manuals) to an undercover FBI agent.While working as a Navy nuclear engineer, Jonathan Toebbe had access to naval nuclear propulsion information, including military-sensitive design elements, performance characteristics, and other restricted data for nuclear-powered warship reactors.He served as a nuclear engineer assigned to the Naval Nuclear Propulsion Program of the Department of the Navy, which gave him access to restricted naval nuclear reactors data, given that he also held an active national security clearance through the U.S. Defense Department.\"Naval nuclear engineer Jonathan Toebbe was entrusted with our nation's critical secrets and, along with his wife Diana Toebbe, put the security of our country at risk for financial gain,\" said U.S. Attorney Cindy Chung on Wednesday.\"Their serious criminal conduct betrayed and endangered the Department of the Navy's loyal and selfless service members. The seriousness of the offense in this case cannot be overstated.\"The attempted exchange of restricted nuclear warship data began with a package sent to a foreign government on April 1, 2020, containing \"U.S. Navy documents, a letter containing instructions,\" and an SD card with contact instructions via an encrypted communication platform.In the following email exchanges between April and June 2021, the FBI convinced the defendant to deliver additional confidential U.S. Navy information to a \"dead drop\" location in Jefferson County, West Virginia, after agreeing to pay for it in Monero cryptocurrency.\"The samples will be encrypted using GnuPG symmetric encryption with a randomly generated passphrase,\" the defendant told the undercover agent via encrypted email. \"I am very aware of the risks of blockchain analysis of BitCoin and other cryptocurrencies, and believe Monero gives both us excellent deniability.\"Ironically, he also expressed concern in communications with the FBI that he might not be communicating with a foreign power agent before agreeing to deliver the encrypted documents at the dead drop location.\"I am sorry to be so stubborn and untrusting, but I can not agree to go to a location of your choosing. I must consider the possibility that I am communicating with an adversary who has intercepted my first message and is attempting to expose me,\" he said.\"Would not such an adversary wish me to go to a place of his choosing, knowing that an amateur will be unlikely to detect his surveillance? If you insist on my physically delivering the package, then it must be a place of my choosing.\"On June 26, 2021, Jonathan Toebbe placed an SD card concealed in half a peanut butter sandwich at a pre-arranged dead drop location, with his spouse acting as a lookout.They were both arrested after he delivered a third SD card at a pre-arranged \"dead drop\" at another location in West Virginia.\"If not for the remarkable efforts of FBI agents, the sensitive data stolen by Mr. Toebbe could have ended up in the hands of an adversary of the United States and put the safety of our military and our nation at risk,\" said U.S. Attorney William J. Ihlenfeld II.\"The Toebbes were willing to compromise the security of the nation by selling information related to naval nuclear propulsion systems, they are now being held accountable for their actions,\" FBI Special Agent in Charge Mike Nordwall added."
   },
   {
      "time": "2022-11-10",
      "title": "New StrelaStealer malware steals your Outlook, Thunderbird accounts",
      "text": " A new information-stealing malware named 'StrelaStealer' is actively stealing email account credentials from Outlook and Thunderbird, two widely used email clients.This behavior deviates from most info-stealers, which attempt to steal data from various data sources, including browsers, cryptocurrency wallet apps, cloud gaming apps, the clipboard, etc.StrelaStealer arrives on the victim's system via email attachments, currently ISO files with varying content.In one example, the ISO contains an executable ('msinfo32.exe') that sideloads the bundled malware via DLL order hijacking.In a more interesting case seen by the analysts, the ISO contains an LNK file ('Factura.lnk') and an HTML file ('x.html'). The x.html file is of particular interest because it is a polyglot file, which is a file that can be treated as different file formats depending on the application that opens it.In this case, x.html is both an HTML file and a DLL program that can load the StrelaStealer malware or display a decoy document in the default web browser.When the Fractura.lnk file is executed, it will execute x.html twice, first using rundll32.exe to run the embedded StrelaStealer DLL and another time as HTML to load the decoy document in the browser, as shown in the image below.Once the malware is loaded in memory, the default browser is opened to show the decoy to make the attack less suspicious.Upon execution, StrelaStealer searches the '%APPDATA%\\Thunderbird\\Profiles\\' directory for 'logins.json' (account and password) and 'key4.db' (password database) and exfiltrates their contents to the C2 server.For Outlook, StrelaStealer reads the Windows Registry to retrieve the software's key and then locates the 'IMAP User', 'IMAP Server', and 'IMAP Password' values.Finally, StrelaStealer validates that the C2 received the data by checking for a specific response and quits when it receives it. Otherwise, it enters a 1-second sleep and retries this data-theft routine.Since the malware is spread using Spanish-language lures and focuses on very specific software, it may be used in highly targeted attacks. However, DCSO CyTec couldn't determine more about its distribution."
   },
   {
      "time": "2022-11-10",
      "title": "15,000 sites hacked for massive Google SEO poisoning campaign",
      "text": " Hackers are conducting a massive black hat search engine optimization (SEO) campaign by compromising almost 15,000 websites to redirect visitors to fake Q&A discussion forums.The attacks were first spotted by Sucuri, who says that each compromised site contains approximately 20,000 files used as part of the search engine spam campaign, with most of the sites being WordPress.The researchers believe the threat actors' goal is to generate enough indexed pages to increase the fake Q&A sites' authority and thus rank better in search engines.The campaign likely primes these sites for future use as malware droppers or phishing sites, as even a short-term operation on the first page of Google Search, would result in many infections.An alternative scenario, based on the existence of an 'ads.txt' file on the landing sites, is that their owners want to drive more traffic to conduct ad fraud.In some cases, the attackers drop their own PHP files on the targeted site, using random or pseudo-legitimate file names like 'wp-logln.php'.The infected or injected files contain malicious code that checks if the website visitors are logged in to WordPress, and if they're not, redirects them to the https://ois.is/images/logo-6.png URL.However, browsers will not be sent an image from this URL but will instead have JavaScript loaded that redirects users to a Google search click URL that redirects users to the promoted Q&A site.Using a Google search click URL is likely to increase performance metrics on the URLs in the Google Index to make it appear as if the sites are popular, hoping to increase their ranking in the search results.Furthermore, redirecting through Google search click URLs makes the traffic look more legitimate, possibly bypassing some security software.The exclusion of logged-in users, as well as those standing at 'wp-login.php,' aims to avoid redirecting an administrator of the site, which would result in the raising of suspicion and the cleaning of the compromised site.The PNG image file uses the 'window.location.href' function to generate the Google Search redirection result to one of the following targeted domains:Most of these websites hide their servers behind Cloudflare, so Sucuri's analysts couldn't learn more about the campaign's operators.As all of the sites use similar website-building templates, and all appear to have been generated by automated tools, it is likely they all belong to the same threat actors.Sucuri couldn't identify how the threat actors breached the websites used for redirections. However, it likely happens by exploiting a vulnerable plugin or brute-forcing the WordPress admin password.Hence, the recommendation is to upgrade all WordPress plugins and website CMS to the latest version and activate two-factor authentication (2FA) on admin accounts."
   },
   {
      "time": "2022-11-10",
      "title": "Pentagon to Unveil Zero-Trust Cyber Strategy - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-11-10",
      "title": "Lenovo fixes flaws that can be used to disable UEFI Secure Boot",
      "text": " Lenovo has fixed two high-severity vulnerabilities impacting various ThinkBook, IdeaPad, and Yoga laptop models that could allow an attacker to deactivate UEFI Secure Boot.UEFI Secure Boot is a verification system that ensures no malicious code can be loaded and executed during the computer boot process.The problem arises from Lenovo mistakenly including an early development driver that could change secure boot settings from the OS in the final production versions.This means the vulnerabilities are not caused by a bug in the code but rather a practical error of including the incorrect driver on production devices.The presence of these drivers in multiple Lenovo products was discovered by ESET researchers, who reported it to the computer vendor.\"The affected drivers were meant to be used only during the manufacturing process but were mistakenly included in the production,\" explains the Twitter thread by ESET.The two flaws fixed by Lenovo via BIOS fix the following vulnerabilities:There's also a third flaw of similar nature, tracked as CVE-2022-3432, impacting only Ideapad Y700-14ISK. Lenovo will not address this vulnerability as the affected product has reached its end of life (EOL).The firmware versions that fix the vulnerabilities are mentioned under the CVE IDs, so make sure to upgrade to that version or later."
   },
   {
      "time": "2022-11-10",
      "title": "APT29 Exploited a Windows Feature to Compromise European Diplomatic Entity Network",
      "text": " The Russia-linked APT29 nation-state actor has been found leveraging a \"lesser-known\" Windows feature called Credential Roaming following a successful phishing attack against an unnamed European diplomatic entity.According to Microsoft, \"Credential Roaming is storing user credentials in the ms-PKI-DPAPIMasterKeys and ms-PKI-AccountCredentials attributes in the user object,\" with the latter described as a multi-valued LDAP property containing binary large objects (BLOBs) of encrypted credential objects.Investigating its inner workings further, Mandiant highlighted the discovery of an arbitrary file write vulnerability that could be weaponized by a threat actor to achieve remote code execution in the context of the logged-in victim.\"An attacker who successfully exploited the vulnerability could gain remote interactive logon rights to a machine where the victim's account would not normally hold such privilege,\" it noted.Mandiant said the research \"offers insight into why APT29 is actively querying the related LDAP attributes in Active Directory,\" urging organizations to apply the September 2022 patches to secure against the flaw.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-10",
      "title": "New IceXLoader Malware Loader Variant Infected Thousands of Victims Worldwide",
      "text": " An updated version of a malware loader codenamed IceXLoader is suspected of having compromised thousands of personal and enterprise Windows machines across the world.IceXLoader is a commodity malware that's sold for $118 on underground forums for a lifetime license. It's chiefly employed to download and execute additional malware on breached hosts.Version 3.3.3 of IceXLoader, like its predecessor, is written in Nim and is equipped to collect system metadata, all of which is exfiltrated to a remote attacker-controlled domain, while awaiting further commands issued by the server.The commands include the ability to restart and uninstall the malware loader and halt its execution. But its main feature is to download and execute next-stage malware on disk or filelessly in memory.Minerva Labs said a SQLite database file hosted in the command-and-control (C2) server is being continuously updated with information about thousands of victims, adding it's in the process of notifying impacted companies.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-10",
      "title": "Experts Warn of Browser Extensions Spying On Users via Cloud9 Chrome Botnet Network",
      "text": " The Keksec threat actor has been linked to a previously undocumented malware strain, which has been observed in the wild masquerading as an extension for Chromium-based web browsers to enslave compromised machines into a botnet.Called Cloud9 by security firm Zimperium, the malicious browser add-on comes with a wide range of features that enables it to siphon cookies, log keystrokes, inject arbitrary JavaScript code, mine crypto, and even enlist the host to carry out DDoS attacks.The JavaScript botnet isn't distributed via Chrome Web Store or Microsoft Edge Add-ons, but rather through fake executables and rogue websites disguised as Adobe Flash Player updates.Once installed, the extension is designed to inject a JavaScript file called \"campaign.js\" on all pages, meaning the malware could also operate as a standalone piece of code on any website, legitimate or otherwise, potentially leading to watering hole attacks.The JavaScript code takes responsibility for cryptojacking operations, abusing the victim's computing resources to illicitly mine cryptocurrencies, as well as inject a second script named \"cthulhu.js.\"The connection to Keksec comes from overlaps in the domains that were previously identified as used by the malware group.The fact that Cloud9 is JavaScript-based and is offered either for free or a small fee on hacker forums makes it possible for less-skilled cybercriminals to get easy access to low-cost options for launching attacks targeting different browsers and operating systems.\"Users should be trained on the risks associated with browser extensions outside of official repositories, and enterprises should consider what security controls they have in place for such risks,\" Gupta said.Update: Following the publication of the story, a Google spokesperson shared the below statement with The Hacker News -Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]