[
   {
      "time": "2022-10-25",
      "title": "Critical Flaws in Abode Home Security Kit Allow Hackers to Hijack, Disable Cameras - SecurityWeek",
      "text": " Hi, what are you looking for?Abode Systems has resolved multiple severe vulnerabilities in its home security kit, including critical issues that could allow attackers to execute commands with root privileges.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-25",
      "title": "Ransomware group claims attack on Wisconsin school district",
      "text": " A ransomware group took responsibility for a cyberattack on a school district in Wisconsin serving nearly 20,000 students. The Snatch ransomware group added the Kenosha Unified School District to its list of victims on Sunday morning but did not say how much data was stolen during the attack or what kind of files were taken.The school district said it notified staff and families that it “proactively took certain portions of its network offline after it experienced a cybersecurity incident.”They contacted law enforcement and hired a cybersecurity firm to investigate the incident. The school eventually brought systems back online and said it would review the incident to “mitigate any potential impact to data.”“Officials from state and local entities reported that the loss of learning following a cyberattack ranged from 3 days to 3 weeks, and recovery time ranged from 2 to 9 months,” the report found.GAO officials said the Secretary of Education and CISA need to establish a collaborative mechanism to coordinate cybersecurity efforts between agencies and with the K-12 community.They urged the Education department to develop metrics for the effectiveness of K-12 cybersecurity-related products and services as well as coordinate with federal agencies on ways to “best to help school districts overcome the identified challenges.”The GAO also provided similar recommendations to CISA, asking that the agency determine the extent to which the agency “meets the needs of state and local-level school districts to combat cybersecurity threats.”Thanks—as separately noted, we’re very focused this year on cyber risks facing “target rich, resource poor” orgs—inc. K-12 school districts, water utilities, & hospitals—working w/SRMA’s (ED/EPA/HHS) to provide info, tools & resources to improve & sustain strong cybersecurity.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-25",
      "title": "Chrome extensions with 1 million installs hijack targets’ browsers",
      "text": " Researchers at Guardio Labs have discovered a new malvertizing campaign pushing Google Chrome extensions that hijack searches and insert affiliate links into webpages.Because all these extensions offer color customization options and arrive on the victim's machine with no malicious code to evade detection, the analysts named the campaign \"Dormant Colors.\"The infection begins with advertisements or redirects when visiting web pages that offer a video or download.However, when attempting to download the program or watch the video, you are redirected to another site stating you must install an extension to continue, as demonstrated below.When the visitor clicks on the 'OK' or 'Continue' button, they are then prompted to install an innocuous-looking color-changing extension.However, when these extensions are first installed, they will redirect users to various pages that side-load malicious scripts that instruct the extension on how to perform search hijacking and on what sites to insert affiliate links.\"Both of those HTML elements (colorstylecsse and colorrgbstylesre) include content (InnerText) that for the first is a '#' separated list of strings and regexes and the last is a comma-separated list of 10k+ domains.\"\"To finish it up, it also assigns a new URL to the location object so you are redirected to the advertisement that finalizes this flow as it is was just another advertisement popup.\"When performing search hijacking, the extension will redirect search queries to return results from sites affiliated with the extension's developer, thus generating income from ad impressions and the sale of search data.Dormant Colors goes beyond this by also hijacking the victim’s browsing on an extensive list of 10,000 websites by automatically redirecting users to the same page but this time with affiliate links appended to the URL.Once the affiliate tags are appended to the URL, any purchase made on the site will generate a commission for the developers.Guardio has also shared a video demonstrating the affiliation hijacking component, shown below.The researchers warn that using the same stealthy malicious code side-loading technique, the operators of Dormant Colors could achieve potentially nastier things than hijacking affiliations.The researchers say it’s possible to redirect victims to phishing pages to steal credentials for Microsoft 365, Google Workspace, bank sites, or social media platforms.While there are no signs that the campaigns are performing this more malicious behavior, the researchers say it could be enabled simply by side-loading additional scripts.The extensions and the websites listed in the report's IoCs section have been removed/taken offline, but the researchers warn that the operation is constantly renewed with new add-on names and domains."
   },
   {
      "time": "2022-10-25",
      "title": "Apple fixes new zero-day used in attacks against iPhones, iPads",
      "text": " In security updates released on Monday, Apple has fixed the ninth zero-day vulnerability used in attacks against iPhones since the start of the year. Apple revealed in an advisory today that it's aware of reports saying the security flaw \"may have been actively exploited.\"This can result in data corruption, application crashes, or code execution because of undefined or unexpected results (also known as memory corruption) resulting from subsequent data written to the buffer.As Apple explains, if successfully exploited in attacks, this zero-day could have been used by potential attackers to execute arbitrary code with kernel privileges.The complete list of impacted devices includes iPhone 8 and later, iPad Pro (all models), iPad Air 3rd generation and later, iPad 5th generation and later, and iPad mini 5th generation and later.While Apple has disclosed that it knows of active exploitation reports of this vulnerability in the wild, it has yet to release any information regarding these attacks.This will likely allow Apple customers to patch their devices before more attackers develop additional exploits and start using them in attacks targeting vulnerable iPhones and iPads.Even though this zero-day bug was most likely only used in highly-targeted attacks, installing today's security updates is strongly recommended to block any attack attempts.This is the ninth zero-day fixed by Apple since the start of the year:"
   },
   {
      "time": "2022-10-25",
      "title": "Iran’s atomic energy agency confirms hack after stolen data leaked online",
      "text": " The Iranian Atomic Energy Organization (AEOI) has confirmed that one of its subsidiaries' email servers was hacked after the ''Black Reward' hacking group published stolen data online.AEOI says an unauthorized party from a specific foreign country, which is not named, stole emails from the hacked server, which consisted of daily correspondence and technical memos.The agency says it immediately took the necessary preventive measures to mitigate the results of this incident and informed all concerned parties and officials to be prepared for potential exploitation attempts.AEIO says that the purpose of the breach and the data leak was to attract public attention and smear the image of AEOI in the media.The hacker group responsible for the attack calls itself 'Black Reward' and has leaked some of the stolen data on their Telegram channel.There, Black Reward posted a 27GB 14-part collection of RAR archives allegedly containing 85,000 email messages characterized as \"perfect for researchers.\"The hackers claim to have scrutinized the collection before publication, removing all marketing messages and spam emails and keeping only the valuable content.The leaked data includes alleged passports and visas of Iranian and Russians working with the agency, power plant status and performance reports, contracts, and technical reports.The threat actors' message ends with an oblation to Mehsa Amini, the young woman who died in the custody of Iran's \"moral\" police force.The hackers' message is signed \"For women, life, freedom,\" giving the email server breach and data leak action the character of hacktivism."
   },
   {
      "time": "2022-10-25",
      "title": "Cuba ransomware affiliate targets Ukrainian govt agencies",
      "text": " The Computer Emergency Response Team of Ukraine (CERT-UA) has issued an alert about potential Cuba Ransomware attacks against critical networks in the country.Starting on October 21, CERT-UA observed a new wave of phishing emails that impersonated the Press Service of the General Staff of the Armed Forces of Ukraine, urging recipients to click on an embedded link.The link takes the recipient to a third-party web page to supposedly download a document named \"Наказ_309.pdf,\" but they are shown a fake alert stating that the visitor needs to update their PDF reader software first.The website then urges the visitor to click on a \"DOWNLOAD\" button, which leads to the download of an executable (\"AcroRdrDCx642200120169_uk_UA.exe\") resembling an Acrobat Reader installer.However, running this file will install and execute the \"rmtpak.dll\" DLL file, which is Cuba Ransomware's signature malware known as \"ROMCOM RAT.\"This malware allows the threat actors to perform file operations on the host, steal data, spawn spoofed processes, start reverse shells, and more.BlackBerry also highlights other victims of the malware, located in the Philippines, Brazil, and the United States.In these cases, the attackers use a different payload-dropping site spoofing the legitimate \"Advanced IP Scanner\" site. Notably, BlackBerry's report didn't link ROMCOM RAT to any threat actors.While that incident was initially given a geo-political hue, Cuba Ransomware isn't among the hackers who have declared interest in hacktivism, and neither did they take sides in the conflict between Russia and Ukraine."
   },
   {
      "time": "2022-10-25",
      "title": "Adobe Illustrator Vulnerabilities Rated Critical, But Exploitation Not Easy - SecurityWeek",
      "text": " Hi, what are you looking for?Updates released by Adobe last week for its Illustrator product patch two vulnerabilities that could lead to arbitrary code execution, but the researcher who found them says exploitation is not easy.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-25",
      "title": "\r\n\tUK Construction Biz Fined £4.4m for Serious Security Failings - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineA British construction company has been fined over £4m ($4.5m) by the data protection regulator after a series of security failings allowed a hacker to steal and encrypt the personal information of 113,000 current and former employees.The Information Commissioner’s Office (ICO) has the power to fine organizations up to £17.5m ($20m) or 4% of total global annual turnover, whichever is higher, under the GDPR and the UK Data Protection Act 2018.It claimed that Berkshire-based Interserve Group had failed to put appropriate security measures in place to guard against a ransomware attack. This led to the theft of a large range of sensitive employee information including contact details, national insurance numbers, bank account details, as well as details of any disabilities, sexual orientation, ethnic origin, religion and health information.It explained that a phishing email was opened by an employee after being forwarded by a colleague. The worker unwittingly downloaded malware to their machine which was flagged for attention by the company’s antivirus (AV) software.The data was encrypted and stolen, although there’s no information on whether Interserve paid its extorters.According to the regulator, Interserve:The £4.4m sum is the final fine amount, with the ICO not changing its initial “notice of intent” figure following representations from Interserve.The ICO urged all companies to learn from this case to avoid serious compromise. To better safeguard people’s data, it said organizations should:"
   },
   {
      "time": "2022-10-25",
      "title": "SideWinder APT Using New WarHawk Backdoor to Target Entities in Pakistan",
      "text": " SideWinder, a prolific nation-state actor mainly known for targeting Pakistan military entities, compromised the official website of the National Electric Power Regulatory Authority (NEPRA) to deliver a tailored malware called WarHawk.The intrusions have been significant not only with regard to their frequency but also in their persistence, even as the group takes advantage of a massive arsenal of obfuscated and newly-developed components.WarHawk, for its part, masquerades as legitimate apps such as ASUS Update Setup and Realtek HD Audio Manager to lure unsuspecting victims into execution, resulting in the exfiltration of system metadata to a hard-coded remote server, while also receiving additional payloads from the URL.This includes a command execution module that's responsible for the execution of system commands on the infected machine received from the command-and-control server, a file manager module that recursively enumerates files present in different drives, and an upload module that transmits files of interest to the server.Also deployed as a second-stage payload using the aforementioned command execution module is a Cobalt Strike Loader, which validates the host's time zone to confirm it matches the Pakistan Standard Time (PKT), failing which the process is terminated.Per the cybersecurity company, the attack campaign's connections to the SideWinder APT stem from the reuse of network infrastructure that has been identified as used by the group in prior espionage-focused activities against Pakistan.\"The SideWinder APT Group is continuously evolving their tactics and adding new malware to their arsenal in order to carry out successful espionage attack campaigns against their targets,\" the researchers concluded.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-10-25",
      "title": "CISA Warns of Daixin Team Hackers Targeting Health Organizations With Ransomware",
      "text": " U.S. cybersecurity and intelligence agencies have published a joint advisory warning of attacks perpetrated by a cybercrime gang known as the Daixin Team primarily targeting the healthcare sector in the country.The alert was published Friday by the Federal Bureau of Investigation (FBI), Cybersecurity and Infrastructure Security Agency (CISA), and the Department of Health and Human Services (HHS).Over the past four months, the group has been linked to multiple ransomware incidents in the Healthcare and Public Health (HPH) sector, encrypting servers related to electronic health records, diagnostics, imaging, and intranet services.It's also said to have exfiltrated personal identifiable information (PII) and patient health information (PHI) as part of a double extortion scheme to secure ransoms from victims.On October 11, 2022, the Texas healthcare facility notified its customers of emails sent by \"third-parties\" regarding the cyber attack, stating it's directly informing affected patients, in addition to offering free credit monitoring services for 18 months.Per the new alert, initial access to targeted networks is achieved by means of virtual private network (VPN) servers, often taking advantage of unpatched security flaws and compromised credentials obtained via phishing emails.Upon gaining a foothold, the Daixin Team has been observed moving laterally by making use of remote desktop protocol (RDP) and secure shell (SSH), followed by gaining elevated privileges using techniques like credential dumping.\"The actors have leveraged privileged accounts to gain access to VMware vCenter Server and reset account passwords for ESXi servers in the environment,\" the U.S. government said. \"The actors have then used SSH to connect to accessible ESXi servers and deploy ransomware on those servers.\"As mitigations, it's recommended that organizations apply the latest software updates, enforce multi-factor authentication, implement network segmentation, and maintain periodic offline backups.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]