[
   {
      "time": "2022-12-15",
      "title": "SAP's December 2022 Security Updates Patch Critical Vulnerabilities - SecurityWeek",
      "text": " Hi, what are you looking for?German software maker SAP this week announced the release of 14 new and five updated security notes as part of its December 2022 Security Patch Day, including four notes that address critical vulnerabilities in Business Client, BusinessObjects, NetWeaver, and Commerce.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-15",
      "title": "Six Charged in Mass Takedown of DDoS-for-Hire Sites – Krebs on Security",
      "text": " The U.S. Department of Justice (DOJ) today seized four-dozen domains that sold “booter” or “stresser” services — businesses that make it easy and cheap for even non-technical users to launch powerful Distributed Denial of Service (DDoS) attacks designed knock targets offline. The DOJ also charged six U.S. men with computer crimes related to their alleged ownership of the popular DDoS-for-hire services.The booter service OrphicSecurityTeam[.]com was one of the 48 DDoS-for-hire domains seized by the Justice Department this week.The DOJ said the 48 domains it seized helped paying customers launch millions of digital sieges capable of knocking Web sites and even entire network providers offline.Booter services are advertised through a variety of methods, including Dark Web forums, chat platforms and even youtube.com. They accept payment via PayPal, Google Wallet, and/or cryptocurrencies, and subscriptions can range in price from just a few dollars to several hundred per month. The services are generally priced according to the volume of traffic to be hurled at the target, the duration of each attack, and the number of concurrent attacks allowed.Prosecutors in Los Angeles say the booter sites supremesecurityteam[.]com and royalstresser[.]com were the brainchild of Jeremiah Sam Evans Miller, a.k.a. “John the Dev,” a 23-year-old from San Antonio, Texas. Miller was charged this week with conspiracy and violations of the Computer Fraud and Abuse Act (CFAA). The complaint against Miller alleges Royalstresser launched nearly 200,000 DDoS attacks between November 2021 and February 2022. Defendant Angel Manuel Colon Jr., a.k.a Anonghost720 and Anonghost1337, is a 37-year-old from Belleview, Fla. Colon is suspected of running the booter service securityteam[.]io. He was also charged with conspiracy and CFAA violations. The feds say the SecurityTeam stresser service conducted 1.3 million attacks between 2018 and 2022, and attracted some 50,000 registered users.Charged with conspiracy were Corey Anthony Palmer, 22, of Lauderhill, Fla, for his alleged ownership of booter[.]sx; and Shamar Shattock, 19, of Margate, Fla., for allegedly operating the booter service astrostress[.]com, which had more than 30,000 users and blasted out some 700,000 attacks.Two other alleged booter site operators were charged in Alaska. John M. Dobbs, 32, of Honolulu, HI is charged with aiding and abetting violations of the CFAA related to the operation of IPStresser[.]com, which he allegedly ran for nearly 13 years until last month. During that time, IPstresser launched approximately 30 million DDoS attacks and garnered more than two million registered users.Joshua Laing, 32, of Liverpool, NY, also was charged with CFAA infractions tied to his alleged ownership of the booter service TrueSecurityServices[.]io, which prosecutors say had 18,000 users and conducted over 1.2 million attacks between 2018 and 2022.Purveyors of stressers and booters claim they are not responsible for how customers use their services, and that they aren’t breaking the law because — like most security tools — stresser services can be used for good or bad purposes. For example, all of the above-mentioned booter sites contained wordy “terms of use” agreements that required customers to agree they will only stress-test their own networks — and that they won’t use the service to attack others.“Our terms of use are a legal document that protects us, among other things, from certain legal consequences,” Dobbs told ZDNet. “Most other sites are satisfied with a simple checkbox, but we ask for a digital signature in order to imply real consent from our customers.”But the DOJ says these disclaimers usually ignore the fact that most booter services are heavily reliant on constantly scanning the Internet to commandeer misconfigured devices that are critical for maximizing the size and impact of DDoS attacks.“Analysis of data related to the FBI-initiated attacks revealed that the attacks launched by the SUBJECT DOMAINS involved the extensive misuse of third-party services,” Peterson continued. “All of the tested services offered ‘amplification’ attacks, where the attack traffic is amplified through unwitting third-party servers in order to increase the overall attack size, and to shift the financial burden of generating and transmitting all of that data away from the booter site administrator(s) and onto third parties.”According to U.S. federal prosecutors, the use of booter and stresser services to conduct attacks is punishable under both wire fraud laws and the Computer Fraud and Abuse Act (18 U.S.C. § 1030), and may result in arrest and prosecution, the seizure of computers or other electronics, as well as prison sentences and a penalty or fine. The charges unsealed today stemmed from investigations launched by the FBI’s field offices in Los Angeles and Alaska, which spent months purchasing and testing attack services offered by the booter sites. The Justice Department says it is trying to impress upon people that even buying attacks from DDoS-for-hire services can land Internet users in legal jeopardy. “Whether a criminal launches an attack independently or pays a skilled contractor to carry one out, the FBI will work with victims and use the considerable tools at our disposal to identify the person or group responsible,” said Donald Alway, the assistant director in charge of the FBI’s Los Angeles field office. “Potential users and administrators should think twice before buying or selling these illegal services,” said Special Agent Antony Jung of the FBI Anchorage field office. “The FBI and our international law enforcement partners continue to intensify efforts in combatting DDoS attacks, which will have serious consequences for offenders.” “The purpose of the ads is to deter potential cyber criminals searching for DDoS services in the United States and around the globe, as well as to educate the public on the illegality of DDoS activities,” the DOJ said in a press release.Here is the full list of booter site domains seized (or in the process of being seized) by the DOJ:api-sky[.]xyz\nastrostress[.]com\nblackstresser[.]net\nbooter[.]sx\nbooter[.]vip\nbootyou[.]net\nbrrsecurity[.]org\nbuuter[.]cc\ncyberstress[.]us\ndefconpro[.]net\ndragonstresser[.]com\ndreams-stresser[.]io\nexotic-booter[.]com\nfreestresser[.]so\ninstant-stresser[.]com\nipstress[.]org\nipstress[.]vip\nipstresser[.]com\nipstresser[.]us\nipstresser[.]wtf\nipstresser[.]xyz\nkraysec[.]com\nmcstorm[.]io\nnightmarestresser[.]com\norphicsecurityteam[.]com\novhstresser[.]com\nquantum-stresser[.]net\nredstresser[.]cc\nroyalstresser[.]com\nsecurityteam[.]io\nshock-stresser[.]com\nsilentstress[.]net\nstresser[.]app\nstresser[.]best\nstresser[.]gg\nstresser[.]is\nstresser[.]net/stresser[.]org\nstresser[.]one\nstresser[.]shop\nstresser[.]so\nstresser[.]top\nstresserai[.]com\nsunstresser[.]com\nsupremesecurityteam[.]com\ntruesecurityservices[.]io\nvdos-s[.]co\nzerostresser[.]com\r\n         This entry was posted on Wednesday 14th of December 2022 02:58 PM \r\n         The logic behind “I will only use this tool to test my own network” will be interesting to see once it is argued in court.\nI can see both sides, then again, I’m not a lawyer.Nobody uses that as a defense, because a case only goes to court after it’s used against systems NOT OWNED by the defendant.There are legitimate Load-testing as a service providers out there such as Loader & K6Honestly just be smart and use a good nfo server website ddos panels are not as good as u think they don’t even compare to the real power of botnets that can run through putty can’t tell u how many times someone tried to hit me off with a website and it just tickled my nfoi LOVE krebs on security! I hate hackres and booters hopefuly this maks an example outof futuree owners of these types of service wohoo great post krebsWooHooo! Go Krebscriminals deserve to go in jail , once again congrats on the fbiAgreed, great post.  The statistics on number of DDoS attacks and customers of these systems boggle the mind.  What motivates this — is it extortion, akin to ransomware?You rarely see DDoS for ransom.No barelly anyone does it for ransom, mostly its for the sole feeling of power, ddosing other peoples vpns, sites, games like r6 because if you ddos it it will crash and ur lost wont count.I’m curious to know from others how can one properly test their network(s) for validating DDoS protection, etc. if not using a third party booter service?There are legitimate stressors “RedWolf Security” that leverage hyperscalers (with their approval) to generate DDoS load. You may also want to ask the Cloud Provider or on-prem provider (if managed support is on contract) for permission, as most of the times, it violates their AUP or T&Cs. Stressing origin with DDoS for due diligence is the same concept as Pen testing for WAF. Ipso Facto!Thanks for this – much appreciated.Keep your software patched and your ports tight.damn bro what am i going to use now?Damn this is so sad. The FBI and CIA are honestly slow mentally. They cannot get all of “them” . I do “do not condone DDoS attacks” these are horrible and NEED to stop.As a legit service owner who is fighting against DDoS attacks on a weekly basis, thanks FBI ♥️I’m curious. As a legit business owner, are you being extorted ? Why are you fighting DDoS attacks frequently ? What type of “legit” service are you running?One of my friends run a game server (FiveM) & he said that they often get DDoSed by their competitions.That checks out.Booters always ticked me off because it takes no skill and are easy to access.skidsDo read mister Krebs post on Mastodon. He talks about one individual he got in contact with. I hope all the money they made with the sites gets confiscated and they all realize how many people they have hurt in time.This is so a fantastic article. Thanks for sharing this informative blog. I have become a fan of your blogs, and this blog is so exciting and informative.I predict the prosecutor will question why there was no form of technical verification of ownership against targets before the attacks were permitted. It wouldn’t be hard to automate a check against DNS records, robots.txt, whois info or web beacon.If they allowed their service to be used for only legitimate testing, the authorities probably wouldn’t have cared, even with the abuse of misconfigured devices.DNS records don’t matter here. I can set up a DNS record pointing to your IP address.What matters are IP addresses and AS/ASNs.There are reverse DNS records, but they’re generally not used for things like this to my knowledge.I don’t know of an AS(N) oriented approach.You could probably require a timestamped https response from a server based on a certificate for a public IP address. That doesn’t show authorization to send traffic to the AS. And someone could hack a computer to put up this and answer that query. Should that really be all that’s necessary for a service to decide it’s ok to send traffic? I’d say no.I’d want actual money to cover liability. Way more than the pennies these hacking sites possibly charge. Enough to cover damages when it turns out that the procured service was a malicious attack.I’m still getting attacked so apparently there are more out there.  Look at how many are in florida hahahaif you think that public stressers are the only services out there then you are bigly misstakenThey should go after the customers and if the penalties are not high enough, then the\nCongress should raise them. Dry up the demand and that will limit the booters. Also make it easy for the booters and their customers to be sued by the victims. It is all about money for the booters after all.you cant go after the costumers as its run on their servers thats their whole unique selling pointWell everyone thinks going after the stressers will stop ddos attacks and they are wrong, all is going to happen is the next bored kid at home will open another one, targeting the main providers that sale spoof Hosting’s its how you slow this attacks down because stopping it maybe impossible since this days any 13 year old can run a script and have a botnet Running, is like saying GitHub should be taking down by the fbi because most of this scripts are in GitHub but like you said we cant control what everyone does with the scripts.The law enforcement is doing nothing except making the market in the DDoS community grow. The more stressers that get taken down, the less competition other stress owners have to deal with. If they try to take them “all” down, it just makes the service worth more.I completely Agree, I am one of the people named in the post. And they dont understand ddos is not an issue that just comes from the usa they also come from other country’s with poor laws and kids know that, i’ve been telling many people stop ddosing ever since i found out the seriousness of it and i was raided and all they say is my country dont care about ddos, some kid even has the nerves to say his country gives him 5 warnings before prosecuting.The law enforcement is doing nothing except making the market in the DDoS community grow. The more stressers that get taken down, the less competition other stress owners have to deal with. If they try to take them “all” down, it just makes the service worth more.This is stupid and uneducated. Half of these stressers are already back up on different domains and there customers have been redirected there via telegram groups etcNobody yet spotted that the FBI agent running the case, Elliott Peterson, managed to get elliot.ns.cloudflare.com as one of the nameservers?*I* want a vanity nameserver too!So it’s illegal because these guys used other folks devices in their botnet for hire without the network device owners permission breaking cfaa. Pretty simple. Now if however they owned all the devices and/or has explicit permission to do use said devices for their stress test service then that’s totally different but again if you are legitimate then you would log who used the services and what proposes.Well, CyberHero Krebs, you DO know a thing or two about getting DDoSed, now don’t you…  LOL  😉Which makes me wonder if you have seen any increased ne’r-do-well activity along the lines of Mirai/BASHLITE/Miori/SpeakUp offerings as perhaps stealthier alternatives to these DDoSaaS stresser-sites that are apparently finally receiving well-deserved scrutiny…? How many more nanny cams, DVRs, thermostats and window blinds are being conscripted as we speak to fill in the void!?!Every user on the planet that cares about the current and future state of security and safety on the Internet owes their personal gratitude to Cyberhero Brian “CBK” Krebs for continuing non-stop to put his ass on the line in endless pursuit of the ne’r-do-wells (and threat actors too LOL) who want to take all of the good out of what could be a really, really, really good World Wide Web!  Sounds flowery…?  It’s true!Many thanks to Bruce Schneier as well!P.S.  Brian, thanks to your frequent allusions to “Mr. Robot”, I finally started watching it on Netflix tonight;  where in the HECK have I been??!!  Way awesome show –  it even has Freddie Mercury playing the lead!  Best thing since DOS 3.3…DDoS For Hire Sites Not Being Seized WhyList:\nkraysecurity.com formerly kraysec.com\nstressthem.to\nquality-api.orgYour email address will not be published.Pretty simple.I’ve dealt with one of these guys last year, glad to see him get locked up after years of harassment.Woohoo boo krebs Comments are closed.Mailing ListSearch KrebsOnSecurityRecent PostsStory CategoriesWhy So Many Top Hackers Hail from Russia"
   },
   {
      "time": "2022-12-15",
      "title": "FBI’s Vetted Info Sharing Network ‘InfraGard’ Hacked – Krebs on Security",
      "text": " InfraGard, a program run by the U.S. Federal Bureau of Investigation (FBI) to build cyber and physical threat information sharing partnerships with the private sector, this week saw its database of contact information on more than 80,000 members go up for sale on an English-language cybercrime forum. Meanwhile, the hackers responsible are communicating directly with members through the InfraGard portal online — using a new account under the assumed identity of a financial industry CEO that was vetted by the FBI itself.On Dec. 10, 2022, the relatively new cybercrime forum Breached featured a bombshell new sales thread: The user database for InfraGard, including names and contact information for tens of thousands of InfraGard members.The FBI’s InfraGard program is supposed to be a vetted Who’s Who of key people in private sector roles involving both cyber and physical security at companies that manage most of the nation’s critical infrastructures — including drinking water and power utilities, communications and financial services firms, transportation and manufacturing companies, healthcare providers, and nuclear energy firms.“InfraGard connects critical infrastructure owners, operators, and stakeholders with the FBI to provide education, networking, and information-sharing on security threats and risks,” the FBI’s InfraGard fact sheet reads.In response to information shared by KrebsOnSecurity, the FBI said it is aware of a potential false account associated with the InfraGard Portal and that it is actively looking into the matter.“This is an ongoing situation, and we are not able to provide any additional information at this time,” the FBI said in a written statement.KrebsOnSecurity contacted the seller of the InfraGard database, a Breached forum member who uses the handle “USDoD” and whose avatar is the seal of the U.S. Department of Defense.USDoD’s InfraGard sales thread on Breached.USDoD said they gained access to the FBI’s InfraGard system by applying for a new account using the name, Social Security Number, date of birth  and other personal details of a chief executive officer at a company that was highly likely to be granted InfraGard membership.The CEO in question — currently the head of a major U.S. financial corporation that has a direct impact on the creditworthiness of most Americans — told KrebsOnSecurity they were never contacted by the FBI seeking to vet an InfraGard application.USDoD told KrebsOnSecurity their phony application was submitted in November in the CEO’s name, and that the application included a contact email address that they controlled — but also the CEO’s real mobile phone number.“When you register they said that to be approved can take at least three months,” USDoD said. “I wasn’t expected to be approve[d].”But USDoD said that in early December, their email address in the name of the CEO received a reply saying the application had been approved (see redacted screenshot to the right). While the FBI’s InfraGard system requires multi-factor authentication by default, users can choose between receiving a one-time code via SMS or email.“If it was only the phone I will be in [a] bad situation,” USDoD said. “Because I used the person[‘s] phone that I’m impersonating.”USDoD said the InfraGard user data was made easily available via an Application Programming Interface (API) that is built into several key components of the website that help InfraGard members connect and communicate with each other.USDoD said after their InfraGard membership was approved, they asked a friend to code a script in Python to query that API and retrieve all available InfraGard user data.“InfraGard is a social media intelligence hub for high profile persons,” USDoD said. “They even got [a] forum to discuss things.”To prove they still had access to InfraGard as of publication time Tuesday evening, USDoD sent a direct note through InfraGard’s messaging system to an InfraGard member whose personal details were initially published as a teaser on the database sales thread.That InfraGard member, who is head of security at a major U.S. technology firm, confirmed receipt of USDoD’s message but asked to remain anonymous for this story.USDoD acknowledged that their $50,000 asking price for the InfraGard database may be a tad high, given that it is a fairly basic list of people who are already very security-conscious. Also, only about half of the user accounts contain an email address, and most of the other database fields — like Social Security Number and Date of Birth — are completely empty.“I don’t think someone will pay that price, but I have to [price it] a bit higher to [negotiate] the price that I want,” they explained.While the data exposed by the infiltration at InfraGard may be minimal, the user data might not have been the true end game for the intruders.USDoD said they were hoping the imposter account would last long enough for them to finish sending direct messages as the CEO to other executives using the InfraGuard messaging portal. USDoD shared the following redacted screenshot from what they claimed was one such message, although they provided no additional context about it.A screenshot shared by USDoD showing a message thread in the FBI’s InfraGard system.USDoD said in their sales thread that the guarantor for the transaction would be Pompompurin, the administrator of the cybercrime forum Breached. By purchasing the database through the forum administrator’s escrow service, would-be buyers can theoretically avoid getting ripped off and ensure the transaction will be consummated to the satisfaction of both parties before money exchanges hands.Update, 10:58 p.m. ET: Updated the story after hearing from the financial company CEO whose identity was used to fool the FBI into approving an InfraGard membership. That CEO said they were never contacted by the FBI.Update, 11:15 p.m. ET:  The FBI just confirmed that it is aware of a potential false account associated with the InfraGard portal. The story now includes their full statement.This is a developing story. Updates will be noted here with timestamps. \r\n         This entry was posted on Tuesday 13th of December 2022 06:54 PM \r\n         Interesting  articleThis sounds like it could be very promising. Would InfraGard be a good source of up to date information about attacks and scams and how to deal with them?   Has anyone here been a member and found them useful?Mainly OSINT. I’ve never found it to be useful. Generally just delete emails from them.Same. Attended a single meeting but heard nothing I couldn’t gather from staying on top of industry news cycles.As an InfraFard member, I value the formal purpose and intention of the group.  In the event of a realized threat, due to the association to critical infrastructure, new communication channels become available in realtime, due to one’s association to critical infrastructure, not just because your a member of InfraGard.  But InfraGard thru its association to Homeland and the FBI, would be one of the channels used to share information.Independent of your Chapter, (I’m in Chicago), there is also informal sharing of information by the members.  The informal sharing, via private forums and email is in near real-time.  Over the years, these informal shares are real-time, and not (yet) in the news.  If you are associated to critical infrastructure, yes, this is a valuable organization to be a member. It compliments your other formal associations.  And opens your informal networking to a group of your peers who are both business leaders, and often nerdy enough to know the consequences of the technology being compromised. For sure, if you qualify, it is a group of peers who are likely making decisions about threats to the Confidentiality, Integrity, and Availability (CIA) of critical infrastructure  from either a global, national, state, regional, or own business perspective.I believe the issue a lot of us security pros/InfraGard members have to do with the content is exemplified in your post.  Many InfraGard presentations have a lot of windbaggery and grandstanding, with the non-technical (or very outdated technically) presenters going on and on about basic topics of infosec management.  The fact that you took pains to expand the CIA triad (InfoSec 101), and state “global…regional”  is typical of these presentations.I’ve never seen a situation where InfraGard supplied information helped any organization get ahead of any threats.sounds like a skill issuehelloI’ve always found the threat intel very useful.  Yes, I can find it from other sources (Mandiant, Talos, etc.) but I find that at least Infragard contains all of the information and not distilled to a set of products.   The local chapter meetings have been very useful as well.Aside from the general OSINT, it really depends on the Chapter you are a member of.  Some chapters are more active than others.  My chapter has actually put on a fair amount of seminars with experts on various aspects of security, both physical and cyber.  I find these live events to be the far more compelling aspect of membership.Agreed!Yes, it’s good for that purpose.OoopsWhoopsie!I am in InfraGuard member, and the FBI has not disclosed the breach and the potential exposure of my PII to me.\nIf I did not follow Krebs, I would not know.  The District of Columbia does have breach notification requirements on the books; do they not apply?Ah…Late news bulletin for you…\nSorry you skipped the US civics class…but who has the time for the mundane?\nWe are a Federal republic with 53 separate state entities, and 3000+ counties.\nEach has the power to enact separate laws, as long as they don’t conflict with the Feds, or its own state’s laws.\nGot that?\nDC can pass any “municipal law” it wants; no effect on the local FBI HQ (your point).\nCongress, by the archaic, sclerotic 1787 Constitution, rules both the FBI and DC.\nMuch good luck on your further studies of our basic US governing documents…\nGlad to have helped your education!\nNow you can tackle partisan state gerrymandering, or Presidential pardons as a obstruction of justice tool…\nThe start of a very long charge sheet, indeed…FBI might not hire any person nerdy enough to firewall. However, as I see it, the onus is on flabby nerdy. And no, I do not have six-pack absolutely-s. I imagine, is all. Everybody is hacked, or whatever? Axiom of Choice is saying no. Not everybody is getting hacked.It’s not clear that it is a firewall / hack issue since the data was taken over the API.   It’s more of a vetting and policy issue: how much access to allow between vetted members?     Vetting becomes progressively harder as criminal technology advances: even if someone applies in person, how to know that the ID they present isn’t fake along with the stolen credentials they are assuming?As a former member of InfraGard, back when I applied, we had to physically show up at an orientation meeting at the local FBI field office and were vetted/had our accounts created on site. My membership lapsed when I moved employers, but clearly they relaxed their standards/due diligence. It’s sad to see this happen to an organization that is supposed to be security focused above all else. This news makes me feel a little bit embarrassed to have ever been associated with the program.The API shouldn’t be wide open for any user to query as they pleaseIt’s not because you must be a “vetted” member.and vetting makes it super secureVetting zoo.ROFLSo the people who continue to target anyone who does not agree with the mainstream media comments can’t even protect their own Datbase.I’m just done….the fBI get’s BILLIONS and they can’t even protect something as simple….as an online Database.Just WowI know you’re upset that they investigated your favorites – California congressman TJ Cox and Texas Rep. Henry Cuellar, but investigations target those who ask to be investigated by their actions.Yup, just like Rev Dr Martin Luther King, right?  I have no opinion on the folks you mentioned, for the record.  Hell, I don’t even know who they are.  Just pointing out that the idea you’re promoting is simplistic and, quite frankly, dangerous.  Blind trust in anything – especially government – is foolish.Those guys aren’t MLK.  The comparison is insulting.I’ll go further, kind sir…\nIn this libertarian US economy, blind trust in the private sector, and particularly anything connected to electronic commerce , is equally dangerous for a US Consumer.\nHave you not heard of truly massive private data base’s breaches and fraud since 2000?\nI wish thee much good luck…With scammers like these, I’m always surprised they don’t get an English-language editor involved to touch up their phishing emails. I know there’s the whole “people who ignore the typos/bad grammar are more likely to fall for further scams” aspect, but as the blog post mentions, these targets are already security-conscious people. The message in the article above is likely to get no hits, while even some basic editing could really clean it up and boost its chances.That was my first thought too. The letter is supposed to be from a CEO. Did its author really think anyone who writes like that would be CEO of anything larger than a corner vape shop? The letter is a surefire way to eliminate worthless executives: anyone who falls for the letter doesn’t belong in their job.ChatGPT has entered the chat…LOL…. exactlyHave you seen the CEO’s of some companies.  Sam Bankman-Fried and so many others become celebrity executives.Totally read this the first time through that the US Department of Defense was hacking the FBI.  Funny how in these bizarre times my brain thought yup…that sounds about right.The FBI is certainly not what they once were…Don’t know. You could be reasonably certain if you passed information from the CIA to the FBI it would get leaked.Would the information be used anyway.? Sort of like providing information to the government prior to the piles of dead bodies. But, then again, can they be sure the information is any good without a few dead bodies?* And they do not give out medals they say “I stopped these,” with a little dead body underneath. (Though you can make your own little award and pop it on your desk.)*Yes…along with a whole lot other of intel, especially if there is gas to be got, and oil to be shipped.Think of the economic cost for God’s sake, or losing all that election financing! (And the short term political gain in ignoring a whole lot of trouble that likely can’t be solved anyway).Good God man, what you are proposing would turn the whole system on it’s head! We gave all that information to the FBI about the Russians and that sat on that for decades.What was it you were saying again?You know that look Batman has on his face when Catwoman told him something, but he never listened to it?Bolton, Comey, Clinton all had that look.Thats better than a cup of coffee.  I’ve had big issues with the infragard and its funny that they’ve finally got slapped with Karma.FBI should have to buy it back…Aren’t these the guys who want back doors into everything? Sure, they can be trusted with it.Interesting story. Just wondering if the “major U.S. financial corporation that has a direct impact on the creditworthiness of most Americans” is one of the three major credit bureaus. That possibility tickles my funny bone. Not that I delight in the CEO’s misfortune of being impersonated, especially for nefarious purposes, but might it be an instance of poetic justice that the shoe is on the other foot?That’s a bingoNot a security professional, but it seems kind of naive to just accept “USDod said” as an indicator of  truth. Particularly one who has claimed to have spoofed the FBI. Where is the indicator they have this data and aren’t spoofing you too?You mean apart from the fact that I verified they were able to direct message InfraGard members via the InfraGard site with the fake CEO identity they claimed? Or the fact that the FBI confirmed they were investigating a rogue account?Not a security professional, but I wouldn’t terminate that account either if I could monitor to collect other data on its origin from someone dumb enough to keep logging back in. Here’s another thought – the FBI did reach out by phone to the person who didn’t apply (as the hacker states s/he feared) to confirm it was a penetration attempt, but then approved the account early to see where it would go. It doesn’t sound like a lot of value was obtained in any event – a list of subscribers with most of the other data fields left blank – even assuming USDoD’s claim of what it downloaded is true.What is astonishing is the lack of due diligence for site membership.  If the premise of the site is to share information and communicate among others, then identity verification is critical.nothing online,is private,someone,somewhere,has all your info,it;s a game called “buy and sell”I just double-checked my email. I haven’t received any notification from Infragard or the FBI that my information was exposed. Doesn’t this mean they are violating the breach notification standards?Same – a little let down I found out in my Teams chat last night via a Krebs article.  Grateful but still – you’d think they’d say SOMETHING and then back away saying ongoing.  I did email and the response I got was the canned one:The FBI is aware of a potential false account associated with the InfraGard Portal and is actively looking into this matter. This is an ongoing situation, and we are not able to provide additional information at this time.Federal agencies often aren’t bound by state law.\nFwiw, California’s law is explicitly limited to businesses and state agencies.Fun trivia: USPS vehicles aren’t required to have and don’t have license plates. (USPS is a constitutional entity.)Krebs broke the story.\nSus.So have they locked the site up?  I’ve been trying to log in since last night and can’t get in – curious how much of myself I put out there  and not really too concerned about it – all of our intense work is done in person and not online there.The internet is not secure. Never was, and never will be.  But it is forever. 🙂An expose on the shoddy security of the infraguard.org website was published on LinkedIn on 24 Nov. 2019.  Title:  “Do as I say, not as I do.  INFRAGUARD.ORG”.  The author saw this breech coming over 2 years ago, and like Cassandra, the warning was ignored.  The author published an number of exposes of insecure organizations  including .gov, .mil, and .org where the organizations are government backed.  Most were ignored by the entities owning the domains.USDoD was joking when he said he took it down, he actually released the full dataset for free on the 17th or 18th, albeit behind an 8 credit wall. I don’t know why no one is talking about this. Forum thread title as proof “InfraGard Database – Leaked, Download!”.I don’t mean to spam, just posting again because I’m not sure if comment is held for review or error posting. Just in case here is redundant comment:\nUSDoD was joking when he said he took it down, he actually released the full dataset for free on the 17th or 18th, albeit behind an 8 credit wall. I don’t know why no one is talking about this. Forum thread title as proof “InfraGard Database – Leaked, Download!” .Think about it.The problem with Infragard is not security.  It is the existence of Infragard.  In a democratic country, do we really want the FBI running a social media site?Just what is “social media?”Infragard is Twitter, with the FBI cutting out the middleman.Think about it.The problem with Infragard is not security.  It is the existence of Infragard.  In a democratic country, do we really want the FBI running a social media site?Just what is “social media?”Infragard is Twitter, with the FBI cutting out the middleman.Much of what other posters have to say about InfraGard is true but if you subtract the snark, these things are true about all human endeavors.  None of us always operates at the level to which we aspire, though we hope that in an emergency we’ll be able.   And yet we demand that others are at their most capable at all times, especially in retrospect.  InfraGard is neither a program for FBI spying on business or a Social Media operation.  At its most useful it is a networking group that helps folks to climb out of their silos.  We have all heard the phrase: “If you see something, say something.”  InfraGard facilitates the conversations that may assist us by introducing us to those of our peers to whom we can “say something’ if the need arrises.Comments are closed.Mailing ListSearch KrebsOnSecurityRecent PostsStory CategoriesWhy So Many Top Hackers Hail from Russia"
   },
   {
      "time": "2022-12-15",
      "title": "Royal Ransomware Puts Novel Spin on Encryption Tactics",
      "text": " Royal ransomware operates around the world, and reportedly on its own; it does not appear that the group uses affiliates through ransomware-as-a-service (RaaS) or to target a specific sector or country. The group is known to make ransom demands of up to $2 million and claims to have published 100% of the data it extracts from its victims.One key aspect of Royal's tactics is the concept of partial encryption, where it locks up only a predetermined portion of file content rather than all of it. While partial encryption is not a new tactic, it is key to Royal's strategy, with the group taking it to a new level not seen much before in ransomware activity, the researchers said.Recently, for instance, Royal has expanded the idea by basing the tactic on flexible-percentage encryption that can be tailored to the target, thus making detection more challenging, the Cybereason researchers said.The group also employs multiple threads to accelerate the encryption process, giving victims less time to stop it once it starts, and the encryption also initially starts and deploys in different ways, which also makes detection challenging, according to Cybereason.\"The group does not seem to focus on a specific sector, and its victims vary from industrial companies to insurance companies, and more,\" the Cybereason researchers wrote.\"While some larger ransomware gangs have demonstrated scruples at either avoiding targeting healthcare institutions or providing decryption keys at no cost, it's clear that is not the case when it comes to Royal ransomware,\" says Shawn Surber, senior director of technical account management at Tanium, a converged endpoint management provider.\"This is especially concerning considering virtually any outage or disruption in operations will cause a financial — and often physical — impact in a patient care setting,\" he says.While most ransomware bases partial encryption only on the file size, then encrypts a set percentage of the file the same way each time, Royal ransomware lets the operator choose a specific percentage and lower the amount of encrypted data even if the file size is large, the researchers said.When a targeted file is being encrypted, the ransomware calculates the percentage to encrypt and divides the file content — encrypted and unencrypted — into equal segments, researchers explained in the post. The fragmentation — and thus the low percentage of encrypted file content that results — lowers the chance of being detected by anti-ransomware solutions.\"This ability to change the amount of the file to be encrypted gives Royal ransomware an advantage when it comes to evading detection by security products,\" the researchers noted.The file size that Royal chooses for its partial encryption threshold — 5.24MB — also is the same as what Conti Group used in the past, encrypting 50% of a file in a divided manner if it was over this size, \"much like Royal ransomware,\" the researchers wrote.Another technique unique to Royal is how it multithreads encryption, choosing the number of running threads by using the API call GetNativeSystemInfo to collect the number of processors in a machine, the researchers divulged. It will then multiply the result by two and create the appropriate number of threads accordingly. This allows for rapid encryption, another show of sophistication by the group, the researchers said.To avoid rolling out the red carpet for Royal and other ransomware, researchers recommend that enterprises deploy a multilayer approach to malware protection that leverages threat intelligence, machine learning, anti-ransomware, next-generation antivirus, and variant payload-prevention capabilities.For healthcare organizations with limited cybersecurity resources that may not have such tools in their arsenal, one security expert advised the adoption of low-code security automation to help detect and respond to threats in real time by allowing complete visibility into IT environments.\"Endpoint security tools that integrate low-code security automation give healthcare organizations a cohesive protection strategy that protects patients and employees from data theft and extortion,\" Daniel Selig, security automation architect at security automation provider Swimlane, tells Dark Reading.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-15",
      "title": "Quick Update on Recent Denonia Samples - Cado Security | Cloud Forensics & Incident Response",
      "text": " Back in April 2022, Cado discovered a suspicious ELF binary that utilized DNS over HTTPS, binary padding and in-memory execution to conduct cryptojacking. After analyzing the sample in question, our researchers soon realized that they had encountered the first malware campaign specifically targeting Lambda – AWS’ serverless computing environment.Despite there being little activity in relation to this campaign since it was first discovered, we’ve recently detected a number of new Denonia samples.Here are the SHA256 hashes of a few of the recent Denonia samples so other researchers can review them too:The samples all contain an embedded version of XMRig, which is executed from memory. This is consistent with the original Denonia samples we analyzed. They also include several thousand lines of HTTP request strings, which we determined were used for binary padding in the initial analysis.Finally, several of the samples have been submitted to VirusTotal from the Philippines, where the original samples were submitted from.Each of these samples are ELF binaries, compiled for either ARM64 or x86_64 architectures – both of which are natively-supported by Lambda. These versions employ heavier obfuscation in comparison to the original samples, confusing static analysis tools such as Redress. However, they contain most of the third-party packages required to execute Go-compiled code in Lambda. They also display the following log statement when executed outside the Lambda environment, as the original samples did:2022/12/14 15:17:25 expected AWS Lambda environment variables [_LAMBDA_SERVER_PORT AWS_LAMBDA_RUNTIME_API] are not definedCado Security is the provider of the first cloud forensics and incident response platform. By leveraging the scale and speed of the cloud, the Cado platform automates forensic-level data capture and processing across cloud, container, and serverless environments. Only Cado empowers security teams to respond at cloud speed.Cado Security is the provider of the first cloud forensics and incident response platform. By leveraging the scale and speed of the cloud, the Cado platform automates forensic-level data capture and processing across cloud, container, and serverless environments. Only Cado empowers security teams to respond at cloud speed.© Copyright 2023 Cado Security"
   },
   {
      "time": "2022-12-15",
      "title": "2023 Cybersecurity predictions",
      "text": " Powered byAT&T Alien LabsCybersecurity is a relatively new discipline in the realm of computing. Once computing became more democratized with PCs connected via local area networks (LAN) and client/server environments, adversaries quickly saw opportunities. The more democratized computing – the more risk and the potential for cyber adversaries.Dealing with cyber risk and adversaries is now part of a normal business plan. Gone are the days of instilling fear, uncertainty, and doubt (FUD) about the potential of a bad actor. The days of nefarious hackers in hoodies lurking in the shadows are gone.Businesses of all types and sizes now know that cybersecurity is part of a solid business plan. Security is no longer relegated to a team of really smart experts; security is a business enabler and builder of digital trust.With more of a focus on outcomes, security becomes the center of focus in the new democratized era of computing. We are just getting started with ideas for edge computing. And, by association, we are just getting started with what security means.Here are my predictions for some of the trends and highlights we will see in cybersecurity landscape in the year ahead.A new paradigm of computing is upon us. This new era is underpinned by 5G and edge.Edge is a word we have heard for quite some time, but in general conversation lacks a consistent definition. Vendors and business users alike tend to define edge in accordance with the technology stack being sold or used.When thinking about edge, consider these three characteristics as a starting point:Edge use cases are largely driven by the world of the internet of things (IoT) that collect and transmit data to make logical and rational decisions to derive an outcome.In 2023, we should expect to see an accelerated full-scale rollout of edge use cases in areas such as:These use cases require connected systems from the network layer through to application monitoring/management, and require each component to be secure in order to derive the desired outcome.With more democratized computing, security is no longer isolated, it is central to delivering strong business outcomes.In 2023, expect to see more edge use cases and applications. For successful implementation and with security at the core, expect to see the erosion of decades-old siloes such as networking, IT, app development, and security begin to fade away and enable more cross-functional work and roles.Networks are becoming more intelligent. The idea of disaggregation, the separation into component parts, means that some security tools may be able to become part of the network.Following the theme of software-defined, disaggregated networks can bring in the security components needed at a specific time. Think about a network infected with malware. In the scenario of a disaggregated network, a new instantiation may be easily and quickly spun up and the propagation of malware across the network avoided.Admittedly, widespread implementation and adoption of disaggregation will take more than the next 12 months. However, expect to see the start of this game-changing technology in 2023.Edge computing is all about data – collecting, using, and enriching.From a security perspective, expect to see solutions that focus on the data lifecycle to help organizations make sure that data governance policies are automated and enforced.As more edge applications are deployed the sheer amount of data will multiply at a rapid scale. Data, at the heart of the edge app, needs to be protected, intact/trusted, and usable.  It is critical to make sure the data lifecycle is managed with the proper data governance policies.In 2023, expect to have more emphasis and focus placed on data – the collection, management, use, and governance.Security is central to a successful business, and in a software-defined world, applications or apps are the connecting point.APIs and applets are about computer program to computer program communication. It is critical that the software development lifecycle (SDLC) embrace security as a non-functional requirement. This need may require developers to re-assess software engineering practices and work in more systematic ways.In 2023, expect application security to be a top priority as organizations move to the edge and understand the importance of security as a central priority for the business – including at the application level.Threat intelligence, the gathering of information about attacks on an organization from a variety of sources, will continue to be an essential component of security.With edge computing and the expansion of IoT devices, threat intelligence will relay more granular and refined information about the attack surface. Threat intelligence will continue to be delivered as tactical, strategic, and operational. As more machine learning enrichment is available, consumers of threat intelligence will demand more pertinent and personalized reporting.In 2023, expect to see the need for more relevant and curated threat intelligence feeds designed to combat specific industries or use cases.Using biometrics to authenticate identity is nothing new, we have been doing this with fingerprints for over 50 years and more recently with facial recognition. In fact, multi-factor authentication (MFA) is frequently framed as something you know – a passcode, something you have – a device, and something you are – a biometric indicator.We are now seeing celebrities selling their images or digital twins. This means that your favorite actor will continue to be in new movies, at varying ages, indefinitely.What does this mean for security? Increasingly, we are being asked to authenticate via some sort of biometric. Advancements in digital twins and deepfakes mean there is a need to secure our own physical identities. The abundance of images available of any individual via a quick internet search can yield a treasure trove for an adversary seeking to hack an identity.In 2023, expect to see more serious discussions regarding digital twins and how to make biometrics more secure.Cybersecurity professionals have secured our cyber world – the electronic bits and bytes that create our computing systems. Increasingly, connected computers are entering a space that was reserved for physical only devices – think internet connected medical devices, internet connected construction devices, and internet connected transportation such as cars, planes, and ships. These previously physical only devices connected to the internet now constitute convergence.Anything connected to the internet has to be secured and this includes newly converged physical devices that are now considered endpoints.Making sure that these new style of endpoints are protected from cyber-attacks as well as physical attacks are key.In 2023, expect to see more solutions focused on protecting the cyber and the physical and expect to see new roles emerge in organizations focused on this new element of security.Disruption is essential for innovation. As new “born on the edge” companies begin to emerge, the baggage of previous iterations of computing are jettisoned. Just as we saw “born of the web” companies not have to deal with legacy computing systems and infrastructure, “born on the edge” companies will have data and application security embedded from the beginning.“Born on the edge” companies will take advantage of networks, infrastructure, development practices, and organizational benefits available in 2023. These new types of companies, across industries of all types, will spur on innovation and increase competition. As a result, more businesses will advance edge ecosystems and edge applications to deliver business outcomes.Expect 2023 to be a year of anticipated disruption as “born on the edge” companies boldly emerge.Out of necessity, we have seen digital transformation initiatives flourish over the past two years. And, in the last year digital transformation has yielded way to operationalizing what was transformed.In 2022, we have once again been able to convene in person to discuss, debate, and dream of what is next.Expect 2023 to be a year where we are reminded of the seemingly endless possibilities of the power of ideas translated to computing.Here’s to an innovative and exciting 2023!INSIGHTS REPORTSELF ASSESSMENT© Copyright 2023"
   },
   {
      "time": "2022-12-15",
      "title": "High-Severity Memory Safety Bugs Patched With Latest Chrome 108 Update - SecurityWeek",
      "text": " Hi, what are you looking for?Google this week announced a Chrome update that resolves eight vulnerabilities in the popular browser, including five reported by external researchers.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-15",
      "title": "Open-source repositories flooded by 144,000 phishing packages",
      "text": " Unknown threat actors have uploaded a massive 144,294 phishing-related packages on open-source package repositories, inluding NPM, PyPi, and NuGet.The large-scale attack resulted from automation, as the packages were uploaded from accounts using a particular naming scheme, featured similar descriptions, and led to the same cluster of 90 domains that hosted over 65,000 phishing pages.The campaign supported by this operation promotes fake apps, prize-winning surveys, gift cards, giveaways, and more. In some cases, they take victims to AliExpress via referral links.NuGet had the largest share of malicious package uploads, counting 136,258, PyPI had 7,894 infections, and NPM only had 212.The phishing packages were uploaded in troves within a couple of days, which is commonly a sign of malicious activity.The URL to the phishing sites was implanted in the package description, hoping that the links from repositories would increase the SEO of their phishing sites.These package descriptions also urged users to click links to get more info about alleged gift card codes, apps, hack tools, etc.In some cases, the threat actors promote fake Steam gift card generators, Play Station Network e-gift card codes, Play Store credits, Instagram followers generators, YouTube subscribers generators, and more.Almost all of these sites request visitors to enter their email, username, and account passwords, which is where the phishing step takes place.The fake sites feature an element that resembles the promised free generator but fails when visitors try to use it, asking for “human verification.”This initiates a series of redirections to survey sites, finally landing on legitimate e-commerce websites using affiliate links, which is how the threat actors generate revenue from the campaign.Of course, the stolen game account credentials, emails, and social media usernames can also be monetized, as these are typically bundled in collections and sold on hacking forums and darknet markets.The security researchers who discovered this campaign informed NuGet of the infection, and all packages have since been delisted.However, considering the automated method employed by the threat actors to upload such a large number of packages in such a short time, they could re-introduce the threat using new accounts and different package names at any time."
   },
   {
      "time": "2022-12-15",
      "title": "ICS Patch Tuesday: Siemens Fixes 80 OpenSSL, OpenSSH Flaws in Switches - SecurityWeek",
      "text": " Hi, what are you looking for?Industrial giants Siemens and Schneider Electric have addressed over 140 vulnerabilities with their December 2022 Patch Tuesday updates.SiemensByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-15",
      "title": "Serious Attacks Could Have Been Staged Through This Amazon ECR Public Gallery Vulnerability",
      "text": " A critical security flaw has been disclosed in Amazon Elastic Container Registry (ECR) Public Gallery that could have been potentially exploited to stage a multitude of attacks, according to cloud security firm Lightspin.\"This malicious code is executed on any machine that pulls and runs the image, whether on user's local machines, Kubernetes clusters or cloud environments.\"But the issue identified by Lightspin meant that it could be weaponized by external actors to delete, update, and create poisoned versions of legitimate images in registries and repositories that belong to other AWS accounts by taking advantage of undocumented internal ECR Public APIs.Lightspin characterized the flaw as an instance of \"deep software supply chain attack.\"\"This vulnerability could potentially lead to denial-of-service, data exfiltration, lateral movement, privilege escalation, data destruction, and other multivariate attack paths that are only limited by the craftiness and goals of the adversary,\" Amiga noted.\"A malicious actor could poison popular images, all while abusing the trust model of ECR Public as these images would masquerade as being verified and thus undermine the ECR Public supply chain.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]