[
   {
      "time": "2022-10-08",
      "title": "ZINC weaponizing open-source software | Microsoft Security Blog",
      "text": " April 2023 update – Microsoft Threat Intelligence has shifted to a new threat actor naming taxonomy aligned around the theme of weather. Zinc is now tracked as Diamond Sleet.Beginning in June 2022, ZINC employed traditional social engineering tactics by initially connecting with individuals on LinkedIn to establish a level of trust with their targets. Upon successful connection, ZINC encouraged continued communication over WhatsApp, which acted as the means of delivery for their malicious payloads.Microsoft Defender for Endpoint provides comprehensive protection against tools and custom malware used by ZINC, including ZetaNile. The hunting queries provided at the end of this blog will help customers comprehensively search their environments for relevant indicators. As with any observed nation-state actor activity, Microsoft directly notifies customers that have been targeted or compromised, providing them with the information they need to secure their accounts. ZINC is a highly operational, destructive, and sophisticated nation-state activity group. Active since 2009, the activity group gained further public notoriety in 2014 following their successful attack against Sony Pictures Entertainment. ZINC is known to use a variety of custom remote access tools (RATs) as part of their arsenal, including those detected by Microsoft as FoggyBrass and PhantomStar.  ZINC attacks appear to be motivated by traditional cyberespionage, theft of personal and corporate data, financial gain, and corporate network destruction. ZINC attacks bear many hallmarks of state-sponsored activities, such as heightened operational security, sophisticated malware that evolves over time, and politically motivated targeting.ZINC, tracked by other security companies as Labyrinth Chollima and Black Artemis, has been observed conducting this campaign from late April to mid-September 2022.LinkedIn Threat Prevention and Defense detected ZINC creating fake profiles claiming to be recruiters working at technology, defense, and media entertainment companies, with the goal of moving targets away from LinkedIn and to the encrypted messaging app WhatsApp for the delivery of malware. ZINC primarily targeted engineers and technical support professionals working at media and information technology companies located in the UK, India, and the US. Targets received outreach tailored to their profession or background and were encouraged to apply for an open position at one of several legitimate companies. In accordance with their policies, for accounts identified in these attacks, LinkedIn quickly terminated any accounts associated with inauthentic or fraudulent behavior.Once they have established a connection with their target, ZINC operationalized malicious versions of two SSH clients, PuTTY and KiTTY, that acted as the entry vector for the ZetaNile implant. Both utilities provide terminal emulator support for different networking protocols, making them attractive programs for individuals commonly targeted by ZINC. The weaponized versions were often delivered as compressed ZIP archives or ISO files. Within that archive, the recipient is provided a ReadMe.txt and an executable file to run. As part of the evolution of ZINC’s malware development, and in an effort to evade traditional defenses, running the included executable does not drop the ZetaNile implant. For ZetaNile to be deployed, the SSH utility requires the IP provided in the ReadMe.txt file. An example of the content of that file is provided below:ZINC has been using trojanized PuTTY as part of its attack chain for many years, and this most recent variant establishes persistence on compromised devices by utilizing scheduled tasks. This activity was recently reported by Mandiant. The malicious PUTTY.exe is configured to install the Event Horizon malware in C:\\ProgramData\\colorui.dll and subsequently copy C:\\Windows\\System32\\colorcpl.exe to C:\\ProgramData\\colorcpl.exe.  By using DLL search order hijacking, ZINC can load the second stage malware, colurui.dll, and decode the payload with the key “0CE1241A44557AA438F27BC6D4ACA246” to be used for command and control. Upon successful connection to the C2 server, the attackers can install additional malware on the compromised device for other tasks.Lastly, persistence is established with the creation of a daily scheduled task, PackageColor, as part of the configuration for the weaponized PuTTY. ZINC accomplishes this with the following command:While ZINC has utilized weaponized PuTTY for many years, ZINC has only recently expanded their capabilities to include weaponizing a fork of PuTTY called KiTTY. The executable first collects the username and hostname of the victim system. It then sends that information to a hardcoded IP 172[.]93[.]201[.]253 over TCP/22, which does not use SSH protocol and does not require SSH handshake to establish communication. Upon successful TCP connection to the server at 137[.]184[.]15[.]189, the malicious KiTTY executable then deploys the malware as %AppData%\\mscoree.dll following multiple rounds of decoding. The mscoree.dll file is the embedded payload, detected as EventHorizon, in the ZetaNile malware family. Similar to ZINC’s version of PuTTY, the actor uses DLL search order hijacking to load malicious DLL files that perform tasks within the context of these legitimate Windows processes, specifically through %AppData%KiTTY%PresentationHost.exe -EmbeddingObject.The mscoree.dll malware is modularized in such a way that, upon successful connection to the compromised C2 domain, the attackers can install additional malware on the target system as needed using the existing C2 communication, such as executing C:\\ProgramData\\Cisco\\fixmapi.exe -s AudioEndpointBuilder to load malicious mapistub.dll from the compromised C2 server. The HTTP POST requests contain the hardcoded user agent string with misspelled “Edge”, as detailed below, and contain a unique ID for the field gametype and the hardcoded value for the field type for malware campaign tracking purposes:Beginning in September 2022, ZINC was observed utilizing a trojanized TightVNC Viewer that was delivered to a target alongside a weaponized SSH utility over WhatsApp. This malware has a unique PDBPath:The weaponized versions of TightVNC Viewer often were delivered as compressed ZIP archives or job description-themed ISO files via online platforms such as WhatsApp. Within that archive, the recipient is provided a ReadMe.txt and an executable file to run. The .txt file has the following content:As part of the threat actor’s latest malware technique to evade traditional defenses, the malicious TightVNC Viewer has a pre-populated list of remote hosts, and it’s configured to install the backdoor only when the user selects ec2-aet-tech.w-ada[.]amazonaws from the drop-down menu in the TightVNC Viewer, as shown in Figure 5:The malware was configured to send the username and hostname to IP 44[.]238[.]74[.]84 on TCP/22 as part of the victim check-in with the C2 and establish VNC connections to the same IP on port TCP/5900. Once a successful connection is established to the server IP, the embedded second stage DLL payload from TightVNC.exe is loaded in memory to establish C2 communication to a known compromised domain.ZINC has operationalized malicious versions of two PDF readers, Sumatra PDF and muPDF/Subliminal Recording installer, that act as the entry vector for the ZetaNile implant. This delivery mechanism is often utilized in relation to fraudulent job postings delivered to job-seeking targets in the IT and defense sector. The weaponized versions were often delivered as compressed ZIP archives. Within that archive, the recipient is provided with an executable file to run. While the malicious Sumatra PDF reader is a fully functional PDF reader that can load the malicious implant from a fake PDF, the muPDF/Subliminal Recording installer can set up the backdoor without loading any malicious PDF files.The trojanized version of Sumatra PDF Reader named SecurePDF.exe has been utilized by ZINC since at least 2019 and remains a unique ZINC tradecraft. SecurePDF.exe is a modularized loader that can install the ZetaNile implant by loading a weaponized job application themed file with a .PDF extension. The fake PDF contains a header “SPV005”, a decryption key, encrypted second stage implant payload, and encrypted decoy PDF, which is rendered in the Sumatra PDF Reader when the file is opened.Once loaded in memory, the second stage malware is configured to send the victim’s system hostname and device information using custom encoding algorithms to a C2 communication server as part of the C2 check-in process. The attackers can install additional malware onto the compromised devices using the C2 communication as needed.Within the trojanized version of muPDF/Subliminal Recording installer, setup.exe is configured to check if the file path ISSetupPrerequisites\\Setup64.exe exists and write C:\\colrctl\\colorui.dll on disk after extracting the embedded executable inside setup.exe. It then copies C:\\Windows\\System32\\ColorCpl.exe to C:\\ColorCtrl\\ColorCpl.exe. For the second stage malware, the malicious installer creates a new process C:\\colorctrl\\colorcpl.exe C3A9B30B6A313F289297C9A36730DB6D, and the argument C3A9B30B6A313F289297C9A36730DB6D gets passed on to colorui.dll as a decryption key. The DLL colorui.dll, which Microsoft is tracking as the EventHorizon malware family, is injected into C:\\Windows\\System\\credwiz.exe or iexpress.exe to send C2 HTTP requests as part of the victim check-in process and to get an additional payload.Microsoft will continue to monitor ZINC activity and implement protections for our customers. The current detections and IOCs in place across our security products are detailed below.The techniques used by the actor and described in the “Observed actor activity” section can be mitigated by adopting the security considerations provided below:The below list provides IOCs observed during our investigation. We encourage our customers to investigate these indicators in their environments and implement detections and protections to identify past related activity and prevent future attacks against their systems.NOTE: These indicators should not be considered exhaustive for this observed activity.Microsoft Sentinel customers can use the following queries to look for the related malicious indicators in their environments.Identify ZINC IP/domain/hash IOCThis query identifies a match across various data feeds for IP/Domain IOCs related to the Zinc actor as shared in this blog post.Identify ZINC filename/command line IOCTo locate possible Zinc Filename/command line activity shared in the blog Microsoft Sentinel customers can use the queries below:Identify ZINC AV hits IOCThis query looks for Microsoft Defender AV detections related to Zinc actor as shared in the blog post:To locate related activity, Microsoft 365 Defender customers can run the following advanced hunting queries:Suspicious mapistub.dll file creationLook for PresentationHost.exe creating mapistub.dll, likely for use in DLL search order hijacking attacks.Suspicious mscoree.dll file creationLook instances of mscoree.dll created by PuTTY processes. Suspicious colorcpl.exe image loadSurface instances of the colorcpl.exe process loading colorui.dll not in an expected path, indicative of a DLL search order hijacking attack. \n\t\t\tMicrosoft has observed ongoing activity from mobile banking trojan campaigns targeting users in India with social media messages and malicious applications designed to impersonate legitimate organizations and steal users’ information for financial fraud scams. \t\t\n\t\t\tMicrosoft has been tracking activity related to the financially motivated threat actor Octo Tempest, whose evolving campaigns represent a growing concern for many organizations across multiple industries.\t\t\n\t\t\t Since early October 2023, Microsoft has observed North Korean nation-state threat actors Diamond Sleet and Onyx Sleet exploiting the Jet Brains TeamCity CVE-2023-42793 remote-code execution vulnerability. Given supply chain attacks carried out by these threat actors in the past, Microsoft assesses that this activity poses a particularly high risk to organizations who are affected.\t\t\n\t\t\tMicrosoft Threat Intelligence has identified highly targeted social engineering attacks using credential theft phishing lures sent as Microsoft Teams chats by the threat actor that Microsoft tracks as Midnight Blizzard (previously tracked as NOBELIUM). \t\tMicrosoft is a leader in cybersecurity, and we embrace our responsibility to make the world a safer place."
   },
   {
      "time": "2022-10-08",
      "title": "FBI warns of disinformation threats before 2022 midterm elections",
      "text": " The Federal Bureau of Investigation (FBI) warned today of foreign influence operations that might spread disinformation to affect the results of this year's midterm elections.The federal law enforcement agency warned that foreign actors are actively spreading election infrastructure disinformation to manipulate public opinion, discredit the electoral process, sow discord, and encourage a lack of trust in democratic processes and institutions.As the FBI added, foreign actors might also target the public with attempts to incite violence before and after the midterms.\"Foreign actors may intensify efforts to influence outcomes of the 2022 midterm elections by circulating or amplifying reports of real or alleged malicious cyber activity on election infrastructure,\" the FBI said in a public service announcement jointly issued with CISA.\"Additionally, these foreign actors may create and knowingly disseminate false claims and narratives regarding voter suppression, voter or ballot fraud, and other false information intended to undermine confidence in the election processes and influence public opinion of the elections' legitimacy.\"Disinformation campaigns could use various channels to spread and amplify false claims, including spoofed websites, fake social media personas, and dark web and publicly available media channels.These efforts by foreign actors aim to undermine voter confidence and to entice unwitting consumers of information and third-party individuals to like, discuss, share, and amplify the spread of false or misleading narratives. — FBIThe FBI and CISA urged voters to carefully evaluate their sources of information in the lead-up to and after the 2022 midterm elections and to only trust info from trusted sources, including reputable news outlets and election officials.The FBI and CISA said cyber-attacks attempting to compromise election infrastructure are unlikely to affect election results and will not prevent or cause massive disruption of the voting process."
   },
   {
      "time": "2022-10-08",
      "title": "Operation Chakra: CBI Searches 105 Locations, Targeting Cyber Crimes - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-08",
      "title": "Iranian Hackers Employ Novel RatMilad Spyware to Target Enterprise Android Users  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-08",
      "title": "Australian Security Firm G4S Hacked, Staff on Alert - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " Present and earlier employees of security organization G4S have been alarmed to be cautious, due to a ransomware attack where personal information was stolen and posted online. The leaked info includes tax file numbers, medical checks, and bank account information. The attack comes after the massive Optus data leak incident in Australia, joining two more data breaches. It seeks government plans to reform cybersecurity and follow higher penalties under the Privacy Act.G4S offers services to prisons throughout Australia, earlier it offered services to offshore detention centers on Manus Island, belonging to the federal government. It informed its former and current customers earlier this week that it suffered a cyber incident, allowing unauthorized access to a third party, and giving malware programs access to G4S systems. According to Guardian Australia, it believes the incident to be a ransomware attack targeting Port Philip prison. The media reported on this incident in early July. \"Guardian Australia was also alerted on Tuesday to another Optus-style data breach involving an employment agency. The breach was the result of a similar open application programming interface (API) to that believed to have been breached in the Optus attack. Personal documents such as photos of passport pages and Covid-19 vaccination certificates were accessible via the vulnerability.\"During mid-September, G4S came to know that some data was leaked online. However, it only informed the affected customers about the degree of the attack and the compromised documents in an e-mail earlier this week. The stolen data includes employee names, dates of birth, address, medical and police records, contact info, bank account details, tax file numbers, license details, and Medicare numbers. In some incidents, health info is given to the company, payslips, and Workcover claims information and incident reports have also been leaked.Though the incident happened at Port Philip prison, the cyber criminal got access to the company's entire network throughout Australia. The number of staff impacted by the breach is yet to be known, G4S didn't give answers to questions about the victims, on the other hand, saying the company is working with affected individuals to provide them full assistance. G4S advised the victims to change their identity documents but didn't provide compensation for replacements or give credit monitoring. The Guardian reports:\"Separately, photos of identity documents – including driver licenses – of hundreds of thousands of the company’s clients were publicly available via Google image search results because users had uploaded their licences as their profile photo. The company has since acted to prevent users from uploading sensitive documents to profiles.\"your nameYour Emailyour message"
   },
   {
      "time": "2022-10-08",
      "title": "Details Released for Recently Patched new macOS Archive Utility Vulnerability",
      "text": " Security researchers have shared details about a now-addressed security flaw in Apple's macOS operating system that could be potentially exploited to run malicious applications in a manner that can bypass Apple's security measures.Apple described the bug as a logic issue that could allow an archive file to get around Gatekeeper checks, which is designed so as to ascertain that only trusted software runs on the operating system.The security technology achieves this by verifying that the downloaded package is from a legitimate developer and has been notarized by Apple – i.e., given a stamp of approval to ensure it's not been maliciously tampered with.It's also worth noting archive files downloaded from the internet are tagged with the \"com.apple.quarantine\" extended attribute, including the items within the file, so as to trigger a Gatekeeper check prior to execution.But in a peculiar quirk discovered by Jamf, it was found that the Archive Utility fails to add the quarantine attribute to a folder \"when extracting an archive containing two or more files or folders in its root directory.\"Thus by creating an archive file with the extension \"exploit.app.zip,\" it leads to a scenario where an unarchival results in the creation of a folder titled \"exploit.app,\" while also lacking the quarantine attribute.This application \"will bypass all Gatekeeper checks allowing an unnotarized and/or unsigned binary to execute,\" Jamf researcher Ferdous Saljooki, who discovered the flaw, said. Apple said it resolved the vulnerability with improved checks.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-10-08",
      "title": "Glut of Fake LinkedIn Profiles Pits HR Against the Bots – Krebs on Security",
      "text": " A recent proliferation of phony executive profiles on LinkedIn is creating something of an identity crisis for the business networking site, and for companies that rely on it to hire and screen prospective employees. The fabricated LinkedIn identities — which pair AI-generated profile photos with text lifted from legitimate accounts — are creating major headaches for corporate HR departments and for those managing invite-only LinkedIn groups.Some of the fake profiles flagged by the co-administrator of a popular sustainability group on LinkedIn.Since then, the response from LinkedIn users and readers has made clear that these phony profiles are showing up en masse for virtually all executive roles — but particularly for jobs and industries that are adjacent to recent global events and news trends.“We receive over 500 fake profile requests to join on a weekly basis,” Taylor said. “It’s hit like hell since about January of this year. Prior to that we did not get the swarms of fakes that we now experience.”The opening slide for a plea by Taylor’s group to LinkedIn.Taylor recently posted an entry on LinkedIn titled, “The Fake ID Crisis on LinkedIn,” which lampooned the “60 Least Wanted ‘Crisis Relief Experts’ — fake profiles that claimed to be experts in disaster recovery efforts in the wake of recent hurricanes. The images above and below show just one such swarm of profiles the group flagged as inauthentic. Virtually all of these profiles were removed from LinkedIn after KrebsOnSecurity tweeted about them last week.Another “swarm” of LinkedIn bot accounts flagged by Taylor’s group.“When a bot tries to infiltrate the group, it does so in waves,” Miller said. “We’ll see 20-30 requests come in with the same type of information in the profiles.”After screenshotting the waves of suspected fake profile requests, Miller started sending the images to LinkedIn’s abuse teams, which told him they would review his request but that he may never be notified of any action taken.Some of the bot profiles identified by Mark Miller that were seeking access to his DevOps LinkedIn group. Miller said these profiles are all listed in the order they appeared.Miller said that after months of complaining and sharing fake profile information with LinkedIn, the social media network appeared to do something which caused the volume of group membership requests from phony accounts to drop precipitously.“I wrote our LinkedIn rep and said we were considering closing the group down the bots were so bad,” Miller said. “I said, ‘You guys should be doing something on the backend to block this.”Lathrop said that about two months ago his employer noticed waves of new followers, and identified more than 3,000 followers that all shared various elements, such as profile photos or text descriptions.“Then I noticed that they all claim to work for us at some random title within the organization,” Lathrop said in an interview with KrebsOnSecurity. “When we complained to LinkedIn, they’d tell us these profiles didn’t violate their community guidelines. But like heck they don’t! These people don’t exist, and they’re claiming they work for us!”Lathrop said that after his company’s third complaint, a LinkedIn representative responded by asking ISOutsource to send a spreadsheet listing every legitimate employee in the company, and their corresponding profile links. Not long after that, the phony profiles that were not on the company’s list were deleted from LinkedIn. Lathrop said he’s still not sure how they’re going to handle getting new employees allowed into their company on LinkedIn going forward.But the Sustainability Group administrator Taylor said the bots he’s tracked strangely don’t respond to messages, nor do they appear to try to post content.“Clearly they are not monitored,” Taylor assessed. “Or they’re just created and then left to fester.”This experience was shared by the DevOp group admin Miller, who said he’s also tried baiting the phony profiles with messages referencing their fakeness. Miller says he’s worried someone is creating a massive social network of bots for some future attack in which the automated accounts may be used to amplify false information online, or at least muddle the truth.“It’s almost like someone is setting up a huge bot network so that when there’s a big message that needs to go out they can just mass post with all these fake profiles,” Miller said.In last week’s story on this topic, I suggested LinkedIn could take one simple step that would make it far easier for people to make informed decisions about whether to trust a given profile: Add a “created on” date for every profile. Twitter does this, and it’s enormously helpful for filtering out a great deal of noise and unwanted communications.Many of our readers on Twitter said LinkedIn needs to give employers more tools — perhaps some kind of application programming interface (API) — that would allow them to quickly remove profiles that falsely claim to be employed at their organizations.Another reader suggested LinkedIn also could experiment with offering something akin to Twitter’s verified mark to users who chose to validate that they can respond to email at the domain associated with their stated current employer. In response to questions from KrebsOnSecurity, LinkedIn said it was considering the domain verification idea.“This is an ongoing challenge and we’re constantly improving our systems to stop fakes before they come online,” LinkedIn said in a written statement. “We do stop the vast majority of fraudulent activity we detect in our community – around 96% of fake accounts and around 99.1% of spam and scams. We’re also exploring new ways to protect our members such as expanding email domain verification. Our community is all about authentic people having meaningful conversations and to always increase the legitimacy and quality of our community.”“What’s clear is that LinkedIn’s cachet as being the social network for serious professionals makes it the perfect platform for lulling members into a false sense of security,” Bloomberg’s Tim Cuplan wrote. “Exacerbating the security risk is the vast amount of data that LinkedIn collates and publishes, and which underpins its whole business model but which lacks any robust verification mechanisms.”\r\n         This entry was posted on Wednesday 5th of October 2022 05:20 PM \r\n         It’s super common in Facebook, too. I co-admin a group for stock trading/market news/personal finance discussion with over 15,000 members. When I became an admin (third of three, and one of only two active admins), I did so to help combat scammers and spammers because I have professional experience combating online abuse. At that time, the group had over 17,000 members. I have culled over 2,000, in addition to helping field around 100-150 new member requests per week–and most weeks, only (at most) one or two of those requests are legitimate.I don’t admin any other active groups, so I assumed my group was likely being targeted because of it’s theme (making a juicier pool of potential victims for financial fraud and crypto scams), but a friend of mine recently made a group for “cheesecake lovers,” and within a couple weeks, was cheering about hitting the 50k members mark, but also complains regularly about the behavior of group members (she seems hesitant to accept that, in all likelihood, half or more of her members are probably fake.And Facebook is absolutely awful about acting on abuse reports. No matter how clear, obvious, or blatant the abuse being committed, Facebook almost always says that no rules were broken and declines to take enforcement action, usually without ever allowing a human to get involved, but the humans rarely act even when they are involved.now doubt about FB and their customer/consumer interactions. It’s wishful thinking when reporting anything. And they are often heavy handed when it’s automated punishments. 30 days bans for people in a private group that discus security issues, because we mention items in conversation that happen to be “sensitive”  topics to the FB police. They have a way to challenge it, but it’s a joke too. I just take it for granted that all social media’s main purpose is to “guide peoples opinions to those that the owner/board want people to have”, to be good little consumers that only think what they are allowed to talk about. Not a place for humans that think.> asking to send a spreadsheet listing every legitimate employee . . . that were not on the company’s listThat’s not the way data privacy works.  Rather than giving up all your employees like that, properly put the onus on LinkedIn not to *libel* you by publishing false claims about your business.  > We do stop . . . around 96% of fake accountsWhy do companies say things like this as if they were bragging about doing a good job rather than realizing they’re admitting to doing a *terrible* job?  The fullness of their statement is essentially:  “You know those 12,700 fake accounts you personally noticed?  Well, our garbage system was really allowing around 325,000 fake accounts to get created!”There’s no reason to think this isn’t in some way intentional by LinkedIn, for whatever reason.  It’s trivially easy to put measures in place to stop this far beyond a simple “created on” date.  I mean, the whole site is the network effect in action, and they’re allowing anyone to claim a connected node?  That’s a level of ineptitude that rises to the level of malicious/nefarious.  No organization that values competence should be dealing with LinkedIn.“No organization that values competence should be dealing with LinkedIn.”Absolutely correct. Anyone with a modicum of sense and critical thinking ability should immediately understand that a for-profit “open” social network like LinkedIn that enforces no rules or standards is, and will always be, utterly untrustworthy.LinkedIn used to spam the bejaysus out of me, even after I begged them to stop. I won’t have anything to do with spammers.“cynical attempts to exploit Humanitarian Relief and Crisis Relief experts.”\nDoesn’t that imply they once cared?  Else what’s the baseline for cynicism?\nYou saw the Ukraine referendums, 99% should be enough for anyone.The number one reason I left facebook, dating websites, all social media and soon to leave linkedin is fake profiles. I do not want fake profiles wasting my time and I do not like fake profiles trying to influence my values. Life is so much better when I remove the fake profile noise and tune out the internet social media crap.Well I wrote a good response that apparently got filtered by the approval bot (I’m used to that; my writing style tends to be a bit colorful and um loquacious so sometimes I may come off as Saul Goodman meets Hunter S. Thompson to these bots), but really all I wanted to say is:– “Life is so much better when I remove the fake profile noise and tune out the internet social media crap.”Word and church, Tim2DaG, best comment on here yet!Nulling FaceBook was a no-brainer for me once I was able to finally suck my mind out of it in about 2018 – and don’t even bother to get me started about their security…LinkedIn took a little longer for me to see behind the Oz curtain because many of the potential phishing attempts in my gmail from alledged recruiters appear to be sent through the LinkedIn proprietary message system but don’t stand up to even cursory cross-checking of the alledged recruiter names, company names, eMail addies and URLs against valid company URLs and employee lists and a significant number of these reference alledged Indian divisions of real global corporations…What is grossly maddening and saddeningly insidious is that the “n’er-do-wells” – as CyberHero Brian Krebs all too generously refers to them – are abusing these kinds of sites to prey on alot of truly nice people who are earnestly just trying to find honest work because their families need food on their tables…> around 325,000 fake accounts to get created    Then the 325,000 fake accounts sent requests to everyone in their address books to “Join my LinkedIn network!”.  /s  (Reference to the early days of LinkedIn behavior of conscripting unsuspecting users into spamming all their friends.  Of course the bots have no one else in their address books)This. It’s happening.I had a number of weird accounts try to connect not that long ago, they were all crypto related and came out of the blue. Perhaps a similar scenario?“Stopping 96% of fake accounts” implies they know they must know that other 4% are fake yet aren’t doing anything about it…No you bag of potatoes. It means that their current methods of stopping accounts can take care of 96% of fake accounts. However, there are 4% where their tools haven’t been able to successfully remove, but they still know about them and the accounts will be removed manually (not efficient). Therefore, there is still room for improvement, which will always be the case for fake accounts. It’s an endless battle.There should be a place to apply so one can be vetted for created sock puppet accounts – as being authentic and part of an RTE. Because stuff like this happens, it would make sense to test an enterprise against it right? Also, why not request that this-fill in the blank- does not exist add metadata that large social media companies can detect. If for anything else to monitor to see unknown TTPs being utilized. Then there is the issue of privacy. My profile just doesn’t have a headshot. The only thing that verifying myself through my company does is gives them access to my LinkedIn profile… which kinda defeats the purpose. I dont want my company seeing my profile unless it’s to verify what I am putting as my experience through them specifically. Domain verification…. guess what… didnt work. LinkedIn is caught and tossed from the spam filter immediately. There’s a difference between letting companies be assessed for potential insider threats, people saying they had a job that they didn’t (or responsibilities), and letting North Korea set up a ton of CISO (HIGH LEVEL C-SUITE) be created with little to no filtering. How could LI not be going after crypto scams before any of this happened?? That has been a known threat for a decade.I used LinkedIn a bunch when I was working (before I retired). I was not shopping connections or prospects but more learning about a legitimate business or person. But it kept getting worse with the solicited connections or groups or people who seem to put some value on how many connections (friends) the have. I had already deleted FB and, after retiring, likewise for LinkedIn. Problem solved.It  can’t  be no  worse  then all the  fake  accounts  on FacebookExcept a random FB page isn’t lending undue credential as a security professional.\nThe same problems exist in different ratios and means but FB isn’t taken seriously\nwhere LI unfortunately and ridiculously is.Linkedin is the perfect Scam Platform i learned from the movie “The Wolf of Wallstreet”.“Sell me this pencil!”> “Sell me this pencil!”That was the first exercise in my sales training course.The other thing I remember is the phrase “Would you like it in green?” That was the suggested response to a customer asking “Do you have it in green?” when you’re trying to sell them a beige box (i.e. we can get some green car-body spray). In theory, if they say Yes, you’ve closed the sale.Most of the CISOs and other cybersecurity executives in the US are unqualified and incompetent any way.\nAttorneys, Physicians alike need to go through rigorous academic and real world experience before they start practicing. Any Tom and Dick who have executive contacts can become a CISO in this country with a degree in Music. Not kidding.LEAVE NOW. This is the best advice I can give. I never joined any of those “web 2.0” purveyors, going back to “myspace” and the like, where you are the product, you are providing their content. Disconnect, drop out, tune in; to paraphrase Dr. Tim Leary. It’s all a bunch of bull, meant to keep you preoccupied while they rake in oodles of cash using you as their bait. Illegal? Not in most countries. Immoral? Absolutely.I was told, and Brian reiterates here, to “stake my claim, plant my flag” on these slimeball sites, because it is intimated that someone else will impersonate me and “ruin my reputation”. If someone is using these sites to find out what a person is worth, then need to have their head examined. Even profiles that have real people behind them are full of misdirection and bluffs that have replaced the “love-me-wall” at work. I mean “Crisis relief thinker”? “Branding queen”? Yes, I know those are on the fake profiles, but they were copied from “real” ones somewhere.Hopefully everyone will soon realize how easy it is to fool these companies into having fake data, fake profiles, fake lives show up when anyone cares to look, and then there will be a great reckoning. Either disconnect and get back to real face-to-face meetings and phone calls, or force these companies to spend millions, or billions to implement hither-to-unannounced highly-invasive features to “remedy” the problem. Which will probably cost the users too, in real dinero.Remedy until the next brilliant nefarious mind comes along, that is.ThanksI just had a fake profile apply to an open position at my org. I am one of those rare hiring managers who reads every resume and cover letter I receive and matches it against LinkedIn or portfolio sites if I want to go the next stage. Nothing, and I mean nothing aside from the name and profile picture (which looked like a stock image) matched between the resume and LinkedIn profile. Everything from the background to location to education was completely different. I flagged it for the hiring team after assuming it was someone trying to get a job for someone else. Now it seems far more sinister.Unfortunately, ever since MSFT took it over, it’s been a cesspool. I always thank God I’m retired from IT, the way it’s going downhill even faster; it’s just taking so long to sink because it’s so huge, and it has the 800lb gorilla in Redmond behind it.\nI STILL get weekly spam/phishing emails from accounts with no picture,  500+ connections, and a very short history.It’s really too bad. It started out as a really nice tool from 2003 to about 2016…and it just got worse from there on.Sad.Actually, I have been getting a lot of requests from weird accounts lately and this is getting very serious! Thank you for sharing thoYes, I tried LinkedIn once or three times. Did not much like it. Have not used it for quite some time. It is a little irritating for me.Ok now after 3 posts apparently rejected by the site censor bot, this is a test post with no possible objectionable content or verbiage.Res5TestInternet job sites are manipulators I would stay far away from this crowd people tend to trust anyone in these area’s.also what I don’t understand is how the corporate world can fall head over for it.Fake profiles for fake jobs. Crisis relief expert? Networking Guru? Remote hiring expert? Those are all fake jobs where anyone can easily claim qualifications.I have been following up on crypto trades ever since I got to know about it . I finally decided to involve in it so I got money out of my savings and put into it .. along the line it all seemed good trading then one day I couldn’t gain access to the crypto account and I kept receiving mails that my money was removed from it.. I was fuming and almost went wild with the whole situation until I came across an article about CryptoSwiftRecovery AT g mail. com and how they help with such a case as my own. contacted them and explained my story to them and they required some details from me about the crypto account.. finally they were able to help me recover every bit of my money that I thought was gone…captin uranis is comin to get yaTheb biggest issue is I can create one linkedin profile with one email, no need verification. Should let every one verify this is you and this is a real person.Comments are closed.Mailing ListSearch KrebsOnSecurityRecent PostsStory CategoriesWhy So Many Top Hackers Hail from Russia"
   },
   {
      "time": "2022-10-08",
      "title": "City of Tucson discloses data breach affecting over 123,000 people",
      "text": " The City of Tucson, Arizona, has disclosed a data breach affecting the personal information of more than 123,000 individuals.As revealed in a notice of data breach sent to affected people, an attacker breached the city's network and exfiltrated an undisclosed number of files containing sensitive information.\"On August 4, 2022, the City learned that certain files may have been copied and taken from the City's network.\"The City began notifying potentially impacted individuals on September 23 that, among the sensitive personal information exposed during the incident, the attacker could have accessed the affected individuals' names and Social Security numbers.\"The information within the potentially accessed files included certain individuals' name, Social Security number, driver's license or state identification number, and passport number.\"Notification letters sent to affected individuals also reveal no evidence was found that this personal info has been misused until now.Those impacted by the data breach are advised to monitor their credit reports for any suspicious activity that could hint at incidents of identity theft and fraud involving their personal information.The City is providing impacted individuals with 12 months of free access to Experian credit monitoring and identity protection services, as well as guidance on defending against identity theft.\"The City treats the security of information in its possession as an utmost priority and apologizes for any inconvenience this event may cause,\" the breach notification letters read.\"As part of its ongoing commitment to the security of information within its care, the City reviewing its existing policies and procedures regarding cybersecurity and evaluating additional measures and safeguards to protect against this type of event in the future.\"Update: Corrected title saying 125K+ individuals were affected instead of 123K+."
   },
   {
      "time": "2022-10-08",
      "title": "Pegasus: Spyware Attacks Targets Journalists and Activists - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-08",
      "title": "Ferrari Refutes Ransomware Attack Following RansomEXX’s Online Claims - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-08",
      "title": "Hundreds of Microsoft SQL servers backdoored with new malware",
      "text": " Security researchers have found a new piece of malware targeting Microsoft SQL servers. Named Maggie, the backdoor has already infected hundreds of machines all over the world.Maggie is controlled through SQL queries that instruct it to run commands and interact with files. Its capabilities extend to brute-forcing administrator logins to other Microsoft SQL servers and doubling as a bridge head into the server's network environment.The backdoor was discovered by German analysts Johann Aydinbas and Axel Wauer of the DCSO CyTec. Telemetry data shows that Maggie is more prevalent in South Korea, India, Vietnam, China, Russia, Thailand, Germany, and the United States.Extended Stored Procedure files extend the functionality of SQL queries by using an API that accepts remote user arguments and responds with unstructured data.Maggie abuses this technical behavior to enable remote backdoor access with a rich set of 51 commands.A report from DCSO CyTec says that the variety of commands supported by Maggie allow querying for system information, executing programs, interacting with files and folders, enabling remote desktop services (TermService), running a SOCKS5 proxy, and setting up port forwarding.The attackers can append arguments to these commands, and Maggie even offers usage instructions for the supported arguments in some cases.The researchers say that the command list also includes four “Exploit” commands, indicating that the attacker may rely on known vulnerabilities for some actions, such as adding a new user.However, the analysts couldn’t test the exploits as they appear to depend on an additional DLL that is not shipped with Maggie.Brute-forcing admin passwords happens through the commands “SqlScan” and “WinSockScan” after defining a password list file and a thread count. If successful, a hardcoded backdoor user is added to the server.The malware offers simple TCP redirection functionality, which allows remote attackers to connect to any IP address the infected MS-SQL server can reach.“The implementation enables port reuse, making the redirection transparent to authorized users, while any other connecting IP is able to use the server without any interference or knowledge of Maggie,” the researchers added.The malware also features SOCKS5 proxy functionality to route all network packets through a proxy server, making it even stealthier if needed.At this time some details remain unknown, like the post-infection use of Maggie, how the malware is planted in the servers in the first place, and who is behind these attacks."
   }
]