[
   {
      "time": "2022-08-17",
      "title": "Exploit out for critical Realtek flaw affecting many networking devices",
      "text": " Exploit code has been released for a critical vulnerability affecting networking devices with Realtek’s RTL819x system on a chip (SoC), which are estimated to be in the millions.The flaw is identified as CVE-2022-27255 and a remote attacker could exploit it to compromise vulnerable devices from various original equipment manufacturers (OEMs), ranging from routers and access points to signal repeaters.No user interaction neededTheir presentation covered the entire effort leading to finding the security issue, from picking a target to analyzing the firmware and exploiting the vulnerability, and automating the detection in other firmware images.The vulnerability is a stack-based buffer overflow in the SIP ALG function that is responsible for rewrites SDP data. They also shared a video showing that a remote attacker could compromise the device even if remote management features are turned off.The researchers note that CVE-2022-27255 is a zero-click vulnerability, meaning that exploitation is silent and requires no interaction from the user.An attacker exploiting this vulnerability would only need the external IP address of the vulnerable device.Johannes Ullrich, Dean of Research at SANS says that a remote attacker could exploit the vulnerability for the following actions:Ullrich warns that if an exploit for CVE-2022-27255 turns into a worm, it could spread over the internet in minutes.This is because multiple vendors use the vulnerable Realtek SDK for equipment based on RTL819x SoCs and many of them have yet to release a firmware update.It is unclear how many networking devices use RTL819x chips but the RTL819xD version of the SoC was present in products from more than 60 vendors. Among them ASUSTek, Belkin, Buffalo, D-Link, Edimax, TRENDnet, and Zyxel.The researcher says that:It is important to note that not all products using RTL819x are vulnerable. Faraday Security researchers shared a list with products powered by Realtek's chip and believed to be vulnerable.Zyxel NBG6615 is on the list because it runs on a vulnerable chip. However, it is not impacted by the vulnerability.Zyxel reached out to BleepingComputer after publishing this article to explain that the firmware in the NBG6615 router does not initiate the ALG comment function, and, it is not affected by CVE-2022-27255.Users should check if their networking equipment is vulnerable and install a firmware update from the vendor released after March, if available. Other than this, organizations could try to block unsolicited UDP requests.Update: Zyxel contacted BleepingComputer after publishing this article to share that CVE-2022-27255 impacts none of its products and to clarify that while its NBG6615 runs on Realtek, the firmware does not use the vulnerable function."
   },
   {
      "time": "2022-08-17",
      "title": "RTLS systems vulnerable to MiTM attacks, location manipulation",
      "text": " Security researchers have uncovered multiple vulnerabilities impacting UWB (ultra-wideband) RTLS (real-time locating systems), enabling threat actors to conduct man-in-the-middle attacks and manipulate tag geo-location data.RTLS technology is widely used in industrial environments, mass transit, healthcare, and smart city applications. Its primary role is to assist in safety by defining geofencing zones using tracking tags, signal reception anchors, and a central processing system.Tampering with the limits of hazard zones or the position of people in these environments can have dire consequences for their health and safety.Nozomi analysts focused on the Sewio Indoor Tracking RTLS UWB Wi-Fi kit and Avalue Renity Artemis Enterprise kit, two widely used RTLS solutions that support the safety functionalities described above.The tracking tags communicate with the anchor via UWB signals, while the anchors use Ethernet or Wi-Fi to transmit or receive data from the central computer.If Wi-Fi is selected, both devices use a custom binary network protocol for communications. However, since there’s no encryption in the data, Wireshark captures of the network packets make reverse engineering possible.The prerequisite for capturing those packets is to break into the Wi-Fi network, which is WPA2-PSK-protected. However, both vendors use a weak default password that may not be re-configured during installation, so many deployments are easy to breach.If a remote attacker manages to compute the position of the anchors to derive the relative position of the tracking tags, they would be able to send arbitrary values to the central computer by forging sync and positioning packets.Nozomi says the key information of anchor positioning can be derived through the transmitted power levels and timestamps, which indicate tag distances from the anchor points. However, physical access to the target area would simplify this process.Apart from data manipulation, an attacker may eavesdrop to track assets and people positions, either for stalking and reconnaissance or for locating a valuable item.Movement patterns can be recorded and replayed during attacks to imitate realistic tag movement, like a guard on patrol, for example.An attacker with access to the RTLS system can alter the position of a tag as needed to allow entrance to a restricted area or to raise false alarms and disrupt production line operations.Additionally, personnel could be put at physical harm risk by making them appear outside the proximity of machine safety zones, which would continue operating as if nobody was around.If the threat actor aims to steal a valuable item tracked by a tag, they could manipulate its position to make it appear stable inside a protected zone while physically removing it from the monitored area without raising any alarms.Nozomi suggests that admins of RTLS systems should use firewalls to restrict access, add intrusion detection systems in the network, and use SSH tunneling with packet synchronization counter-values for data encryption."
   },
   {
      "time": "2022-08-17",
      "title": "Over 1,900 Signal User Data Exposed  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-08-17",
      "title": "Malicious browser extensions targeted almost 7 million people",
      "text": " Almost 7 million users have attempted to install malicious browser extensions since 2020, with 70% of those extensions used as adware to target users with advertisements.The most common payloads carried by malicious web browser extensions during the first half of 2022 belonged to adware families, snooping on browsing activity and promoting affiliate links.From January 2020 to June 2022, Kaspersky recorded adware extensions targeting 4.3 million unique users, corresponding to roughly 70% of all malicious extensions in that period.It should also be noted that these numbers only reflect telemetry from users who utilize Kaspersky software. The numbers are likely far more significant when considering users protected by other security vendors.Starting with 'WebSearch,' Kaspersky says they detected related extensions targeting 876,924 users this year, typically mimicking productivity tools such as DOC to PDF converters and document merging utilities.According to Kaspersky, WebSearch monitors users' browsing activity to profile them based on their interests and then promotes links from affiliated marketing programs that help monetize the infection.Additionally, WebSearch changes the browser's home page with AliExpress or Farfetch, generating funds from the extension through clicks on affiliated links on the search results.The second most common adware hiding in the browser extension scripts is 'AddScript,' seen in attacks against 156,698 unique users.AddScript runs covertly in the background while the extensions that carry it offer the promised functionality: downloading videos from the web.The malware uses JavaScript fetched after installation to run videos in the background and log \"views\" on YouTube channels, thus increasing ad revenue.Additionally, the AddScript injects affiliate cookies on the host, receiving commissions for purchases made through the browser.The third-most popular adware nesting on people's machines via malicious extensions is 'DealPly,' responsible for 97,525 infection attempts in the first half of the year.This adware begins with the execution of pirated software like KMS activators and game cheat engines downloaded from peer-to-peer networks and shady sites.This is followed by the automatic injection of the browser extensions and the addition of new registry keys.These keys add persistence, so if the user removes the extension, it is re-downloaded and installed on the browser when the program is relaunched.DealPly also changes the browser's home page to promote affiliate sites that match the user's search queries.To keep your browser free of adware infections, only download extensions from the browser's official web store, examine user comments and reviews, and run a background check on the developer/publisher.Some extensions require powerful permissions to offer the promised functionality, so it's essential to review their privacy policy and data collection practices carefully before agreeing to them.Finally, try to use the least amount of extensions you need and periodically review the installed add-ons to remove any that you are unsure of how they were installed."
   },
   {
      "time": "2022-08-17",
      "title": "How electronic warfare is reshaping the war between Russia and Ukraine",
      "text": " Drones have played an outsized role in Ukraine’s efforts to locate troops and plan out attacks in its war with Russia. But the devices are increasingly thwarted by an invisible enemy: Russia’s electronic warfare arsenal.Electronic warfare systems have been used by both Russia and Ukraine in recent months to locate, disrupt and jam electronic and GPS signals from weapons and drones. The systems can be used by aircraft, naval ships, ground forces, and helicopters, according to Samuel Bendett, an analyst and expert in unmanned and robotic military systems at the Center for Naval Analyses.Electronic warfare systems use signals such as radar, radio, and infrared transmissions to detect, interpret and disrupt communication. The stations detect enemy electronic signals and attack the equipment emitting them essentially with white noise, which makes them inoperable.Although both countries have made use of the technology, Russia in particular has invested in a wide range of equipment — from tactical close-range systems to ones that can supposedly disrupt enemies dozens of kilometers away, Bendett said. And Russia has increasingly made use of these systems as cyberattacks and ground strikes against Ukraine’s communications infrastructure have proved to have limited impact.“[When] they realized that wasn't enough, they turned to electronic warfare,” said Makena Young, associate fellow with the Aerospace Security Project at the Center for Strategic and International Studies (CSIS).Electronic warfare technology isn’t particularly new: Even before the war, Russia actively promoted its electronic warfare systems, according to Valentyn Badrak, director at Ukrainian Center for Army Conversion and Disarmament Studies. It used some of the same systems in previous conflicts, including the invasion of Crimea and eastern Ukraine in 2014 and the Syrian civil war in 2015.But the systems have seen particularly heavy use in recent months as Russia looks to disrupt Ukraine’s drone strategy.Ukrainian charities have raised millions of dollars to purchase and develop unmanned aerial vehicles, and the country has launched piloting schools, including Dronarium and Boryviter, to train hundreds of professional drone operators. More than 400 pilots graduated from these two schools in July, according to the Ukrainian Digital Transformation Ministry.Ukraine has no centralized supply of drones for the army — some soldiers buy drones themselves, and others receive them from friends, family or charitable funds. Small commercial drones, such as DJI quadcopters, are not designed for war, and make easy targets for sophisticated electronic warfare attacks, according to Bendett. In addition to small commercial drones used for surveillance, Ukraine’s drone fleet has combat UAVs, like the Turkish Bayraktar TB2 and R18 developed by the Ukrainian drone unit Aerorozvidka.But drone operators have found it difficult to keep these devices in the air.“There are entire segments of the front where [Ukrainian drone operators] can’t fly their drones since they are getting jammed by the Russian EW forces,” Bendett said.The Russian military is currently deploying Krasukha-2 and 4, R-330 Zhitel, Moskva-1, Leer-3, RP-377L/LA Lorandit, and Pole systems, among others, according to Bendett. They primarily target mobile networks, satellite navigation, and communication between drones and their operators, he said. Electronic warfare systems have already had a major impact, Ukrainian drone operators told The Record. Russia has claimed to have destroyed at least 1,700 Ukrainian drones since the start of the war, although Ukraine hasn't confirmed this figure.\"To say how many drones we lost, we need to know how many of them we had at the beginning of the war,\" said Vadym, the head of the robotics department at Aerorozvidka, who asked to go by his first name due to security reasons. Although Russia has many strengths with electronic warfare, Ukraine is trying to catch up, according to Badrak.The Ukrainian electronic warfare arsenal is similar to Russia’s — both countries inherited much of the technology from the USSR and developed systems together prior to the war. In Ukraine, the systems are developed by two private companies — Ukrspetszvyazok and Proximus. Among the most popular, uniquely Ukrainian electronic warfare systems, according to Badrak, are Enclave, Bukovel, and Prometheus-MF5. In addition to disrupting drones, electronic warfare has been used to block communications in Ukraine.Because of this, most of the Ukrainian military uses the U.S. L3Harris systems, which are more secure, according to Badrak. Ukrainians also use Elon Musk’s satellite internet Starlink, which is not as affected by Russian electronic warfare systems. “The Russians can locate Starlink terminals, but deciphering the internet stream is very difficult, so we recommend using them,” according to Vadym from Aerorozvidka.Although some alternative communication channels exist, there isn’t always a way for Ukrainians to protect themselves from Russian electronic warfare systems, according to Bendett. Improving defense involves masking, protecting, and limiting “electronic signatures,” including radio and cellular communications and electronic signals emitted by combat vehicles and systems, he said.According to Young, “the best way to protect yourself from EW is to make sure your equipment is less vulnerable to these systems and that all of your communications are secure.”“Most drone manufacturers have taken notice and will look for ways to avoid the impact of EW,” according to Vadym. “There is a solution to any problem, but it takes time,” he said.For now, the conflict is revealing what war will look like in the future, according to Young. “Space and cyber capabilities have been used during this war in ways we have never seen before. It's a quick and easy way to disrupt someone's communication,” she told The Record.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-17",
      "title": "New MailChimp breach exposed DigitalOcean customer email addresses",
      "text": " DigitalOcean is warning customers that a recent MailChimp security breach exposed the email addresses of some customers, with a small number receiving unauthorized password resets.The company says they first learned of the breach after MailChimp disabled their account without warning on August 8th. DigitalOcean used this MailChimp account to send email confirmations, password reset notifications, and alerts to customers.DigitalOcean says that on the same day, a customer notified their cybersecurity team that their password was reset without authorization.After an investigation, they found an unauthorized email address from the @arxxwalls.com domain was added to their MailChimp account and used in emails starting on August 7th.Believing that their MailChimp account was breached, DigitalOcean says they reached out to the company but didn't hear back until August 10th, when they learned that a hacker had gained access to MailChimp's internal support tools.Further investigations showed that the threat actor used the stolen customer email addresses to try and gain access to DigitalOcean accounts by performing password resets. These password reset requests originated from the IP address x.213.155.164.However, those accounts using multi-factor authentication were protected from the password reset attempts.DigitalOcean has since switched to another email service provider. The company notified affected customers about the data breach yesterday.BleepingComputer contacted DigitalOcean last night with further questions about the breach but did not receive a response.As for MailChimp, a security advisory posted on August 12th does not provide much information other than saying it targeted crypto-related customers.\"We took this action to protect our users’ data, and then acted quickly to notify all primary contacts of impacted accounts and implement an additional set of enhanced security measures.However, in response to questions about the breach, MailChimp told BleepingComputer that they were breached through phishing and social engineering tactics that allowed the hackers to access 214 MailChimp accounts.\"We recently experienced a security incident in which unauthorized actors targeted Mailchimp’s crypto-related users by employing sophisticated phishing and social engineering tactics. Based on our investigation to date, it appears that 214 Mailchimp accounts were affected by the incident.\" - MailChimp.MailChimp told us they are working to reinstate accounts and investigate the incident.As part of DigitalOcean's disclosure, they mention that an email address from the @arxxwalls.com domain was added as a sender to its MailChimp account.While the owner of the arxxwalls.com domain states that it is not used for illegal activity, it has been abused by numerous scams, operators of fake companies, and phishing attacks.Included in these emails is a phone number that, when called, will be used to steal information from the victim or to prompt the recipient to install remote access software on their device."
   },
   {
      "time": "2022-08-17",
      "title": "The Return of LOIC, HOIC, HULK, and Slowloris to the Threat Landscape – Radware Blog",
      "text": " Figure 1: HOIC, LOIC, HULK, Slowloris DoS Events (2020/2021)\nData source: Radware Cloud ServicesBy the decade’s end, simple denial-of-service tools barely impacted the threat landscape, averaging less than a few hundred monthly events (see figure 1). This decline in use is primarily attributed to the collapse of Anonymous following the Trump/Clinton election battle in 2016 and hacktivists’ inability to grasp more advanced Tactics, Techniques, and Procedures (TTP) as the threat landscape evolved into a more organized and for-profit model.Figure 2: HOIC, LOIC, HULK, Slowloris DoS Events (2020-2022)\nData source: Radware Cloud ServicesHOIC, HULK, LOIC, and Slowloris are all well documented, allowing anyone the ability to launch a denial-of-service attack without any prior knowledge or experience. And while these tools may not be relevant to the current threat landscape, one thing is clear about their return. They are the digital weapon of choice for people worldwide.Most threat actors today who use these tools are not cyber experts or technically savvy people. They are people who have been driven to act and commit a crime due to a local or geo-political event, assuming their actions will be justified and result in their desired outcome. But what happens when that objective isn’t accomplished?They crash from a dopamine high, reporting either they do not have the knowledge or the experience to counter mitigation by leveraging more advanced TTPs or that denial-of-service attacks on pharmacies and movie theaters will not win a kinetic war.As the Russian/Ukrainian conflict continues into the second half of the year, it is expected that the use of simple denial-of-service tools will continue to decline in the region as the local threat landscape evolves and escalates. Those unable to counter mitigation techniques or find unprotected websites will likely exit the conflict. At the same time, those who can advance will probably move away from the psychological highs of launching simple denial-of-service attacks and pursue more advanced tactics and techniques that will have a more significant impact on the current conflict.It is also likely that low-level threat actors in the second half of 2022 will begin to shift their emotions and attention towards the growing conflict between China and Taiwan, running the same playbook seen in the Russian invasion of Ukraine during the first half of the year. In this case, we could expect another peak of activity from denial-of-service tools such as HOIC, HULK, LOIC, and Slowloris as unprotected assets are targeted in the region.Daniel is the Head of Research for Radware’s Threat Intelligence division. He helps produce actionable intelligence to protect against botnet-related threats by working behind the scenes to identify network and application-based vulnerabilities. Daniel brings over ten years of experience to the Radware Threat Intelligence division. Before joining, Daniel was a member of Radware’s Emergency Response Team (ERT-SOC), where he applied his unique expertise and intimate knowledge of threat actors’ tactics, techniques, and procedures to help develop signatures and mitigate attacks proactively for customers.Our experts will answer your questions, assess your needs, and help you understand which products are best for your business.We’re ready to help, whether you need support, additional services, or answers\n\t\t\t\t\t\t\tto your questions about our products and solutions.An Online Encyclopedia Of Cyberattack and Cybersecurity TermsConnect with experts and join the conversation about Radware technologies.\n\n\n"
   },
   {
      "time": "2022-08-17",
      "title": "\r\n\tTwo Additional Malicious Python Libraries Found on PyPI Repository - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistAccording to the security team, both new packages were masquerading as one of the most popular open-source packages on PyPI.“The attacker used a description of the legitimate ‘requests’ package in order to trick victims into installing a malicious one,” wrote Kaspersky.Additionally, the description contained faked statistics, suggesting the package was installed 230 million times in a month and had more than 48,000 “stars” on GitHub. “The project description also references the web pages of the original 'requests' package, as well as the author’s email,” Kaspersky said. “All mentions of the legitimate package’s name have been replaced with the name of the malicious one.”The code of the malicious packages was also extremely similar to the code of the legitimate ‘requests’ package, except for one file called exception.py.The modified version of the script (dated July 30, the date of publication of the malicious package), was responsible for delivering a malicious payload.“The script writes another Python one-liner script into a temporary file and then runs that file via the system.start() function. Then that one-liner script downloads the next-stage script,” Kaspersky explained.The next stage of the attack would then rely on a downloader obfuscated with a publicly available tool named Hyperion, which would deploy the final stage payload featuring a script allowing it to achieve persistence on the infected machine.The final payload, dubbed “W4SP Stealer” by its author in the code, is a Trojan written in Python and obfuscated with the same obfuscator as the downloader. The malware can steal IP addresses, and work with cryptography for decrypting cookies and passwords from browsers. After initial infection, the Trojan starts collecting Discord tokens, saved cookies and passwords from browsers in separate threads.“The injected script monitors the victim’s actions such, as changing their email address, password or billing information. The updated information is also sent to the Discord channel,” read the advisory.Kaspersky ended the document by confirming it reported the two packages to both the PyPI security team and Snyk Vulnerability Database."
   },
   {
      "time": "2022-08-17",
      "title": "\r\n\t#DEFCON: Electrovolt Exploits Against Electron Desktop Apps Exposed - Infosecurity Magazine\r\n",
      "text": " Reporter, Infosecurity Magazine\"We were able to compromise 20 different electron applications, that are  used by millions of people,\" Purani said.The vulnerable applications included Microsoft Teams, VS Code, Discord, Mattermost, RocketChat, Notion and BaseCamp among others. Purani explained that Electron based apps have become increasingly common in recent years. Electron enables developers to encapsulate web applications into a desktop app which is rendered using the Chromium web browser.\"If you can build a website, then you can build a desktop application, that's the main concept behind Electron,\" Purani said. \"Just using HTML, JavaScript, and CSS you can ship an entirely cross platform native desktop application.\"While there is great power with Electron, there is also risk. A common function for developers to use within Electron is to load remote content, which is one of multiple ways that Electrovolt was able to exploit Electron apps.\"So the only thing you need to do as an attacker is to find a way to invade your JavaScript within the webpage,\" Purani said.One such example that the researchers discovered is CVE-2021-43908 which is an exploit that targets Microsoft's VS Code. Purani suggests that a lesson learned from that specific flaws is that developers of electron apps should consider all windows as a part of the threat model and apply the most restrictive settings on all of them.The Electrovolt researchers also discovered a remote code execution issue in the popular social messaging app Discord. The issue with Discord was a little more mundane in that the Discord desktop app was running with an older version of Electron, which in turn was using an older version of Chromium that was at risk. Microsoft Teams also found to be vulnerable to an account takeover risk, due in part to the fact that the application was using an older version of Electron.The researchers also found that some applications were at risk from an attack vector known as Same Site Origin Spoofing. Purani explained that Chromium, like most modern web browsers, has a feature known as site isolation which applies different restriction to content coming from the same domain than it does for content coming from a different origin point. Chromium and Electron will update for issues as they arise, such as Same Site Origin Spoofing issues, but there is often a gap between when the primary project update and when Electron base apps update.\"There is a noticeable patch gap between chromium and electron applications, which makes most of them susceptible to this attack,\" Purani said. \"If you are a developer who is always keeping up with the pace of Electron releases, then you should be much safer from the patch gap and it will be narrow.\""
   },
   {
      "time": "2022-08-17",
      "title": "Multiple cloud vendors impacted by PostgreSQL vulnerability that exposed enterprise databases | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondFlaws discovered in various PostgreSQL-as-a-Service offerings, including those from Microsoft and GoogleWiz Research has found vulnerabilities in popular ‘PostgreSQL-as-a-Service’ offerings from various cloud vendors, introduced by the cloud vendors themselves.“The isolation was not perfect, and we had network access from our managed instance to other customers’ instances, which opened an attack surface for other potential vulnerabilities,” Shir Tamari, head of research at Wiz, tells The Daily Swig.“We proved it was possible to exploit this attack surface and gained full read access to the databases of other customers.”Dating back 25 years, PostgreSQL lacks a permissions model suitable for a managed service, leading vendors to add their own code.“PostgreSQL’s permission model cannot provide a user only a set of superuser privileges. Therefore, cloud vendors had to introduce modifications to allow regular users a set of superuser capabilities. “These modifications let the team execute arbitrary commands on vendor-managed compute instances of multiple PostgreSQL-as-a-Service offerings – in extreme cases gaining unauthorized cross-tenant data access to other customers using the affected service.In the case of Cloud SQL, while the team wasn’t able to gain superuser status, it was possible to access some of its privileges. One was the ability to arbitrarily change the ownership of a table to any user or role in the database.This meant the team could create a table with dummy content, create a malicious index function – with its code execution payload – on the table, and then alter the table owner to cloudsqladmin, GCP’s superuser role, used only by Cloud SQL to maintain and manage the database.Analyzing the table then forced the PostgreSQL engine to switch user-context to the table’s owner, cloudsqladmin, and call the malicious index function with the cloudsqladmin permissions, resulting in execution of the shell command.“During the research, we worked with more than a dozen PostgreSQL vendors to verify and fix the issues we discovered. It turns out that many cloud providers introduced the same modifications to adjust PostgreSQL as a managed service and therefore were potentially vulnerable,” says Tamari.“As part of a broad responsible disclosure process, we shared our findings with major cloud providers and others to help them determine whether they were exposed to the issues we identified.”Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   }
]