[
   {
      "time": "2022-09-27",
      "title": "Australian cybersecurity minister lambasts Optus for ‘unprecedented\\' hack",
      "text": " Australia’s cybersecurity minister criticized the country’s second largest telecommunications company for its response to what she called an “unprecedented theft of consumer information.”The hack involved the theft of basic personal information related to 9.8 million Australians. More alarmingly, it also included extensive personal data like license numbers and passport numbers from 2.8 million people. Australia’s population is about 25 million. The data taken, she said, “effectively amounts to 100 points of ID check,” making the “scope for identity theft and fraud quite significant in particular for those 2.8 million Australians.”She went on to dispute Optus’ characterization of the attack as advanced, calling the incident “quite a basic hack.”Journalist Jeremy Kirk spoke with the hacker behind the incident, who claimed they gained access through an unauthenticated Application Programming Interface (API) endpoint. The hacker said it was “bad access control,” noting that it was connected to the internet “for anyone to use.”“We should not have a telecommunications provider in this country which has effectively left the window open for data of this nature to be stolen,” O'Neil said. The interviewer pressed O'Neil about the discrepancy between her description of the attack and Optus’, asking whether she “bought the line from Optus that this was a sophisticated attack.”“Well it wasn't, so no,” O'Neil responded. “When it comes to cyber protections, the previous government put in place a very significant piece of legislation that I think was a very good start, but it didn't bring telecommunications companies into that legislation and so what it's meant is that I am more limited with telecommunications companies in terms of the powers that I have,” she said.According to O'Neil, industry leaders convinced the government to leave them out of the law, claiming they were “really good at cybersecurity and could do it without being regulated.” That position, she said, was undercut by the current situation with Optus. While in the past, cybersecurity in Australia was viewed as a matter between a private company and customers, she said the industry has now reached a point where it is holding data sensitive enough to warrant government intervention. “We've got half of all Australian adults who have had some data breach here and it's clearly not just between Optus and the customer. The government has to be involved when the stakes are this high,” she said.“I think we need to be looking at a variety of issues including the powers that I have as cybersecurity security minister to mandate minimum cybersecurity standards which could have prevented this from occurring.”The cybersecurity regulator's hands are also tied by limits to fines, which under Australian law can be a maximum of $2 million, which she called \"totally inappropriate.\" Before rethinking regulations, she said, support needed to be given to the victims. The Australian Cybersecurity Center, Australian Federal Police and Australian Signals Directorate are all assisting Optus with the technical aspects of the recovery and response. Optus is providing the 2.8 million customers most seriously affected with a free 12-month subscription to credit monitoring and identity protection service Equifax Protect. Several Australian media outlets reported the presence online of a $1 million ransom demand directed towards the company, but Reuters could not confirm its authenticity.The company did not respond to requests for comment about O'Neil’s statements but on Monday announced that it has sent emails or text messages to all customers who had ID document information, such as license or passport numbers, compromised. They are still in the process of contacting other victims whose information was leaked.“Optus needs to communicate clearly to their customers about exactly what information was being taken from specific individuals and then needs to assist and support customers to manage the impacts of what is an unprecedented theft of consumer information in Australian history,” she said. On Monday, the alleged hacker behind the incident threatened to publish 40,000 records over the next four days if they are not paid $1 million.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-27",
      "title": "New Erbium password-stealing malware spreads as game cracks, cheats",
      "text": " The new 'Erbium' information-stealing malware is being distributed as fake cracks and cheats for popular video games to steal victims' credentials and cryptocurrency wallets.Erbium is a new Malware-as-a-Service (MaaS) that provides subscribers with a new information-stealing malware that is gaining popularity in the cybercrime community thanks to its extensive functionality, customer support, and competitive pricing.Erbium has been promoted on Russian-speaking forums since July 2022, but its actual deployment in the wild has been uncertain thus far.Erbium initially cost $9 per week, but since its popularity rose in late August, the price went up to $100 per month or $1000 for a full-year license.Compared to the \"defacto\" choice in the field, RedLine stealer, Erbium's cost is roughly one-third, so it's aiming to disrupt the market for malware commonly used by threat actors.Like other information-stealing malware, Erbium will steal data stored in web browsers (Chromium or Gecko-based), such as passwords, cookies, credit cards, and autofill information.The malware also attempts to exfiltrate data from a large set of cryptocurrency wallets installed on web browsers as extensions.Cold desktop wallets like Exodus, Atomic, Armory, Bitecoin-Core, Bytecoin, Dash-Core, Electrum, Electron, Coinomi, Ethereum, Litecoin-Core, Monero-Core, Zcash, and Jaxx are also stolen.Erbium also steals two-factor authentication codes from Trezor Password Manager, EOS Authenticator, Authy 2FA, and Authenticator 2FA.The malware can grab screenshots from all monitors, snatch Steam and Discord tokens, steal Telegram auth files, and profile the host based on the OS and hardware.All data is exfiltrated to the C2 via a built-in API system, while the operators get an overview of what has been stolen from each infected host on a Erbium dashboard, shown below.The malware uses three URLs for connecting to the panel, including Discord's Content Delivery Network (CDN), a platform that malware operators have heavily abused.While Erbium is still a work in progress, users on hacker forums have praised the author's efforts and willingness to listen to client requests.Cluster25 reported signs of Erbium infections worldwide, including in the USA, France, Colombia, Spain, Italy, India, Vietnam, and Malaysia.While the first Erbium campaign uses game cracks as lures, the distribution channels could diversify significantly anytime, as buyers of the malware may choose to push it via different methods.To keep the threat out of your system, avoid downloading pirated software, scan all downloaded files on an AV tool, and keep your software up to date by installing the latest available security patches."
   },
   {
      "time": "2022-09-27",
      "title": "Hackers use PowerPoint files for 'mouseover' malware delivery",
      "text": " This article was updated on 9/29/22 with new information that Microsoft fixed a vulnerability in 2021 tracked as CVE-2021-40444 that also prevents this PowerPoint exploit from working. If you have installed Windows Updates since then, your device is secure.Hackers believed to work for Russia have started using a new code execution technique that relies on mouse movement in Microsoft PowerPoint presentations to trigger a malicious PowerShell script.No macro is necessary for the malicious code to execute and download the payload, for a more insidious attack.The threat actor lures targets with a PowerPoint (.PPT) file allegedly linked to the Organization for Economic Co-operation and Development (OECD), an intergovernmental entity working towards stimulating worldwide economic progress and trade.Inside the PPT file there are two slides, both featuring instructions in English and French for using the Interpretation option in Zoom video-conferencing app. The PPT file contains a hyperlink that acts as a trigger for launching a malicious PowerShell script using the SyncAppvPublishingServer utility.The researchers say that the threat actor targets entities in the defense and government sectors of countries in the European Union and Eastern Europe and believe that the espionage campaign is ongoing.When opening the lure document in presentation mode and the victim hovers the mouse over a hyperlink, a malicious PowerShell script is activated to download a JPEG file (“DSC0002.jpeg”) from a Microsoft OneDrive account.The JPEG is an encrypted DLL file (lmapi2.dll), that is decrypted and dropped in the 'C:\\ProgramData\\' directory, later executed via rundll32.exe. A registry key for persistence is also created for the DLL.Next, lmapi2.dll fetches and decrypts a second JPEG file and loads it into memory, on a new thread previously created by the DLL.Cluster25 details that each of the strings in the newly fetched file requires a different XOR key for deobfuscation. The resulting payload is Graphite malware in portable executable (PE) form.Graphite abuses the Microsoft Graph API and OneDrive to communicate with the command and control (C2) server. The threat actor accesses the service by using a fixed client ID to obtain a valid OAuth2 token.With the new OAuth2 token, Graphite queries the Microsoft GraphAPIs for new commands by enumerating the child files in the check OneDrive subdirectory, the researchers explain.“If a new file is found, the content is downloaded and decrypted through an AES-256-CBC decryption algorithm,” Cluster25 says, adding that \"the malware allows remote command execution by allocating a new region of memory and executing the received shellcode by calling a new dedicated thread.”The campaign that Trellix investigated used an Excel documents titled \"parliament_rew.xlsx\" and \"Missions Budget.xlsx\" that appeared to target government employees and individuals in the defense industry.Based on code similarities with malware samples from 2018, targeting, and the infrastructure used in the attacks, Trellix has attributed Graphite to APT28 with low to moderate confidence.Update 9/29/22:Before publishing this article, BleepingComputer attempted to confirm if Microsoft fixed the PowerPoint bug described in this attack. Unfortunately, while we found numerous writeups about the bug and its variants, none of them indicated that it was fixed.This MoTW would cause Microsoft Office to open the document in Protected View and display a warning explaining that the mouseover may trigger a \"potential security concern,\" as shown in Dormann's tweet below.Therefore, while there appears to be a recent attack using this vulnerability, you will not be affected if you regularly install Windows security updates.However, if you do not regularly install updates on your devices and have not done so since the September 2021 Patch Tuesday, you are vulnerable to this exploit and many others. "
   },
   {
      "time": "2022-09-27",
      "title": "Ukraine warns of 'massive cyberattacks' coming from Russia on critical infrastructure sites | CyberScoop",
      "text": " \n\nSeptember 26, 2022\n\nThe Russian government is planning “massive cyberattacks” against Ukrainian critical infrastructure facilities to “increase the effect of missile strikes on electrical supply facilities,” the Ukrainian government said Monday.“By the cyberattacks, the enemy will try to increase the effect of missile strikes on electricity supply facilities, primarily in the eastern and southern regions of Ukraine,” the agency said Monday. “The occupying command is convinced that this will slow down the offensive operations of the Ukrainian Defence Forces.”Ukrainian government officials did not immediately respond to a request for additional detail Monday morning.“Many of the disruptive and destructive cyber attacks we have seen thus far have been disrupted, isolated, or largely limited to Ukraine, where there is intense focus,” said John Hultquist, the vice president of intelligence analysis at Mandiant. “With a few exceptions, we have not seen the scaled, serious attacks we expected even before the war began. There is still significant room for Russia to escalate, especially with regards to Ukraine’s allies. So far, Russian cyber attacks outside of Ukraine have been very restrained.”That said, Hultquist added, “Russia is under enormous pressure and cyber attacks may give them a means to respond without risking serious military consequences.”"
   },
   {
      "time": "2022-09-27",
      "title": "NullMixer drops Redline Stealer, SmokeLoader and other malware | Securelist",
      "text": " Solutions for:ThreatsCategories26 Sep 2022\n  minute read\t\t\t\t\t\t\t\tTable of ContentsAuthorsNullMixer is a dropper leading to an infection chain of a wide variety of malware families. NullMixer spreads via malicious websites that can be found mainly via search engines. These websites are often related to crack, keygen and activators for downloading software illegally, and while they may pretend to be legitimate software, they actually contain a malware dropper.It looks like these websites are using SEO to stay at the top of search engine results, making them easy to find when searching the internet for “cracks” and “keygens”. When users attempt to download software from one of these sites, they are redirected multiple times, and end up on a page containing the download instructions and archived password-protected malware masquerading as the desired piece of software. When a user extracts and executes NullMixer, it drops a number of malware files to the compromised machine. These malware families may include backdoors, bankers, credential stealers and so on. For example, the following families are among those dropped by NullMixer: SmokeLoader/Smoke, LgoogLoader, Disbuk, RedLine, Fabookie, ColdStealer.The infection vector of NullMixer is based on a ‘User Execution’ (MITRE Technique: T1204) malicious link that requires the end user to click on and download a password-protected ZIP/RAR archive with a malicious file that is extracted and executed manually.The whole infection chain of NullMixer is as follows:Top Google search engine results for “crack software” contain malicious websites delivering NullMixerMalware execution instructionsExample of NullMixer infection chain executionNullMixer is a dropper that includes more than just specific malware families; it drops a wide variety of malicious binaries to infect the machine with, such as backdoors, bankers, downloaders, spyware and many others.The real infection occurs when the user extracts the ‘win-setup-i864.exe’ file from the downloaded password-protected archive and runs it. The ‘win-setup-i864.exe’ file is an NSIS (Nullsoft Scriptable Install System) installation program, which is a very popular installation instrument used by many software developers. In our case, it dropped and launched another file, ‘setup_installer.exe’, that is in fact an SFX archive ‘7z Setup SFX’ wrapped into a Windows executable. The ‘setup_installer.exe’ file dropped dozens of malicious files. But instead of launching them, it launches a single executable – setup_install.exe – which is a NullMixer starter component. NullMixer’s starter launches all the dropped executable files. To do so, it contains a list of hardcoded file names, and launches them one by one using ‘cmd.exe’.List of files hardcoded into NullMixer starter componentNullMixer execution chainIt also tries to change Windows Defender settings using the following command line.\nImmediately after all the dropped files have been launched, the NullMixer starter beacons to the C&C about a successful installation. From this point, all the dropped and launched malicious files are left to their own devices. With a little monitoring we can identify a wide variety of malicious binaries that are spread by the NullMixer malware.NullMixer and malware families it dropsSince the number of families turned out to be quite large, we decided to give only a brief description of each in this report. A full technical description will be provided in subsequent reports.SmokeLoader (aka Smoke) is a modular malware that has been known since 2011, distributed via phishing emails and drive-by downloads. It has evolved its capabilities with additional modules over the years. For example, disabling of Windows Defender and anti-analysis techniques have been added to the malware. However, most threat actors only use the main functionality – payload downloading and executing.In contrast to the simplest downloaders that download malicious files using hardcoded static URLs, SmokeLoader communicates with the C&C in order to receive and perform download tasks.RedLine Stealer has been known since early 2020 and developed through 2021. The malware is known to be sold on online forums, and distributed via phishing emails.A newer method of spreading RedLine Stealer is by luring Windows 10 users to get fake Windows 11 upgrades. When the user downloads and executes the binary, they’re actually running the malware.RedLine’s main purpose is to steal credentials and information from browsers, in addition to stealing credit card details and cryptocurrency wallets from the compromised machine. Moreover, the malware also collects information about the system, such as: username, hardware details and installed security applications.The malware is known to be distributed via other botnets such as Glupteba. The main aim of the PseudoManuscrypt threat actors is to spy on their victims by stealing cookies from Firefox, Google Chrome, Microsoft Edge, Opera, and Yandex Browser, keylogging and stealing cryptocurrency by utilizing the ClipBanker plugin. A distinctive feature of the malware is the use of the KCP protocol to download additional plugins.ColdStealer is a relatively new malicious program that was discovered in 2022. Like many other stealers its main purpose is to steal credentials and information from web browsers, in addition to stealing cryptocurrency wallets, FTP credentials, various files and information about the system such as OS version, system language, processor type and clipboard data. The only known method of delivering stolen information to cybercriminals is by sending a ZIP archive to an embedded control center.ColdStealer Main() functionFormatLoader is a downloader that got its name for using hardcoded URLs as format strings, where it needs to fill a single digit to get a link to download an additional binary. The available digit range is also hardcoded.\nFormatLoader’s main purpose is to infect the machine with an additional malicious file by downloading the binary to the compromised machine. To do so, the malware adds digits from the hardcoded range one by one to the hardcoded format strings, and accesses the download links.In addition, FormatLoader uses a third-party website service for tracking the compromised machine. It sends a ‘GET’ request to a specific URL of an IP logger service, which collects information such as IP address and IP-based geolocation.CsdiMonetize is known to be an advertising platform that used to install many different PUAs (Potentially Unwanted Applications) on a Pay-Per-Install basis after infecting the user’s machine. Later on, rather than just infecting their victim with PUAs, CsdiMoneitze began infecting their victims with actual Trojans, like the Glupteba malware.Nowadays, CsdiMonetize infects its victims with additional malware family types such as: Fabookie, Disbuk, PseudoManuscrypt and more.Csdi execution chainThe infection begins with NSIS installer ’61f665303c295_Sun1059d492746c.exe’, which downloads the Csdi installer ‘MSEkni.exe‘. The Csdi installer requests the current configuration from the C&C and a list of additional Csdi components to install. Configuration is stored in several registry keys in encrypted and base64 encoded form. The next step is to download additional components, the most notable being publisher and updater components. The Csdi publisher component is responsible for showing advertisements by launching the browser with URLs as command line parameters. The updater component is responsible for a Pay-Per-Install service. It receives the list of URLs from the C&C and instructions on how to drop and execute downloaded files.Disbuk (aka Socelar) is known to disguise itself as a legitimate application, such as PDF editor software.This malware was found to mainly target Facebook Ads and evolved to steal Facebook session cookies from Chrome and Firefox by accessing the browser’s SQLite database. After retrieving this information, the malware attempts to extract additional information like access tokens, account IDs, etc. After further evolution, Disbuk has also started retrieving Amazon cookies.Besides stealing data, Disbuk also installs a malicious browser extension that masquerades as a Google Translate extension. To get more information about a user’s Facebook account, Disbuk queries Facebook Graph API.Fabookie is another stealer that targets Facebook Ads. Its functionality is similar to the Disbuk malware, and includes stealing Facebook session cookies from browsers, using Facebook Graph API Queries to receive additional information about a user’s account, linked payment method, balance, friends, etc. Stolen credentials can later be used to run ads from the compromised account.Unlike Disbuk, this malware does not contain built-in malicious browser extensions, but contains two embedded NirSoft utilities – ‘Chrome Cookies View’ and ‘Web Browser Password Viewer’ – that are used to extract data from browsers.DanaBot is a Trojan-Banker written in Delphi that spreads via email phishing, and is known to have evolved since it was discovered in 2018.DanaBot is a modular malware that includes various additional modules; the most popular functionalities of these modules are stealing information from compromised machines and injecting fake forms into popular ecommerce and social media sites to collect payment data. It can also provide full access to infected systems with remote desktop, or mouse and keyboard access by utilizing a VNC plugin.Racealer (aka RaccoonStealer) is known to be a stealer-type malware that mostly extracts user credentials and exfiltrates data from compromised machines.Racoon is also known to have evolved over the years since it was discovered in 2019. For example, it now uses Telegram to retrieve C&C IP addresses and malware configurations. Moreover, additional modules are now being downloaded from the malware’s C&Cs that are also used to extract credentials.Generic.ClipBanker is a clipboard hijacker malware that monitors the clipboard of the compromised machine, and specifically searches for cryptocurrency addresses in order to replace them. When a user copies an address of a cryptocurrency wallet the malware replaces the address of the wallet with their own cryptocurrency wallet address, so the end user sends cryptocurrencies (such as Bitcoin) to them rather than to the intended wallet address.Screen with cryptocurrency addresses from Generic.ClipBanker binaryThe SgnitLoader is a small Trojan-Downloader written in C#. The downloader binary size is about 15 Kbytes. However, the original file is packed with Obsidium, which makes the binary size grow to more than 400 Kbytes.The SgnitLoader contains a few hardcoded domains in its binary, to which it appends the path and adds a number from 1 to 7. Unlike the FormatLoader malware, it doesn’t use a format string, but simply adds a number to the end of the string in order to get the full URL.\nAfter the download and execute procedures are completed, SgnitLoader pings back to the C&C with a ‘GET’ request. The original pingback URL is hidden with the ‘iplogger.org’ URL shortener service.Another small Trojan-Downloader written in C#. Its binary is half the size of SgnitLoader. Its main function code is fairly short and it uses the ‘IP Logger‘ URL shortener service to hide the original URL that it downloads the payload from. That’s why it’s called ShortLoader.ShortLoader Main() functionThe original file is an ‘Inno Setup’ installer that utilizes ‘Inno Download Plugin’ download functionality.\nThe setup script is programmed to download a file from the URL ‘http://onlinehueplet[.]com/77_1.exe‘ placing it into the ‘%TEMP%‘ directory as ‘dllhostwin.exe‘ and executing it with the string ’77’ as an argument.Part of Inno Setup installation scriptThe downloaded file belongs to the Satacom Trojan-Downloader family. However, in the course of our research we discovered that this file was replaced on the server with legitimate PuTTY software, a popular SSH client.This file is another software installer that uses the Microsoft Cabinet archive-file format. After execution, it drops three files: a batch file, an AutoIt interpreter with a stripped executable header and an AutoIt script. Then it executes the batch file with ‘cmd.exe’. The task of the batch file is to restore the AutoIt interpreter executable, and launch it with a path to the AutoIt script as a command line argument.AutoIt script performs a few AntiVM and AntiDebug checks. If all the checks are successful, then it starts AutoIt interpreter once again, decrypts and decompresses the embedded executable and injects it into the newly created process. The injected executable is LgoogLoader.LgoogLoader is a Trojan-Downloader that downloads an encrypted configuration file from a hardcoded static URL. It then decrypts the configuration, extracts additional URLs from it and downloads and executes the final payloads. It was called LgoogLoader due to its use of strings from ‘Google Privacy Policy’.Google Privacy Policy strings in LgoogLoader’s binaryDownloader.Bitser’s infection chainA legitimate 7-Zip Standalone Console application is dropped by the installer under the name ‘data_load.exe‘ and launched with arguments to unpack files from the downloaded archive.Part of NSIS script with download and execute instructionsC-Joker is an incredibly simple Exodus wallet stealer. It uses the Telegram API to send notifications about successful or failed installations. In order to steal credentials, it downloads a backdoored version of the ‘app.asar’ file and replaces the original file from the Exodus wallet.String in C-Joker’s binaryPrivateLoader is yet another example of a Pay-Per-Install malicious loader like LgoogLoader and SmokeLoader. It uses a single-byte XOR encryption key to receive URLs from the control center.Satacom is also known as LegionLoader. Discovered in 2019, Satacom uses different anti-analysis tricks that were probably borrowed from the al-khazer stress tool. The embedded user agent varies from sample to sample, but in our case the user agent is “deus vult”.Strings in Satacom binaryThe latest version receives the main control center address from TXT-record. Satacom sends a DNS TXT-query to ‘reosio.com‘ and receives a response with a base64 encoded string. Satacom DNS request and responseAfter decoding and decrypting with the XOR key “DARKMATTER” it gets the real C&C URL ‘banhamm.com‘.Satacom C&C communicationGCleaner is another Pay-Per-Install malicious loader. It was discovered at the beginning of 2019. Initially it was distributed as a cleaning tool called Garbage Cleaner or G-Cleaner through a fake website mimicking popular cleaning tools like CCleaner. The main loader was used to download potentially unwanted applications together with malware such as Azorult, Vidar, PredatorTheThief, miners and so on. GCleaner is now distributed by various crack websites along with other malware. This PPI platform uses C&C-based geolocation targeting, meaning it can push different malware depending on the victim’s IP address. Although the GCleaner loader is no longer mimicking cleaning tools, there are some still remnants of this in its binary code such as encrypted strings like “Software\\GCleaner\\Started” or “\\Garbage.Cleaner”. The sample of GCleaner that we detected when analyzing this campaign was trying to download the Vidar password stealer.Vidar is an info-stealer. It downloads DLL files freebl3.dll, mozglue.dll, msvcp140.dll, nss3.dll, softokn3.dll and vcruntime140.dll from its C&C for use in password-grabbing routines. Vidar can also receive settings from the C&C that tells it exactly what to do. It is able to steal autofill information from web browsers, cookies, saved credit cards, browser history, coin wallets and Telegram databases. It also can make and send screenshots to the C&C, as well as any file that matches a specified mask.Vidar downloads DLL files and uploads collected dataSince the beginning of the year we’ve blocked attempts to infect more than 47,778 victims worldwide. Some of the most targeted countries are Brazil, India, Russia, Italy, Germany, France, Egypt, Turkey and the United States.We are currently unable to directly attribute NullMixer to any group.Trying to save money by using unlicensed software can be costly. A single file downloaded from an unreliable source can lead to a large-scale infection of a computer system. As we can see, a large proportion of the malware families dropped by NullMixer are classified as Trojan-Downloaders, which suggests infections will not be limited to the malware families described in this report. Many of the other malware families mentioned here are stealers, and compromised credentials can be used for further attacks inside a local network.AuthorsNullMixer: oodles of Trojans in a single dropperYour email address will not be published. Required fields are marked *Name * Email * ΔC. Wayne Lewis Great information!!!Table of ContentsGReAT webinarsFrom the same authorsThe hottest research right in your inboxΔIn the same categoryAsian APT groups target various organizations from a multitude of regions and industries. We created this report to provide the cybersecurity community with the best-prepared intelligence data to effectively counteract Asian APT groups.We unveil a Lazarus campaign exploiting security company products and examine its intricate connections with other campaignsHow Kaspersky researchers obtained all stages of the Operation Triangulation campaign targeting iPhones and iPads, including zero-day exploits, validators, TriangleDB implant and additional modules.Nobody would even suspect the mining malware was merely a mask, masquerading behind an intricate modular framework that supports both Linux and Windows.  The amount of effort that went into creating the framework is truly remarkable, and its disclosure was quite astonishing.The hottest research right in your inboxΔThreatsCategories© 2023 AO Kaspersky Lab. All Rights Reserved.\nRegistered trademarks and service marks are the property of their respective owners.The hottest research right in your inboxΔ"
   },
   {
      "time": "2022-09-27",
      "title": "Malicious SEO Campaign is Leading Search Engine Users to JavaScript Malware - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-09-27",
      "title": "Adware on Google Play and Apple Store installed 13 million times",
      "text": " Security researchers have discovered 75 applications on Google Play and another ten on Apple’s App Store engaged in ad fraud. Collectively, they add to 13 million installations.Apart from flooding mobile users with advertisements, both visible and hidden, the fraudulent apps also generated revenue by impersonating legitimate apps and impressions.Researchers from HUMAN’s Satori Threat Intelligence team identified a collection of mobile apps that are part of a new ad fraud campaign that they named 'Scylla'.The analysts believe Scylla is the third wave of an operation they found in August 2019 and dubbed 'Poseidon'. The second wave, apparently from the same threat actor, was called 'Charybdis' and culminated towards the end of 2020.The Satori team have informed Google and Apple about their findings and the apps have been removed from the official Android and iOS stores.For iOS, Apple is not clear on how to remove adware apps already installed on the device. Human is recommending users remove the fraudulent apps if present on their devices. A short list with the most downloaded of them is present below:iOS app list:Android app list (1+ million downloads)The Scylla apps typically used a bundle ID that doesn’t match their publication name, to make it appear to the advertisers as if the ad clicks/impressions come from a more profitable software category.HUMAN’s researchers found that 29 Scylla apps imitated up to 6,000 CTV-based apps and regularly cycled through the IDs to evade fraud detection.On Android, the ads are loaded in hidden WebView windows, so the victim never gets to notice anything suspicious, as it all happens in the background.Additionally, the adware uses a “JobScheduler” system to trigger ad impression events when the victims aren’t actively using their devices, for example, when the screen is off.The signs of fraud are registered in logs and can be seen in network packet captures, but regular users do not typically scrutinize these.Compared to 'Poseidon', the first campaign for this operation, Scylla apps rely on additional layers of code obfuscation using the Allatori Java obfuscator. This makes detection and reverse engineering more difficult for researchers.Users should monitor their apps for malicious or unwanted apps by looking for some signs that typically indicate an issue such as rapid battery drainage and increased internet data usage, or apps you don't remember installing.It is also recommended to check the list of installed apps and remove those you don't remember installing or come from an unfamiliar vendor."
   },
   {
      "time": "2022-09-27",
      "title": "Researchers Identify 3 Hacktivist Groups Supporting Russian Interests",
      "text": " At least three alleged hacktivist groups working in support of Russian interests are likely doing so in collaboration with state-sponsored cyber threat actors, according to Mandiant.While the so-called hacktivist groups have conducted distributed denial-of-service (DDoS) attacks and website defacements to target Ukraine, indications are that these fake personas are a front for information operations and destructive cyber activities.That said, the exact nature of the relationship and the degree of affiliation with the Russian state remains unknown, although it suggests either direct involvement from GRU officers themselves or through the moderators running the Telegram channels.This line of reasoning is substantiated by XakNet's leak of a \"unique\" technical artifact that APT28 utilized in its compromise of a Ukrainian network and the fact that CyberArmyofRussia_Reborn's data releases are preceded by APT28 intrusion operations.\"The war in Ukraine has also presented novel opportunities to understand the totality, coordination, and effectiveness of Russia cyber programs, including the use of social media platforms by threat actors,\" Mandiant said.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-09-27",
      "title": "RCE in Sophos Firewall is being exploited in the wild (CVE-2022-3236) - Help Net Security",
      "text": " Sophos has patched an actively exploited remote code execution vulnerability (CVE-2022-3236) in its Firewall solutions, and has pushed the fix to customers who have automatic installation of hotfixes enabled.CVE-2022-3236 is a code injection vulnerability in the User Portal and Webadmin of Sophos Firewall. If successfully exploited, it allows for remote code execution (RCE) on the targeted vulnerable installation.It affects Sophos Firewall v19.0 MR1 (19.0.1) and older. Sophos published hotfixes for a variety of them, and has included the fix in v18.5 MR5 (18.5.5), v19.0 MR2 (19.0.2), and v19.5 GA.The hotfixes have been pushed to customers with the “Allow automatic installation of hotfixes” feature enabled on remediated versions (the feature is enabled by default).Customers who don’t have the featured enabled are advised to get the hotfix or to upgrade to a newer version. If none of that is possible, they can protect themselves from external attackers by disabling WAN access to the User Portal and Webadmin. As an alternative for remote access and management, they can use VPN and/or the Sophos Central cloud management platform.CVE-2022-3236 has been added to CISA’s Known Exploited Vulnerabilities Catalog, which means that US federal civilian executive branch agencies are required to remediate it. Sophos did not name the organizations that have been compromised by attackers via CVE-2022-3236, but said that they “informed each of these organizations directly.”“DriftingCloud is an effective, well equipped, and persistent threat actor targeting five-poisons-related targets. They are able to develop or purchase zero-day exploits to achieve their goals, tipping the scales in their favor when it comes to gaining entry to target networks,” the researchers noted."
   }
]