[
   {
      "time": "2023-10-16",
      "title": "AI algorithm detects MitM attacks on unmanned military vehicles",
      "text": " Professors at the University of South Australia and Charles Sturt University have developed an algorithm to detect and intercept man-in-the-middle (MitM) attacks on unmanned military robots.MitM attacks are a type of cyberattack where the data traffic between two parties, in this case, the robot and its legitimate controllers, is intercepted either to eavesdrop or to inject false data in the stream.Such malicious attacks aim to interrupt the operation of unmanned vehicles, modify the transmitted instructions, and, in some cases, even assume control, instructing the robots to take dangerous actions.\"The advent of Industry 4, marked by the evolution in robotics, automation, and the Internet of Things, has demanded that robots work collaboratively, where sensors, actuators, and controllers need to communicate and exchange information with one another via cloud services.\"\"The downside of this is that it makes them highly vulnerable to cyberattacks.\"The university researchers developed an algorithm using machine learning techniques to detect these attempts and shut them down in seconds.The algorithm was tested in a replica of the GVR-BOT used by the U.S. Army (TARDEC), and recorded successful attack prevention 99% of the time, with false positives occurring in less than 2% of the tested cases.Detecting MitM targeting crewless vehicles and robots is complex as these systems operate under fault-tolerant modes, so distinguishing between normal operations and fault conditions can be hazy.Also, robotic systems can be compromised at various levels, from the core system to its sub-systems and their sub-components, causing an operational problem that could render the robot dysfunctional..The university researchers developed a system that analyzed the robot's network traffic data to detect attempts to compromise it. This system uses node-based methods, scrutinizes packet data, and uses a flow-statistic-based system that reads metadata from the packet header.The detailed technical paper released by the researchers delves into the specifics of the deep learning CNN (convolutional neural network) model that was developed for this purpose, comprising multiple layers and filters that raise the reliability of the cyberattack detection outcome.Real tests conducted on the replica bot with simulated cyber-attacks targeting various systems produced excellent results and high identification accuracy even after only 2-3 epochs of model training.Optimized versions of this novel protection system could find applications in similar but more demanding robotic applications, like unmanned aircraft."
   },
   {
      "time": "2023-10-16",
      "title": "Microsoft plans to kill off NTLM authentication in Windows 11",
      "text": " Microsoft announced earlier this week that the NTLM authentication protocol will be killed off in Windows 11 in the future.NTLM (short for New Technology LAN Manager) is a family of protocols used to authenticate remote users and provide session security.While it was the default protocol used in old Windows versions, NTLM is still used today, and if, for any reason, Kerberos fails, NTLM will be used instead.NTLM has also been targeted in pass-the-hash attacks, where cybercriminals exploit system vulnerabilities or deploy malicious software to acquire NTLM hashes, which represent hashed passwords, from a targeted system.Once in possession of the hash, attackers can utilize it to authenticate as the compromised user, thus gaining access to sensitive data and spread laterally on the network.However, Microsoft is now working on two new Kerberos features: IAKerb (Initial and Pass Through Authentication Using Kerberos) and Local KDC (Local Key Distribution Center).\"This leverages IAKerb to allow Windows to pass Kerberos messages between remote local machines without having to add support for other enterprise services like DNS, netlogon, or DCLocator. IAKerb also does not require us to open new ports on the remote machine to accept Kerberos messages.\"Microsoft intends to introduce the two new Kerberos features in Windows 11 to broaden its use and tackle two significant challenges leading to Kerberos fallback to NTLM.The first feature, IAKerb, enables clients to authenticate with Kerberos across a broader range of network topologies. The second feature involves a local Key Distribution Center (KDC) for Kerberos, which extends Kerberos support to local accounts.Redmond also plans to expand NTLM management controls, providing administrators with increased flexibility in monitoring and restricting NTLM usage within their environments.\"All these changes will be enabled by default and will not require configuration for most scenarios. NTLM will continue to be available as a fallback to maintain existing compatibility,\" Palko said.\"Reducing the use of NTLM will ultimately culminate in it being disabled in Windows 11. We are taking a data-driven approach and monitoring reductions in NTLM usage to determine when it will be safe to disable.\"In the meantime, you can use the enhanced controls we are providing to get a head start. Once disabled by default, customers will also be able to use these controls to reenable NTLM for compatibility reasons.\""
   },
   {
      "time": "2023-10-16",
      "title": "Steam enforces SMS verification to curb malware-ridden updates",
      "text": " Valve has announced implementing additional security measures for developers publishing games on Steam, including SMS-based confirmation codes. This is to deal with a recent outbreak of malicious updates pushing malware from compromised publisher accounts.Steamworks is a set of tools and services developers and publishers of games/software use to distribute their products on the Steam platform.It supports DRM (digital rights management), multiplayer, video streaming, matchmaking, achievements system, in-game voice and chat, microtransactions, statistics, cloud saving, and community-made content sharing (Steam Workshop).Starting in late August and into September 2023, there has been an elevated number of reports about compromised Steamworks accounts and the attackers uploading malicious builds that infect players with malware.Valve assured the gaming community that the impact of these attacks was limited to a few hundred users, who were individually informed of the potential breach via notices sent by the company.To curb this problem, Valve will enforce a new SMS-based security check starting on October 24, 2023, which game developers must pass before pushing an update on the default release branch (not beta releases).The same requirement will be enforced when someone attempts to add new users to the Steamworks partner group, which is already protected by an email-based confirmation. Starting October 24, the group admin must verify the action with an SMS code.\"The same will be true for any Steamworks account that needs to add new users. This change will go live on October 24, 2023, so be sure to add a phone number to your account now.\"\"We also plan on adding this requirement for other Steamworks actions in the future.\"For those using the SetAppBuildLive API, Steam has updated it to require a steamID for confirmation, particularly for changes to the default branch of a released app.Using 'steamcmd' to set builds live is no longer applicable for managing the default branch of released apps.Also, Valve says there will be no workaround for developers without a phone number, so they must find a way to receive text messages to continue publishing on the platform.While introducing SMS-based verification is a good step towards achieving better supply chain security on Steam, the system is far from perfect.One of the game developers, Benoît Freslon, explained that he was infected with an information-stealing malware that was used to steal his credentials.Using these stolen credentials, the threat actor briefly pushed out a malicious update for the NanoWar: Cells VS Virus that infected players with malware.Freslon explained on Twitter that Valve's new SMS-based MFA security measure wouldn't have helped stop the attack as the info-stealer malware snatched session tokens to all his accounts.The game installer dropped a password-stealing malware on his computer, which targeted his Discord, Steam, Twitch, Twitter, and other accounts.Until the tokens were revoked or expired, the attackers continued to access the developer's accounts, remaining free to push malware-laced game updates to players.Also, SMS 2FA is inherently vulnerable to SIM-swap attacks where threat actors can port the number of a game developer to a new SIM and bypass the security measure.A better and more modern solution would be to enforce authenticator apps or physical security keys, especially for projects with large communities."
   },
   {
      "time": "2023-10-16",
      "title": "Microsoft Debuts AI Bug-Bounty Program, Offers $15K",
      "text": " Microsoft has announced its AI bug-bounty program to encourage researchers worldwide to discover vulnerabilities within the Bing generative AI chatbot and AI integrations. Bounty rewards will range from $2,000 to $15,000 for qualified submissions.Eligible participants must be at least 14 years old, with permission from a legal guardian if they are a minor, and an individual researcher. Should a participant be a public sector employee, the bounty award must go to the public sector organization and be signed by an attorney or executive responsible for its ethics policies. The scope of the bounty program extends to AI-powered Bing on bing.com, AI-powered Bing integration in Microsoft Edge, AI-powered Bing integration in the Microsoft Start app, and AI-powered Bing integration in the Skype Mobile app. Any vulnerabilities found in these integrations are qualified for submission and are eligible to win a reward.Microsoft stated that the goal of the program is to uncover vulnerabilities that have a significant impact on the security of its customers within the AI-powered \"Bing experience.\" When submitting a vulnerability, researchers must ensure that it has not been previously reported, is of critical or important severity as per the Microsoft Vulnerability Severity Classification for AI Systems, and is reproducible on the latest version of the product with clear steps as to how to reproduce the vulnerability. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-16",
      "title": "Women Political Leaders Summit targeted in RomCom malware phishing",
      "text": " A new, lightweight variant of the RomCom backdoor was deployed against participants of the Women Political Leaders (WPL) Summit in Brussels, a summit focusing on gender equality and women in politics.The campaign used a fake website mimicking the official WPL portal to bait people seeking to attend or simply interested in the summit.In August 2023, Void Rabisu set up a malicious website on the address 'wplsummit[.]com', designed to imitate the real Women Political Leaders (WPL) website hosted on wplsummit.org.The fake site linked to a OneDrive folder through a button named 'Videos & photos,' which contained pictures from the two days of the event, taken from the genuine site, and a malware downloader named 'Unpublished Pictures.'The malicious executable is signed by an Elbor LLC certificate and is a self-extracting archive containing 56 photos to act as decoys, while a second encrypted file is downloaded from a remote host.The second payload is a DLL that is decrypted and loaded into memory to evade detection and continues to fetch additional components required for establishing communication with the attacker's server.Trend Micro identifies the latest, stripped-down variant of RomCom as the fourth major release of the backdoor, explaining that it's the same malware Volexity researchers recently named 'Peapod.'Compared to RomCom 3.0, the previous version seen in Void Rabisu operations, the new backdoor variant has undergone significant changes, making it lighter and stealthier.It now supports only the following ten commands, a stark reduction from the previous 42.Also, instead of utilizing modified MSIs to drop its components onto devices directly, the new variant leverages an EXE file to fetch XOR-encrypted DLLs, loading all its components in memory.RomCom 4.0 has also incorporated new features related to Transport Layer Security (TLS), a protocol designed to provide secure communication with the C2 server.The malware has been coded to force WinHTTP functions to specifically use the TLS version 1.2 rather than allowing the operating system to choose the default TLS version.This enforcement system results in an error on Windows 7, which Trend Micro considers safe against the newest RomCom variant.The goal of this mechanism is likely to make C2 communication more resistant to snooping, complicate automated discovery, and possibly allow attackers to filter out unsuitable victims.In general, Void Rabisu's tactics and the deployment of the RomCom malware remain cloudy. However, it is clear that the backdoor's development is still ongoing, and its operators are increasingly focused on top-level cyber espionage.Trend Micro concludes that it is very likely that Void Rabisu will target all big conferences related to special interest groups, so caution is advised when visiting event sites."
   },
   {
      "time": "2023-10-16",
      "title": "Feds: Beware AvosLocker Ransomware Attacks on Critical Infrastructure",
      "text": " US authorities issued a warning this week about potential cyberattacks against critical infrastructure from ransomware-as-a-service (RaaS) operation AvosLocker.The group also likes to use living-off-the-land (LotL) tactics, making use of native Windows tools and functions such as Notepad++, PsExec, and Nltest for performing actions on remote hosts.Post-compromise, AvosLocker both locks up and exfiltrates files in order to enable follow-on extortion, should its victim be less than cooperative.\"It's all kind of the same, to be honest, as what we've been seeing for the past year or so,\" Ryan Bell, threat intelligence manager at Corvus, says of AvosLocker and other RaaS groups' TTPs. \"But they're becoming more deadly efficient. Through time they're getting better, quicker, faster.\"To protect against AvosLocker and its ilk, CISA provided a long list of ways critical infrastructure providers can protect themselves, including implementing standard cybersecurity best practices — like network segmentation, multifactor authentication, and recovery plans. CISA added more specific restrictions, such as limiting or disabling remote desktop services, file and printer sharing services, and command-line and scripting activities and permissions.\"Typically, ransomware groups take a little bit of a summer vacation. We forget that they are people, too,\" Bell says, citing lower-than-average ransomware numbers in recent months. September's 5.12% bump in ransomware cyberattacks, he says, is the canary in the coal mine.\"They will increase attacks through the fourth quarter. That's usually the highest we see throughout the year, as in both 2022 and 2021, and we're seeing that holds true even now,\" he warns. \"Things are definitely climbing up all across the board.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-16",
      "title": "\r\n\tNew Phishing Campaign Uses LinkedIn Smart Links in Blanket Attack - Infosecurity Magazine\r\n",
      "text": " Reporter, Infosecurity MagazineEmail security provider Cofense has discovered a new phishing campaign comprising over 800 emails and using LinkedIn Smart Links.The campaign was active between July and August 2023 and involved various subject themes, such as financial, document, security, and general notification lures, reaching users’ inboxes across multiple industries.The financial, manufacturing and energy sectors are the top targeted verticals.Cofense estimated that “this campaign was not a direct attack on any one business or sector but a blanket attack to collect as many credentials as possible using LinkedIn business accounts and Smart Links to carry out the attack.”LinkedIn Smart Links, also known as slinks, are used by LinkedIn business accounts to deliver content and track user content engagements through the LinkedIn Sales Navigator.A typical Smart Link uses the LinkedIn domain followed by a ‘code’ parameter with an eight-alphanumeric character ID that may contain underscores and dashes. However, malicious Smart Links can include other parts of information, such as obfuscated victim emails.Smart Links have proven to bypass security email gateways (SEGs) and other email security suites due to the link using a trusted domain.This new trove of Smart Links-based phishing messages suggests that these accounts are either newly created or previously compromised LinkedIn business accounts, allowing threat actors insight into the phishing campaign with its tracking capabilities.Upon clicking a malicious LinkedIn Smart Link embedded in an email, the user will be sent directly or through a series of redirects to the phish.The designated phishing kit will read the victim’s email attached to the Smart Link to autofill the malicious form to add to the illusion of legitimacy that the victim has landed at the legitimate Microsoft sign-in. However, a Smart Link will still lead to a credential phishing page without the victim’s email in the URL.Once at the phish, the user will be instructed to log in using their Microsoft Office credentials.LinkedIn Smart Links have been used in malicious phishing campaigns for a while now.Cofense identified large-scale phishing attacks using LinkedIn Smart Links as early as 2021. The company also reported on a large-scale campaign using slinks in September 2022.However, this is not a phishing method that malicious actors regularly use."
   },
   {
      "time": "2023-10-16",
      "title": "DarkGate malware spreads through compromised Skype accounts",
      "text": " Between July and September, DarkGate malware attacks have used compromised Skype accounts to infect targets through messages containing VBA loader script attachments.\"It's unclear how the originating accounts of the instant messaging applications were compromised, however is hypothesized to be either through leaked credentials available through underground forums or the previous compromise of the parent organization,\"Trend Micro also observed the DarkGate operators trying to push their malware payload through Microsoft Teams in organizations where the service was configured to accept messages from external users.\"The goal is still to penetrate the whole environment, and depending on the threat group that bought or leased the DarkGate variant used, the threats can vary from ransomware to cryptomining,\" Trend Micro said.\"From our telemetry, we have seen DarkGate leading to tooling being detected commonly associated with the Black Basta ransomware group.\"This recent surge in DarkGate activity underscores the growing influence of this malware-as-a-service (MaaS) operation within the cybercriminal sphere.It also emphasizes the threat actors' determination to continue their attacks, adapting their tactics and methods despite disruptions and challenges."
   },
   {
      "time": "2023-10-16",
      "title": "23andMe hit with lawsuits after hacker leaks stolen genetics data",
      "text": " Genetic testing provider 23andMe faces multiple class action lawsuits in the U.S. following a large-scale data breach that is believed to have impacted millions of its customers.The file allegedly contained the data of nearly 1 million Ashkenazi Jews who used 23andMe services to find their ancestry info, genetic predispositions, and more.The data in the CSV file contained information on 23andMe users' account IDs, full names, sex, date of birth, DNA profiles, location, and region details.Last week, the original hacker decided to retract the post and instead began selling data profiles of stolen 23andMe data. However, other threat actors continued to share the original 23andMe leak throughout cybercrime communities and forums.In response to an inquiry, 23andMe told BleepingComputer that the hackers accessed its platform through credential-stuffing attacks on weakly secured accounts. However, they refuted claims of a direct security breach of their systems.A 23andMe spokesperson explained that the attackers initially gained unauthorized access to a small number of accounts but eventually exfiltrated the data of a larger yet undefined number of clients due to them activating an optional feature named 'DNA Relatives,' which connects genetic relatives.Although platform members voluntarily activated the opt-in feature, not all of them accept that the involved risk of internal data-sharing should exempt the firm from its responsibility to place protection layers.In this case, many people following proper security practices by enabling 2FA on their accounts and using a strong and unique password still found themselves exposed, and their sensitive data leaked on cybercrime forums.The lawsuits highlight a lack of information in the company's official announcement regarding the security event, the current status of customer data safety, the network breach's duration, and the cyberattack's exact mechanism.Also, they criticize 23andMe for failing to implement adequate security measures that would help monitor its network for abnormal activity and potentially take action to stop the intrusion much sooner.The legal actions emphasize that 23andMe, a company managing sensitive medical data, should have been well aware of the elevated cybersecurity threats given the numerous high-profile breaches in the industry, underscoring the high value of such data.The plaintiffs ask for various financial reliefs against 23andMe, including restitution, lifetime credit monitoring, actual, compensatory, and statutory damages and penalties, punitive damages, and coverage of attorney's fees."
   },
   {
      "time": "2023-10-16",
      "title": "Alphv gang stole 5TB of data from Morrison Community Hospital",
      "text": " The ALPHV/BlackCat ransomware group claims to have hacked the Morrison Community Hospital and added it to its dark web Tor leak site.The group claims to have stolen 5TB of patients’ and employee’s information, backups, PII documents, and more. The gang also published a sample as proof of the stolen data.The group states that it has started contacting journalists because the representatives of the Morrison Community Hospital haven’t provided a clear response. The Alphv gang also threatens to initiate patient calls shortly.The popular researcher Brett Callow states that far this year, 29 US health systems with 90 hospitals between them have been impacted by #ransomware, and at least 23/29 had data stolen. The group is known to have a role for its affiliated that prohibits attacking healthcare organizations. Its policy forbids to encrypt systems of organizations where damage could lead to the death of individuals.The gang explained that one of its partners attacked SickKids violating its rules, for this reason, it blocked the affiliate.The Rhysida ransomware group threatened Prospect Medical Holdings to leak the stolen data if the company did not pay a 50 Bitcoins ransom (worth $1.3 million). The same group this week claimed to have breached other three US hospitals.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-10-16",
      "title": "CVE-2023-38831 Exploited by Pro-Russia Hacking Groups in RU-UA Conflict Zone for Credential Harvesting Operations",
      "text": " By \n\t\t\t\t\t\t\t\tCluster25 Threat Intel Team\n\t\t\t\t\t\t\t\t\n\t\t\t\t October 12, 2023\n\t\t\t\t\n\t\t\t\t\t\t\nCluster25 observed and analyzed several phishing-based attacks to be linked to a Russia-nexus nation-State threat actor. The attack involves the use of malicious archive files that exploit the recently discovered vulnerability affecting the WinRAR compression software versions prior to 6.23 and traced as CVE-2023-38831.The lure file consists in a PDF document, contained in the archive, that shows a list of Indicator of Compromise (IoCs) with domain names and hashes related to different malware, including SmokeLoader, Nanocore RAT, Crimson RAT and AgentTesla. Due to the vulnerability, the click on the PDF file causes a BAT script to be executed, which launches PowerShell commands to open a reverse shell that gives the attacker the access to the targeted machine and a PowerShell script that steals data, including login credentials, from the Google Chrome and Microsoft Edge browsers. To exfiltrate the data, attackers uses the legit web service webhook[.]site. The lure sample is an archive file named IOC_09_11.rar, probably with the intention of masquerading itself as a file to be used to share Indicators of Compromise (IoCs). The archive is crafted to exploit the WinRAR vulnerability traced as CVE-2023-38831: it contains a bogus PDF file named IOC_09_11.pdf with a trailing space character in its filename and a directory with the same name (including the trailing space) with the file named \"IOC_09_11.pdf .cmd\", which is a BAT script. Content of the malicious RAR fileDue to the vulnerability, if the victim user has an installed version of the WinRAR software prior to 6.23, the opening of the bogus PDF file causes the BAT script to be executed. The BAT script first launches a background command of WinRAR to extract its content in the %TEMP% directory, then it deletes the script file from it and opens the PDF file to show the lure to the victim. The latter shows a list of IoCs containing domain names and hashes related to different malware, including SmokeLoader, Nanocore RAT, Crimson RAT and AgentTesla.Content of lure PDF document used by attackersThen, the script begins the malicious activity, launching three PowerShell commands.Content of.bat script used in the kill-chainThe first command writes a Private RSA Key in the file rsakey under the directory %LOCALAPPDATA%\\Temp. The file is used by the second command to open a reverse shell that gives the attacker access to the targeted machine, using the SSH tool with the TCP port 443 at the IP address 216.66.35[.]145.Code snippet of PowerShell code used in the kill-chainThe third command executes a Base64-encoded string that once decoded shows the following PowerShell script:Redacted second-stage code snippet of PowerShell code used in the kill-chainThe script retrieves and decrypts the data, including the Login credentials, from the Google Chrome and Microsoft Edge browsers, then it sends it to the threat actor using the legit Webhook.site service, which allows users to set a unique URL and to obtain a log of requests or emails sent to it, so to inspect their content. The script performs a POST request with the retrieved data to the following URL, containing the unique token owned by the attacker: According to the Cluster25 visibility and considering the sophistication of the infection chain, the attack could be related with low-to-mid confidence to the Russian state-sponsored group APT28 (aka Fancy Bear, Sednit).  Cluster25 observed a malicious campaign that employs LinkedIn messages as a vector for executing identity theft attacks....BlackByte is a Ransomware-as-a-Service (RaaS) group that is known for the use of the homonymous malware that is constant...Cluster25 researchers analyzed several campaigns (also publicly reported by CERT-AGID) that used phishing emails to spre...Security without boundaries.GLOBAL HQ350 5th Ave, New York, NY 10118 USA© 2023 DuskRise Inc. All Rights Reserved."
   },
   {
      "time": "2023-10-16",
      "title": "Lazarus 조직의 Operation Dream Magic - ASEC BLOG",
      "text": " Lazarus 조직은 국가가 배후인 것으로 알려진 해킹 조직으로 금전적인 이득, 자료 탈취 등의 목적으로 전세계를 대상으로 꾸준히 해킹하고 있습니다.Lazarus 조직의 이니세이프 취약점을 악용한 워터링 홀을 간단하게 정리하면 언론사의 특정 기사에 악성 링크 삽입, 해당 기사를 클릭하는 기업, 기관이 해킹 대상, 국내 취약한 홈페이지를 C2 로 악용 그리고 제한된 범위의 해킹을 위해서 IP 필터링 등을 사용했습니다. 이번 워터링 홀에서 악용하는 프로그램의 취약점이 매직라인으로 변경됐을 뿐 워터링 홀 과정은 과거 이니세이프 사례와 동일합니다.안랩은 Lazarus 조직의 매직라인 취약점을 악용한 워터링 홀을 대응하기 위해서 여러 팀의 협업이 있었습니다. 매직라인 취약점을 탐지하기 위한 조건을 연구하고 백신에 업데이트해준 분석팀, 탐지된 PC 가 고객일 경우 로그 및 샘플 수집 등 고객 대응을 해준 기술지원팀, 수집한 로그 분석 및 국가기관과의 소통을 담당한 대응팀 등 여러 팀의 협업이 있었습니다. 또한 안랩은 국가기관과도 정보 공유 및 협업을 통해서 Lazarus 조직의 매직라인 취약점을 악용한 워터링 홀을 추적하고 분석을 진행했으며, 매직라인 제조 기업의 이름 일부와 매직라인의 이름 일부를 조합하여 이번 작전을 “Operation Dream Magic”으로 명명했습니다.본 보고서에서는 악성코드 분석 내용, 탐지 현황, 일부 기업의 협조로 수집한 로그 분석, 국가 기관과의 정보 공유 및 협업 등을 바탕으로 해석한 내용을 포함했으며, 이번 작전을 Lazarus 조직의 소행으로 판단한 근거에 대해서도 설명했습니다. [필수] 개인정보 수집 및 이용 동의Δ[필수] 개인정보 수집 및 이용 동의Δ"
   }
]