[
   {
      "time": "2022-09-20",
      "title": "American Airlines discloses data breach after employee email compromise",
      "text": " American Airlines has notified customers of a recent data breach after attackers compromised an undisclosed number of employee email accounts and gained access to sensitive personal information.In notification letters sent on Friday, September 16th, the airline explained that it has no evidence that the exposed data was misused. American Airlines discovered the breach on July 5th, immediately secured the impacted email accounts, and hired a cybersecurity forensic firm to investigate the security incident.\"Upon discovery of the incident, we secured the applicable email accounts and engaged a third party cybersecurity forensic firm to conduct a forensic investigation to determine the nature and the scope of the incident.\"Personal information exposed in the attack and potentially accessed by the threat actors may have included employees' and customers' names, dates of birth, mailing addresses, phone numbers, email addresses, driver's license numbers, passport numbers, and / or certain medical information.The airline said it would offer affected customers free two-year membership of Experian's IdentityWorks to help with identity theft detection and resolution.\"Although we have no evidence that your personal information has been misused, we recommend that you enroll in Experian's credit monitoring,\" American Airlines added.\"In addition, you should remain vigilant, including by regularly reviewing your account statements and monitoring free credit reports.\"The company is yet to disclose the number of affected customers and how many email accounts were breached in the incident.Andrea Koos, American Airlines' Sr. Manager for Corporate Communications told BleepingComputer after the article was published that the employees' accounts were compromised in a phishing campaign but refused to reveal how many customers and employees were affected, instead saying that it was a \"very small number.\"\"American Airlines is aware of a phishing campaign that led to the unauthorized access to a limited number of team member mailboxes. A very small number of customers and employees’ personal information was contained in those email accounts,\" Koos said.\"While we have no evidence that any personal information has been misused, data security is of the utmost importance and we offered customers and team members precautionary support. We are also currently implementing additional technical safeguards to prevent a similar incident from occurring in the future.\"As the world's largest airline by fleet size (more than 1,300 aircraft in its mainline), American Airlines has more than 120,000 employees and operates almost 6,700 flights daily to roughly 350 destinations in over 50 countries.Update: Added American Airlines statement."
   },
   {
      "time": "2022-09-20",
      "title": "Microsoft 365 phishing attacks impersonate U.S. govt agencies",
      "text": " An ongoing phishing campaign targeting U.S. government contractors has expanded its operation to push higher-quality lures and better-crafted documents.The lure in these phishing emails is a request for bids for lucrative government projects, taking them to phishing pages that are clones of legitimate federal agency portals.This is the same operation that INKY reported about in January 2022, with the threat actors using attached PDFs with instructions on going through the bidding process for the U.S. Department of Labor projects.Moreover, there’s now a plethora of different lures used in the messages, better phishing web page behavior, and removal of artifacts that revealed the signs of fraud in previous versions of the attached PDFs.Building upon what they have previously achieved, the phishing actors behind this campaign have implemented careful revisions to increase their success rates.Starting with the phishing emails, Cofense reports they now feature more consistent formatting, larger logos, and prefer to include a link to the PDF instead of attaching the file.The PDF files used to contain detailed instructions on how to bid, with overly technical information included. Now, they have been simplified and reduced in size, featuring more prominent logos and a link to the phishing page.Also, the PDFs previously featured the same signee, “edward ambakederemo,” whereas now, the metadata in the documents matches the spoofed department. For example, lures supposedly sent by the Wisconsin Department of Transportation are signed with “WisDOT.”The phishing websites have also received targeted improvements, using HTTPS on all web pages in the same domain.In addition to the “.gov” sites previously serving the campaign, the threat actors now also use very long domains like “transportation[.]gov[.]bidprocure[.]secure[.]akjackpot[.]com” to make them appear legitimate when opened from mobile browsers that can’t show the full length in the URL bar.On the phishing page that tries to trick visitors into entering their Microsoft Office 365 account credentials, the threat actors have now added a Captcha Challenge step to ensure they’re not logging bot inputs.It appears that the operatives of this campaign aren’t likely to stop any time soon, as they are now simultaneously expanding their targeting scope while refining their lures.Considering that the emails, PDFs, and websites used in this phishing operation are essentially copies of the actual content from requests for bids and state bidding portals, it may be hard to catch the signs of fraud.“Given the advancements seen in each area of the phishing chain, it is likely the threat actors behind these campaigns will continue to innovate and improve upon their already believable campaigns,” predicts Cofense.The only way to defend against this is to examine all details like the sending address, the landing URL, and eventually visit the bidding portal through a search engine instead of following provided links.If unsure, try searching the URLs online, as many of these long-lasting campaigns have published indicators of compromise confirming their fraudulent nature."
   },
   {
      "time": "2022-09-20",
      "title": "Bosnia and Herzegovina investigating alleged ransomware attack on parliament",
      "text": " Prosecutors in Bosnia and Herzegovina are investigating a wide-ranging cyberattack that has crippled the operations of the country’s parliament.A spokesperson for the prosecutor’s office of Bosnia and Herzegovina told The Record that they were assigned the case a couple of days ago.“The prosecutor who was on duty on that date gave necessary instructions to officers in law enforcement agencies and the aim is to clarify all the circumstances of the case and to protect the cybersecurity of the IT system and the capacities of the institutions of BiH [Bosnia and Herzegovina],” spokesperson Boris Grubešić said. “The case is in progress and, therefore, we cannot give any other additional information at this stage.”Zlatko Miletić, a delegate in the House of Peoples, told Nezavisne that it is impossible for lawmakers to get any work done and that the attack started around September 8 or 9. “Users are unable to access the server, and the e-mail address and the official website are inactive,” a parliament spokesperson told the news outlet. Several lawmakers said part of why they were told not to turn on their computers was out of fear ransomware would spread to their device. Miletić was critical of the government’s cybersecurity experts, claiming “no one cared” before the attack. “There was enough time to buy adequate technical means, that is, to additionally protect those servers. They must understand that the field of security requires investment. There is no security without equipment,” Miletić told Nezavisne. “Those technical means are expensive, but we must inevitably acquire them. Not only the parliament, but all institutions that deal with storing various data. This is a good lesson.”Another lawmaker, Dušanka Majkić, expressed concerns about data that could be found on government computers, noting that she had files on her device dating back to 2004.The country is in the midst of political turmoil as concerns grow about secession efforts by Republika Srpska. If rumors of a ransomware attack are confirmed, this would be the latest incident this year to see ransomware groups exploit political disputes before launching an attack.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-20",
      "title": "Russian Sandworm hackers pose as Ukrainian telcos to drop malware",
      "text": " The Russian state-sponsored hacking group known as Sandworm has been observed masquerading as telecommunication providers to target Ukrainian entities with malware.Sandworm is a state-backed threat actor attributed by the US government as part of the Russian GRU foreign military intelligence service.Recent campaigns aim to deploy commodity malware like Colibri Loader and the Warzone RAT (remote access trojan) onto critical Ukrainian systems.While Sandworm has refreshed its C2 infrastructure significantly, it did so gradually, so historical data from CERT-UA reports allowed Recorded Future to link current operations with strong confidence to the threat actor.Another spoofed Ukrainian telecommunication services provider is Kyivstar, for which Sandworm uses the facades \"kyiv-star[.]ddns[.]net\" and \"kievstar[.]online.\"The more recent case is that of \"ett[.]ddns[.]net\" and \"ett[.]hopto[.]org,\" very likely an attempt to imitate the online platform of EuroTransTelecom LLC, another Ukrainian telecom operator.Many of these domains resolve to new IP addresses, but in some cases, there are overlaps with past Sandworm campaigns dating as far back as May 2022.The attack begins by luring victims to visit the domains, typically via emails sent from these domains, to make it appear like the sender is a Ukrainian telecommunication provider.The language used in these sites is Ukrainian, and the topics presented concern military operations, administration notices, reports, etc.The most common web page seen by Recorded Future is one containing the text \"ОДЕСЬКА ОБЛАСНА ВІЙСЬКОВА АДМІНІСТРАЦІЯ,\" which translates to \"Odesa Regional Military Administration.\"The payload contained in the image file is Warzone RAT, a malware created in 2018 and reached peak popularity in 2019. Sandworm uses it to replace the DarkCrystal RAT they deployed in previous months.Possibly, the Russian hackers want to make tracking and attribution harder for security analysts by using widely available malware and hoping that their tracks are \"lost in the noise.\"The WarZone RAT malware may be old, but it still offers powerful features like a UAC bypass, hidden remote desktop, cookie and password stealing, live keylogger, file operations, reverse proxy, remote shell (CMD), and process management."
   },
   {
      "time": "2022-09-20",
      "title": "Hacking group focused on Central America dumps 10 terabytes of military emails, files | CyberScoop",
      "text": " \n\nSeptember 19, 2022\n\nA hacking group that has primarily focused on Central American targets released on Monday roughly 10 terabytes of emails and other materials from military and police agencies in Chile, Mexico, El Salvador, Colombia and Peru.The data dump is the latest release from the group that has focused on infiltrating mining and oil companies, police and several Latin American regulatory agencies since March 2022.“To make it clear, the military armies and the police forces of the States of Abya Yala are the guarantee of the domination of North American imperialism, they are the guarantee of the extractivist presence of the Global North,” the group said in a Spanish-language statement, according to a Google translation. “They are violent repressive forces, criminals against the peoples themselves and their internal pyramidal organization charts of power are also reprehensible.”Abya Yala is the name used by indigenous people of current day Central America for the American continent.The specific targets in this case, according to the release, are the Joint Chiefs of Staff of the Chilean Armed Forces, the Mexican Secretariat of National Defense, the National Civil Police of El Salvador and the Armed Forces of El Salvador, the General Command of the Military Forces of Colombia, the Joint Command of the Armed Forces of Peru and the Army of Peru.Earlier releases have targeted the federal prosecutor’s office in Colombia, a group of international mining and energy companies — as well as some of the agencies tasked with regulating them — from across multiple regional countries, and another release from March on a Swiss mining consortium operating in Guatemala.Correction: This story initially inaccurately reported that the released files totaled 10 gigabytes. The correct figure is roughly 10 terabytes."
   },
   {
      "time": "2022-09-20",
      "title": "VMware, Microsoft warn of widespread Chromeloader malware attacks",
      "text": " VMware and Microsoft are warning of an ongoing, widespread ChromeLoader malware campaign that has evolved into a more dangerous threat, seen dropping malicious browser extensions, node-WebKit malware, and even ransomware in some cases.Back then, the malware infected Chrome with a malicious extension that redirected user traffic to advertising sites to perform click fraud and generate income for the threat actors.The ChromeLoader malware is delivered in ISO files that are distributed through malicious ads, browser redirects, and YouTube video comments.ChromeLoader ISOs commonly contain four files, a ZIP archive containing the malware, an ICON file, a batch file (commonly named Resources.bat) that installs the malware, and a Windows shortcut that launches the batch file.As part of their research, VMware sampled at least ten ChromeLoader variants since the start of the year, with the most interesting appearing after August.The first example is a program mimicking OpenSubtitles, a utility helping users locate subtitles for movies and TV shows. In this campaign, the threat actors moved away from their usual \"Resources.bat\" file and switched to one named \"properties.bat,\" used to install the malware and establish persistence by adding Registry keys.Another notable case is \"Flbmusic.exe,\" mimicking the FLB Music player, featuring an Electron runtime and enabling the malware to load additional modules for network communication and port snooping.For some variants, the attacks turned a bit destructive, extracting ZipBombs that overload the system with a massive unpacking operation.\"As recent as late August, ZipBombs have been seen being dropped onto infected systems. The ZipBomb is dropped with the initial infection in the archive the user downloads. The user must double-click for the ZipBomb to run. Once run, the malware destroys the user's system by overloading it with data,\" explains VMware's report.Even more concerning, recent ChromeLoader variants have been seen deploying the Enigma ransomware in an HTML file.After the encryption is complete, the \".enigma\" filename extension is appended to the files, while the ransomware drops a \"readme.txt\" file containing instructions for the victims.Because adware doesn't create notable damage to victims' systems, besides eating up some bandwidth, it is usually a threat that is ignored or downplayed by analysts.However, every software that nests into systems without being detected is a candidate for more significant trouble, as its authors may apply modifications that facilitate more aggressive monetization options.While ChromeLoader started as adware, it is a perfect example of how threat actors are experimenting with more potent payloads, exploring more profitable alternatives to advertising fraud."
   },
   {
      "time": "2022-09-20",
      "title": "Revolut hack exposes data of 50,000 users, fuels new phishing wave",
      "text": " Revolut has suffered a cyberattack that gave an unauthorized third party access to personal information of tens of thousands of clients.The incident occurred a week ago, on Sunday night, and has been described as \"highly targeted.\"Founded in 2015, Revolut is a financial technology company that has seen a rapid growth, now offering banking, money management, and investment services to customers all over the world.In a statement for BleepingComputer, a company spokesperson said that an unauthorized party had access \"for a short period of time\" to details of only a 0.16% of its customers.\"We immediately identified and isolated the attack to effectively limit its impact and have contacted those customers affected. Customers who have not received an email have not been impacted\" - RevolutAccording to the breach disclosure to the State Data Protection Inspectorate in Lithuania, where Revolut has a banking license, 50,150 customers have been impacted.Details on how the threat actor gained access to the database have not been disclosed but it appears that the attacker relied on social engineering.The Lithuanian data protection agency notes that the likely exposed information includes:Revolut emphasizes that the intruder did not gain access to users' funds.\"Our customers’ money is safe - as it has always been. All customers can continue to use their cards and accounts as normal,\" the company spokesperson told BleepingComputer.The company reacted quickly to the intrusion and significantly limited the risk to its customers, isolating the attack by early Monday (2 A.M.).As a precaution, Revolut formed a dedicated team tasked with monitoring customer accounts, to make sure that both money and data are safe.Users should be \"extremely wary\" of any messages requesting personal details or passwords. Revolut will not call customers about the incident and will never ask for sensitive information.Below is the full statement BleepingComputer received from a Revolut spokesperson:Revolut recently experienced a highly targeted cyber attack. This resulted in an unauthorized third party obtaining access to the details of a small percentage (0.16%) of our customers for a short period of time.We immediately identified and isolated the attack to effectively limit its impact and have contacted those customers affected. Customers who have not received an email have not been impacted.To be clear, no funds have been accessed or stolen. Our customers’ money is safe – as it has always been. All customers can continue to use their cards and accounts as normal.We take incidents such as these incredibly seriously, and we would like to sincerely apologize to any customers who have been affected by this incident, as the safety of our customers and their data is our top priority at Revolut.Some Revolut customers also noted around the time of the incident that the support chat was displaying inappropriate language to visitors.While it is not clear if this defacement is related to the breach disclosed by Revolut, it shows that hackers may have had access to a wider range of systems used by the company.This security incident is a good opportunity for phishing actors to trick any Revolut customer, even those not impacted, into giving away their sensitive details.To request a new card, the victims are directed to click on the link “revolut-card-cancel[.]com”, where they will go through a four-step phishing process as shown below.Most crucially, the threat actors attempt to steal full payment card details, enabling them to perform online purchases or send money to accounts under their control."
   },
   {
      "time": "2022-09-20",
      "title": "Rockstar confirms cyberattack, leak of confidential data including GTA 6 footage",
      "text": " Gaming giant Rockstar confirmed on Monday that a hacker broke into its systems and stole confidential internal data, including footage from the next highly-anticipated installment of its Grand Theft Auto series.In statements posted to Twitter, Facebook and Instagram, Rockstar Games said it suffered a network intrusion that allowed someone to access and download “confidential information from our systems, including early development footage for the next Grand Theft Auto.”“At this time, we do not anticipate any disruption to our live game services nor any long-term effect on the development of our ongoing projects. We are extremely disappointed to have any details of our next game shared with you all in this way,” the company said. “Our work on the next Grand Theft Auto game will continue as planned and we remain as committed as ever to delivering an experience to you, our players, that truly exceeds your expectations. We will update everyone again soon and, of course, will properly introduce you to this next game when it is ready.”A spokesperson for the company told The Record that they will not be commenting on the situation beyond the statements that were released. The individual, writing in apparently fluent English and using the handle “teapotuberhacker,” said they were reachable via Telegram where their handle was Tea Pot. The person did not respond to requests for comment.Initially, the hacker offered data related to Grand Theft Auto 5, which has already been released, for nothing less than $10,000 but claimed they would not sell any of the data related to Grand Theft Auto 6, which is still in development. The account wrote around 1 a.m. EST “imma sleep for some hours now” before logging off in the early hours of Sunday. Although they posted subsequently, their Telegram account has now been deleted. In later messages, the hacker said people connected to Take-Two Interactive were “on” him and that he was unsure of what to do. With others on the message board, the hacker mulled the pros and cons of selling the stolen data and footage or simply keeping it, wondering which would allow them to avoid legal peril. The hacker’s last message said they plan to leak more of what they stole if Rockstar Games or Take-Two Interactive did not pay them. Take-Two Interactive was forced to file several DMCA infringement notices and takedown requests in an effort to get the leaked game footage off of YouTube and Twitter. Before the company released a statement, a reporter from Bloomberg spoke with sources inside Rockstar Games who told him that the leak was real. To those who asked: There are several reasons this is a nightmare for Rockstar. One is that it'll disrupt work for a while. Another is that it may lead management to limit work-from-home flexibility. The repercussions of this leak might not be clear for quite a whileAlexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-09-20",
      "title": "High severity vulnerabilities found in Harbor open-source artifact registry - Help Net Security",
      "text": " Oxeye security researchers have uncovered several new high severity variants of the IDOR (Insecure Director Object Reference) vulnerabilities (CVE-2022-31671, CVE-2022-31666, CVE-2022-31670, CVE-2022-31669, CVE-2022-31667) in CNCF-graduated project Harbor, the popular open-source artifact registry by VMware.Access control systems are designed to enforce policies that prevent users from acting outside of intended permissions. Access control failures typically lead to unauthorized information disclosure, modification, data deletion, or the performance of business functions outside of a user’s limits. In this research, IDOR was discovered in VMware’s Harbor, which allows users to better manage their application artifacts. Role-based access control (RBAC) in place is usually a best practice against IDOR vulnerabilities, but this research tested that theory with surprising results.The IDOR vulnerability in Harbor leads to the disclosure of webhook policies without authorization. Harbor allows users to configure webhook policies to receive notifications about certain events in the repository, e.g., when a new artifact is pushed or when an existing one is deleted. Once a webhook policy is added, a Harbor user may view details of the created webhook policies. In this example, the vulnerability occurred because Harbor only attempted to validate that the requesting user had access to the project ID specified in the request. But it failed to validate that the requested webhook ID belonged to the specified project ID.All IDOR variants mentioned in this announcement have been communicated to the VMware Security Response and Harbor Engineering teams, who promptly collaborated towards a quick and effective resolution. All have been addressed (fixed) in the latest version of Harbor."
   },
   {
      "time": "2022-09-20",
      "title": "Twitter Pranksters Halt GPT-3 Bot with Newly Discovered “Prompt Injection” Hack - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   }
]