[
   {
      "time": "2023-11-09",
      "title": "Pro-Palestinian hackers group 'Soldiers of Solomon' disrupted the production cycle of the biggest flour production plant in Israel",
      "text": " The Pro-Palestinian hackers group ‘Soldiers of Solomon’ announced that it had breached the infrastructure of the production plant of Flour Mills Ltd, a multinational company engaged in the processing and marketing of flour and related food products. The threat actors claim to have damaged the production cycle.The group published on its Telegram Channel a video showing several screenshots from systems used to control the processes at the plan. This type of attack can have a significant impact on the company and the community, as the target is an important component of the food supply chain.The Soldiers of Solomon group continues to target Israeli organizations, recently they claimed a successful cyber attack on Ashalim Power Station located in the Negev desert. The threat actors said it had disconnected the Station out of the power distribution circuit.In October, the hacktivists have taken full control of more than 50 servers, security cameras and a smart city management system in the Nevatim military area. They also claimed to have exfiltrated 25TB of data and ransomed them via our customized Crucio ransomware.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-11-09",
      "title": "Russian state-owned Sberbank hit by 1 million RPS DDoS attack",
      "text": " Russian financial organization Sberbank states in a press release that two weeks ago it faced the most powerful distributed denial of service (DDoS) attack in recent history.Sberbank is a majority state-owned banking and financial services company and the largest institute in Russia, holding about a third of all assets in the country.Following Russia’s invasion of Ukraine, the bank faced international blockades and sanctions and was the target of west-aligned hacktivists multiple times.“We noticed that these are some new hackers. Their fingerprint is not known to us. That is, some new, very qualified criminals appeared on the market who began to systematically attack the largest Russian resources,” stated the head of Sberbank (machine translated).In May 2022, Sberbank announced it was targeted by unprecedented hacker attacks, including massive DDoS waves aimed at its online customer services.A more recent blow sufferend by Russia’s financial system concerns the National Payment Card System (NSPK), the Mir card operator, whose website became unavailable on October 30, 2023, and was later defaced to post messages about a client-impacting data breach."
   },
   {
      "time": "2023-11-09",
      "title": "FBI: Ransomware gangs hack casinos via 3rd party gaming vendors",
      "text": " The Federal Bureau of Investigation is warning that ransomware threat actors are targeting casino servers and use legitimate system management tools to increase their permissions on the network.In a private industry notification, the agency says that third-party vendors and services are common attack vector. Ransomware gangs continue to rely on third-party gaming vendors to breach casinos.\"New trends included ransomware actors exploiting vulnerabilities in vendor-controlled remote access to casino servers, and companies victimized through legitimate system management tools to elevate\nnetwork permissions,\" the agency explains.Starting 2022, the FBI noted ransomware attacks that targeted small and tribal casinos to encrypt servers and personally identifiable information of employees and patrons.The alert also details that the threat actor known as ‘Silent Ransom Group’ (SRG) and 'Luna Moth' has been carrying callback-phishing data theft and extortion attacks since June.The attacker tricked the victim to call a number under the pretense that there were pending charges on their account. If the victim fell for the ruse, SRG would convince them to install a system management tool, which was later used to install other legitimate utilities that can also be used for malicious purposes.\"The [SRG] actors then compromised local files and the network shared drives, exfiltrated victim data, and extorted the companies\" - Federal Bureau of InvestigationThe FBI recommends organizations to implement several mitigations to limit an adversary's use of common system and network discovery techniques.Organizations should keep offline backups that are encrypted and immutable for the entire company's data infrastructure. Implementing policies for remote access and executing only known and trusted applications is also a step towards an improved security stance.Strong password policies and multifactor authentication are encouraged, along with auditing and managing administrative privileges.Network segmentation, adding solutions that monitor for abnormal activity, secure RDP usage and up-to-date software components are common recommendations that many companies still have to meet.Finally, system admins are recommended to turn off unnecessary ports and protocols, add email banners for messages that originate outside the organization, and restrict command-line and scripting activities."
   },
   {
      "time": "2023-11-09",
      "title": "ChatGPT down after major outage impacting OpenAI systems",
      "text": " Update November 08, 11:05 EST: OpenAI says impacted services are back online. OpenAI's AI-powered ChatGPT large language model-based chatbot is down because of a major ongoing outage that also took down the company's Application Programming Interface (API).Customers affected by these ongoing issues see \"something seems to have gone wrong\" errors, with ChatGPT adding that \"There was an error generating a response\" to their queries.\"If this issue persists please contact us through our help center at help.openai.com,\" the errors also read.\"We've identified an issue resulting in high error rates across the API and ChatGPT, and we are working on remediation,\" it said.\"We're experiencing exceptionally high demand. Please hang tight as we work on scaling our systems,\" a banner displayed in ChatGPT's interface warns.Today's issues follow another partial outage on Tuesday that also impacted the company's API and ChatGPT, both hit by periodic outages for several hours.Starting this week, the company introduced a new and less expensive GPT-4 Turbo model with \"128K context and has fresher knowledge than GPT-4,\" available to all developers in preview.GPT-4 Turbo also adds Vision, DALL·E 3, and text-to-speech capabilities for all devs, and the company also announced that it doubled GPT-4 rate limits.\"To help you scale your applications, we’re doubling the tokens per minute limit for all our paying GPT-4 customers,\" OpenAI said."
   },
   {
      "time": "2023-11-09",
      "title": "WhatsApp now lets users hide their location during calls",
      "text": " WhatsApp is rolling out a new privacy feature that helps Android and iOS users hide their location during calls by relaying the connection through WhatsApp servers.As the company's engineering team explained today, the users' location is hidden from other call participants by switching from the standard peer-to-peer direct connection between callers using the company's servers to obfuscate IP address metadata that could contain information on the users' internet service provider or broad geographical location.With the new \"Protect IP Address in Calls\" feature enabled, \"all your calls will be relayed through WhatsApp's servers, ensuring that other parties in the call cannot see your IP address and subsequently deduce your general geographical location. This new feature provides an additional layer of privacy and security particularly geared towards our most privacy-conscious users.\"The new feature can be enabled on iOS and Android devices by toggling the \"Protect IP Address in Calls\" option under Settings > Privacy > Advanced.​This is part of a broader effort to boost WhatsApp users' privacy, with the company introducing in June 2023 a Silence Unknown Callers setting that screens out calls automatically if they're from unknown contacts.These blocked calls will not trigger the phone's ringer but will appear in the call list, providing visibility if they're from someone important and were mistakenly tagged as suspicious.Once enabled, the silence unknown callers feature aims to drastically minimize the attack surface and block spam and scam calls, as well as 'zero-click' attacks that take advantage of the automatic processing of incoming packets from callers.To detect when calls should be silenced without user interaction, WhatsApp uses privacy tokens distributed between local clients. \"Next, the server checks the token's validity along with a few other factors to determine if the intended recipient allows this sender to ring them,\" WhatsApp said.\"WhatsApp built and launched 'Silence Unknown Callers' and 'Protect IP Address in Calls' this year as part of our ongoing comprehensive work to keep users safe,\" the company said.\"These features respect and improve user privacy while also reducing the effectiveness of real-world attacks.\""
   },
   {
      "time": "2023-11-09",
      "title": "Russian-speaking threat actor \"farnetwork\" linked to 5 ransomware gangs",
      "text": " The operator of the Nokoyawa ransomware-as-a-service (RaaS), a threat actor known as 'farnetwork', built experience over the years by helping the JSWORM, Nefilim, Karma, and Nemty affiliate programs with malware development and operation management.A report from cybersecurity company Group-IB provides insight into farnetwork's activity and how they gradually built their profile as a highly active player in the ransomware business.In interactions with threat intelligence analysts, farnetwork shared valuable details that link them to ransomware operations starting 2019 and a botnet with access to multiple corporate networks.According to a report Group-IB shared with BleepingComputer, the threat actor has several usernames (e.g. farnetworkl, jingo, jsworm, razvrat, piparkuka, and farnetworkitand) and has been active on multiple Russian-speaking hacker forums trying to recruit affiliates for various ransomware operations.In March, though, farnetwork started looking for affiliates for their ransomware-as-a-service program based on the Nokoyawa locker. However, Group-IB's threat intelligence analysts say that the actor made it clear that they were not involved in the development of Nokoyawa.Running the RaaS business didn't last very long as farnetwork announced recently that they would retire from the scene and in October they shut down the Nokoyawa RaaS program, after leaking data of 35 victims.In Nokoyawa ransomware, farnetwork acted as a project leader, affiliate recruiter, promoter of the RaaS on darknet forums, and botnet manager.The botnet enabled affiliates direct access to already compromised networks. For this perk, they would pay the botnet owner 20% from the collected ransom and the ransomware owner would get 15%.A 65% cut for the ransomware affiliate may seem like a bad deal, considering that other programs pay up to 85% of the ransom, but the cost covered the effort of finding a suitable target and breaching it.The affiliates were expected to escalate their privileges on the network, steal files, run the encryptor, and demand a ransom payment.Group-IB has been able to track farnetwork’s activities as far back as January 2019 and found connections to the JSWORM, Nemty, Nefilim, and Karma ransomware strains.In April 2019, farnetwork promoted the JSWORM RaaS program on the Exploit hacker forum, where the threat actor advertised the RazvRAT malware.In February 2023, farnetwork pivoted to the RAMP forum saying they were working with the Nokoyawa ransomware as a recruiter and access manager.Based on Group-IB’s findings, farnetwork is suspected to have been involved in developing or at least in the evolution and management of the mentioned ransomware strains. The strongest ties are with Nefilim and Karma, both considered evolutions of Nemty.Group-IB managed to connect the different usernames to the same threat actor, showing that ransomware operations can come and go but behind them are seasoned individuals that keep the business going under new names."
   },
   {
      "time": "2023-11-09",
      "title": "Sumo Logic discloses security breach, advises API key resets",
      "text": " Update November 21, 14:37 EST: Sumo Logic says that no customer data was affected in the breach and provided Indicators of Compromise (IOCs) to help customers scan their own systems for signs of related malicious activity. \"These findings were verified by third-party forensic experts and the investigation of this incident is now complete and closed.\"Security and data analytics company Sumo Logic disclosed a security breach after discovering that its AWS (Amazon Web Services) account was compromised last week.The company detected evidence of the breach on Friday, November 3, after discovering that an attacker used stolen credentials to gain access to a Sumo Logic AWS account.Sumo Logic says its systems and networks weren't impacted during the breach and that \"customer data has been and remains encrypted.\"\"Immediately upon detection we locked down the exposed infrastructure and rotated every potentially exposed credential for our infrastructure out of an abundance of caution,\" the company said.\"We are continuing to thoroughly investigate the origin and extent of this incident. We have identified the potentially exposed credentials and have added extra security measures to further protect our systems.\"These measures involve enhanced monitoring and addressing potential vulnerabilities to prevent similar incidents in the future. The company also continues to monitor network and system logs to identify any indications of additional malicious activity.In light of these developments, Sumo Logic advised customers to rotate credentials used to access its services or any credentials shared with Sumo Logic for accessing other systems.Sumo Logic customers should immediately rotate their API access keys and should also reset the following as a precautionary measure:\"While the investigation into this incident is ongoing, we remain committed to doing everything we can to promote a safe and secure digital experience,\" the company said.\"We will directly notify customers if evidence of malicious access to their Sumo Logic accounts is found. Customers may find updates at our Security Response Center.\"Sumo Logic operates a cloud-native SaaS analytics platform providing customers with log analytics, infrastructure monitoring, cloud infrastructure security services, and more."
   },
   {
      "time": "2023-11-09",
      "title": "Researchers Uncover Undetectable Crypto Mining Technique on Azure Automation",
      "text": " Cybersecurity company SafeBreach said it discovered three different methods to run the miner, including one that can be executed on a victim's environment without attracting any attention.The study mainly set out to identify an \"ultimate crypto miner\" that offers unlimited access to computational resources, while simultaneously requiring little-to-no maintenance, is cost-free, and undetectable.That's where Azure Automation comes in. Developed by Microsoft, it's a cloud-based automation service that allows users to automate the creation, deployment, monitoring, and maintenance of resources in Azure.An alternative method entails creating a test-job for mining, followed by setting its status as \"Failed,\" and then creating another dummy test-job by taking advantage of the fact that only one test can run at the same time.The end result of this flow is that it completely hides code execution within the Azure environment.A threat actor could leverage these methods by establishing a reverse shell towards an external server and authenticating to the Automation endpoint to achieve their goals.Furthermore, it was found that code execution could be achieved by leveraging Azure Automation's feature that allows users to upload custom Python packages.\"We could create a malicious package named 'pip' and upload it to the Automation Account,\" Gamrian explained.\"The upload flow would replace the current pip in the Automation account. After our custom pip was saved in the Automation account, the service used it every time a package was uploaded.\"Microsoft, in response to the disclosures, has characterized the behavior as \"by design,\" meaning the method can still be exploited without getting charged.While the scope of the research is limited to the abuse of Azure Automation for cryptocurrency mining, the cybersecurity firm warned that the same techniques could be repurposed by threat actors to achieve any task that requires code execution on Azure.\"As cloud provider customers, individual organizations must proactively monitor every single resource and every action being performed within their environment,\" Gamrian said.\"We highly recommend that organizations educate themselves about the methods and flows malicious actors may use to create undetectable resources and proactively monitor for code execution indicative of such behavior.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-09",
      "title": "Beware, Developers: BlazeStealer Malware Discovered in Python Packages on PyPI",
      "text": " A new set of malicious Python packages has slithered their way to the Python Package Index (PyPI) repository with the ultimate aim of stealing sensitive information from compromised developer systems.\"[BlazeStealer] retrieves an additional malicious script from an external source, enabling a Discord bot that gives attackers complete control over the victim's computer,\" security researcher Yehuda Gelb said.The campaign, which commenced in January 2023, entails a total of eight packages named Pyobftoexe, Pyobfusfile, Pyobfexecute, Pyobfpremium, Pyobflite, Pyobfadvance, Pyobfuse, and pyobfgood, the last of which was published in October. These modules come with setup.py and init.py files that are designed to retrieve a Python script hosted on transfer[.]sh, which gets executed immediately upon their installation.Called BlazeStealer, the malware runs a Discord bot and enables the threat actor to harvest a wide range of information, including passwords from web browsers and screenshots, execute arbitrary commands, encrypt files, and deactivate Microsoft Defender Antivirus on the infected host.What's more, it can render the computer unusable by ramping up CPU usage, inserting a Windows Batch script in the startup directory to shut down the machine, and even forcing a blue screen of death (BSoD) error.\"It stands to reason that developers engaged in code obfuscation are likely dealing with valuable and sensitive information, and therefore, to a hacker, this translates to a target worth pursuing,\" Gelb noted.A majority of downloads associated with the rogue packages originated from the U.S., followed by China, Russia, Ireland, Hong Kong, Croatia, France, and Spain. They were collectively downloaded 2,438 times before being taken down.\"The open-source domain remains a fertile ground for innovation, but it demands caution,\" Gelb said. \"Developers must remain vigilant, and vet the packages prior to consumption.\"In recent years, open-source repositories have emerged as a lucrative way for threat actors to spread malware. According to Phylum's Evolution of Software Supply Chain Security Report for Q3 2023, 13,708 packages across multiple ecosystems were found to execute suspicious code during installation.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-09",
      "title": "Microsoft drops SMB1 firewall rules in new Windows 11 build",
      "text": " Windows 11 will no longer add SMB1 Windows Defender Firewall rules when creating new SMB shares starting with today's Canary Channel Insider Preview Build 25992 build.Before this change and since Windows XP SP2, creating SMB shares set up firewall rules automatically within the \"File and Printer Sharing\" group for the specified firewall profiles.After today, Windows 11 will configure the updated \"File and Printer Sharing (Restrictive)\" group, omitting inbound NetBIOS ports 137-139 (which are SMB1 artifacts).\"Administrators can still configure the \"File and Printer Sharing\" group if necessary as well as modify this new firewall group.\"The SMB client now also allows connections with an SMB server via TCP, QUIC, or RDMA over custom network ports different from the hardcoded defaults—previously, SMB only came with support for TCP/445, QUIC/443, and RDMA iWARP/5445. These improvements are part of an extensive effort to strengthen Windows and Windows Server security, as highlighted by other updates issued in recent months. By requiring that all destination servers support SMB 3.x and encryption, Windows administrators can guarantee that all connections are secure, thus mitigating the risks of eavesdropping and interception attacks."
   },
   {
      "time": "2023-11-09",
      "title": "\n        \n            Jamf Threat Labs Discovers Malware from BlueNoroff\n        \n    ",
      "text": " Jamf Threat Labs discovered a new later-stage malware variant from BlueNoroff that shares characteristics with their RustBucket campaign. Read this blog to learn more about this malware and view the indicators of compromise.Research led by Ferdous Saljooki.Jamf Threat Labs has identified a new malware variant attributed to the BlueNoroff APT group. BlueNoroff’s campaigns are financially motivated, frequently targeting cryptocurrency exchanges, venture capital firms and banks. During our routine threat hunting, we discovered a Mach-O universal binary communicating with a domain that Jamf has previously classified as malicious. This executable was undetected on VirusTotal at the time of our analysis, piquing our interest.The standalone binary, labeled ProcessRequest, is ad-hoc signed and has been observed communicating with the domain swissborg[.]blog. This raised suspicions, especially since a legitimate cryptocurrency exchange exists operating under the domain swissborg.com, where they host a legitimate blog at the URL swissborg.com/blog. The malware splits the command and control (C2) URL into two separate strings that get concatenated together. This is likely an attempt to evade static-based detection.The malicious domain swissborg[.]blog was registered on May 31, 2023, and resolves to the IP address 104.168.214[.]151. Pivoting from this domain revealed several URLs used for the malware’s communication. However, at the time of our analysis, the C2 server did not respond to any of these URLs and went offline shortly after our attempts to communicate.The IP address 104.168.214[.]151 has been associated with malware previously used by this attacker.We have observed submissions to VirusTotal from countries such as Japan and the US in September and October.The malware is written in Objective-C and operates as a very simple remote shell that executes shell commands sent from the attacker server. Although it is not entirely clear how initial access was achieved, this malware is likely being used as a later stage to manually run commands after compromising a system. This malware at a glance is very different from the previously mentioned RustBucket malware seen used in other attacks, but the attacker’s focus in both cases seems to be providing simple remote shell capability.Upon execution, the malware calls a function titled sendRequest to send a POST message to the hardcoded URL hXXp://swissborg.blog/zxcv/bnm. The malware then uses the Objective-C NSProcessInfo functionality which allows them to gain information about the malware process itself. It then retrieves the operatingSystemVersionString to determine the macOS version. An NSMutableURLRequest object is created using the hardcoded URL and the HTTP method and header fields are set accordingly.This POST request uses the NSURLSession class to generate the user-agent in the following format.The HTTP POST data is constructed using the following JSON formatted string, {\"sdf\":\"wsx\",\"info\":\"operatingSystemVersionString\"}, where operatingSystemVersionString will be replaced by the property value fetched from the processInfo object.Below is an example of the POST message being sent to the attacker server from the victim system.The block callback [ProcessRequest sendRequest]_block_invoke serves as the command executor if a response is received from the C2.The malware utilizes the system() function for command execution, inherently invoking sh -c. It logs the server response via NSLog for commands awaiting execution and records both successes and failures. The choice to log these activities is intriguing, as attackers crafting sophisticated malware typically omit any statements that might leave traces.The main function of the program initializes an instance of the ProcessRequest class, then sets up a repeating timer using the startTimer method. This timer triggers the sendRequest method at regular intervals, facilitating periodic network requests. To ensure continuous operation, the NSRunLoop class is used, keeping the main thread active.Although fairly simple, this malware is still very functional and will help attackers carry out their objectives. This seems to be a theme with the latest malware we’ve seen coming from this APT group. Based on previous attacks performed by BlueNoroff, we suspect that this malware was a late stage within a multi-stage malware delivered via social engineering. Jamf Threat Labs tracks this malware as ObjCShellz and as part of the RustBucket campaign.Have market trends, Apple updates and Jamf news delivered directly to your inbox."
   }
]