[
   {
      "time": "2022-12-08",
      "title": "Fraudsters Siphon $360M From Retailers Using 50M Fake Shoppers",
      "text": " Online fraudsters posing as consumers likely siphoned off more than $360 million from the marketing budgets of online businesses by generating fake clicks during Black Friday, while 20% of visits to retail sites on Cyber Monday were bots posing as shoppers and not humans, Web security firms said this week.The surge in fraud included techniques such ad injection, search engine redirects, and affiliate fraud — and shows the trouble that cybercriminal automation such as bots can cause for online commerce providers. The increase in fraud matched the annual upswing of US holiday sales that start the week of Thanksgiving though the following Monday, also known as Cyber Monday. Overall, online retailers saw a nearly 12% increase in sales during November and a 2.3% increase in purchases on Black Friday.The lockstep growth of sales and fraud underscores the opportunistic nature of attackers, says Guy Tytunovich, CEO of Cheq.\"Fraud is always there, but it is very seasonal in terms of peak times,\" he says. \"[The trigger] could be anything — it could be political, like an election, or it could be like Black Friday or Cyber Monday.\"Fraudsters have had a significant impact on online businesses, according to data provided to Dark Reading by Cheq and online network-services provider Akamai. By donning the disguise of legitimate consumers, bots can cost advertisers and retailers real money on marketing — typically a loss of 10% to 15% — that is not being seen by human eyes. In addition, bots can be used to buy out popular items, enable credit card fraud, and tie up inventory.About 20% of sessions overall are \"being distorted\" because of something happening on the client side, says Patrick Sullivan, chief technology officer for security strategy at Akamai. While businesses tend to focus on attacks against their own infrastructure — the server side — they pay less attention to what is going on with visitors' systems and browsers, he says.\"In general, we've seen over the last five years that no longer can security be focused on the crown jewels just being on the server side,\" Sullivan says. \"Across a number of industries, we see attackers more focused on the client side. We've seen supply chain attacks where the fraudsters gain control of the javascript running on the client side, for example.\"While credit card fraud continues to be a significant concern for retailers, the increase in attacks that deplete inventory or make inventory unavailable to legitimate buyers is more worrisome, he says.\"While they are not as malicious as other [cyberattacks], retailers are extremely scared about scalper bots,\" he says. \"The bots that are wholly aimed at getting those Jordan Ones or PlayStation 5s or whatever, and get the entire stock.\"Another major inventory-impacting attack are bots that abandon shopping carts, which typically puts a hold of 10 to 15 minutes on an items — a small amount, but one that can add up quickly with the intensity that only automation can provide. These denial-of-inventory attacks can cause chaos with retailers' visibility into the state of their stocks, Akamai's Sullivan says.\"There are certain industries that almost engineer scarcity — they want people to queue up for sneakers or handbags — but now we have seen it across multiple industries — groups that have traditionally never seen that,\" he says. \"Because of the supply chain issues now, a lot more industries are impacted by these inventory-grabbing bots out there.\"However, most of the invalid traffic, or IVT, that companies such as Akamai and Cheq track are not necessarily fraud, but just unwanted by retailers.In many cases, the influx of non-human traffic included user-installed price-comparison tools, such as Honey and Rakuten, which retailers might prefer that their visitors did not use, but which are not fraudulent nor malicious. In the US during Cyber Week, for example, retailers saw 25% to 30% more sessions that used browser extensions for price comparison, Akamai stated.Yet such traffic also skews retailers' understand of consumer demand, which can lead to inefficiencies, according to Cheq. Unique site visits are increased by 22% by automated traffic, while sessions duration can dive 41% and the number of new users overestimated by 21%, the company found.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-08",
      "title": "Apple rolls out end-to-end encryption for iCloud backups",
      "text": " Apple introduced today Advanced Data Protection for iCloud, a new feature that uses end-to-end encryption to protect sensitive iCloud data, including backups, photos, notes, and more.For customers who choose to enable this new security feature, Advanced Data Protection is designed to safeguard \"most iCloud data even in the case of a data breach in the cloud\" by ensuring that encrypted cloud data can only be decrypted on the users' trusted devices.Those who opt-in will first be prompted to choose an alternate recovery method (the device passcode or password, a recovery contact, or a personal recovery key) required if they lose access to their Apple account. This is needed because Apple will not have the decryption keys to recover the data.The data types protected using end-to-end encryption include device and message backups, iCloud Drive, Photos, Notes, Reminders, Safari bookmarks, Wallet passes, voice memos, Siri shortcuts, and more.iCloud Mail, Contacts, and Calendar data will not be encrypted because it's needed to communicate with other email, contacts, and calendar systems.The ability to opt-in to encrypted iCloud backups is a really big win for users and bad news for law enforcement, who loved to request iCloud backups to save them the trouble of breaking into a phone.Users can also toggle off backup encryption at any time, and their devices will securely upload the encryption keys to Apple servers (their accounts will automatically switch back to standard data protection).Advanced Data Protection is already available in the U.S. for customers enrolled in Apple's Beta Software Program and will be available to all U.S. later this month. It will start rolling out for users outside the U.S. in early 2023.\"Advanced Data Protection is Apple's highest level of cloud data security, giving users the choice to protect the vast majority of their most sensitive iCloud data with end-to-end encryption so that it can only be decrypted on their trusted devices,\" said Ivan Krstić, Apple's head of Security Engineering and Architecture.​Apple also introduced two additional security features today: iMessage Contact Key Verification and Security Keys for Apple ID.The first enables iMessage users to verify the identity of the people on the other end, and it alerts them if a threat actor manages to add their own device into the conversation to snoop on their encrypted communication channel.\"Now with iMessage Contact Key Verification, users who face extraordinary digital threats — such as journalists, human rights activists, and members of government — can choose to further verify that they are messaging only with the people they intend,\" Apple said.The second allows Apple customers to set up their Apple ID account to require a physical security key to finish the sign-in process.\"This feature is designed for users who, often due to their public profile, face concerted threats to their online accounts, such as celebrities, journalists, and members of government,\" Apple added."
   },
   {
      "time": "2022-12-08",
      "title": "Vice Society Ransomware Attackers Targeted Dozens of Schools in 2022",
      "text": " The Vice Society cybercrime group has disproportionately targeted educational institutions, accounting for 33 victims in 2022 and surpassing other ransomware families like LockBit, BlackCat, BianLian, and Hive.The cybersecurity company called Vice Society one of the \"most impactful ransomware gangs of 2022.\"Of the 100 organizations affected in total, 35 cases have been reported from the U.S., followed by 18 in the U.K., seven in Spain, six each in Brazil and France, four each in Germany and Italy, and three cases in Australia.Active since May 2021, Vice Society stands apart from other ransomware crews in that it does not use a ransomware variant of its own, rather relying on pre-existing ransomware binaries such as HelloKitty and Zeppelin that are sold on underground forums.Unit 42's incident response efforts show that the group has a dwell time of six days in the victims' environments and that the initial ransom amounts could exceed $1 million – a figure that may drop by as much as 60% post negotiations to $460,000.\"School districts with limited cybersecurity capabilities and constrained resources are often the most vulnerable to threat actors,\" Unit 42 researcher JR Gumarin said.\"Vice Society and its consistent targeting of the education industry vertical, particularly around the September time frame, serves as a warning that this group has shaped their campaigns to take advantage of the school year in the U.S.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-08",
      "title": "CloudSEK claims it was hacked by another cybersecurity firm",
      "text": " Indian cybersecurity firm CloudSEK says a threat actor gained access to its Confluence server using stolen credentials for one of its employees' Jira accounts.While some internal information, including screenshots of product dashboards and three customers' names and purchase orders, was exfiltrated from its Confluence wiki, CloudSEK says the attackers didn't compromise its databases. Instead, using the stolen Jira credentials, the threat actor could access training and internal documents, Confluence pages, and open-source automation scripts attached to Jira.A threat actor named 'sedut' is now trying to sell what they claim is access to CloudSek's \"networks, Xvigil, codebase, email, JIRA and social media accounts\" on multiple hacking forums.They also leaked images containing CloudSEK-related information, including usernames and passwords for accounts used to scrape the Breached and XSS hacking forums, instructions on how to use various website crawlers, as well as screenshots showing CloudSEK's database schema, CloudSEK's dashboard, and purchase orders.The threat actor is now trying to sell CloudSEK's alleged database for $10,000 and the codebase and employee/engineering product docs for $8,000 each.\"All the screenshots and purported accesses shared by the threat actor can be traced back to JIRA Tickets and internal confluence pages,\" Sasi added Wednesday.\"Even the screenshots of Elastic DB, mySQL database schema, and XVigil/PX are from training documents stored on JIRA or Confluence.\"CloudSEK has already tightened its circle of suspects, and, in an update to his blog post, Sasi claims another cybersecurity company known for tracking dark web developments might be behind the breach.\"We suspect a notorious Cyber Security company that is into Dark web monitoring behind the attack,\" CloudSEK's CEO says.\"The attack and the indicators connect back to an attacker with a notorious history of using similar tactics we have observed in the past.\"BleepingComputer reached out earlier today for more info, but a company spokesperson refused to provide additional details on the name of the cybersecurity outfit suspected of the CloudSEK breach.\"As soon as we came to know about a targeted attack on CloudSEK, we went public with the information and in the spirit of transparency, we are updating all our findings on our blog post about it,\" the CloudSEK spokesperson told BleepingComputer on Wednesday."
   },
   {
      "time": "2022-12-08",
      "title": "Hackers use new Fantasy data wiper in coordinated supply chain attack",
      "text": " The Iranian Agrius APT hacking group is using a new 'Fantasy' data wiper in supply-chain attacks impacting organizations in Israel, Hong Kong, and South Africa.The campaign started in February and unfolded at full scale in March 2022, breaching an IT support services firm, a diamond wholesaler, a jeweler, and an HR consulting company.In this campaign, Agrius used a new wiper named 'Fantasy' hidden inside a software suite created by an Israeli vendor. This software is commonly used in the diamond industry.Wipers are a category of malware aiming to delete data on breached computers, causing digital destruction and business interruption.The Agrius APT (Advanced Persistent Threat) breached a South African organization in the diamond industry on February 20, 2022, dropping credential harvesters like MiniDump and SecretsDump on its network to steal account credentials.The hackers leveraged the stolen credentials to spread further throughout the breached network, presumably collecting information and gaining access to other systems.On March 12, 2022, Argius deployed Host2IP and a new tool named 'Sandals' to spread the Fantasy wiper on reachable devices.Sandals is a Windows executable that connects to systems on the same network via SMB and writes a batch file executed via PsExec to launch the Fantasy wiper.On the same day in March, and within a 2.5-hour time frame, the attackers deployed all four mentioned tools against Israeli targets and a company in Hong Kong.All attacked companies were customers of the affected software developer, who, according to ESET, realized the problem immediately and pushed clean updates within hours.The Fantasy data wiper is a 32-bit Windows executable ('fantasy45.exe' and 'fantasy35.exe'). Upon execution, it gets a list of all drives and their directories except for the Windows folder, which is skipped, and all files in each directory.Fantasy overwrites the content of each file with random data, sets timestamps to midnight 2037, and deletes it. This process attempts to prevent the files from being recovered with data recovery tools.Next, Fantasy deletes registry keys in HKCR, clears all WinEventLogs, deletes the Windows SystemDrive folder, and then enters a two-minute sleep.Finally, the wiper overwrites the master boot record, deletes itself, and reboots the system after another 30-second delay.However, even though these were destructive attacks, ESET says that victims could get back up and running in hours.\"It is likely that %SYSTEMDRIVE% recovery is possible. Victims were observed to be back up and running within a matter of hours,\" explains ESET.ESET comments that while there's extensive code overlap between Apostle and Fantasy, the latter is purely a wiper, not having any data encryption capabilities, and does not create ransom notes."
   },
   {
      "time": "2022-12-08",
      "title": "Google: State hackers still exploiting Internet Explorer zero-days",
      "text": " Google's Threat Analysis Group (TAG) revealed today that a group of North Korean hackers tracked as APT37 exploited a previously unknown Internet Explorer vulnerability (known as a zero-day) to infect South Korean targets with malware.Once opened on the victims' devices, the document would deliver an unknown payload after downloading a rich text file (RTF) remote template that would render remote HTML using Internet Explorer.Loading the HTML content that delivered the exploit remotely allows the attackers to exploit the IE zero-day even if the targets weren't using it as their default web browser.While Google TAG couldn't analyze the final malicious payload distributed by the North Korean hackers on their South Korean targets' computers, the threat actors are known for deploying a wide range of malware in their attacks.\"Although we did not recover a final payload for this campaign, we've previously observed the same group deliver a variety of implants like ROKRAT, BLUELIGHT, and DOLPHIN,\" Google TAG's Clement Lecigne and Benoit Stevens said.\"APT37 implants typically abuse legitimate cloud services as a C2 channel and offer capabilities typical of most backdoors.\"The threat group is known for focusing its attacks on individuals of interest to the North Korean regime, including dissidents, diplomats, journalists, human rights activists, and government employees."
   },
   {
      "time": "2022-12-08",
      "title": "New Go-based Botnet Exploiting Exploiting Dozens of IoT Vulnerabilities to Expand its Network",
      "text": " A novel Go-based botnet called Zerobot has been observed in the wild proliferating by taking advantage of nearly two dozen security vulnerabilities in the internet of things (IoT) devices and other software.The campaign, which is said to have commenced after November 18, 2022, primarily singles out Windows and Linux operating systems to gain control of vulnerable devices.Zerobot gets its name from a propagation script that's used to retrieve the malicious payload after gaining access to a host depending on its microarchitecture implementation (e.g., \"zero.arm64\").The malware is designed to target a wide range of CPU architectures such as i386, amd64, arm, arm64, mips, mips64, mips64le, mipsle, ppc64, ppc64le, riscv64, and s390x.Two versions of Zerobot have been spotted to date: One used before November 24, 2022, that comes with basic functions and an updated variant that includes a self-propagating module to breach other endpoints using 21 exploits.This comprises vulnerabilities impacting TOTOLINK routers, Zyxel firewalls, F5 BIG-IP, Hikvision cameras, FLIR AX8 thermal imaging cameras, D-Link DNS-320 NAS, and Spring Framework, among others.Zerobot, upon initialization in the compromised machine, establishes contact with a remote command-and-control (C2) server and awaits further instructions that allow it to run arbitrary commands and launch DDoS attacks for different network protocols like TCP, UDP, TLS, HTTP, and ICMP.\"Within a very short time, it was updated with string obfuscation, a copy file module, and a propagation exploit module that make[s] it harder to detect and gives it a higher capability to infect more devices,\" Lin said.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-08",
      "title": "Russian Hackers Spotted Targeting U.S. Military Weapons and Hardware Supplier",
      "text": " A state-sponsored hacking group with links to Russia has been linked to attack infrastructure that spoofs the Microsoft login page of Global Ordnance, a legitimate U.S.-based military weapons and hardware supplier.The cybersecurity firm said it discovered 38 domains, nine of which contained references to companies like UMO Poland, Sangrail LTD, DTGruelle, Blue Sky Network, the Commission for International Justice and Accountability (CIJA), and the Russian Ministry of Internal Affairs.It's suspected that the themed domains are likely an attempt on part of the adversary to masquerade as authentic parties in social engineering campaigns.\"Notably, a consistent trend has emerged regarding the use of specifically tailored infrastructure by TAG-53 highlighting the long-term use of similar techniques for their strategic campaigns,\" the researchers said.Enterprise security company Proofpoint has further called out the group for its sophisticated impersonation tactics to deliver rogue phishing links.One of those attacks involved the threat actor using a spoofed email address mimicking a trusted source to send a spear-phishing message with a decoy PDF containing a fraudulent link in an attempt to evade detection from email gateways.\"The email exchange shows that the attacker did not include the malicious payload in the ﬁrst email, but waited to get an answer to build a relationship and avoid suspicion before sending the payload to the victim,\" the cybersecurity company explained.The use of typosquatted Russian ministry domains further adds weight to Microsoft's assessment that SEABORGIUM targets former intelligence officials, experts in Russian affairs, and Russian citizens abroad.SEKOIA.IO also characterized the targeting of CIJA as an intelligence gathering mission designed to amass \"war crime-related evidence and/or international justice procedures, likely to anticipate and build counter narrative on future accusations.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-08",
      "title": "Meta Expected to Face New Fines After EU Privacy Ruling - SecurityWeek",
      "text": " Hi, what are you looking for?Meta is expected to face another large fine after Europe’s data watchdog on Tuesday imposed binding decisions concerning the treatment of personal data by the owner of Facebook, Instagram and WhatsApp. ByFlipboardRedditWhatsappWhatsappEmailAFP 2023Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.SecurityWeek spoke with more than 300 cybersecurity experts to see what is bubbling beneath the surface, and examine how those evolving threats will present...Joanna Burkey, CISO at HP, and Kevin Cross, CISO at Dell, discuss how the role of a CISO is different for a multinational corporation...In this issue of CISO Conversations we talk to two CISOs about solving the CISO/CIO conflict by combining the roles under one person.Security professionals understand the need for resilience in their company’s security posture, but often fail to build their own psychological resilience to stress.SecurityWeek examines how a layoff-induced influx of experienced professionals into the job seeker market is affecting or might affect, the skills gap and recruitment...The three primary drivers for cyber regulations are voter privacy, the economy, and national security – with the complication that the first is often...2022 Cybersecurity Year in Review: Top news headlines and trends that impacted the security ecosystemGot a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-08",
      "title": "Maryland bars state employees from using Kaspersky, TikTok, Huawei | SC Media",
      "text": "  Outgoing Republican Gov. Larry Hogan banned Maryland state employees from using a range of Chinese and Russian equipment and software, citing national security and the potential for such technologies for be leveraged for hacking and foreign espionage. The order starts the clock on a two-week timeline for state employees to remove any known hardware or software from the companies from state networks and put in place measures that would prevent the future installation or access to such systems. The order recommends automated tools to scan for known desktop applications, the use of mobile device management software to keep track of phones issued to workers and a restriction in administrative privileges for state employees.“There may be no greater threat to our personal safety and our national security than the cyber vulnerabilities that support our daily lives,” said Hogan in a statement. “As the cyber capital of America, Maryland has taken bold and decisive actions to prepare for and address cybersecurity threats. To further protect our systems, we are issuing this emergency directive against foreign actors and organizations that seek to weaken and divide us.”Kaspersky, Huawei and TikTok have all come under scrutiny in recent years as Washington has become more aware of cybersecurity vulnerabilities in the technology supply chain and as the cloud computing revolution has stored increasingly amounts of American data overseas.U.S. officials have repeatedly accused Kaspersky and Huawei of having formal or informal working relationships with the Russian and Chinese governments and claim that domestic laws in both countries legally obligate those companies to store data within their borders and assist the government in national security investigations.All the companies in the order have been subject to previous restrictions or sanctions from the federal government and have repeatedly denied working with the Chinese or Russian governments, or intentionally facilitating hacking, espionage or surveillance.In March 2017, ZTE agreed to pay a $1.19 billion fine for violating a U.S. trade embargo against two heavily sanctioned countries: Iran and North Korea. The company was required to discipline certain employees as part of that agreement and, according to U.S. officials, ZTE failed to punish employees who destroyed and concealed evidence related to the violations, and some were even rewarded with bonuses.\"ZTE made false statements to the U.S. government when they were originally caught and put on the Entity List, made false statements during the reprieve it was given, and made false statements again during its probation,\" then-Secretary of Commerce Wilbur Ross said in a statement at the time.Derek is a senior editor and reporter at SC Media, where he has spent the past three years providing award-winning coverage of cybersecurity news across the public and private sectors. Prior to that, he was a senior reporter covering cybersecurity policy at Federal Computer Week. Derek has a bachelor’s degree in print journalism from Hofstra University in New York and a master’s degree in public policy from George Mason University in Virginia.Tenable was named Best Security Company by offering cybersecurity risk management products that help organizations understand and reduce their cyber risk across the entire attack surface.Aqua Nautilus researchers warn that the installation of a malicious PowerShell module could take down an organization.More than 80% of CISOs say they now participate in product and service pitches to potential customers.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   }
]