[
   {
      "time": "2022-11-17",
      "title": "Researchers Discover Hundreds of Amazon RDS Instances Leaking Users' Personal Data",
      "text": " Hundreds of databases on Amazon Relational Database Service (Amazon RDS) are exposing personal identifiable information (PII), new findings from Mitiga, a cloud incident response company, show.This includes names, email addresses, phone numbers, dates of birth, marital status, car rental information, and even company logins.The Israeli company, which carried out the research from September 21, 2022, to October 20, 2022, said it found 810 snapshots that were publicly shared for varying duration, starting from a few hours to weeks, making them ripe for abuse by malicious actors.Of the 810 snapshots, over 250 of the backups were exposed for 30 days, suggesting that they were likely forgotten.Based on the nature of the information exposed, adversaries could either steal the data for financial gain or leverage it to get a better grasp of a company's IT environment, which could then act as a stepping stone for covert intelligence gathering efforts.It's highly recommended that RDS snapshots are not publicly accessible in order to prevent potential leak or misuse of sensitive data or any other kind of security threat. It's also advised to encrypt snapshots where applicable.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-17",
      "title": "Disneyland Malware Team: It’s a Puny World After All – Krebs on Security",
      "text": " The Disneyland Team’s Web interface, which allows them to interact with malware victims in real time to phish their login credentials using phony bank websites.The Disneyland Team uses common misspellings for top bank brands in its domains. For example, one domain the gang has used since March 2022 is ushank[.]com — which was created to phish U.S. Bank customers.But this group also usually makes use of Punycode to make their phony bank domains look more legit. The U.S. financial services firm Ameriprise uses the domain ameriprise.com; the Disneyland Team’s domain for Ameriprise customers is https://www.xn--meripris-mx0doj[.]com [brackets added to defang the domain], which displays in the browser URL bar as ạmeriprisẹ[.]com.Have a look at the Punycode in this Disneyland Team phishing domain: https://login2.xn--mirtesnbd-276drj[.]com, which shows up in the browser URL bar as login2.ẹmirạtesnbd[.]com, a domain targeting users of Emirates NBD Bank in Dubai.Here’s another domain registered this year by the Disneyland Team: https://xn--clientchwb-zxd5678f[.]com, which spoofs the login page of financial advisor Charles Schwab with the landing page of cliẹntșchwab[.]com. Again, notice the dots under the letters “e” and “s”.  Another Punycode domain of theirs sends would-be victims to cliẹrtschwạb[.]com, which combines a brand misspelling with Punycode.We see the same dynamic with the Disneyland Team Punycode domain https://singlepoint.xn--bamk-pxb5435b[.]com, which translates to singlepoint.ụșbamk[.]com — again phishing U.S. Bank customers.What’s going on here? Holden says the Disneyland Team is Russian-speaking — if not also based in Russia —  but it is not a phishing gang per se. Rather, this group uses the phony bank domains in conjunction with malicious software that is already secretly installed on a victim’s computer.In years past, crooks like these would use custom-made “web injects” to manipulate what Gozi victims see in their Web browser when they visit their bank’s site. These web injects allowed malware to rewrite the bank’s HTML code on the fly, and copy and/or intercept any data users would enter into a web-based form, such as a username and password.Most Web browser makers, however, have spent years adding security protections to block such nefarious activity. As a result, the Disneyland Team simply tries to make their domains look as much like the real thing as possible, and then funnel victims toward interacting with those imposter sites.“The reason that it is infeasible for them to use in-browser injects include browser and OS protection measures, and difficulties manipulating dynamic pages for banks that require multi-factor authentication,” Holden said.In reality, the fake bank website overlaid by the Disneyland Team’s malware relays the victim’s browser activity through to the real bank website, while allowing the attackers to forward any secondary login requests from the bank, such as secret questions or multi-factor authentication challenges.The Disneyland Team included instructions for its users, noting that when the victim enters their login credentials, he sees a 10-second spinning wheel, and then the message, “Awaiting back office approval for your request. Please don’t close this window.”A fake PNC website overlay or “web inject” displaying a message intended to temporarily prevent the user from accessing their account.The “SKIP” button in the screenshot above sends the user to the real bank login page, “in case the account is not interesting to us,” the manual explains. “Also, this redirect works if none of our operators are working at the time.”The “TAKE” button in the Disneyland Team control panel allows users or affiliates to claim ownership over a specific infected machine or bot, which then excludes other users from interacting with that victim.In the event that it somehow takes a long time to get the victim (bot) connected to the Disneyland Team control panel, or if it is necessary to delay a transaction, users can push a button that prompts the following message to appear on the victim’s screen:“Your case ID number is 875472. An online banking support representative will get in touch shortly. Please provide your case ID number, and DO NOT close this page.”The Disneyland user manual explains that the panel can be used to force the victim to log in again if they transmit invalid credentials. It also has other options for stalling victims whilst their accounts are drained. Another fake prompt the panel can produce shows the victim a message saying, “We are currently working on updating our security system. You should be able to log in once the countdown timer expires.”The user manual says this option blocks the user from accessing their account for two hours. “It is possible to block for an hour with this button, in this case they get less frustrated, within the hours ddos will kill their network.”Those stories also observed that since the vast majority of the malicious software used in cyberheists is designed to run only on Microsoft Windows computers, it made sense to pick a non-Windows computer for that dedicated banking system, such as a Mac or even a version of Linux. I still stand by this advice.\r\n         This entry was posted on Wednesday 16th of November 2022 12:32 PM \r\n         “The “SKIP” button in the screenshot above sends the user to the real bank login page,”I see no SKIP button in that screenshot.He was referring to the first screenshot, it shows the panel the phishers are using.First screenshot.  Not the one immediately “above.”look closer 🙂So you admit that you are blind?The security importance of a clean screen becomes apparent.It’s not a matter of having a dirty screen, it’s the fact that immediately above that sentence is a screenshot which does not include the skip button. This was actually bad form on the part of the editor who laid out this page to leave the sentence worded that way after placing the sentence below an unrelated screenshot. Had the second screenshot appeared just after that sentence, there would be no confusion.I was confused by the same incongruity until I scrolled back up the page to see whether it was referring to a different “image above” than the one immediately “above.”One thing that can be important is to set up an entirely different and secret e-mail address to be used for banking.  Whenever you get e-mail from the bank, if it is not to that e-mail address, then you should be very skeptical of the e-mail.Wow. Thanks for the heads up. While I use a variety of data points to help “see” a malicious site (misspellings and lack of personalization have been easy to spot), this illustrates how much more difficult it is becoming even for the cautiously aware users. Will using the latest browser updates from Google Chrome, Microsoft Edge (Chromium) or an Outlook safe link (clicked from an updated version of MS Office 365) prevent or flag an oversight?In Firefox, you can set it to show the full punycode (rather than have it translated to the spoofed non-Latin letters)\nabout:config > network.IDN_show_punycode = TRUEHowever, it seems the use of punycode here is used in conjunction with man-in-the-browser malware already on the victim machine which redirects the victim’s browser.  I would think the malware would also just switch the config too.\nSo in this scenario, the computer is pwned already.  The best advice is what Brian said, have dedicated hardware for online banking that you always use for banking, and never use for anything else.When was this activity initially discovered? IS it possible it was discovered before Gozi operators purportedly moved on from targeting  the banking sector? Are the old and new operations “operating” concurrently?Strip punycode disguises in Firefox by changing this built-in setting:Erase the URL and type\nabout:configThe agree/understand the risks etc and continue.type “puny” in the search settings boxOne result should appear:\nnetwork.IDN_show_punycode (false)Double-click so it’s TrueClose the tab. That’s it.The Chrome extension PhishAI used to block punycode but the extension fell out of favor for some reason.FYI,  the website  centralops(.) net  wll  decipher   those   punycode,   phishing domain  namesI always, without exception, access my bank by opening a Windows Sandbox instance, and using MS Edge within that.  I never type in the banking address because I have established links on that desktop.  Is this “secure enough” ?I always, without exception, access my bank by opening a Windows Sandbox instance, and using MS Edge within that.  I never type in the banking address because I have established links on that desktop.  Is this “secure enough” ?@PostToaster, Only you can really judge what is “secure enough” for you, but you’ve already done more than most people.  I take it you also have 2 factor authentication for your banking?No two-factor except when I can use my landline for it.  Too much SIM-swapping going on.“Look carefully, and you’ll notice small dots beneath the “a” and the second “e”.”\nThere seem to be even exact representatives of the same character: e.g.\nа\tcyrillic small letter a\na\tlatin small letter a\nThat seems worrying. In my mail client URLS that only differ in these characters LOOK EXACTLY THE SAME, even when hovering over them, but the URLs it then actually navigates to are different.\nHow to fix this? Mail clients could show the translated ‘xn--*’ url, but that of course only works for tech savvy people and as long as most hostnames are ascii based, because otherwise it will be complete gibberish to humans.Is there a reason you aren’t recommending people using their banks app in place of a browser?My advice skews toward businesses, which enjoy exactly zero legal protection against fraud like this. If you’re a consumer and your account gets cleaned out because of a trojan, you’re not on the hook for that loss. Businesses are.Also, I have a hard time seeing an accountant for a business doing all they need to do with their bank from a mobile phone vs. a computer, but that’s just me.Agree Brian, on the business preference for using a desktop/laptop for large scale ops, over a small mobile device.\nI knew that at the birth of the iPhone. Run a payroll on a 2″ x 3″ screen? Right…\nHowever, the enormous, exponential current Zelle losses, caused by gullible consumers using “weak security” SMS comms, actively sponsored by banks/credit unions, despite the Jy 2016 NIST warning, numerous FBI warnings since, and the stunner, NSA 29Jy21, says the depth of stupidity and greed in the financial world is thicker than I had perceived.\nSo much good luck to these Zelle banks on their conflict with defrauded, MITM consumers, with their Regulation E claims.\nBased on the last 25 years of documented rampant compromise, electronic commerce is not to be trusted.\nAlways have a non-electronic Plan B…I guess it is a fraud world after all.. 🙂Do your banking from “a dedicated, security-hardened system”…meaning a Chromebook. Never use a Windows computer for on-line banking. Best would be to use a Chromebook for reading email and browsing too.I am not sure if you are joking or not. A friend was cleaning out an abandoned house and came across a Chrome book, wondering if they could use it, they asked me for help.\nIn less than an hour, without myself even seeing it, we had taken it over, user data and all. (Granted, there was physical contact but it did not seem very secure in the least.)Generally speaking, if an adversary has physical access to your device, it’s no longer your device.Thanks Brian for your reminder of a not-new problem being dusted off by perps and inflicted on us again.I added a firewall rule to put the kibbosh on all xn-- addresses:\n^(.*\\.)?.*(xn\\-\\-).*$\nI realize this is draconian and would create an unworkable situation for users who legitimately need to access such domains, but I do not manage any users who have these needs, so for now I’m going with it. In addition to that, I prettied up and added Brian’s list to my pi-hole to specifically block that handful of domains.\nI verified that Vivaldi 5.5 (on Android) catches at least some deliberate spoofs, such as the ‘apple’ demo set up by Xudong Zheng.Wheel spinner is a game that I am sure that anyone who loves spins of fortune will be addicted to sitting in front of the computer playing this game for hours on end. The game has no age limit for players, suitable for those who want healthy entertainment and improved hand reflexes.Wheel spinner is a game that I am sure that anyone who loves spins of fortune will be addicted to sitting in front of the computer playing this game for hours on end. The game has no age limit for players, suitable for those who want healthy entertainment and improved hand reflexes.Comments are closed.Mailing ListSearch KrebsOnSecurityRecent PostsStory CategoriesWhy So Many Top Hackers Hail from Russia"
   },
   {
      "time": "2022-11-17",
      "title": "DOJ touts work with Kaseya, urges more ransomware victims to contact CISA, FBI",
      "text": " A senior Justice Department official urged more ransomware victims to come forward and approach law enforcement agencies for assistance, touting the work done with software provider Kaseya last year.Speaking at the Aspen Cyber Summit on Wednesday, Eun Young Choi, Director of the DOJ’s National Cryptocurrency Enforcement Team, said her office is tracking more than 100 ransomware variants and is increasingly having success in helping victims. She noted that part of the ransom paid by Colonial Pipeline after last year’s ransomware attack was clawed back through the blockchain only a month after it was handed over. The attack had wide-ranging effects on thousands of organizations but was eventually remediated and led to the rare instance of U.S. officials taking offensive actions against the ransomware group behind the incident. Choi noted that her office now has more than 150 digital asset coordinators and investigators focused on cryptocurrency-related crimes. She encouraged victims to contact the FBI, CISA, or DOJ if they are ever dealing with a ransomware attack. “We’re getting better at this,” Choi said. “We’re applying that not only to ransomware to the broader operations of cybercrime as well.”Heather Trew of the Treasury Department’s virtual currencies division also appeared on the panel and spoke at length about her office’s efforts to share information with other agencies. Trew flagged how the Office of Foreign Assets Control (OFAC) has been ramping up sanctions on cybercriminals and nation-state hackers. “We’d be remiss to not mention sanctions, they’re a critical action,” she said, comparing them to “the financial death penalty to designated persons or in some cases jurisdictions.”Recorded Future, the parent company of The Record, is a sponsor of the Aspen Cyber Summit. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-17",
      "title": "Updated RapperBot malware targets game servers in DDoS attacks",
      "text": " The Mirai-based botnet 'RapperBot' has re-emerged via a new campaign that infects IoT devices for DDoS (Distributed Denial of Service) attacks against game servers.By tracing its activities, the researchers found that RapperBot has been operational since May 2021, but its exact goals were hard to decipher.The recent variant uses a Telnet self-propagation mechanism instead, which is closer to the approach of the original Mirai malware.Also, the motivation of the current campaign is more apparent, as the DoS commands in the latest variant are tailored for attacks against servers hosting online games.Fortinet analysts could sample the new variant using C2 communication artifacts collected in the previous campaigns, indicating that this aspect of the botnet's operation has not changed.The analysts noticed the new variant featured several differences, including support for Telnet brute-forcing, using the following commands:The malware tries to brute force devices using common weak credentials from a hardcoded list, whereas previously, it fetched a list from the C2.\"Unlike less sophisticated IoT malware, this allows the malware to avoid trying to test a full list of credentials.\"After successfully finding credentials, it reports it to the C2 via port 5123 and then attempts to fetch and install the correct version of the primary payload binary for the detected device architecture.Currently supported architectures are ARM, MIPS, PowerPC, SH4, and SPARC.The DoS capabilities in RapperBot's older variant were so limited and generic that the researchers hypothesized its operators might be more interested in the initial access business.However, in the latest variant, the true nature of the malware has become apparent with the addition of an extensive set of DoS attack commands like:Based on the HTTP DoS methods, the malware appears to be specialized in launching attacks against game servers.\"This campaign adds DoS attacks against the GRE protocol and the UDP protocol used by the Grand Theft Auto: San Andreas Multi Player (SA:MP) mod,\" reads Fortinet's report.Fortinet believes all detected RapperBot campaigns are orchestrated by the same operators, as newer variants indicate access to the malware's source code.Moreover, the C2 communication protocol remains unchanged, the list of credentials used for brute forcing attempts has been the same since August 2021, and there have been no signs of campaign overlaps at this time.To protect your IoT devices from botnet infections, keep the firmware up to date, change default credentials with a strong and unique password, and place them behind a firewall if possible."
   },
   {
      "time": "2022-11-17",
      "title": "Suspected Zeus cybercrime ring leader ‘Tank’ arrested by Swiss police",
      "text": " Vyacheslav Igorevich Penchukov, also known as Tank and one of the leaders of the notorious JabberZeus cybercrime gang, was arrested in Geneva last month.The Swiss Federal Office of Justice (FOJ) said Penchukov was arrested last month and is waiting to be extradited to the United States, although he can still appeal FOJ's decision.\"By order of the Federal Office of Justice (FOJ) and based on an extradition request from the USA, a Ukrainian national was arrested in the Canton of Geneva on 23 October 2022 and detained pending extradition,\" Swiss prosecutors told BleepingComputer.\"The US authorities accuse the prosecuted person of extortion, bank fraud, and identity theft, among other things. During the hearing on 24 October 2022, the person did not consent to his extradition to the USA via a simplified proceeding.\"After completion of the formal extradition procedure, the FOJ has decided to grant his extradition to the USA on 15 November 2022. The decision of the FOJ may be appealed at the Swiss Criminal Federal Court, respectively at the Swiss Supreme Court.\"Multiple sources previously told BleepingComputer that Penchukov was also one of the managers of the Maze and Egregor ransomware operations.However, according to Krebs' report, he was able to evade prosecution with the help of his political connections, including the late son of former Ukrainian President Viktor Yanukovych."
   },
   {
      "time": "2022-11-17",
      "title": "WatchDog Continues to Target East Asian CSPs - Cado Security | Cloud Forensics & Incident Response",
      "text": " Researchers at Cado Labs have recently discovered the re-emergence of the threat actor WatchDog. As regular readers will know, WatchDog are an opportunistic and prominent threat actor, who are known for routinely carrying out cryptojacking attacks against resources hosted by various Cloud Service Providers.We previously reported on WatchDog’s activities after they targeted one of our honeypots back in June 2022. We’ve attributed this new campaign to them based on the presence of a malicious shell script and a Monero wallet ID known to be under their control. Techniques known to be used by this group are also evident.As is common with this type of attack, the script begins with a number of commands designed to weaken the compromised system and remove monitoring tools. We can see the threat actor making use of the ulimit command to configure resource limits for the current user, before removing the Linux syslog – in an attempt to cover their tracks.This section of the script also includes commands to remove various files/directories from /tmp/ which appear to be related to cryptomining (lines 13 – 15). This is likely an attempt to remove artifacts from prior cryptojacking attacks. Moving further down the script, we can see the threat actor has included code to remove monitoring agents native to East Asian Cloud Service Providers. This suggests targeting of these CSPs, as we’ve seen in related campaigns.Perhaps some of the most interesting information to be gained from analysing these types of payloads is the insight into techniques used by competing threat groups. Usually cryptomining shell scripts have a section dedicated to killing processes and removing artifacts from competing cryptojacking attacks – this one is no different. In this particular payload, a number of lines within this section caught our attention.Lines 497 and 501 are used to remove files from a folder named TeamTNT under /usr/bin. It would seem likely that this folder contained executables implanted during an attack by this prominent cloud threat actor.Lines 671, 682 and 693 also demonstrate use of the touch command to perform timestomping on the replaced system utilities. We believe this is an anti-forensics measure, designed to confuse an analyst during the incident response process. We saw this technique in our analysis of CoinStomp, and it’s surprising that we don’t see it more often with cloud threat actors – given that it’s a clever example of “living off the land”.The rest of the script is dedicated to retrieving and setting up the miner – a version of XMRig which is saved with the filename “zzh” and run from /tmp/. The following mining servers are used:Clearly, WatchDog remain active and pose a significant threat to users of Cloud Service Providers such as Tencent and Alibaba Cloud. Several techniques typical of this threat actor were seen in the analysed shell script and the reuse of a particular Monero wallet made attribution relatively easy. The presence of code used to remove TeamTNT executables was an interesting observation. We’ve seen evidence to suggest that cloud-focused cryptojacking groups keep their knowledge of the threat landscape current, so perhaps this indicates that WatchDog have encountered evidence of TeamTNT activities during their campaigns. We mentioned earlier that WatchDog and similar groups are opportunistic, and it’s likely that this malware made use of misconfigured cloud instances as an initial access vector. Once again, this highlights the ease of which certain cloud threat actors can compromise cloud resources and how little effort is required for them to make this endeavour profitable.Cado Security is the provider of the first cloud forensics and incident response platform. By leveraging the scale and speed of the cloud, the Cado platform automates forensic-level data capture and processing across cloud, container, and serverless environments. Only Cado empowers security teams to respond at cloud speed.Cado Security is the provider of the first cloud forensics and incident response platform. By leveraging the scale and speed of the cloud, the Cado platform automates forensic-level data capture and processing across cloud, container, and serverless environments. Only Cado empowers security teams to respond at cloud speed.© Copyright 2023 Cado Security"
   },
   {
      "time": "2022-11-17",
      "title": "US govt: Iranian hackers breached federal agency using Log4Shell exploit",
      "text": " The FBI and CISA revealed in a joint advisory published today that an unnamed Iranian-backed threat group hacked a Federal Civilian Executive Branch (FCEB) organization to deploy XMRig cryptomining malware.The two U.S. federal agencies added that all organizations who haven't yet patched their VMware systems against Log4Shell should assume that they've already been breached and advise them to start hunting for malicious activity within their networks.Log4Shell can be exploited remotely to target vulnerable servers exposed to local or Internet access to move laterally across breached networks to access internal systems that store sensitive data.The list of attackers includes state-backed hacking groups from China, Iran, North Korea, and Turkey, as well as access brokers known for their close ties with some ransomware gangs.CISA also advised organizations with vulnerable VMware servers to assume they were breached and initiate threat-hunting activities."
   },
   {
      "time": "2022-11-17",
      "title": "Magento stores targeted in massive surge of TrojanOrders attacks",
      "text": " At least seven hacking groups are behind a massive surge in 'TrojanOrders' attacks targeting Magento 2 websites, exploiting a vulnerability that allows the threat actors to compromise vulnerable servers.These attacks are being used to inject malicious JavaScript code into an online store's website that can cause significant business disruption and massive customer credit card theft during a busy Black Friday and Cyber Monday period.The trend is expected to continue as we head towards Christmas when online shops are at their most critical and simultaneously most vulnerable time.TrojanOrders is the name of an attack that exploits the critical Magento 2 CVE-2022-24086 vulnerability, allowing unauthenticated attackers to execute code and inject RATs (remote access trojans) on unpatched websites.Adobe fixed CVE-2022-24086 in February 2022, but Sansec says many Magento sites still need to be patched.For example, the above attack will inject a copy of the 'health_check.php' file on the site, containing a PHP backdoor that can run commands sent via POST requests.After gaining a foothold on the website, the attackers install a remote access trojan to establish permanent access and the ability to perform more intricate actions.In many cases observed by Sansec, the attackers scanned for the presence of 'health_check.php' upon compromise to determine if another hacker had already infected the site, and if so, replace the file with their own backdoor.The attackers ultimately modify the site to include malicious JavaScript that steals customers' information and credit card numbers when purchasing products in the store.Sansec's analysts believe that there are multiple reasons we are seeing a surge in attacks targeting this vulnerability.First, a large number of Magento 2 sites remain vulnerable to these attacks, even ten months after the patches became available.Second, PoC (proof of concept) exploits have been available for a long time, allowing exploit kit authors to incorporate them into their tools and profit by selling them to low-skilled hackers.These Magento exploits are so abundant they are sold for as low as $2,500, whereas in early 2022, they cost between $20,000 and $30,000.Finally, the timing is ideal for these attacks, as websites are seeing increased traffic due to the holiday season, meaning malicious orders and code injections may be more likely to be overlooked.If you have not applied the security update that addresses CVE-2022-24086, you should do so as soon as possible.Additionally, scrutinize orders to find signs of a TrojanOrder attack, like template code in order forms or orders submitted by anonymous email accounts using Protonmail, Tutanota, etc.Finally, use a backend malware scanner to discover potential past infections that have resulted in RAT injections on your site.Sansec says Magento's official tool, Security Scan, only scrapes the front end, so it can't catch TrojanOrders.For this reason, the security firm offers one month of free access to its scanner to help administrators clean their sites.Remember, detecting and removing malware and PHP backdoors will only stop future infections if the Magento 2 patches are applied, so this is still the most crucial step to take."
   },
   {
      "time": "2022-11-17",
      "title": "Police dismantle pirated TV streaming network with 500,000 users ",
      "text": " The Spanish police have dismantled a network of pirated streaming sites that illegally distributed content from 2,600 TV channels and 23,000 movies and series to roughly 500,000 users.The law enforcement action took place in a joint operation involving the Spanish police and EUROPOL, resulting in the arrest of four operators in Malaga.Additionally, 95 resellers in Spain, Malta, Portugal, Cyprus, Greece, and the United Kingdom have been identified.The pirated TV network used numerous websites to advertise and promote subscription-based streaming services, listing unlimited access to channels from different platforms.The live streams from these platforms were decoded with stolen or abused accounts and passwords and then re-broadcasted to the subscribers' video player clients.The resellers bought the subscription packages from the organization operators and resold them to thousands of people in their local countries to profit from the price difference.During the searches in the suspects' locations, law enforcement found ten administration panels connected to 32 streaming servers spread across France, Spain, and the Netherlands, that hosted the content mentioned above.The police disconnected these administration panels, taking the pirate platform offline, and seized computer equipment, 2,800 Euros in cash, and vehicles worth approximately 180,000 Euros.The authorities will continue investigations to determine if further core members of the pirate network are operating in Spain or other countries.According to the police announcement, the pirated streaming network had been operating since 2012, constantly evading detection by setting up new shell companies.Notably, investigations on this content piracy case started in 2020 after a complaint filed by the Alliance for Creativity (ACE)."
   },
   {
      "time": "2022-11-17",
      "title": "DuckDuckGo now lets all Android users block trackers in their apps",
      "text": " DuckDuckGo for Android's 'App Tracking Protection' feature has reached open beta, allowing all Android users to block third-party trackers across all their installed apps.The 'App Tracking Protection' aims to increase privacy throughout the entire operating system by blocking third-party tracking scripts in other Android apps installed on the device.\"It's a free feature in the DuckDuckGo Android app that helps block 3rd-party trackers in the apps on your phone (like Google snooping in your weather app) – meaning more comprehensive privacy and less creepy targeting,\" announced DuckDuckGo today.Compared to the previous close beta version of the feature, the new version of App Tracking Protection lets Android users see exactly what trackers are blocked and what type of data they are targeting.The feature is somewhat similar to Apple's 'App Tracking Transparency,' but unlike the Apple feature, DuckDuckGo's system does not depend on the app developers' compliance with user choice.DuckDuckGo says Android users have an average of 35 apps installed on their devices, generating between a thousand and 2,000 tracking attempts daily for over 70 tracking companies.The App Tracking Protection promises to block all these attempts in the background while the users regularly browse the web, play games, or check the weather on their devices.This blocking also happens without causing a noticeable impact on device performance, something that was improved on the latest version of the app (v5.143.1).To activate the new feature, the user has to open the DuckDuckGo app on Android, navigate to Settings → More from DuckDuckGo, and then enable App Tracking Protection, as shown below.The feature works by configuring the DuckDuckGo for Android app as a VPN on the device, which allows the app to filter traffic from other apps and block trackers.However, unlike a traditional VPN, this does not provide anonymity while browsing the web or connecting to remote devices and is only used locally.Therefore, to enable the feature, DuckDuckGo will request the user allow the VPN connection to be created, which is required for the blocker to function as expected.From then on, the app will regularly update the user with automatically generated summaries of blocked app trackers to give them an idea of what is happening behind the scenes.Those who want to evaluate how threatening each app is to their privacy can use App Tracking Protection’s real-time view to see what trackers are loaded and blocked.App Tracking Protection is a powerful tool, but users should keep in mind that the feature is still in the beta stage of development.Therefore, it may cause sites or apps not to function correctly, for some trackers to remain undetected, or lead to performance issues. If you run into any of these issues, you can disable the feature."
   },
   {
      "time": "2022-11-17",
      "title": "Dtrack expands its operations to Europe and Latin America | Securelist",
      "text": " Solutions for:ThreatsCategories15 Nov 2022\n  minute read\t\t\t\t\t\t\t\tTable of ContentsAuthorsDTrack allows criminals to upload, download, start or delete files on the victim host. Among those downloaded and executed files already spotted in the standard DTrack toolset there is a keylogger, a screenshot maker and a module for gathering victim system information. With a toolset like this, criminals can implement lateral movement into the victims’ infrastructure in order to, for example, retrieve compromising information.DTrack itself hasn’t changed much over the course of time. Nevertheless, there are some interesting modifications that we want to highlight in this blogpost. Dtrack hides itself inside an executable that looks like a legitimate program, and there are several stages of decryption before the malware payload starts.DTrack unpacks the malware in several stages. The second stage is stored inside the malware PE file. To get it, there are two approaches:The idea is that DTrack retrieves the payload by reading it from an offset within the file or by reading it from a resource within the PE binary. An example of a decompiled pseudo function that retrieves the data using the offset-based approach can be found below.Example of DTrack offset-oriented retrieval functionAfter retrieving the location of the next stage and its key, the malware then decrypts the buffer (with a modified RC4 algorithm) and passes control to it. To figure out the offset of the payload, its size and decryption keys, DTrack has a special binary (we have dubbed it ‘Decrypt config’) structure hidden in an inconspicuous part of the PE file.The second stage payload consists of heavily obfuscated shellcode as can be seen below.Heavily obfuscated second stage shellcodeThe encryption method used by the second layer differs for each sample. So far, we have spotted modified versions of RC4, RC5 and RC6 algorithms. The values of the third stage payload and its decryption key are obtained by reading Decrypt config again.One new aspect of the recent DTrack variants is that the third stage payload is not necessarily the final payload; there may be another piece of binary data consisting of a binary configuration and at least one shellcode, which in turn decrypts and executes the final payload.The shellcode has some quite interesting obfuscation tricks to make analysis more difficult. When started, the beginning of the key (used to decrypt the final payload) is searched for. For example, when the beginning of the key is 0xDEADBEEF, the shellcode searches for the first occurrence of 0xDEADBEEF.Chunk decryption routine exampleOnce the key is found, the shellcode uses it to decrypt the next eight bytes after the key, which form yet another configuration block with final payload size and its entry point offset. The configuration block is followed by an encrypted PE payload that starts at the entry point offset after decryption with the custom algorithm.Once the final payload (a DLL) is decrypted, it is loaded using process hollowing into explorer.exe. In previous DTrack samples the libraries to be loaded were obfuscated strings. In more recent versions they use API hashing to load the proper libraries and functions. Another small change is that three C2 servers are used instead of six. The rest of the payload’s functionality remains the same.When we look at the domain names used for C2 servers, a pattern can be seen in some cases. For example, the actors combine a color with the name of an animal (e.g., pinkgoat, purplebear, salmonrabbit). Some of the peculiar names used in the DTrack infrastructure can be found below:According to KSN telemetry, we have detected DTrack activity in Germany, Brazil, India, Italy, Mexico, Switzerland, Saudi Arabia, Turkey and the United States, indicating that DTrack is spreading into more parts of the world. The targeted sectors are education, chemical manufacturing, governmental research centers and policy institutes, IT service providers, utility providers and telecommunications.The DTrack backdoor continues to be used actively by the Lazarus group. Modifications in the way the malware is packed show that Lazarus still sees DTrack as an important asset. Despite this, Lazarus has not changed the backdoor much since 2019, when it was initially discovered. When the victimology is analyzed, it becomes clear that operations have expanded to Europe and Latin America, a trend we’re seeing more and more often.AuthorsDTrack activity targeting Europe and Latin AmericaYour email address will not be published. Required fields are marked *Name * Email * ΔTable of ContentsGReAT webinarsFrom the same authorsThe hottest research right in your inboxΔIn the same categoryAsian APT groups target various organizations from a multitude of regions and industries. We created this report to provide the cybersecurity community with the best-prepared intelligence data to effectively counteract Asian APT groups.We unveil a Lazarus campaign exploiting security company products and examine its intricate connections with other campaignsHow Kaspersky researchers obtained all stages of the Operation Triangulation campaign targeting iPhones and iPads, including zero-day exploits, validators, TriangleDB implant and additional modules.Nobody would even suspect the mining malware was merely a mask, masquerading behind an intricate modular framework that supports both Linux and Windows.  The amount of effort that went into creating the framework is truly remarkable, and its disclosure was quite astonishing.The hottest research right in your inboxΔThreatsCategories© 2023 AO Kaspersky Lab. All Rights Reserved.\nRegistered trademarks and service marks are the property of their respective owners.The hottest research right in your inboxΔ"
   }
]