[
   {
      "time": "2023-03-08",
      "title": "Nvidia releases driver hotfix for Windows performance issues",
      "text": " Unlike Game Ready drivers, these drivers contain quick fixes, aren't WHQL-certified, and don't go through the usual testing process.\"These fixes (and more) will be in the next Game Ready Driver which will be WHQL-certified and delivered to gamers via GeForce Experience and usual driver download page,\" Pelletier added.Until the fix gets added to a Game Ready driver release, affected users who don't want to install today's hotfix can mitigate the game crashes and the general OS performance issues by killing the NVIDIA Container process via the Windows task manager.To address the BSODs, you will have to roll back the driver using the following steps:"
   },
   {
      "time": "2023-03-08",
      "title": "Microsoft discovers Shein app accessing clipboard on Android devices | SC Media",
      "text": "  Microsoft said they could not specify malicious intent regarding SHEIN's case but suggested that the feature of accessing clipboards was not necessary. SC Media has reached out to Shein for further information.  \"Even if SHEIN's clipboard behavior involved no malicious intent, this example case highlights the risks that installed applications can pose, including those that are highly popular and obtained from the platform's official app store,\" Microsoft said.  The tech giant identified and verified Shein’s clipboard behavior by performing static analysis of the app to find \"the relevant code responsible for the behavior\" and then doing a dynamic analysis to run the app \"in an instrumented environment to observe the code.\"  Following Microsoft's research findings, Google recognized the potential threats associated with clipboards and has made the following efforts to secure the Android platform.  Menghan Xiao is a cybersecurity reporter at SC Media, covering software supply chain security, workforce/business, and threat intelligence. Before SC Media, Xiao studied journalism at Northwestern University, where she received a merit-based scholarship from Medill and Jack Modzelewski Scholarship Fund.It’s clear iLeakage presents itself as a major flaw with no known mitigation and it’s a real problem for iOS devices – here are some ideas on how to respond. Malware distribution on Android devices has been facilitated by the new SecuriDropper dropper-as-a-service operation by evading Android 13's \"Restricted Settings\" functionality to breach \"Accessibility Services,\" BleepingComputer reports.Jamf says North Korean subgroup of the financially motivated Lazarus Group targets specific users the threat actors believe have access to cryptocurrency.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-03-08",
      "title": "Acer Confirms Data Offered Up for Sale Was Stolen",
      "text": " Acer has confirmed its systems were breached after a threat actor offered 160GB of data they say was stolen from the electronics company. Acer sells a variety of consumer electronics products, including Chromebooks, monitors, laptops, and desktop PCs. The post in the cybercrime forum claims to have a slew of secret information for sale, including Acer slides, employee manuals, and product information. Acer said in a statement reacting to the claims that the compromised data doesn't appear to include customer information. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-03-08",
      "title": "Hacker Cracks Toyota Customer Search Tool",
      "text": " A production API in Toyota's C360 customer relationship management (CRM) tool loaded with the personal information of an unknown number of the carmaker's customers in Mexico was found to expose reams of sensitive data.A disclosure from threat hunter Eaton Zveare outlines how it was possible to access Toyota customers' names, addresses, phone numbers, emails, and tax identification numbers, as well as vehicle ownership and service history stored in the C360 CRM.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-03-08",
      "title": "Emotet malware attacks return after three-month break",
      "text": " The Emotet malware operation is again spamming malicious emails as of Tuesday morning after a three-month break, rebuilding its network and infecting devices worldwide.Emotet is a notorious malware distributed through email containing malicious Microsoft Word and Excel document attachments. When users open these documents and macros are enabled, the Emotet DLL will be downloaded and loaded into memory.Once Emotet is loaded, the malware will sit quietly, waiting for instructions from a remote command and control server.While Emotet has been considered the most distributed malware in the past, it has gradually slowed down, with its last spam operation seen in November 2022. However, even then, the spamming only lasted two weeks.Cofense also confirmed to BleepingComputer that the spam campaign began at 7:00 AM ET, with current volumes remaining low.\"The first email we saw was around 7am EST. Volume remains low at this time as they continue to rebuild and gather new credentials to leverage and address books to target,\" Cofense told BleepingComputer.Instead of using reply-chain emails like in the previous campaign, the threat actors are utilizing emails that pretend to be invoices, as shown below.Attached to these emails are ZIP archives containing inflated Word documents that are over 500 MB in size. They are padded with unused data to make the files larger and harder for antivirus solutions to scan and detect them as malicious.These documents contain a mess of macros that will download the Emotet loader as a DLL from compromised sites, many of which are hacked WordPress blogs. When downloaded, Emotet will be saved to a random-named folder under %LocalAppData% and launched using regsvr32.exe.Like the Word document, the Emotet DLL has been also padded to be be 526MB to hinder the ability to detect it as malicious by antivirus software.Once running, the malware will run in the background, awaiting commands, which will likely install further payloads on the deviceThe payloads allow other threat actors to remotely access the device, which is then used to spread further in the compromised network.These attacks commonly lead to data theft and full-blown ransomware attacks on breached networks.Cofense says that they have not seen any additional payloads being dropped now, and the malware is just collecting data for future spam campaigns.While Emotet is rebuilding its network, the current method may not have much success after recent changes by Microsoft.Due to this change, users who open an Emotet document will be greeted with a message stating that the macros are disabled because the source of the file is not trusted.For most users receiving Emotet emails, this feature will likely protect them from mistakenly enabling macros unless they make a concerted effort to enable them.It would not be surprising to see Emotet also move to different attachment types after this initial campaign does not go as intended."
   },
   {
      "time": "2023-03-08",
      "title": "Microsoft Excel now blocking untrusted XLL add-ins by default",
      "text": " Microsoft says the Excel spreadsheet software is now blocking untrusted XLL add-ins by default in Microsoft 365 tenants worldwide.The new feature will be generally available in multi-tenants worldwide by late March after rolling out to all desktop users in the Current, Monthly Enterprise, and Semi-Annual Enterprise channels.\"We are introducing a default change for Excel Windows desktop apps that run XLL add-ins: XLL add-ins from untrusted locations will now be blocked by default,\" Microsoft said in a new Microsoft 365 message center post.\"We have already completed rolling out to Insiders preview. We will begin rolling out early March and expect to complete by late March.\"Moving forward, in tenants where the XLL blocking will get enabled by default, an alert will be displayed when users try to enable content from untrusted locations, informing them of the potential risk and allowing them to find more information about why they're seeing the warning.This is part of a broader effort to tackle the rise of malware campaigns abusing various Office document formats as an infection vector throughout recent years.Excel XLL files are dynamic-link libraries (DLLs) used to expand the functionality of Microsoft Excel with additional features like custom functions, dialog boxes, and toolbars.Before being blocked by default, XLLs would allow attackers to infect victims that enabled the untrusted add-ins and opened them even though they were warned that the \"add-ins might contain viruses or other security hazards.\"After opening the add-ins, the malware got installed in the background without requiring user interaction.\"Their usage significantly increased over the last two years as more commodity malware families adopted XLLs as their infection vector,\" Cisco Talos said."
   },
   {
      "time": "2023-03-08",
      "title": "Northern Essex Community College remains shuttered after cyberattack",
      "text": " A Massachusetts community college has closed its doors for a second day after a cyberattack took down significant parts of its network.Northern Essex Community College serves more than 6,000 students across Massachusetts and southern New Hampshire, with campuses in Haverhill and Lawrence.A spokesperson for the school told The Record that they did not know if the attack was ransomware, and claimed they “do not have evidence of any personal data being compromised.” On Tuesday, the school confirmed it would not open for the day.“All employees with a NECC laptop should cease using their laptops and are asked to bring their computers in as soon as possible and leave them in your office so that our IT team can install protection-clients and perform forensics.”The statement adds that remote work will be suspended for the rest of the week due to issues with VPN access, but employees of the college will be required to come to their offices. Microsoft Office 365, Zoom and some web-based services are still functioning, the college said.The college contacted law enforcement and cybersecurity experts to help with an investigation. They urged students and employees to regularly change passwords and said anyone whose information may have been accessed will be contacted with guidance.Since then, Emsisoft ransomware expert Brett Callow said at least 10 colleges have been hit with ransomware or cyberattacks, including last week’s attacks on colleges in Tennessee and Louisiana.“By the end of February this year, there were 19 incidents. The yearly numbers have remained very similar too, having remained within the range of 84 - 89 incidents per year since 2019,” Callow told The Record.“It’s clear that we’re not getting a handle on ransomware in the education sector. In fact, the problem may even be getting worse.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-08",
      "title": "Hospital Clínic de Barcelona severely impacted by ransomware attack",
      "text": " The Hospital Clínic de Barcelona suffered a ransomware attack on Sunday morning, severely disrupting its healthcare services after the institution's virtual machines were targeted by the attacks.The 819-bed hospital is based in Barcelona, Spain, and serves over half a million people seeking medical attention and healthcare services.According to a statement issued by the Government of Catalonia, the Hospital Clínic de Barcelona suffered an attack by the RansomHouse ransomware operation.The government statement also mentions that the cyberattack impacted the emergency services of three medical centers associated with Clínic de Barcelona, including CAP Casanova, CAP Borrell, and CAP Les Corts.\"Work is underway to determine the extent of the damage and the infiltration in a coordinated manner with the Mossos d'Esquadra and Interpol.\"The hospital's SAP system wasn't impacted, but all applications and communications remain broken as work to restore critical systems continues. This means that patient information for physicians is out of reach, and the situation impacts care services.Moreover, 800 urgent cases admitted to the hospital on Sunday had to be dealt with manually, and hence more slowly, so some cases were diverted to other hospitals in Barcelona.Additional health assistants and administrative staff have been added in Clínic de Barcelona to minimize the impact and help bridge communication between the various departments.Radiology, endoscopic tests, radiological scans, dialysis, and outpatient pharmacy services will continue operating normally.Unfortunately, 150 non-urgent operations scheduled for the upcoming weeks have been canceled, and 3,000 appointments were called off.These urgent plans will remain in place for at least a couple of days more, while the time to return to normal operations is impossible to determine currently, according to Clínic Barcelona's hospital director, A. Castells.When writing this, the RansomHouse data leak site has not leaked any data belonging to the Spanish hospital, but it might be too soon for the victim to appear on the threat actor's site."
   },
   {
      "time": "2023-03-08",
      "title": "Transparent Tribe Hackers Distribute CapraRAT via Trojanized Messaging Apps",
      "text": " It's being suspected that the targets are lured through a honeytrap romance scam wherein the threat actor approaches the victims via another platform and persuades them to install the malware-laced apps under the pretext of \"secure\" messaging and calling.The backdoor is packed with an extensive set of features that allows it to take screenshots and photos, record phone calls and surrounding audio, and exfiltrate other sensitive information. It can also make calls, send SMS messages, and receive commands to download files.That having said, users are also required to create an account by linking their phone numbers and completing an SMS verification step in order to access the app's functionalities.The Slovak cybersecurity company stated the campaign is narrowly targeted and that it found no evidence that indicates the apps were available on the Google Play Store.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-03-07",
      "title": "\r\n\tEPA Calls For Cybersecurity Improvements in Public Water Systems - Infosecurity Magazine\r\n",
      "text": " Freelance Journalist“Cyber-attacks against critical infrastructure facilities, including drinking water systems, are increasing, and public water systems are vulnerable. [They] have the potential to contaminate drinking water, which threatens public health,” said EPA Assistant Administrator for Water, Radhika Fox.“EPA is taking action to protect our public water systems by issuing this memorandum requiring states to audit the cybersecurity practices of local water systems.”In particular, the memorandum highlights the need for states to include cybersecurity when conducting periodic audits of water systems (“sanitary surveys”). To this end, EPA is providing guidance in the form of a survey designed to assist states in implementing cybersecurity strategies into sanitary surveys.“The program armed us with the tools to have the appropriate conversations with the Town’s IT staff and our water/sewer staff to take small steps towards improvement. The roadmap for how to correct the Town’s vulnerabilities is still driving decisions today.”The Agency clarified that while the guidelines can be used as they are, EPA is also open to receiving public comment on Sections 4–8 of the guidance and all document Appendices until May 31 2023."
   },
   {
      "time": "2023-03-07",
      "title": "EV Charging Infrastructure Offers an Electric Cyberattack Opportunity",
      "text": " As electric vehicle (EV) charging infrastructure rushes to keep pace with the dramatic rise in sales of electric vehicles in the United States, cyberattackers and security researchers alike have already started focusing on security weaknesses in the infrastructure.The risks are not just theoretical: A year ago, after Russia invaded Ukraine, hacktivists compromised charging stations near Moscow to disable them and display their support for Ukraine and their contempt for Russian President Vladamir Putin.\"Most EV chargers can be considered an Internet of Things (IoT) technology, but they are one of the first that has control over such a significant amount of electrical load,\" he says. He adds, \"The aggregated risk of so many devices, often connected to a small number of single systems, means that devices of this type need to be implemented with care.\"In many ways, EV charging infrastructure represents a perfect storm of technologies. The devices are connected via mobile applications and carry the same risks as other IoT devices, but they're also set to become a critical part of transportation network in the United States, like other operational technology (OT). And because EV charging stations must be connected to public networks, ensuring that their communications are encrypted will be critical to maintaining the security of the devices, says Dragos' Tonkin.\"Hacktivists will always be looking for poorly secured devices on public networks, it's important that the owners of EV put in place controls to ensure they are not easy targets,\" he says. \"The crown jewels of the operators of EV chargers have to be their central platforms, the chargers themselves intrinsically trust the instructions pushed down from the center.\"\"It's not practical for the average domestic customer to have to put in place the right security, therefore making sure the device itself and the methods it uses to communicate with cloud-based services should always be on the vendor,\" he says.The US government should make standards and best practices available to companies to prevent cybersecurity weaknesses, some say. Sandia National Laboratories, for instance, has recommended a number of initiatives to strengthen cybersecurity, including improving EV owner authentication and authorization, adding more security to the cloud component of the charging infrastructure, and hardening the actual charging units against physical tampering.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-03-07",
      "title": "Spanish amusement park giant hit with cyberattack",
      "text": " A Spanish amusement park company with businesses around the globe is investigating a cyberattack after a ransomware group claimed to have stolen sensitive information.Parques Reunidos Group runs more than 60 water and amusement parks, zoos, aquariums and entertainment centers across Europe, the United States, the United Arab Emirates and Australia. The company brings in hundreds of millions of dollars each year and welcomes more than 22 million people to its parks annually.BianLian has targeted the healthcare, education, insurance and media industries since at least December 2021. Little is known about where the group is based.The Spanish Data Protection Authority and law enforcement agencies were contacted about the incident.When the company’s IT team discovered the attack,it attempted to contain the damage, hired cybersecurity experts to investigate the incident and shut down affected systems. The team also blocked “users with affected information systems” and remote access connections, isolating its data center, and changed all passwords that allowed employees to access information systems.“Additionally, the following measures are also going to be taken: extraordinary awareness and training actions, implementation of conditional access for certain accounts to ensure only internal access, and planning actions to increase the number of sources reporting to the log event collector (SIEM) and the number of licenses with enhanced security measures,” the company said.“We continue with forensic investigations into our systems and are committed to taking action to further boost our cybersecurity safeguards as appropriate.”The company urged customers or employees to contact a the company’s data protection officer if they discover that their personal data is being misused or if they see “phishing or spamming campaigns from Parques Reunidos.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-07",
      "title": "Hackers using pirated Final Cut Pro to install cryptominers on Apple devices",
      "text": " Hackers are using pirated versions of video editing software Final Cut Pro to install malicious cryptomining software on Apple devices, according to a new report.Researchers at device management company Jamf said they have been monitoring a family of malware that has resurfaced over the past few months and has been operating undetected.Jaron Bradley, senior manager of MacOS detections at the Minneapolis-based firm, told The Record that malware disguised as or embedded inside of pirated applications has been an issue since the early days of software pirating.“Attackers see an easy opportunity when they don’t have to convince users to run their malware, but rather the users come to them willing to install something they know is illegal,” he said.Final Cut Pro, a popular suite of video-editing tools, costs about $300 for Apple users.“Apple is at a bit of a disadvantage in this particular scenario as users who opt to run pirated software have essentially already accepted that getting applications for free is worth the risk of whatever threat the application may pose,” Bradley said.The cryptomining tool – named XMRig – can be legitimately used to mine cryptocurrency on one’s own devices, but is adaptable and has been widely abused by cybercriminals.In the examples Jamf examined, hackers modified a version of Final Cut Pro to execute XMRig in the background. At the time of its discovery, Jamf said the sample was not detected as malicious by any security vendors on VirusTotal — a platform used to catalog malware. Since January, however, several vendors have begun to detect the malware.Yet in recent months researchers have found more instances of cryptomining targeting Mac users. Most Macs come equipped with powerful ARM processors which make them attractive targets for the malware, Jamf researchers said. Miners perform complex math problems for the chance to receive new coins such as bitcoin or Ethereum.The researchers traced the tainted software back to Pirate Bay, which allows people to download content and programs illegally. They saw that it was uploaded by someone who had spent years sharing pirated macOS software, and much of it was among the most widely shared versions for the respective titles.After examining each file, the researchers found that all of the person’s uploads since 2019 were compromised with malicious cryptomining malware.According to Bradley, what jumped out to his team the most was the inability of antivirus vendors to detect the malware even though some of the details around it have been shared in the past. The researchers were able to pinpoint specific changes in the cryptomining malware that allowed the hackers to dodge detection.One newer feature is that it runs a script that checks every three seconds whether the device’s Activity Monitor is active. If it finds that the Activity Monitor is active, it stops all malicious processing. The goal of the feature is to make sure that even if a victim realizes that their computer is running hotter than normal and checks to see why, they will not see the cryptominer operating.Later versions of the malware also only run when the application is launched, allowing it to hide activity until the victim uses the specific application.But Apple has created security features to combat tactics like this in newer versions of its operating system, according to Jamf. With its latest operating system update — macOS Ventura — Apple created a tool that checks whether apps have been changed by unauthorized processes, even after the first time they launch.This is a departure from past versions, where the operating system would only perform checks like that when an application was opened for the first time.On macOS Ventura, the changed version of Final Cut Pro does not even launch, according to Jamf.“This discovery presented a rare opportunity to trace the evolution of a malware family. What started as a rudimentary and conspicuous scheme had iterated through three distinct stages of evolution into something with creative evasion techniques,” they said, adding that only samples from the first generation of the malware family had been reported on.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-07",
      "title": "Thousands of appointments canceled after ransomware hits major Barcelona hospital",
      "text": " A ransomware attack on the city of Barcelona’s main hospital has forced thousands of appointments to be canceled, officials announced Monday.The Hospital Clinic de Barcelona was attacked Saturday, with computers across the institutions’ numerous laboratories, clinics and emergency room shut down. Its website was unavailable on Monday.The Ransom House gang — which lists semiconductor company AMD as a previous victim, claiming to have sold data stolen by its \"partners\" — was responsible for the attack, according to the regional Catalonian Cybersecurity Agency. The gang itself claims on its leak site to “have nothing to do with any breaches” and doesn’t “produce or use any ransomware.” It describes itself as a “professional mediators community.”Segi Marcén, telecommunications secretary for the regional Catalonia government, said that no extortion demand had yet been received but that the hospital would not be making a ransom payment even if one was.“We will not pay a cent,” Marcén said. Ransomware gangs typically threaten to release stolen data publicly if an extortion payment doesn’t come by a certain deadline. As of Monday, nothing from the hospital was on Ransom House’s leak site.Marcén added that the regional government was “focusing on recovering the information” impacted by the attack, although it was not yet clear whether the hospital’s data backups were also compromised, El País reported.Staff at the hospital have been forced to write on paper and do not have access to electronic patient data-sharing systems. The facility’s press department announced that urgent cases are being diverted to other hospitals.“We can’t make any prediction as to when the system will be back up to normal,” the hospital’s director, Antoni Castells, told journalists, adding that there was a contingency plan to keep services functioning for several days although he hoped the system would be fixed sooner.Tomàs Roy, the general director of the Catalan Cybersecurity Agency, said the attackers “have used new attack techniques,” but didn’t specify what they were.Recovering from the attack will be “gradual,” reported El País, as IT staff will need to ensure that systems aren’t restored while the attackers maintain some access to the system.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-07",
      "title": "Vice Society ransomware group claims German university as latest victim",
      "text": " The Vice Society ransomware group added the Hamburg University of Applied Sciences (HAW Hamburg) to its leak site this weekend following an attack that the institution said took place late last year.HAW Hamburg is one of several German-speaking institutions with a focus on applied sciences to be targeted by ransomware gangs in recent months.“The attackers worked their way manually from decentralized IT systems via the network to the central IT and security components of HAW Hamburg. They also gained administrative rights to the central storage systems via this attack path and thus compromised the central data storage,” the statement explained.“With the administrative rights obtained, the encryption of various virtualized platforms and the deletion of saved backups were finally started,” it added.The university warned that “significant amounts of data from various areas” were copied, including usernames and “cryptographically secured” passwords, email addresses and mobile phone numbers.Despite describing the compromised passwords as “cryptographically secured” the IT team recommended that students and staff change their passwords “for all internal university applications,” adding “in particular, change your password for Microsoft Teams and avoid using passwords that you have already used before.”The university said it had to rebuild its IT systems, including the existing Microsoft cloud environment, and was “trying to restore a backup of the email data from the old mail server as of December 14.”Following the attack, HAW Hamburg’s IT security said it had “received several reports from students about attempts to log on to Internet portals such as Amazon and eBay by unauthorized third parties.”“After reviewing all previous reports, and taking into account the attacker group's previous approach, it can be ruled out that the login attempts are related to the security incident at HAW Hamburg or the attacker group,” the team added.Then in February the University of Zurich, Switzerland’s largest university, announced it was the target of a “serious cyberattack,” which a spokesperson described to The Record as “part of a current accumulation of attacks on educational and health institutions.”Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-07",
      "title": "Nvidia working on driver fix for Windows BSOD, high CPU usage",
      "text": " Nvidia confirmed today that it's working to fix a driver issue causing high CPU usage and blue screens of death (BSODs) on Windows systems.\"I had none of these issues prior to this release, and after reverting back to the previous release, I have yet to reencounter any of the issues again; it appears this driver release is the clear culprit (please advise if I can provide any diagnostics that would help resolve this).\"Until the issue gets addressed, users can kill the NVIDIA Container process via the Windows task manager to get rid of the general OS lagginess.If you are also experiencing Windows BSODs, game crashes, reduced in-game performance, and, in some cases, games not launching, you should roll back to your older driver.To do that, you have to go through this procedure on Windows 10 and Windows 11 devices:"
   },
   {
      "time": "2023-03-07",
      "title": "Old Windows ‘Mock Folders’ UAC bypass used to drop malware",
      "text": " A new phishing campaign targets organizations in Eastern European countries with the Remcos RAT malware with aid from an old Windows User Account Control bypass discovered over two years ago.The use of mock trusted directories to bypass Windows User Account Control stands out in the attack as it's been known since 2020 but remains effective today.The latest Remcos campaign was observed and analyzed by SentinelOne researchers, who documented their findings in a report published today.The phishing campaign emails are sent from top-level domains that match the recipient's country and are typically masked as invoices, tender documentation, and other financial documents.The emails don't contain much text other than what is required to point the recipient's attention to the attachment, a tar.lz archive containing the DBatLoader executable.Such an unusual choice of file format reduces the chances of the victims successfully opening the attachment but also helps in evading detection from antivirus software and email security tools.The first stage payload of the malware loader is disguised as a Microsoft Office, LibreOffice, or PDF document using double extensions and app icons to trick the victim into opening it.Upon launching the malware loader, a second-stage payload is fetched from a public cloud service, such as Microsoft OneDrive or Google Drive.Sentinel One reports that in one case, the cloud service was abused for hosting DBatLoader for over a month, although it's not clear if the threat actors used their own or a compromised account with a clean history.Before loading Remcos RAT, DBatLoader creates and executes a Windows batch script to abuse a Windows UAC bypassing method documented in 2020.Windows UAC is a protection mechanism that Microsoft introduced in Windows Vista, asking users to confirm the execution of high-risk applications.Some folders, such as C:\\Windows\\System32\\, are trusted by Windows, allowing executables to auto-elevate without displaying a UAC prompt. A mock directory is an imitation directory with a trailing space. For example, the \"C:\\Windows\\System32\" is a legitimate folder and is considered a trusted location in Windows. A mock directory would look like \"C:\\Windows \\System32\", with an extra space after C:\\Windows\\. The problem is that some Windows programs, like File Explorer, treat \"C:\\Windows\" and \"C:\\Windows \" as the same folder, thus tricking the operating system into thinking C:\\Windows \\System32 is a trusted folder and should have its files auto-elevate without a UAC prompt.The script used by DBatLoader, in this case, creates mock trusted directories in the same way, creating a \"C:\\Windows \\System32\" folder and copying legitimate executables (\"easinvoker.exe\") and malicious DLLs (\"netutils.dll\") to it.\"easinvoker.exe is an auto-elevated executable, meaning that Windows automatically elevates this process without issuing a UAC prompt if located in a trusted directory – the mock %SystemRoot%\\System32 directory ensures this criteria is fulfilled.\"The malware loader adds the malicious script (\"KDECO.bat\") that hides in the DLL to Microsoft's Defender exclusion list and then establishes persistence for Remcos by creating a new registry key.Eventually, Remcos is executed through process injection, configured with keylogging and screenshot-snapping capabilities.SentinelOne suggests that system administrators configure Windows UAC to \"Always Notify,\" albeit this might be too obstructive and noisy.Admins should also monitor for suspicious file creations or process executions in trust filesystem paths with trailing spaces, especially folders containing the string \"\\Windows\"."
   },
   {
      "time": "2023-03-07",
      "title": "Ukraine, Germany lead takedown of  DoppelPaymer ransomware gang | SC Media",
      "text": "  German and Ukrainian law enforcement agencies said Monday they conducted simultaneous raids, seizing evidence and detaining several suspects connected with the DoppelPaymer ransomware gang. Europol authorities say they sent three experts to Germany to cross-check information from the raids against Europol databases, provide operational analysis, tracing of cryptocurrency funds and forensic support.\"The analysis of this data and other related cases is expected to trigger further investigative activities,\" the agency said in the release. \"Europol also set up a Virtual Command Post to connect the investigators and experts from Europol, Germany, Ukraine, the Netherlands and the United States in real time and to coordinate activities during the house searches.\"German law enforcement authorities said they were able to identify 11 individuals linked to a group that has operated in various guises since at least 2010, but gave no specific number on how many members of the group were arrested.Ukraine had experienced a less than a day-long power outage in October 2022 following an attack by Russian state-sponsored hacking operation Sandworm targeted at an electrical substation amid the ongoing Russia-Ukraine war, marking the first cyberattack-related power interruption in the country since 2017, CyberScoop reports.Attacks deployed by Iranian state-backed threat operation MuddyWater against Israel saw the utilization of the new MuddyC2Go command-and-control framework, which replaced the PhonyC2 custom platform following the exposure of its source code, reports The Hacker News.Israel had its technology, logistics, and transportation industries targeted by Iranian advanced persistent threat operation Charming Kitten, also known as APT35 and Imperial Kitten, last month amid its ongoing war with Palestinian militant group Hamas, according to The Record, a news site by cybersecurity firm Recorded Future.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-03-07",
      "title": "Alert: Scammers Pose as ChatGPT in New Phishing Scam",
      "text": " The modus operandi of this scam involves users receiving a scam email containing a link to ChatGPT, which is, of course, fake.According to Bitdefender, the scam is a “highly sophisticated financial scam” involving innovative lures, since previously, threat actors have mostly relied on weekly or monthly subscription-based lures.The email itself offers insufficient details, and the recipient has to click on an embedded link for more information. This link leads them to a fake version of the ChatGPT chatbot, where they are asked to invest at least €250 and enter their banking card details, email address, ID credentials, and phone number.Then, a copycat version of ChatGPT is delivered to the victim, which differs from the original chatbot as it offers a few pre-determined answers to the user’s queries. This chatbot was accessible only through a blacklisted domain (timegaeacom).The researchers at Bitdefender, headquartered in Bucharest, noticed that the fake ChatGPT first offered a brief introduction to how it could help them become successful investors. It asked for their email address for instant verification and their phone number for setting up a WhatsApp account for the promised investment.Afterwards, they receive a call from in which scammers claim to represent a London-based firm called Import Capital. Speaking in Romanian, the rep asks victims to invest in crypto and international stock.Further, they request crucial financial information like their permission to calculate their and their family members’ median daily salary, passive income sources, hours they daily spend working, and if they are satisfied with their current income.They are then asked to invest €250 and provide the last six digits of their valid ID card. However, while digging deeper into the scam, Bitdefender researchers requested that a link to the investment portal be sent via email. A form was sent to them, in which they inserted a false code, so the investment was declined.This campaign is quickly expanding to other regions, so users must stay alert. That’s why it is necessary to use ChatGPT only through its official website.Remember, as an AI language model, ChatGPT does not engage in any phishing scams. However, scammers are using the ChatGPT name to try to trick people into revealing personal information or clicking on malicious links. Here are some tips to stay safe:Super secure VPNMinimal data loggingFavorable privacy policy\n\tHackread.com is among the registered trademarks of Gray Dot Media Group Ltd. Company registration number 12903776 in regulation with the United Kingdom Companies House. The registered address is 85 Great Portland Street, London, England, W1W 7LT The display of third-party trademarks and trade names on the site do not necessarily indicate any affiliation or endorsement of Hackread.com. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n\t\t\t\t"
   }
]