[
   {
      "time": "2022-10-26",
      "title": "Jira Align Vulnerabilities Exposed Atlassian Infrastructure to Attacks - SecurityWeek",
      "text": " Hi, what are you looking for?Vulnerabilities addressed recently in Jira Align could allow an attacker to elevate privileges, obtain Atlassian cloud credentials, and potentially go after Atlassian infrastructure, researchers with Bishop Fox warn.ByFlipboardRedditWhatsappWhatsappEmail“These are both known and patched medium-severity vulnerabilities. Our Security Intelligence team has verified that no customers that use Jira Align on an Atlassian hosted Cloud offering had either vulnerability exploited.\n\nThe server-side request forgery (SSRF) vulnerability is a known vulnerability and a patch was released mitigating the issue on June 9th. Our Security Intelligence team also verified that no customers that use Jira Align on an Atlassian hosted Cloud offering had this vulnerability exploited. Details can be found in the hotfix public release notes here: Hotfix Notes for 10.107.4.2.\n\nFor the insufficient authorization controls vulnerability, we released a patch on July 22nd and our Security Intelligence team also verified that the vulnerability was not exploited for any customers that use Jira Align on Atlassian hosted Cloud offering.\nAs always, we recommend that our server and data center customers apply the latest security patches and mitigations as soon as they are available in order to receive the latest features and fixes. We also recommend that our customers move to the cloud versions of Atlassian products to ensure they automatically receive the upgrades and security patches.”\n\nThe server-side request forgery (SSRF) vulnerability is a known vulnerability and a patch was released mitigating the issue on June 9th. Our Security Intelligence team also verified that no customers that use Jira Align on an Atlassian hosted Cloud offering had this vulnerability exploited. Details can be found in the hotfix public release notes here: Hotfix Notes for 10.107.4.2.\n\nFor the insufficient authorization controls vulnerability, we released a patch on July 22nd and our Security Intelligence team also verified that the vulnerability was not exploited for any customers that use Jira Align on Atlassian hosted Cloud offering.\nAs always, we recommend that our server and data center customers apply the latest security patches and mitigations as soon as they are available in order to receive the latest features and fixes. We also recommend that our customers move to the cloud versions of Atlassian products to ensure they automatically receive the upgrades and security patches.”\nThe server-side request forgery (SSRF) vulnerability is a known vulnerability and a patch was released mitigating the issue on June 9th. Our Security Intelligence team also verified that no customers that use Jira Align on an Atlassian hosted Cloud offering had this vulnerability exploited. Details can be found in the hotfix public release notes here: Hotfix Notes for 10.107.4.2.\n\nFor the insufficient authorization controls vulnerability, we released a patch on July 22nd and our Security Intelligence team also verified that the vulnerability was not exploited for any customers that use Jira Align on Atlassian hosted Cloud offering.\nAs always, we recommend that our server and data center customers apply the latest security patches and mitigations as soon as they are available in order to receive the latest features and fixes. We also recommend that our customers move to the cloud versions of Atlassian products to ensure they automatically receive the upgrades and security patches.”\n\nFor the insufficient authorization controls vulnerability, we released a patch on July 22nd and our Security Intelligence team also verified that the vulnerability was not exploited for any customers that use Jira Align on Atlassian hosted Cloud offering.\nAs always, we recommend that our server and data center customers apply the latest security patches and mitigations as soon as they are available in order to receive the latest features and fixes. We also recommend that our customers move to the cloud versions of Atlassian products to ensure they automatically receive the upgrades and security patches.”\nFor the insufficient authorization controls vulnerability, we released a patch on July 22nd and our Security Intelligence team also verified that the vulnerability was not exploited for any customers that use Jira Align on Atlassian hosted Cloud offering.\nAs always, we recommend that our server and data center customers apply the latest security patches and mitigations as soon as they are available in order to receive the latest features and fixes. We also recommend that our customers move to the cloud versions of Atlassian products to ensure they automatically receive the upgrades and security patches.”\nAs always, we recommend that our server and data center customers apply the latest security patches and mitigations as soon as they are available in order to receive the latest features and fixes. We also recommend that our customers move to the cloud versions of Atlassian products to ensure they automatically receive the upgrades and security patches.”\nIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...SecurityWeek talks to Billy Spears, CISO at Teradata (a multi-cloud analytics provider), and Lea Kissner, CISO at cloud security firm Lacework.Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-26",
      "title": "Hive claims ransomware attack on Tata Power, begins leaking data",
      "text": " Hive ransomware group has claimed responsibility for a cyber attack disclosed by Tata Power this month.A subsidiary of the multinational conglomerate Tata Group, Tata Power is India's largest integrated power company based in Mumbai.In screenshots seen by BleepingComputer, Hive operators have posted data they claim to have stolen from Tata Power, indicating that the ransom negotiations failed.As of a few hours ago, operators behind the Hive ransomware group began leaking data allegedly stolen from Tata Power on their leak site.Additionally, the data dump contains engineering drawings, financial and banking records as well as client information, suggests Krishnan.Hive operators claim that they encrypted Tata Power's data on October 3rd. \"The Company has taken steps to retrieve and restore the systems. All critical operational systems are functioning; however, as a measure of abundant precaution, restricted access and preventive checks have been put in place for employee and customer facing portals and touch points,\" stated Tata Power's filing, signed by company secretary H.M. Mistry at the time.Threat actors like extortion and ransomware groups typically begin leaking or selling data stolen from breaching their targets should the target refuse to pay their ransom demand and subsequent negotiations fail."
   },
   {
      "time": "2022-10-26",
      "title": "Cisco warns admins to patch AnyConnect flaws exploited in attacks",
      "text": " Cisco warned customers today that two security vulnerabilities in the Cisco AnyConnect Secure Mobility Client for Windows are being exploited in the wild.The AnyConnect Secure Mobility Client simplifies secure enterprise endpoint access and enables employees to work from anywhere while connected to a secure Virtual Private Network (VPN) through Secure Sockets Layer (SSL) and IPsec IKEv2.Following successful exploitation, the attackers could execute arbitrary code on the targeted Windows devices with SYSTEM privileges.Today, two years after patching them in 2020, Cisco updated the security advisories to ask admins to update the vulnerable software and block ongoing attacks.\"In October 2022, the Cisco PSIRT became aware of additional attempted exploitation of this vulnerability in the wild,\" the company warned.\"Cisco continues to strongly recommend that customers upgrade to a fixed software release to remediate this vulnerability.\"The federal agencies were given three weeks, until November 11th, to ensure that any ongoing exploitation attempts would be blocked.The U.S. cybersecurity agency also strongly urged all organizations worldwide to prioritize patching these security bugs, even though BOD 22-01 only applies to U.S. FCEB agencies."
   },
   {
      "time": "2022-10-26",
      "title": "See Tickets discloses 2.5 years-long credit card theft breach",
      "text": " Ticketing service provider 'See Tickets' has disclosed a data breach, informing customers that cybercriminals might have accessed their payment card details via a skimmer on its website.Skimmers are snippets of JavaScript code injected on order checkout pages to steal inputted payment card details from customers, in this case, people who bought a ticket to a live entertainment event.However, it wasn't until January 8, 2022, that the malicious code was fully removed from its site.After engaging with forensic experts and Visa, MasterCard, American Express, and Discover to investigate the incident further, See Tickets concluded on September 12, 2022, that unauthorized parties may have accessed customer credit card information.The internal investigation showed that the infection happened on June 25, 2019, so the total duration of the exposure was just over 2.5 years.The customer information that the hackers might have stolen includes the following data:See Tickets says Social Security Numbers, state identification numbers, or bank account information have not been exposed due to this incident, as they're not stored in its systems.Due to the type of data the hackers stole, See Tickets warns that users should be vigilant against unauthorized credit card transactions and identity theft.Threat actors commonly use stolen credit card information to purchase goods from online stores and then sell them to private individuals for money laundering.The proceedings of these sales are often bounced through \"money mule\" networks before they reach the crooks to obscure their trace.Additionally, the notice urges the impacted recipients to remain vigilant against phishing emails or other unsolicited communication and monitor credit card statements for suspicious charges.Unfortunately, See Tickets has not offered a free-of-charge identity protection service for the impacted individuals, so exposed customers were left on their own to deal with the consequences of the security breach.The number of the impacted customers is unknown, and See Tickets hasn't clarified if skimmers infected only the global site or any of the other five domains it operates for regional audiences in the U.S., Canada, and Europe.BleepingComputer has contacted See Tickets on the matter, but we are still waiting to receive a response."
   },
   {
      "time": "2022-10-26",
      "title": "Ukrainian charged for operating Raccoon Stealer malware service",
      "text": " 26-year-old Ukrainian national Mark Sokolovsky has been charged for involvement in the Raccoon Stealer malware-as-a-service (MaaS) cybercrime operation.Raccoon Stealer is an information-stealing trojan distributed under the MaaS (malware-as-a-service) model that threat actors can rent for $75/week or $200/month.Subscribers also get access to the admin panel that lets them customize the malware, retrieve the stolen data (also known as logs), and create new malware builds.While Dutch authorities arrested the defendant, the FBI and law enforcement partners in the Netherlands and Italy dismantled Raccoon Infostealer's infrastructure and took down the malware's existing version offline.​Since March, the FBI has been collecting some of the data stolen by cybercriminals using the Raccoon Stealer malware from infected computers.\"The credentials appear to include over four million email addresses. The United States does not believe it is in possession of all the data stolen by Raccoon Infostealer and continues to investigate.\"Those who had their data stolen will receive a confirmation email with additional info, resources, and links at the address they provided when searching the U.S. government's Raccoon Infostealer Disclosure portal.\"Please note that Raccoon Infostealer may have compromised other personal data such as financial information without stealing an email address,\" the portal further explains."
   },
   {
      "time": "2022-10-26",
      "title": "Microsoft: Vice Society targets schools with multiple ransomware families",
      "text": " A threat group known as Vice Society has been switching ransomware payloads in attacks targeting the education sector across the United States and worldwide.While this isn't necessarily new information, since the group is known for using multiple ransomware strains in some attacks, Microsoft has also seen them use this tactic against organizations in the U.S. education sector between July and October 2022.As Microsoft Security Threat Intelligence analysts shared in a report published today, Vice Society (tracked by Redmond as DEV-0832) has been swapping between BlackCat, QuantumLocker, Zeppelin, and a Vice Society-branded variant of Zeppelin ransomware.While Vice Society runs its own data leak site, it should be noted that the RedAlert and BlackCat operations have their own leak sites as well.Besides the strains mentioned in the report, BleepingComputer is aware that the gang has also been deploying HelloKitty/Five Hands ransomware as part of their attacks.Vice Society will also skip the ransomware deployment stage in some attacks, with the operators opting for stealing sensitive data from their victims' networks and extorting them under the threat of leaking the stolen files online.\"The shift from a ransomware as a service (RaaS) offering (BlackCat) to a purchased wholly-owned malware offering (Zeppelin) and a custom Vice Society variant indicates DEV-0832 has active ties in the cybercriminal economy and has been testing ransomware payload efficacy or post-ransomware extortion opportunities.\"They also exfiltrate data from compromised systems before encryption and use it for double extortion, threatening victims to leak it online if their ransom demands aren't met."
   },
   {
      "time": "2022-10-26",
      "title": "Dutch police arrest hacker who breached healthcare software vendor",
      "text": " The Dutch police have arrested a 19-year-old man in western Netherlands, suspected of breaching the systems of a healthcare software vendor in the country, and stealing tens of thousands of documents.These documents might contain sensitive personal and medical data of patients of healthcare providers using the company's systems. At this time, it has not been determined if the hacker shared or attempted to sell the stolen data, as is common in data breaches.The police traced the man after receiving a report from the hacked company and are currently examining the evidence collected during the arrest at the suspect's home.Carengzorgt is a medical portal used by 9,023 healthcare providers and almost half a million active users, offering features like appointment booking, doctor-patient and family-patient communication, and medical data safekeeping.\"Nedap investigated the vulnerability, resolved it immediately, and then initiated an investigation into the possible impact of this incident.\"\"This revealed that this vulnerability was recently misused. Documents offered by healthcare providers through Carenzorgt.nl have been downloaded unauthorized.\"The alarming finding made Nedap contact the law enforcement authorities, as the medical data of many people were in the hands of an unknown network intruder.Simultaneously, Nedap informed the healthcare providers using the breached portal about the security incident.The company has seen no evidence of the stolen documents being circulated on the internet, but the investigation on that front is still ongoing.Nedap highlights that despite the annual external audits by certified bodies and penetration testers that have helped them discover and fix vulnerabilities in its products, some undetected security flaws remained."
   },
   {
      "time": "2022-10-26",
      "title": "VMware fixes critical Cloud Foundation remote code execution bug",
      "text": " VMware has released security updates today to fix a critical vulnerability in VMware Cloud Foundation, a hybrid cloud platform for running enterprise apps in private or public environments.The flaw (CVE-2021-39144) is in the XStream open-source library used by Cloud Foundation and has an almost maximum CVSSv3 base score of 9.8/10 assigned by VMware.It can be exploited remotely by unauthenticated threat actors in low-complexity attacks that don't require user interaction.To address the issue, VMware has updated XStream to version 1.4.19 to resolve CVE-2021-39144 and block any attempts of exploitation that would target unpatched servers.The company has also issued patches for a second flaw (CVE-2022-31678) that could trigger denials of service or expose information following successful XML external entity injection (XXE) attacks.Steps detailed in a separate support document require admins to log into each SDDC manager Virtual Machine in their Cloud Foundation environment.Once in, they have to apply an NSX for vSphere (NSX-V) hot patch that will upgrade the XStream library to version 1.4.19, which removes the attack vector.However, unlike applying the CVE-2021-39144 security updates released today, the workaround will require admins to go through these steps each time \"a new VI workload domain is created.\""
   },
   {
      "time": "2022-10-26",
      "title": "New Samsung Maintenance Mode protects your data during phone repairs",
      "text": " After a successful pilot program in Korea, Samsung is now rolling out 'Maintenance Mode' to select Galaxy devices globally, to help users protect their sensitive data when they hand over their smartphones at service points.This new system aims at relieving user anxiety and bolstering confidence that nobody can access or copy their personal data, even with physical access to the device.\"With Maintenance Mode, we are giving extra reassurance that Galaxy users can keep their privacy, even if they hand their phone to someone\" - SamsungThe new mode is available in Settings, under the \"Battery and device care\" menu. Once enabled, the mode is active after rebooting the device.Doing so creates an auxiliary user account on the device, completely isolated from all applications the owner installed, the stored data, and the filesystem.This makes photos, documents, and messages associated with the owner's account unavailable to the new user.Samsung still recommends backing up valuable personal data to ensure make sure it can be recovered if the storage media or other component fails during servicing.Maintenance Mode will allow service technicians to perform any action they need to carry out in the context of repair work, like testing device functions, running system apps, downloading software from the Galaxy Store, etc.Once the device is returned to its owner and they enter their regular account password, the second account, data created, and apps installed during Maintenance Mode are automatically wiped.Note that Maintenance Mode will not reach every Galaxy phone in the world immediately. Samsung is planning to roll out the new feature gradually.The Korean tech giant has prioritized the Samsung Galaxy S21 and S22 series models running on One UI 5, so these will get the feature first.The rollout will continue throughout 2023, expanding to more Galaxy models, but Samsung hasn't published a list of them yet."
   },
   {
      "time": "2022-10-26",
      "title": "Rapidly Evolving Magniber Ransomware - ASEC BLOG",
      "text": " The Magniber ransomware has recently been evolving rapidly. From changing its file extension, injection and to UAC bypassing techniques, the Magniber ransomware has been rapidly changing to bypass the detection of anti-malware software. This article summarizes the evolution of the Magniber ransomware in the last few months based on the analysis that had been previously performed.Table 1 shows the major characteristics of the distributed Magniber ransomware files by date. It had been distributed as five different file extensions (msi, cpl, jse, js, wsf) over the course of four months, and in September, it showed a frequent change in its file extension, changing four times (cpl -> jse -> js -> wsf -> msi).Figure 1 shows the Magniber ransomware file distributed on May 7th, 2022. It was distributed with the MSI file extension and was executed with msiexec.exe, which undertook file encryption itself. After encryption, it deactivates the Windows 10 recovery environment. The UAC bypassing technique is used to successfully execute the command to deactivate the recovery environment, and this technique changed the registry value (HKCU:\\Software\\Classes\\ms-settings\\shell\\open\\command) that is referenced as a command by fodhelper.exe, which is run at a high privilege level, to attempt UAC bypassing.Afterwards, the sample from June 14th showed a change where the ransomware payload was injected into normal processes in order to variate the subject of file encryption, the main behavior of the ransomware (See Figure 2). Also, the UAC bypassing technique for disabling the Windows 10 recovery environment used ProgID to change the variable registry value (HKCU:\\Software\\Classes\\(custom progID)\\shell\\open\\command) to be referenced from fodhelper.exe, attempting UAC bypassing. This is more useful for bypassing detection in comparison to changing the fixed registry value (HKCU:\\Software\\Classes\\ms-settings\\shell\\open\\command).Figure 3 shows the file distributed on July 20th. As shown in the picture, it has been identified that the file format changed from MSI (Windows installation package file) to CPL (Windows Control Panel Item). The subject of encryption for the file collected at the time was rundll32.exe, and the malware was not found to be deactivating the Windows 10 recovery environment.In the file distributed on August 8th, an injection feature was added, and the scope of subjects of encryption was expanded to running processes. Also, a command that disables the Windows 10 recovery environment was added. For the UAC bypassing method, it had been identified that ProgID was used to change the variable registry key (HKCU:\\Software\\Classes\\(custom progID)\\shell\\open\\command). An additional characteristic of this version is that the registry value command was changed to a wscript execution syntax instead of the previous regsvr32 execution syntax. Accordingly, the execution subject of the Windows 10 recovery environment deactivation command was run with wscript.exe.Figure 5 shows the file distributed on September 8th, showing another change in the format in just a month. It had been changed to JSE (script) format from the previous CPL format, where its initial execution process started with wscript.exe, after which the payload inside wscript.exe injected the ransomware into running processes, enabling file encryption from a random running process. As shown in Table 1, the attacker changed the file extension in short intervals, starting with September 8th (.jse) to September 16th (.js), and then to September 28th (.wsf).The file distributed on September 30th was changed again to the MSI format that had been previously used. Although it may show resemblance to the file that had distributed on June 14th, it has been identified that the command to deactivate the Windows 10 recovery environment maintains wscript instead of the previous regsvr32.The ASEC analysis team has examined the Magniber ransomware files distributed in each time period. In the month of September alone, there have been format changes up to four times (cpl -> jse -> js -> wsf -> msi). Frequent changes were also made to method of injection, UAC bypassing and deactivation of the Windows 10 recovery environment, for the purpose of bypassing detection.Currently, AhnLab is responding to the Magniber ransomware with not only file detection but also with various detection methods. Thus, it is recommended that users activate the Process Memory Scan and the Malicious Script Detection (AMSI) options in [V3 Preferences] – [PC Scan Settings].Such rapidly evolving versions of the Magniber ransomware are being distributed in a typosquatting method that exploits typos made when entering domains, targeting mainly Chrome and Edge users. As users may download ransomware by entering incorrect domains, extra caution is required.[IOC]250a23219a576180547734430d71b0e6d675958d39e44b310e4e57f4e4f9bc120fa83ec90f3f0d0cbab106e69f6dce522c54fad7d4632a1a94608444cc2acf387b76b698e90df66d4f4bbecf24c953258594ed7991a1a041764344a5713ef7d4Script File DetectionRansomware/WSF.Magniber (2022.09.28.02)Ransomware/VBA.Magniber.S1928 (2022.10.05.00)Ransomware/VBA.Magniber.S1939 (2022.10.13.00)Process Memory DetectionRansomware/Win.Magniber.XM153 (2022.09.15.03)AMSI Detection (.NET DLL)Ransomware/Win.Magniber.R528971 (2022.10.14.00)Subscribe to AhnLab’s next-generation threat intelligence platform ‘AhnLab TIP’ to check related IOC and detailed analysis information.[Important] Consent to Collection and Use of Personal InformationΔ[Important] Consent to Collection and Use of Personal InformationΔ[…] since Threat Actors started knocking to this door as well, I concluded its finally time to disclose underlying MSI installation […][…] Changes to Magniber’s distribution method (cpl -> jse -> js -> wsf -> msi) […]"
   },
   {
      "time": "2022-10-26",
      "title": "Unveil the evolution of Kimsuky targeting Android devices with newly discovered mobile malware | by S2W | S2W BLOG | Medium",
      "text": " S2W BLOG--ListenShareAuthor: Sebin, Lee & Yeongjae, Shin | S2W TALONLast Modified : Oct 24, 2022— Be careful not to open phishing pages on mobile— Be careful not to download a viewer program and document files from third parties and anyone.North Korean hacking group Kimsuky (aka Thallium, Black Banshee) first became active in 2012 and has carried out attacks on targets engaged in Media, Research, Politics, and Diplomacy, etc around the world. The group mainly attempts to collect by distributing malware and taking over accounts through spear-phishing attacks. Attacks have mainly targeted Windows, though instances of attacks on Android devices have likewise been discovered.S2W’s threat research and intelligence center, Talon, recently identified three new types of malware that target Android devices in the process of tracking the Kimsuky group. We named the three malicious APKs FastFire, FastViewer, and FastSpy by adding ‘Fast’ included in the package name of each malicious APK and the characteristics of each.Analyzing the IP of the C&C server domain used by the Kimsuky group in the past, we found a suspected malicious APK that the Kimsuky group is developing to target mobile devices. It is named “FastFire” as its package name contains “fastsecure” and uses the “Firebase” for C&C communication.The malicious APK has a package name com.viewer.fastsecure and disguises Google Security Plugin. After installation, it hides its launcher icon so that the victim does not know that it is installed.FastFire contains five malicious classes. After installation, only three classes are actually executed, and two classes are not. FastFire transmits a device token to the C&C server, and then the C&C server sends a command to the infected device through Firebase Cloud Messaging (FCM).1. Request a permissionWhen FastFire is executed, MainActivity class is executed first, and “You must grant permission to the Google Security Plugin in order to be safely downloaded.” message is displayed, and the MANAGE_OVERLAY_PERMISSION permission is requested. If permission is granted, the message “Downloaded safely” is displayed.2. C&C Communication in ServicesIn the manifest file in FastFire, two classes are specified to be executed as services. Of these, only the MyFirebaseMessagingService class is actually executed.The StartModuleService class is specified on the manifest, but it is not actually executed when FastFire is running. This class performs the function of reading a specific HTML page through the Android VIEW indent.startmodule class is not in the manifest nor is it called by another class, but a malicious code is implemented. Kimsuky group conducts phishing attacks disguised as the site to hijack the accounts of large Korean portal sites such as Naver and Daum, FastFire malware also targets the two portal sites. If the string “naver”, “daum” or “facebook” exists in the value received as an argument when calling the startmodule class, it connects to the C&C server and gets an HTML page. As that class is not actually called, it is likely still in development.Firebase is a mobile development platform that provides various necessary functions such as DB, authentication, and messaging. Using this, message payloads can include a notification property that the Firebase SDKs intercept and attempt to display a visible notification to users.MyFirebaseMessagingService class performs malicious behaviors by receiving commands through Firebase Cloud Messaging (FCM). FastFire generates a device token to use FCM, and the token value is transmitted to the C&C server. After obtaining the token, the attacker makes a request to Firebase to send a message payload containing the attacker’s command to the infected device. In response to the request, Firebase sends a message to the device.When the command is received, the onMessageRecived method is executed to perform an action. If the data of my_custom_key exists in the message, FastFire reads an HTML file from the C&C server and connects the deep link that takes the user to a specific page in an app. The HTML file according to whether the value is “naver”, “daum”, or “facebook”.3. Additional C&C Server and Malicious PagesAfter further analysis of FastFire’s infrastructure, an additional domain assigned to the Resolved IP of FastFire’s C&C server was discovered. Since the domain has specific HTML files in the same directory path as FastFire’s, it is also identified as another C&C server used by Kimsuky.The HTML file obtained from the additional C&C server performs the function of calling a specific application through a deep link on an Android device. FastFire takes the user to a specific page in an app using the deep link according to the command, but the values in the secured HTML were all unidentified. The attacker is expected to fill in that value with a test APK name “[Target]_host” or a random string for the test.Generally, the notification sent from Firebase is handled with the onMessageReceived method. However, the feature is not performed as the method is not implemented. Also, in a separate function for testing notifications, related messages Facebook and Google are included in Turkish.In addition, a file “fcm.html” was secured, and it calls the fcm_host through the deep link and downloads additional malicious code.As such, FastFire is believed to be a new mobile malware currently being developed by the Kimsuky group in that the deep link calling function is not yet properly implemented and there are classes that are not actually executed.In addition to FastFire, we discovered mobile RAT that impersonates the “Hancom Office Viewer”. “Hancom Office Viewer” is a mobile document viewer application used to view Microsoft Word, PDF, or ‘Hangul (.hwp)’ documents and the number of downloads on the Google Play store is over 10 million.FastViewer normally performs a document viewer, but when reading a document file specially created by an attacker, it performs malicious behaviors. The first 4 bytes of the file are checked to determine whether the document was created by the attacker, and if the conditions are met, device information is transmitted to the C&C server. After that, FastViewer additionally downloads FastSpy malware and executes it in memory to perform additional malicious actions.FastViewer is a repackaged APK by adding arbitrary malicious code inserted by an attacker to the normal Hancom Office Viewer app, and the package name, app name, and icon are very similar to the normal app.1. String decryption algorithmThe string used in FastViewer is decrypted by the custom algorithm. The encrypted string is used as the first argument, and the index of the key table is used as the second argument. After obtaining a key pair using the value of the XOR key table corresponding to the index, XOR is performed alternately from the back of the encrypted string.2. Request permissionsFastViewer requests additional permissions from users for malicious actions such as receiving commands, persistence, and spying. FastViewer abuses accessibility, so it is checked whether accessibility is enabled before performing malicious behaviors.3. Check the header of document filesMalicious behavior operates when a special document file created by an attacker is read, by checking whether the first 4 bytes of the file are “EDC%”. It then changes “EDC%” to the original 4 bytes, converting it to a normal document and displaying it to the user, executing malicious behavior in the background.According to the calling condition, malicious behavior is performed that meets the condition according to the variable “StrOpt”.4. C&C CommunicationFastViewer collects the information of the device and sends it to the C&C server as an ati parameter. If the app acquires permissions on the device and successfully gets the Device’s IMEI value, the ati parameter is assigned “Kur-{Device IMEI}_{Device IMEI}”. If IMEI value cannot be acquired due to permission failure or other problems, ati is assigned “Kur-null_error_imei”.After that, the data that FastViewer receives from the C&C server is as follows, and it determines whether to download additional modules by comparing the version variable defined in the FastViewer with the version value received from the server. If the response value is “ok”, only simple information stealing is performed, and an additional module is not downloaded.As above, when information about the additional module is successfully received, the request for downloading the module is sent to the C&C server. The version value is the value received from the server.5. Download an additional module — FastSpyThe downloaded module is a compressed DEX file, and the original data is extracted through base64 decoding and GZIP decompression in memory. The extracted file is FastSpy which performs remote control.After data extraction, the malicious class in the DEX in memory is dynamically called by calling the LoadClass API that matches the SDK version of the device. If the class is successfully called, the decrypted DEX is saved as image{version}.bin in the app install path.When FastSpy is executed, the internally stored C&C server information is compared with the information previously received from the C&C server. If the two values are different, the information is updated in memory with the information received from the server.FastSpy could abuse the accessibility API obtained from FastViewer to get additional privileges without the user’s consent. If FastSpy requests specific permission for malicious behaviors, a pop-up window requesting permission is displayed. In this case, FastSpy automates the function of clicking the “Agree” button in the window, so that FastSpy acquires the permission itself without interaction with users. However, it isn’t actually called in FastSpy we secured.FastSpy can take control of infected devices, hijack phone and SMS information, or identify the device’s location and whether it is used via camera, microphone, speaker, GPS, or KeyStroke in real-time.In addition, the attacker can access files on the infected device and send them to the C&C server. To exfiltrate, the file is compressed with the gzip algorithm and base64 encoding as used in FastSpy.FastSpy and AndroSpy have similar characteristics in the method name, message format, functions, and code. AndroSpy is an open-source RAT malware that was released in 2018 and has the characteristic that methods and key variables are in Turkish.Comparing the C&C URL released at the time and FastFire’s C&C URL, the same domain was used for both campaigns, and the path under the temp directory was used. In addition, the group mainly impersonates Korean large portal sites (Naver and Daum) in order to steal information from the target.The domains (navernnail[.]com, goooglesecurity[.]com) used by the FastFire malware have a history of pivoting to 23[.]106.122.16 in the past, and this IP was also used as a distribution site and C&C server for FastViewer and FastSpy.In that, the signature date of FastViewer and that of FastFire are included within the period in which the navernnail[.]com domain which was bound to 23[.]106.122.16 (Singapore), all three malware and infrastructure are used by Kimsuky at the same time.In addition, the fact that goooglesecurity[.]com, an additionally verified C&C server of FastFire, also supports this point.During the analysis, there was a directory listing vulnerability in navernnail[.]com, so we were able to collect files existing on the server. Among them, the key_ps.txt file has a code similar to the keylogging script used by the Kimsuky group in the past, and the same mutex name is also used.In addition, the info_sc.txt file was also confirmed to have similarities with Kimsuky group. February 18, 2022, the malicious document disguised as the customer center of Klip, a virtual asset wallet service in Korea, downloaded a very similar script.Kimsuky group has continuously performed attacks to steal the target’s information targeting mobile devices. Firebase, a normal service used as the C&C server in FastFire, is their advanced tactic. In addition, various attempts are being made to bypass detection by customizing Androspy, an open-source RAT. In the future, caution is required as the Kimsuky group may distribute malicious codes with similar functions and variants to Android devices.Like FastViewer, sophisticated attack vectors are used to attack only specific targets, and existing open sources are actively used to create high-performance variants such as FastSpy. Since Kimsuky group’s mobile targeting strategy is getting more advanced, it is necessary to be careful about sophisticated attacks targeting Android devices.----S2W BLOGS2W is specializing in cybersecurity data analysis for cyber threat intelligence.S2WinS2W BLOG--S2WinS2W BLOG--S2WinS2W BLOG--1S2WinS2W BLOG--montysecurity--Hossam Ehab--Ofri Ouzan--Paritosh--XIT--TheCyberChef--1HelpStatusAboutCareersBlogPrivacyTermsText to speechTeams"
   }
]