[
   {
      "time": "2023-11-13",
      "title": "State of Maine Becomes Latest MOVEit Victim to Surface",
      "text": " This cyber incident was limited to Maine's MOVEit server, according to the Maine government website, and no other networks or systems belonging to the state were affected. However, the breach exposed information on 1.3 million individuals, with the type of data affected for each varying person to person. The information that may have been impacted includes names, Social Security numbers (SSNs), dates of birth, driver's license or state identification numbers, taxpayer identification numbers, medical information, and health insurance information.Once the state became aware of the breach, it secured its information by blocking Internet access from the MOVEit server. It also implemented security measures as directed by Progress Software and launched an investigation of the cyber incident alongside legal counsel and cybersecurity experts.\"Yet again, we see the MOVEit exploit continuing to hit new victims across all sectors, with more than 640 recorded so far,\" said Darren Williams, CEO and founder at BlackFog, in an emailed statement. \"The catastrophic fallout from this hack has demonstrated a cold reality: a significant number of organizations are not prepared to fend off sophisticated breaches.\"Individuals can contact Maine's call center to find out if their data was affected; they will be offered two years of credit monitoring and identity theft protection services if their SSN or taxpayer identification numbers were involved. The state is also currently notifying individuals who have been affected by this breach through various channels, including emails and letters by mail.\"Governments, in particular, bear a critical responsibility to secure the masses of data belonging to their residents,\" Williams said. \"They must prioritize the adoption of cutting-edge technologies and proactive strategies to lock down their data and ensure the utmost protection for their citizens.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-11-13",
      "title": "Iranian hackers launch malware attacks on Israel’s tech sector",
      "text": " Security researchers have tracked a new campaign from Imperial Kitten targeting transportation, logistics, and technology firms.Imperial Kitten is also known as Tortoiseshell, TA456, Crimson Sandstorm, and Yellow Liderc, and for several years it used the online persona Marcella Flores.It is a threat actor linked to the Islamic Revolutionary Guard Corps (IRGC), a branch of the Iranian Armed Forces, and has been active since at least 2017 carrying out cyberattacks against organizations in various sectors, including defense, technology, telecommunications, maritime, energy, and consulting and professional services.The recent attacks were discovered by researchers at cybersecurity company CrowdStrike, who made the attribution based on infrastructure overlaps with past campaigns, observed tactics, techniques, and procedures (TTPs), the use of the IMAPLoader malware, phishing lures.When opening the document, the malicious macro code within extracts two batch files that create persistence through registry modifications and and run Python payloads for reverse shell access.The attacker then moves laterally on the network using tools like PAExec to execute processes remotely and NetScan for network reconnaissance. Additionally, they employ ProcDump to obtain credentials from the system memory.Communication with the command and control (C2) server is achieved using the custom malware IMAPLoader and StandardKeyboard, both relying on email to exchange information.The researchers say that StandardKeyboard persists on the compromised machine as the Windows Service Keyboard Service and executes base64-encoded commands received from the C2.CrowdStrike confirmed for BleepingComputer that the October 2023 attacks targeted Israeli organizations following the Israel-Hamas conflict.In previous activity, Imperial Kitten carried watering hole attacks by compromising several Israeli websites with JavaScript code that collected information about visitors, such as browser data and IP address, profiling potential targets.In other instances, Crowdstrike has seen the hackers breaching networks directly, leveraging public exploit code, using stolen VPN credentials, performing SQL injection, or through phishing emails sent to the target organization."
   },
   {
      "time": "2023-11-13",
      "title": "Microsoft: BlueNoroff hackers plan new crypto-theft attacks",
      "text": " Microsoft warns that the BlueNoroff North Korean hacking group is setting up new attack infrastructure for upcoming social engineering campaigns on LinkedIn.This financially motivated threat group (tracked by Redmond as Sapphire Sleet) also has a documented history of cryptocurrency theft attacks targeting employees within cryptocurrency companies.\"Sapphire Sleet typically finds targets on platforms like LinkedIn and uses lures related to skills assessment. The threat actor then moves successful communications with targets to other platforms.\"Previously, the North Korean state hackers were seen distributing malicious attachments directly or using links to pages hosted on legitimate websites like GitHub.However, Microsoft believes that swift detection and removal of the attackers' malicious files from legitimate online services prompted the BlueNoroff hackers to create their own websites capable of hosting malicious payloads.These websites are password-protected to thwart analysis efforts and are camouflaged as skills assessment portals, urging recruiters to register for an account."
   },
   {
      "time": "2023-11-13",
      "title": "Hackers breach healthcare orgs via ScreenConnect remote access",
      "text": " Security researchers are warning that hackers are targeting multiple healthcare organizations in the U.S. by abusing the ScreenConnect remote access tool.Threat actors are leveraging local ScreenConnect instances used by Transaction Data Systems (TDS), a pharmacy supply chain and management systems solution provider present in all 50 states.Researchers at managed security platform Huntress spotted the attacks and report seeing them on endpoints from two distinct healthcare organizations and activity indicating network reconnaissance in preparation of attack escalation.The observed intrusions were observed between October 28 and November 8, 2023, and they are likely still happening.Huntress reports that the attacks feature similar tactics, techniques, and procedures (TTPs). These include downloading of a payload named text.xml, indicating that the same actor is behind all observed incidents.The .XML contains C# code that loads the Metasploit attack payload Meterpreter into the system memory, using non-PowerShell to evade detection.According to Huntress, additional processes were observed being launched using the Printer Spooler service.The compromised endpoints operate on a Windows Server 2019 system, belonging to two distinct organizations - one in the pharmaceutical sector and the other in healthcare, the common link between them being a ScreenConnect instance.The remote access tool was used to install additional payloads, to execute commands, transfer files, and to install AnyDesk. The hackers also tried to create new user account for persistent access. Researchers determined that the ScreenConnect instance was be tied to the ‘rs.tdsclinical[.]com’ domain associated with TDS.At this time, it is unclear if TDS suffered a breach, if the credentials to one of their accounts were compromised, or if the attackers exploit a different mechanism.Update 11/14 - ConnectWise, the vendor of ScreenConnect, has reached out to BleepingComputer to share an important detail about the attack.According to their visibility, the attacker gained access via an unmanaged on-prem instance that hasn't been updated since 2019, going against the recommended \"best practices.\""
   },
   {
      "time": "2023-11-13",
      "title": "LockBit ransomware leaks gigabytes of Boeing data",
      "text": " The LockBit ransomware gang published data stolen from Boeing, one of the largest aerospace companies that services commercial airplanes and defense systems.Before the leak, LockBit hackers said that Boeing ignored warnings that data would become publicly available and threatened to publish a sample of about 4GB of the most recent files.LockBit ransomware has leaked more than 43GB of files from Boeing after the company refused to pay a ransom.Most of the data listed on the hacker group’s leak site are backups for various systems, the most recent of them with an October 22 timestamp.The ransomware actor posted Boeing on their site on October 27 and gave the company a November 2nd deadline to contact them and engage in negotiations.The hackers said at the time they had stolen “a tremendous amount of sensitive data” and were ready to publish it.Boeing disappeared from LockBit’s list of victims for a period but was listed again on November 7, when the hackers announced that their warnings had been ignored.When the company continued to be silent, the LockBit ransomware gang decided to show that they had a bargaining chip and threatened to publish “just around 4GB of sample data (most recent).”The hackers also threatened that they would publish the databases “if we do not see a positive cooperation from Boeing.”On November 10, LockBit released on their site all the data they had from Boeing. Among the files are configuration backups for IT management software, and logs for monitoring and auditing tools."
   },
   {
      "time": "2023-11-13",
      "title": "Mortgage giant Mr. Cooper says customer data exposed in breach",
      "text": " Mr. Cooper, the largest home loan servicer in the United States, says it found evidence of customer data exposed during a cyberattack disclosed last week, on October 31.The mortgage loan giant's notice says it's still investigating the nature of the compromised data and will provide affected customers with more information over the coming weeks.Mr. Cooper said the attackers could not access customers' financial information as the impacted systems did not store such data.\"This information is hosted with a third-party provider and, based on the information we have to date, we do not believe it was affected by this incident. As a result, we do not believe that any of our customers' banking information related to mortgage payments was impacted.\"The company has not disclosed whether the attackers issued a ransom demand after last month's security breach.Mr. Cooper also urged customers to monitor their credit reports and bank accounts, with any signs of suspicious or unauthorized activity promptly reported to their bank.Individuals potentially affected by the incident were also advised to place a 'fraud alert' on their credit bureau files as a precautionary measure and to be alerted about any attempts to open new accounts using their Social Security number.\"We are experiencing a system/technical outage, and we hope to resolve this soon,\" a system outage banner on Mr. Cooper's website warned.\"Customers trying to make payments will not incur fees or any negative impacts as we work to fix this issue. We apologize for any inconvenience this may cause and will continue to provide regular updates.\"​Later that day, the company told BleepingComputer that the outage resulted from a cyberattack. It also promised not to charge any fees, penalties, or negative credit reporting related to late payments until it finished restoring impacted systems.Mr. Cooper, formerly Nationstar Mortgage LLC, is a mortgage lending company headquartered in Dallas, Texas, with around 9,000 employees."
   },
   {
      "time": "2023-11-13",
      "title": "\r\n\tMOVEit Gang Targets SysAid Customers With Zero-Day Attacks - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineMicrosoft has revealed a new threat campaign exploiting a zero-day vulnerability in the popular SysAid IT helpdesk software.Posting to X (formerly Twitter) yesterday, the Microsoft Threat Intelligence account said the group is the same one responsible for the MOVEit data theft and extortion campaign – a threat actor known as Lace Tempest (aka DEV-0950, FIN11 and TA505).“Microsoft notified SysAid about the issue (CVE-2023-47246), which they immediately patched,” the post continued.“Organizations using SysAid should apply the patch and look for any signs of exploitation prior to patching, as Lace Tempest will likely use their access to exfiltrate data and deploy Clop ransomware.”Microsoft explained that after exploiting the vulnerability, the threat actors will issue commands via SysAid to deliver a loader for Gracewire malware to victim systems.The firm urged customers to upgrade immediately to version 23.3.36, conduct a thorough assessment to check for indicators of compromise (IoCs), check relevant logs and review any credentials or other information that may have been exposed to threat actors.“While this will not be as widespread at the MOVEit vulnerability, it’s clear that the threat actor behind it is continuing to develop and deploy new ransomware threats. Organizations should use this as a warning to have effective threat assessment and remediation processes in place, especially for non-IT assets like IoT devices and applications.”"
   },
   {
      "time": "2023-11-13",
      "title": "Police takes down BulletProftLink large-scale phishing provider",
      "text": " The notorious BulletProftLink phishing-as-a-service (PhaaS) platform that provided more than 300 phishing templates has been seized, the Royal Malaysian Police announced.The operation started in 2015 but came to researchers' radar later and became more active since 2018 and had thousands of subscribers, some of them paying for access to batches of credential logs.PhaaS platforms provide cybercriminals with tools and resources to carry out phishing attacks through “ready-to-use” kits and templates, page hosting, customization options, credential harvesting, and reverse proxying tools.With servers confiscated, law enforcement can examine them to identify users of the platform, some of them paying a $2,000/month subscription fee to access regular batches of credentials logs.This is a 403% rise in customers since Microsoft’s report in 2021, reflecting the platform’s massive popularity in the cybercrime community.Intel 471 says that phishing resources BulletProftLink offered before it was taken down \"included login pages for Microsoft Office, DHL, the South Korea-based online platform Naver and financial institutions including American Express, Bank of America, Consumer Credit Union and Royal Bank of Canada.\"Some of these phishing pages were hosted on legitimate cloud services like Google Cloud and Microsoft Azure to evade email security tools.The operation was an important source of credentials for professional cybercriminals to gain initial access to corporate systems. With a foothold in the company network, attackers can start the reconnaissance stage and moving laterally to valuable hosts."
   },
   {
      "time": "2023-11-13",
      "title": "Leaky DICOM Medical Standard Exposes Millions of Patient Records",
      "text": " Around 60 million personal and medical records may have been exposed during the past few decades due to the use of a legacy protocol in medical equipment, researchers say.The researchers explained that the DICOM protocol does contain security measures such as TLS integration and user identification, but that most vendors don't implement them, for a variety of reasons. These include a lack of awareness about the security risks; development of the hardware before the security measures existed — which makes upgrades complicated and time-consuming (and maybe not even feasible); and some vendors target smaller organizations that often lack the IT infrastructure needed to implement security measures such as access control and certificates.\"Managing TLS certificates is complicated. It demands significant expertise and resources to avoid resorting to insecure self-signed certificates,\" Yazdanmehr says. He also claims that none of the security measures are mandatory, so a lack of regulatory governance could be seen as another cause of the insecurity.Perhaps the security holes are to be expected, given that the most recent version of the protocol was introduced 30 years ago, in 1993, with the original published in 1985 and a revised edition in 1988. Yazdanmehr says there were some updates in 2021, \"but not in regard to the security improvements that we wanted to see.”The researchers say that over 30 years, they estimate that 59 million records could have been visible, \"including personal information like names, addresses, dates of birth, gender — and in some cases, we could even see the Social Security numbers of those people.\"Yazdanmehr says that the vendors of the machines they had spoken with were aware of the issues, but adds they were unaware of how big the risk is and what the volume of data leakage is.He points out that the devices should be able to talk to each other and exchange data but that moving electronic records securely involves every link in the chain being secure and up to date, and that until the majority of equipment and medical devices can support advanced and complex security measures, there will be a problem.A spokesperson for DICOM said in a statement that DICOM is a standard protocol that manufacturers choose to use, and that vendors and healthcare delivery organizations are the ones to ultimately decide which security mechanisms are appropriate for their environments.\"The implementation, deployment, purchase, maintenance and configuration of systems that implement the DICOM standard are the responsibility of the product vendors and their customers,” according to the statement. “Further, it is the responsibility of the vendors to provide and maintain software implementations. In short, proper security is a shared responsibility between device manufacturers and health delivery organizations. To claim it's the sole responsibility of a standard is false.\"The researchers say they agree with the statement, and that they hope the presentation at Black Hat Europe helps to sound the alarm on the data leakage issue.\"Hopefully, we can increase the awareness, make it better, and the number goes down and more vendors and hospitals start hardening their infrastructure,\" Yazdanmehr says. \"But I think it's going to be a kind of a long journey.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-11-13",
      "title": "Microsoft fixes Outlook Desktop bug causing slow saving issues",
      "text": " Microsoft has resolved a known issue causing significant delays for Microsoft 365 customers when saving attachments in Outlook Desktop.The bug is known to impact Outlook users trying to save an attachment to a network share, according to a support document published by Redmond when the bug was first acknowledged in July.Users encountering this problem see a \"Trying to connect\" dialog box, leading to prolonged loading times for the \"Save As\" dialog.This issue was confirmed to affect Microsoft 365 Apps, particularly in the Current Channel Version 2304 (Build 16327.20214) and Monthly Enterprise Channel Version 2304 (Build 16327.20324).While Microsoft now has a fix, it's currently rolling out only to insiders, starting with building 25991.1000.rs_prerelease.231102-1335.Redmond also provides a temporary fix for customers impacted by this bug who aren't enrolled in the Insider program.To address this known issue, users must revert to an earlier M365 Apps build and disable the WebClient Windows service from starting at login.This can be done by going through the following steps:However, the company warned customers that applying the hyperlink temporary fix might increase the attack surface on affected systems, potentially exposing users and their data to attacks."
   },
   {
      "time": "2023-11-13",
      "title": "자산 관리 프로그램을 악용한 공격 정황 포착 (Andariel 그룹) - ASEC BLOG",
      "text": " ASEC 분석팀은 Lazarus 그룹과 협력 관계이거나 하위 조직으로 알려진 Andariel 위협 그룹이 최근 특정 자산 관리 프로그램을 이용한 공격을 통해 악성코드를 유포하고 있는 정황을 확인하였다.이번에 확인된 공격은 국내의 또 다른 자산 관리 프로그램이 사용되었으며, 이외에도 MS-SQL 서버를 대상으로 한 공격도 동시에 확인되었다. 이러한 공격을 통해 설치된 악성코드들로는 TigerRat뿐만 아니라 NukeSped 변종, Black RAT, 오픈 소스 악성코드인 Lilith RAT 등 다양한 악성코드들이 존재한다. 공격 대상으로 확인된 국내 통신 업체, 반도체 제조업 등 기존 공격 대상 사례들과 유사하다. 최근 국내 특정 자산 관리 프로그램이 Andariel 그룹의 악성코드들을 설치한 로그가 자사 AhnLab Smart Defense (ASD) 로그에서 확인되었다. 물론 해당 로그만으로는 취약점을 이용한 공격인지 단순한 악용인지는 알 수 없다. 공격 대상 시스템에서 실행 중인 자산 관리 프로그램은 최종적으로 다음과 같은 파워쉘 명령을 이용해 악성코드를 다운로드하였다.Andariel 그룹은 파워쉘 외에도 mshta.exe 프로세스를 이용해 악성코드를 다운로드하기도 하였다. 다음은 C&C 주소에 업로드된 HTML 악성코드로서 TigerRat과 같은 Andariel 그룹의 다른 악성코드들을 다운로드하는 기능을 담당한다. 이전 공격 사례에서 Andariel 그룹은 Innorix Agent 뿐만 아니라 스피어 피싱 공격을 함께 사용하였다. 이번 공격 사례에서 눈에 띄는 점은 MS-SQL 서버를 이용한 악성코드 설치 사례가 함께 존재한다는 점이다. 공격자는 부적절하게 관리되는 MS-SQL 서버를 공격해 NukeSped를 설치한 것으로 추정된다. Remcos RAT, Mallox 랜섬웨어 등의 악성코드들은 주로 무차별 대입 공격이나 사전 공격에 취약한 자격 증명 정보를 갖는 MS-SQL 서버를 대상으로 하는 공격을 통해 설치되는데, 해당 시스템에서는 과거에도 다른 공격자들이 이러한 악성코드를 설치하려고 시도했던 로그가 확인되기 때문이다. 즉 Andariel 그룹 또한 최근에는 부적절하게 관리되는 MS-SQL 서버를 공격 벡터로 활용하고 있는 것으로 보인다.공격 과정에서는 일반적인 MS-SQL 서버 대상 공격 사례와 유사하게 권한 상승을 목적으로 PrintSpoofer 악성코드가 함께 사용되었다. 위의 공격을 통해 설치된 백도어 악성코드들로는 Andariel 그룹의 대표적인 악성코드들 중 하나인 TigerRat, Black RAT, NukeSped 변종들이 있다. 이러한 악성코드들은 기존 공격과 거의 유사하지만 이번 공격 사례에서는 오픈 소스 악성코드인 Lilith RAT이 사용된 것이 특징이다. 이외에도 최근 Go 언어로 개발된 악성코드들을 자주 사용하는 Andariel 그룹의 흐름과 유사하게 Go 언어로 개발된 다운로더 악성코드도 함께 확인된다.일반적인 백도어 악성코드들과의 차이점이라고 한다면 C&C 서버와의 최초 통신 과정에서 특정 문자열을 주고받아야 하는 인증 과정이 존재한다는 점이다. 이번 공격에 사용된 TigerRat 또한 2023년에 확인된 유형들과 동일하게 0x20 크기의 랜덤한 문자열들이 인증에 사용되었다. 해당 문자열들은 “fool”(dd7b696b96434d2bf07b34f9c125d51d), “iwan”(01ccce480c60fcdb67b54f4509ffdb56)에 대한 MD5 해시로 추정된다.Andariel 그룹은 2023년 경부터 다양한 백도어 악성코드들을 Go 언어로 제작하여 사용하고 있다. 이전 사례에서는 Black RAT, Goat RAT, DurianBeacon 등이 사용되었으며 이번 공격 사례에서는 Go 언어로 개발된 다운로더 악성코드가 사용되었다. 해당 악성코드는 단순한 형태로서 C&C 서버에 접속하여 추가 페이로드를 설치한다. 특징이 있다면 C&C 서버와의 통신에 Base64 암호화를 사용한다는 점이 있다.공격자는 국내 자산 관리 프로그램을 악용하여 직접 TigerRat을 설치하기도 했지만 Golang 다운로더를 설치한 이후 해당 악성코드가 추가 페이로드를 설치하는 방식도 사용하였다. Golang 다운로더를 통해 설치된 악성코드들로는 TigerRat과 NukeSped 변종 악성코드가 있다.NukeSped는 C&C 서버로부터 명령을 받아 감염 시스템을 제어할 수 있는 백도어 악성코드이다. 공격에 사용된 NukeSped 변종 중 첫 번째 유형은 최초 C&C 서버와의 통신 시 POST 메소드를 이용해 패킷을 전송하며 이후 C&C 서버로부터 전달받은 명령을 수행한 결과는 구글 접속을 위장한 GET 메소드를 이용해 전송하는 점이 특징이다.공격 과정에서는 또 다른 NukeSped 변종도 확인된다. 비록 크기는 23KB로 작지만 자가 삭제에 사용되는 문자열은 기존 NukeSped 변종과 유사하다. Black RAT은 Go 언어로 개발된 백도어 악성코드로서 2023년에 Andariel 그룹의 공격 사례에서 최초로 확인되었다. 이번 공격에 사용된 Black RAT은 소스 코드 정보는 포함되어 있지 않지만 함수 이름이 기존 Black RAT과 거의 유사한 것을 통해 구분이 가능하다.Lilith RAT은 깃허브에 공개된 오픈 소스 RAT 악성코드이다. C++ 언어로 개발되었으며 원격 명령 실행, 지속성 유지, 자가 삭제 등 감염 시스템을 제어할 수 있는 다양한 기능들을 제공한다.Andariel 그룹이 공격에 사용한 Lilith RAT은 바이너리에 존재하는 문자열들 중 상당수가 암호화되어 있는데 이는 파일 진단을 우회하기 위한 목적으로 추정된다. 하지만 모든 문자열들이 암호화된 것은 아니며 일부 문자열들은 Lilith RAT의 소스 코드와 동일하다.공격자는 백도어 악성코드들을 이용해 감염 시스템을 제어하는 것 외에도 감염 시스템에 사용자 계정을 추가하고 이를 은폐하였다. 이러한 작업은 직접 제작한 악성코드를 이용하였는데, 해당 악성코드는 감염 시스템에 특정 사용자 계정이 존재할 때만 정상적으로 동작하기 때문에 이는 이미 감염 시스템에 대한 제어가 탈취된 이후라는 것을 의미한다.일반적으로 공격자가 백도어를 이용해 감염 시스템을 제어할 수 있음에도 불구하고 사용자 계정을 추가하는 이유는 이후 원격 데스크톱을 이용해 GUI 환경에서 감염 시스템을 제어하고 지속성을 유지하기 위한 목적이다. 하지만 단순하게 계정만 추가한다면 시스템의 사용자가 로그인하는 과정에서 새롭게 생성된 사용자 계정을 인지할 수 있다.이러한 이유 때문에 악성코드는 사용자가 인지할 수 없도록 다음과 같은 과정을 진행한다. 먼저 계정 이름에 “$” 기호를 붙여 생성한 후 기존 사용자의 SAM 데이터 중 일부를 복사하여 생성한 “black$“ 계정에 덮어씌우는데 만약 기존 사용자가 관리자 계정이고 원격 데스크톱이 허용된 사용자라면 “black$” 계정 또한 이러한 특성을 동일하게 가질 수 있다.공격자는 백도어 악성코드를 설치한 이후 지속성 유지를 위해 다음과 같은 명령을 실행하여 작업 스케줄러에 등록하였다.이후에는 다음 명령들을 이용해 감염 시스템에 대한 정보를 조회하였다.이외에도 다운로더 악성코드를 제거하거나 다른 프로세스를 종료하는 명령들도 확인된다.공격자는 백도어를 이용해 정보를 수집하기도 하지만 NirSoft 사의 CredentialsFileVIew, Network Password Recovery와 같은 HackTool들을 추가로 다운로드해 사용하기도 하였다. 해당 도구들은 감염 시스템에 저장된 자격 증명 정보와 공유 폴더에 대한 자격 증명 정보를 보여주는 도구로서 추후 감염 시스템이 존재하는 조직의 내부 네트워크 상에서 측면 이동을 위해 사용될 수 있다.최근 확인된 공격 사례에서는 취약한 MY-SQL 서버에 대한 공격뿐만 아니라 자산 관리 프로그램 등 회사 내 여러 프로그램을 이용하여 공급망 공격을 수행하는 것으로 보인다. 사용자들은 출처가 불분명한 메일의 첨부 파일이나 웹 페이지에서 다운로드한 실행 파일은 각별히 주의해야 하며, 기업 보안 담당자는 자산 관리 프로그램의 모니터링을 강화하고 프로그램 보안 취약점이 있다면 패치를 수행하여야 한다. 그리고 OS 및 인터넷 브라우저 등의 프로그램들에 대한 최신 패치 및 V3를 최신 버전으로 업데이트하여 이러한 악성코드의 감염을 사전에 차단할 수 있도록 신경 써야 한다.현재 V3에서는 아래와 같이 진단하고 있으며, IOC는 다음과 같다.파일 진단– Malware/Win.Generic.C5528992 (2023.10.25.00)– Malware/Win.Generic.C5528516 (2023.10.26.00)– Backdoor/Win.TigerRAT.C5517634 (2023.10.19.03)– Backdoor/Win.Agent.C5518308 (2023.10.20.00)– Downloader/HTML.Agent.SC193459 (2023.10.19.03)– Downloader/HTML.Agent.SC193403 (2023.10.18.01)– Backdoor/Win.TigerRAT.C5513095 (2023.10.17.03)– Unwanted/Win.HackTool.C5175443 (2022.06.20.02)– HackTool/Win.CredentialsFileView (2022.04.20.00)– Backdoor/Win.Agent.R619279 (2023.11.01.01)– Backdoor/Win.Agent.C5534745 (2023.11.01.01)– Backdoor/Win.NukeSped.C5535346 (2023.11.01.03)– Backdoor/Win.BlackRAT.C5535345 (2023.11.01.03)– Exploit/Win.PrintSpoofer.C5535350 (2023.11.02.00)행위 진단– Malware/MDP.Download.M1197IOCMD5– 13b4ce1fc26d400d34ede460a8530d93 : TigerRat (credisvs.exe, credis.exe)– 41895c5416fdc82f7e0babc6bb6c7216 : TigerRat (credisvs.exe)– c2f8c9bb7df688d0a7030a96314bb493 : TigerRat (crec.exe, dbinfo.exe)– 33a3da2de78418b89a603e28a1e8852c : TigerRat (mltest.exe)– 4896da30a745079cd6265b6332886d45 : Lilith RAT (svchost.exe, secure.exe, test.exe)– 73eb2f4f101aab6158c615094f7a632a : NukeSped 변종 – Type 1 (system.exe, credisvc.exe)– 7f33d2d2a2ce9c195202acb59de31eee : NukeSped 변종 – Type 1 (mshelp.exe)– e1afd01400ef405e46091e8ef10c721c : NukeSped 변종 – Type 1 (msuser.exe)– fe25c192875ec1914b8880ea3896cda2 : NukeSped 변종 – Type 1 (credisvc.exe)– 232586f8cfe82b80fd0dfa6ed8795c56 : NukeSped 변종 – Type 2 (perf.exe)– c1f266f7ec886278f030e7d7cd4e9131 : Black RAT (winsta.exe)– 49bb2ad67a8c5dfbfe8db2169e6fa46e : Golang 다운로더 (perf.exe)– beb199b15bd075996fa8d6a0ed554ca8 : Golang 다운로더 (credisvc.exe)– 4053ca3e37ed1f8d37b29eed61c2e729 : 사용자 계정 추가 악성코드 (test.exe)– 3a0c8ae783116c1840740417c4fbe678 : 사용자 계정 추가 악성코드 (test.exe)– 0414a2ab718d44bf6f7103cff287b312 : PrintSpoofer (print.exe)– ca564428a29faf1a613f35d9fa36313f : Network Password Recovery – NirSoft (net.exe)– ad6d4eb34d29e350f96dc8df6d8a092e : CredentialsFileView – NirSoft (credentialsfileview.exe)– dc70dc9845aa747001ebf2a02467c203 : 다운로드 스크립트– 3d2ec58f37c8176e0dbcc47ff93e5a76 : 다운로드 스크립트C&C 주소– 27.102.115[.]207:8088 : Black RAT, NukeSped 변종 Type 2– 27.102.118[.]204:8081 : Golang 다운로더– 84.38.132[.]67:8443 : NukeSped 변종 Type 1, Lilith RAT– 109.248.150[.]147:443 : TigerRat– 109.248.150[.]147:8080 : TigerRat– 109.248.150[.]147:8443 : TigerRat– 185.29.8[.]108:443 : TigerRat– 185.29.8[.]108:3443 : TigerRat– 185.29.8[.]108:4443 : TigerRat– 185.29.8[.]108:8080 : TigerRat– 185.29.8[.]108:8081 : Golang 다운로더– 185.29.8[.]108:8443 : TigerRat, NukeSped 변종 Type 1다운로드 주소– hxxp://27.102.128[.]152:8098/load.png : TigerRat– hxxp://27.102.118[.]204:6099/fav.ico : Golang 다운로더– hxxp://84.38.132[.]67:9479/fav.ico : User Adder, Lilith RAT– hxxp://84.38.132[.]67:9479/netpass.png : Network Password Recovery – NirSoft– hxxp://109.248.150[.]147:8585/load.png : TigerRat– hxxp://109.248.150[.]147:8585/load.html : 다운로드 스크립트– hxxp://109.248.150[.]147:8585/view.php : TigerRat– hxxp://185.29.8[.]108:8585/load.html : 다운로드 스크립트– hxxp://185.29.8[.]108:8585/view.php : TigerRat연관 IOC 및 관련 상세 분석 정보는 안랩의 차세대 위협 인텔리전스 플랫폼 ‘AhnLab TIP’ 구독 서비스를 통해 확인 가능하다.[필수] 개인정보 수집 및 이용 동의Δ[필수] 개인정보 수집 및 이용 동의Δ"
   },
   {
      "time": "2023-11-13",
      "title": "Sandworm Disrupts Power in Ukraine Using a Novel Attack Against Operational Technology | Mandiant",
      "text": " Explore our multi-vendor XDR platform, delivering Mandiant products and integrating with a range of leading security operations technology.Solve your toughest cyber security challenges with combinations of products and services.Mitigate threats, reduce risk, and get back to business with the help of leading experts.Mandiant specializes in cyber threat intelligence, offering products, services, and more to support our mission to defend against cyber crime.Get the latest insights from cyber security experts at the frontlines of threat intelligence and incident responseLearn more about us and our mission to help organizations defend against cyber crime. In late 2022, Mandiant responded to a disruptive cyber physical incident in which the Russia-linked threat actor Sandworm targeted a Ukrainian critical infrastructure organization. This incident was a multi-event cyber attack that leveraged a novel technique for impacting industrial control systems (ICS) / operational technology (OT). The actor first used OT-level living off the land (LotL) techniques to likely trip the victim’s substation circuit breakers, causing an unplanned power outage that coincided with mass missile strikes on critical infrastructure across Ukraine. Sandworm later conducted a second disruptive event by deploying a new variant of CADDYWIPER in the victim’s IT environment. This attack represents the latest evolution in Russia’s cyber physical attack capability, which has been increasingly visible since Russia’s invasion of Ukraine. The techniques leveraged during the incident suggest a growing maturity of Russia’s offensive OT arsenal, including an ability to recognize novel OT threat vectors, develop new capabilities, and leverage different types of OT infrastructure to execute attacks. By using LotL techniques, the actor likely decreased the time and resources required to conduct its cyber physical attack. While Mandiant was unable to determine the initial intrusion point, our analysis suggests the OT component of this attack may have been developed in as little as two months. This indicates that the threat actor is likely capable of quickly developing similar capabilities against other OT systems from different original equipment manufacturers (OEMs) leveraged across the world. Based on our analysis, the intrusion began on, or prior to, June 2022 and culminated in two disruptive events on October 10 and 12, 2022. While we were unable to identify the initial access vector into the IT environment, Sandworm gained access to the OT environment through a hypervisor that hosted a supervisory control and data acquisition (SCADA) management instance for the victim’s substation environment. Based on evidence of lateral movement, the attacker potentially had access to the SCADA system for up to three months. On October 10, the actor leveraged an optical disc (ISO) image named “a.iso” to execute a native MicroSCADA binary in a likely attempt to execute malicious control commands to switch off substations. The ISO file contained at least the following:Based on a September 23 timestamp of “lun.vbs”, there was potentially a two-month time period from when the attacker gained initial access to the SCADA system to when they developed the OT capability. Although we were not able to fully recover the ICS command execution implemented by the binary, we are aware that the attack resulted in an unscheduled power outage. Figure 1 contains a visualization of the execution chain resulting in the disruptive OT event.Two days after the OT event, Sandworm deployed a new variant of CADDYWIPER in the victim’s IT environment to cause further disruption and potentially to remove forensic artifacts. However, we note that the wiper deployment was limited to the victim’s IT environment and did not impact the hypervisor or the SCADA virtual machine. This is unusual since the threat actor had removed other forensic artifacts from the SCADA system in a possible attempt to cover their tracks, which would have been enhanced by the wiper activity. This could indicate a lack of coordination across different individuals or operational subteams involved in the attack.A deeper dive on the attack lifecycle and OT capability can be found in the Technical Analysis section of the blog post.This attack represents an immediate threat to Ukrainian critical infrastructure environments leveraging the MicroSCADA supervisory control system. Given Sandworm's global threat activity and the worldwide deployment of MicroSCADA products, asset owners globally should take action to mitigate their tactics, techniques, and procedures against IT and OT systems. Furthermore, our analysis of the activity suggests Russia would be capable of developing similar capabilities against other SCADA systems and programming languages beyond MicroSCADA and SCIL. We urge asset owners to review and implement the following recommendations to mitigate and detect this activity.This research was made possible thanks to the hard work of many people not listed on the byline. Mandiant would like to acknowledge the Security Service of Ukraine (SBU) for their continued partnership and contributions to this report as well as their on-going collaboration. This incident response engagement was funded through the UK’s Ukraine Cyber Programme (cross-government Conflict, Stability and Security Fund) and delivered by the United Kingdom’s Foreign, Commonwealth and Development Office.When leveraging GOGETTER, Sandworm utilized a Systemd service unit to maintain persistence on systems. A Systemd service unit allows for a program to be run under certain conditions, and in this case, it was used to execute the GOGETTER binary on reboot.The Systemd configuration file leveraged by Sandworm enabled the group to maintain persistence on systems. The value “WantedBy” defines when the program should be run; in the configuration used by Sandworm, the setting “multi-user.target” means that the program will be run when the host has reached a state when it will accept users logging on, for example after successful power on. This enables GOGETTER to maintain persistence across reboots. The “ExecStart” value specifies the path of the program to be run, which in this case was GOGETTER.When deploying GOGETTER, Mandiant observed Sandworm leverage Systemd service units designed to masquerade as legitimate or seemingly legitimate services. Sandworm utilized a novel technique to impact the OT environment by executing code within an End-of-Life (EOL) MicroSCADA control system and issuing commands that impacted the victim’s connected substations. Table 1 summarizes the malicious files containing the new OT capability. We note that given the attacker’s use of anti-forensics techniques, we were not able to recover all the artifacts from the intrusion. FilenameHashPurposea.isoUnknownContains attacker’s fileslun.vbs26e2a41f26ab885bf409982cb823ffd1Runs n.batn.batUnknownLikely runs native scilc.exe utilitys1.txtUnknownLikely contains SCIL commandsTo impact the OT systems, Sandworm accessed the hypervisor that hosted a SCADA management instance for the victim’s substation environment and leveraged an ISO image named \"a.iso\" as a virtual CD-ROM. The system was configured to permit inserted CD-ROMs to autorun. The ISO file, at minimum, contained the following files: \"lun.vbs\" and \"n.bat\" as both files are referenced within the D volume and therefore contained within “a.iso”. The inserted ISO led to at least the following command lines execution: Based on forensic analysis, we believe “lun.vbs” contents are the following (Figure 6):The contents in Figure 6 indicate that “lun.vbs” executes “n.bat”. Additional fragments recovered include text consistent with Windows command line execution (Figure 7). This fragment was identified by analyzing images from the host. Reconstruction of the host’s anti-virus logs indicates “lun.vbs” and “n.bat” were executed in close time proximity. Because of this and the reference to the attacker’s ISO folder path, we believe that the command fragment in Figure 7 is likely the contents of “n.bat”.The syntax of the command fragment includes “scilc.exe”, a native utility that is part of the MicroSCADA software suite. The utility is located in the “\\sc\\prog\\exec” folder within the MicroSCADA installation directory, amongst other utilities, libraries, and resources used by MicroSCADA. The impacted MicroSCADA system was running an EOL software version that allowed default access to the SCIL-API. The “-do” flag specifies a SCIL program file to execute (Figure 8). Lastly, the command supplies a file named “s1.txt” in the \"pack\\scil\\\" folder of the attacker's ISO. We assess \"pack\\scil\\s1.txt\" is likely a file containing SCIL commands the attackers executed in MicroSCADA. This file was unrecoverable at the time of analysis.While we were unable to identify the SCIL commands executed, we believe they were probably commands to open circuit breakers in the victim’s substation environments. The SCIL commands would have caused the MicroSCADA server to relay the commands to the substation RTUs via either the IEC-60870-5-104 protocol for TCP/IP connections or the IEC-60870-5-101 protocol for serial connections.Two days following the OT activity, Sandworm deployed a new variant of CADDYWIPER throughout the IT environment. This CADDYWIPER variant, compiled in October 2022, contains some minor functionality improvements that allow threat actors to resolve functions at runtime. We have observed CADDYWIPER deployed across several verticals in Ukraine, including the government and financial sectors, throughout Russia’s invasion of Ukraine.Sandworm deployed CADDYWIPER in this operation via two Group Policy Objects (GPO) from a Domain Controller using TANKTRAP. TANKTRAP is a utility written in PowerShell that utilizes Windows group policy to spread and launch a wiper. We have observed TANKTRAP being used with other disruptive tools including NEARMISS, SDELETE, PARTYTICKET, and CADDYWIPER. These group policies contained instructions to copy a file from a server to the local hard drive and to schedule a task to run the copied file at a particular time.Both TANKTRAP GPOs deployed CADDYWIPER from a staged directory to systems as msserver.exe. CADDYWIPER was then executed as a scheduled task at a predetermined time. ItemValueTask NameqAWZeLegacy Task NameQcWBXCommand to RunC:\\Windows\\msserver.exeTriggerRun at 2022-10-12 16:50:40ItemValueTask NameQJKWtLegacy Task NamezJMwYCommand to RunC:\\Windows\\msserver.exeTriggerRun at 2022-10-12 17:15:59In this incident, the attacker leveraged an EOL version of the MicroSCADA supervisory control system. The SCIL-API interface in MicroSCADA has been disabled-by-default since the release of MicroSCADA 9.4 in 2014. If required to continue using the interface, asset owners can refer to MRK511518 MicroSCADA X Cyber Security Deployment Guideline on how to harden the MicroSCADA. Please contact the Hitachi Energy MicroSCADA support team to obtain the documentation. We note that the MicroSCADA control system became a Hitachi Energy product in 2022 after a divestiture from ABB. Asset owners should reference both vendors in asset inventories and manual asset inspections to determine if the product is present in any OT environments.Harden MicroSCADA and other SCADA management hosts:Monitor MicroSCADA systems and other SCADA management systems for:IndicatorDescription82.180.150[.]197Source IP address for requests to Neo-REGEORG 176.119.195[.]113Source IP address for requests to Neo-REGEORG 176.119.195[.]115Source IP address for requests to Neo-REGEORG185.220.101[.]58Source IP address for requests to Neo-REGEORG190.2.145[.]24C2 for GOGETTER Mozilla/5.0 (X11; Linux x86_64; rv:38.0) Gecko/20100101 Firefox/38.0User agent for requests to Neo-REGEORG Mozilla/5.0 (X11; Linux x86_64; rv:91.0) Gecko/20100101 Firefox/91.0User agent for requests to Neo-REGEORGFile NameMD5 HashTypeFunctions.php3290cd8f948b8b15a3c53f8e7190f9b0Neo-REGEORGcloud-onlinecea123ebf54b9d4f8811a47134528f12GOGETTERlun.vbs26e2a41f26ab885bf409982cb823ffd1Runs n.batn.batUNKNOWNLikely runs scilc.exea.isoUNKNOWNLikely contains attacker filesmsserver.exe / lhh.exeb2557692a63e119af0a106add54950e6CADDYWIPERFiles.xmlNot ApplicablePart of TANKTRAP Group Policy; File CopyScheduledTasks.xml61c245a073bdb08158a3c9ad0219dc23Part of TANKTRAP Group Policy; TaskScheduledTasks.xml82ab2c7e4d52bb2629aff200a4dc6630Part of TANKTRAP Group Policy; Tasks1.txtUNKNOWNLikely contains SCIL commandsrule M_Methodology_MicroSCADA_SCILC_Strings{     meta:          author = \"Mandiant\"          date = \"2023-02-13\"          description = \"Searching for files containing strings associated with the MicroSCADA Supervisory Control Implementation Language (SCIL) scilc.exe binary.\"           disclaimer = \"This rule is for hunting purposes only and has not been tested to run in a production environment.\"      strings:          $s1 = \"scilc.exe\" ascii wide          $s2 = \"Scilc.exe\" ascii wide          $s3 = \"SCILC.exe\" ascii wide          $s4 = \"SCILC.EXE\" ascii wide      condition:          filesize < 1MB and          any of them}rule M_Hunting_MicroSCADA_SCILC_Program_Execution_Strings{     meta:          author = \"Mandiant\"          date = \"2023-02-13\"          description = \"Searching for files containing strings associated with execution of the MicroSCADA Supervisory Control Implementation Language (SCIL) scilc.exe binary.\"           disclaimer = \"This rule is for hunting purposes only and has not been tested to run in a production environment.\"      strings:          $s = \"scilc.exe -do\" nocase ascii wide      condition:          filesize < 1MB and           all of them}rule M_Methodology_MicroSCADA_Path_Strings{     meta:          author = \"Mandiant\"          date = \"2023-02-27\"          description = \"Searching for files containing references to MicroSCADA filesystem path containing native MicroSCADA binaries and resources.\"           disclaimer = \"This rule is for hunting purposes only and has not been tested to run in a production environment.\"      strings:          $s1 = \"sc\\\\prog\\\\exec\" nocase ascii wide      condition:          filesize < 1MB and          $s1}rule M_Hunting_VBS_Batch_Launcher_Strings{     meta:          author = \"Mandiant\"          date = \"2023-02-13\"          description = \"Searching for VBS files used to launch a batch script.\"          disclaimer = \"This rule is for hunting purposes only and has not been tested to run in a production environment.\"      strings:          $s1 = \"CreateObject(\\\"WScript.Shell\\\")\" ascii          $s2 = \"WshShell.Run chr(34) &\" ascii          $s3 = \"& Chr(34), 0\" ascii          $s4 = \"Set WshShell = Nothing\" ascii          $s5 = \".bat\" ascii         condition:          filesize < 400 and           all of them}rule M_Hunting_APT_Webshell_PHP_NEOREGEORG {     meta:          author = \"Mandiant\"          description = \"Searching for REGEORG webshells.\"          disclaimer = \"This rule is for hunting purposes only and has not been tested to run in a production environment.\"      strings:          $php = \"<?php\" nocase          $regeorg1 = {24 72 61 77 50 6f 73 74 44 61 74 61 20 3d 20 66 69 6c 65 5f 67 65 74 5f 63 6f 6e 74 65 6e 74 73 28 22 70 68 70 3a 2f 2f 69 6e 70 75 74 22 29 3b}          $regeorg2 = {20 24 77 72 69 74 65 42 75 66 66 20 3d 20 24 5f 53 45 53 53 49 4f 4e 5b 24 77 72 69 74 65 62 75 66 5d 3b}          $regeorg3 = {20 75 73 6c 65 65 70 28 35 30 30 30 30 29 3b}          $regeorg4 = {20 24 61 72 68 5f 6b 65 79 20 3d 20 70 72 65 67 5f 72 65 70 6c 61 63 65 28 24 72 78 5f 68 74 74 70 2c 20 27 27 2c 20 24 6b 65 79 29 3b}          $regeorg5 = {20 24 72 75 6e 6e 69 6e 67 20 3d 20 24 5f 53 45 53 53 49 4f 4e 5b 24 72 75 6e 5d 3b}          $regeorg6 = {20 24 72 78 5f 68 74 74 70 20 3d 20 27 2f 5c 41 48 54 54 50 5f 2f 27 3b}      condition:          (5 of ($regeorg*)) and          $php}rule M_Hunting_GOGETTER_SystemdConfiguration_1{     meta:          author = \"Mandiant\"          description = \"Searching for Systemd Unit Configuration Files but with some known filenames observed with GOGETTER\"          disclaimer = \"This rule is for hunting purposes only and has not been tested to run in a production environment.\"      strings:          $a1 = \"[Install]\" ascii fullword          $a2 = \"[Service]\" ascii fullword          $a3 = \"[Unit]\" ascii fullword          $v1 = \"Description=\" ascii           $v2 = \"ExecStart=\" ascii           $v3 = \"Restart=\" ascii           $v4 = \"RestartSec=\" ascii           $v5 = \"WantedBy=\" ascii           $f1 = \"fail2ban-settings\" ascii fullword          $f2 = \"system-sockets\" ascii fullword          $f3 = \"oratredb\" ascii fullword          $f4 = \"cloud-online\" ascii fullword      condition:          filesize < 1MB and (3 of ($a*)) and (3 of ($v*)) and (1 of ($f*))}title: MicroSCADA SCILC Command Executiondescription: Identification of Events or Host Commands that are related to the MicroSCADA SCILC programming language and specifically command executionauthor: Mandiantdate: 2023/02/27logsource:    product: windows    service: securitydetection:    selection:        NewProcessName|endswith:            - \\scilc.exe        CommandLine|contains:            - -do    condition: selectionfalsepositives:    - Red Teamlevel: Hightags:    - attack.execution    - attack.T1059rule M_YARAL_Methodology_ProcessExec_SCILC_Do_1{    meta:        author = \"Mandiant\"        description = \"YARA-L rule hunting for instances of process execution of the scilc.exe process with -do parameters. This is intended to be a hunting rule. Analysts would need to verify the legitimacy of the file passed in the -do parameter.\"        severity = \"Low\"        reference = \" https://cloud.google.com/chronicle/docs/detection/yara-l-2-0-overview\"     events:        $e.metadata.event_type = \"PROCESS_LAUNCH\"        $e.target.process.command_line = /\\s+\\-do\\s+[^\\-\\s]+/ nocase        $e.target.process.file.full_path = /scilc\\.exe$/ nocase     condition:        $e}TacticTechniqueProcedureInitial AccessT0847: Replication Through Removable MediaSandworm accessed a hypervisor that hosted a SCADA management instance for the victim’s substation environment and leveraged an ISO image named \"a.iso\" as a logical CD-ROM inserted into the CD-ROM drive of the SCADA virtual machine. The system was configured to permit inserted CD-ROMs to autorun.ExecutionT0807: Command-Line InterfaceSandworm leveraged malicious files that led to at least the following command lines execution:   Additional fragments recovered include text consistent with Windows command line execution: ExecutionT0871: Execution Through APISandworm utilized the native MicroSCADA “scilc.exe” binary to execute an external SCIL program via the SCIL-API.ExecutionT0853: ScriptingSandworm leveraged Visual Basic Scripts, such as “lun.vbs”. The contents of “lun.vbs” include the following: Set WshShell = CreateObject(“WScript.Shell”)WshShell.Run chr(34) & “pack\\n.bat” & Chr(34), 0Set WshShell = NothingEvasionT0872: Indicator Removal on HostSandworm deployed CADDYWIPER malware and deleted files to remove forensic artifacts.Inhibit Response FunctionT0809: Data DestructionSandworm deployed CADDYWIPER to wipe all files, any mapped drives, and the physical drive partition of impacted systems. The actor deleted files related to the OT capability. Impair Process ControlT0855: Unauthorized Command MessageSandworm utilized “scilc.exe” to execute unauthorized SCIL commands that would have caused the MicroSCADA server to relay the commands to the substation RTUs via either the IEC-60870-5-104 protocol for TCP/IP connections or the IEC-68750-5-101 protocol for serial connections.ImpactT0831: Manipulation of ControlSandworm caused a manipulation of control of the power distribution system via unauthorized SCIL commands. These were likely commands to open circuit breakers in the victim’s substation environments.VIDTitleA106-441Malicious File Transfer - REGEORG.NEO, Download, Variant #1A106-442Malicious File Transfer - Sandworm, GOGETTER, Download, Variant #5A106-443Web Shell Activity - REGEORG.NEO, Initial Connection, Variant #1A106-440Malicious File Transfer - CADDYWIPER, Download, Variant #6A106-438Host CLI - Sandworm, GOGETTER, Systemd ServiceA106-446Host CLI - Sandworm, CADDYWIPER, Scheduled Task, Variant #2A106-439Host CLI - Sandworm, CADDYWIPER, Scheduled Task, Variant #1A106-437Protected Theater - CADDYWIPER, Execution, Variant #2S100-280Malicious Activity Scenario - Sandworm Disrupts Power Using a Novel Attack Against Operational Technology SystemsGet the Google Cloud Cyberseurity Forecast 2024 report to explore the latest trends on the horizon.Mandiant experts are ready to answer your questions.© Copyright 2023 Mandiant. All rights reserved."
   }
]