[
   {
      "time": "2022-07-08",
      "title": "CERT-UA",
      "text": " "
   },
   {
      "time": "2022-07-08",
      "title": "North Korean State-Sponsored Cyber Actors Use Maui Ransomware to Target the Healthcare and Public Health Sector | CISA",
      "text": " An official website of the United States governmentHere’s how you know\nOfficial websites use .gov\n A .gov website belongs to an official government organization in the United States.\n              \nSecure .gov websites use HTTPS\n A lock (LockA locked padlock) or https:// means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n              SearchThis joint CSA provides information—including tactics, techniques, and procedures (TTPs) and indicators of compromise (IOCs)—on Maui ransomware obtained from FBI incident response activities and industry analysis of a Maui sample. The FBI, CISA, and Treasury urge HPH Sector organizations as well as other critical infrastructure organizations to apply the recommendations in the Mitigations section of this CSA to reduce the likelihood of compromise from ransomware operations. Victims of Maui ransomware should report the incident to their local FBI field office or CISA. Since May 2021, the FBI has observed and responded to multiple Maui ransomware incidents at HPH Sector organizations. North Korean state-sponsored cyber actors used Maui ransomware in these incidents to encrypt servers responsible for healthcare services—including electronic health records services, diagnostics services, imaging services, and intranet services. In some cases, these incidents disrupted the services provided by the targeted HPH Sector organizations for prolonged periods. The initial access vector(s) for these incidents is unknown.During encryption, Maui creates a temporary file for each file it encrypts using GetTempFileNameW(). Maui uses the temporary to stage output from encryption. After encrypting files, Maui creates maui.log, which contains output from Maui execution. Actors likely exfiltrate [TA0010] maui.log and decrypt the file using associated decryption tools.See table 1 for Maui ransomware IOCs obtained from FBI incident response activities since May 2021. \n Table 1: Maui Ransomware IOCs Attribution to North Korean State-Sponsored Cyber ActorsThe FBI assesses North Korean state-sponsored cyber actors have deployed Maui ransomware against Healthcare and Public Health Sector organizations. The North Korean state-sponsored cyber actors likely assume healthcare organizations are willing to pay ransoms because these organizations provide services that are critical to human life and health. Because of this assumption, the FBI, CISA, and Treasury assess North Korean state-sponsored actors are likely to continue targeting HPH Sector organizations. The FBI, CISA, and Treasury urge HPH Sector organizations to:In addition, the FBI, CISA, and Treasury urge all organizations, including HPH Sector organizations, to apply the following recommendations to prepare for, mitigate/prevent, and respond to ransomware incidents.If a ransomware incident occurs at your organization:Note: the FBI, CISA, and Treasury strongly discourage paying ransoms as doing so does not guarantee files and records will be recovered and may pose sanctions risks. The FBI, CISA, and Treasury would like to thank Stairwell for their contributions to this CSA. July 6, 2022: Initial Version |July 7, 2022: Added STIX"
   },
   {
      "time": "2022-07-08",
      "title": "New stealthy OrBit malware steals data from Linux devices",
      "text": " A newly discovered Linux malware is being used to stealthily steal information from backdoored Linux systems and infect all running processes on the machine.Dubbed OrBit by Intezer Labs security researchers who first spotted it, this malware hijacks shared libraries to intercept function calls by modifying the LD_PRELOAD environment variable on compromised devices.While it can gain persistence using two different methods to block removal attempts, OrBit can also be deployed as a volatile implant when copied in shim-memory.It can also hook various functions to evade detection, control process behavior, maintain persistence by infecting new processes, and hide network activity that would reveal its presence.For instance, once it injects into a running process, OrBit can manipulate its output to hide any traces of its existence by filtering out what gets logged.\"Once the malware is installed it will infect all of the running processes, including new processes, that are running on the machine.\"OrBit is not the first highly-evasive Linux malware that has surfaced recently, capable of using similar approaches to fully compromise and backdoor devices.Both these strains use BPF (Berkeley Packet Filter) hooking functionality to monitor and manipulate network traffic which helps hide their communication channels from security tools.Even though not the first or the most original malware strain targeting Linux lately, OrBit still comes with its share of capabilities that set it apart from other threats.\"This malware steals information from different commands and utilities and stores them in specific files on the machine. Besides, there is an extensive usage of files for storing data, something that was not seen before,\" Fishbein added.\"What makes this malware especially interesting is the almost hermetic hooking of libraries on the victim machine, that allows the malware to gain persistence and evade detection while stealing information and setting SSH backdoor.\""
   },
   {
      "time": "2022-07-08",
      "title": "Disneyland investigating compromised Facebook and Instagram accounts",
      "text": " Disneyland officials are investigating an incident that occurred on Thursday morning in which the Facebook and Instagram accounts of the theme park were hacked and used to send several offensive messages.“Disneyland Resort’s Facebook and Instagram accounts were compromised early this morning,” a Disneyland spokesperson told The Record. “We worked quickly to remove the reprehensible content, secure our accounts, and our security teams are conducting an investigation.” On Thursday morning, a hacker calling themselves “David Do” posted several pictures of a person with expletive-laden messages attached. The attacker claimed to be a “super hacker” and used the n-word as well as the f-word repeatedly in the messages. The posts were removed within a few hours after the account, which has about 8.4 million followers, was taken down briefly.Arctic Wolf vice president of strategy Ian McShane said the incident was an illustration of how the motives of some cybercriminals go beyond financial gain and data collection – with many keen to just inflict reputation damage.“High traffic-high follower accounts will always be a target for threat actors – both sophisticated and the occasional rogue, low-level amateur,” McShane said. “While the reasons behind the compromise and messages are yet to be fully understood, the widespread shock from Disney's 8.4 million followers should be a lesson to organizations of all sizes that, while social media accounts don't contain their most crucial data, they can still be used to disrupt and harm a company's operations.” The breach of the Army’s Twitter and YouTube accounts that occurred earlier today has been resolved and an investigation is underway.  The Army takes information security extremely seriously and until their investigation is complete it would be inappropriate to comment further.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-08",
      "title": "OpenSSL Patches Remote Code Execution Vulnerability - SecurityWeek",
      "text": " Hi, what are you looking for?OpenSSL has issued an urgent advisory to warn of a memory corruption vulnerability that exposes servers to remote code execution attacks.The vulnerability, tracked as CVE-2022-2274, was introduced in OpenSSL 3.0.4 and could potentially allow malicious hackers to launch remote code attacks on unpatched SSL/TLS server side devices.ByFlipboardRedditWhatsappWhatsappEmailThe OpenSSL 3.0.4 release introduced a serious bug in the RSA implementation for X86_64 CPUs supporting the AVX512IFMA instructions.\n\nThis issue makes the RSA implementation with 2048 bit private keys incorrect on such machines and memory corruption will happen during the computation. As a consequence of the memory corruption an attacker may be able to trigger a remote code execution on the machine performing the computation.\nAdvertisement. Scroll to continue reading.\n\n\nSSL/TLS servers or other servers using 2048 bit RSA private keys running on machines supporting AVX512IFMA instructions of the X86_64 architecture are affected by this issue.\n\nThis issue makes the RSA implementation with 2048 bit private keys incorrect on such machines and memory corruption will happen during the computation. As a consequence of the memory corruption an attacker may be able to trigger a remote code execution on the machine performing the computation.\nAdvertisement. Scroll to continue reading.\n\n\nSSL/TLS servers or other servers using 2048 bit RSA private keys running on machines supporting AVX512IFMA instructions of the X86_64 architecture are affected by this issue.\nThis issue makes the RSA implementation with 2048 bit private keys incorrect on such machines and memory corruption will happen during the computation. As a consequence of the memory corruption an attacker may be able to trigger a remote code execution on the machine performing the computation.\nAdvertisement. Scroll to continue reading.\n\n\nSSL/TLS servers or other servers using 2048 bit RSA private keys running on machines supporting AVX512IFMA instructions of the X86_64 architecture are affected by this issue.\nAdvertisement. Scroll to continue reading.\n\n\nSSL/TLS servers or other servers using 2048 bit RSA private keys running on machines supporting AVX512IFMA instructions of the X86_64 architecture are affected by this issue.\nSSL/TLS servers or other servers using 2048 bit RSA private keys running on machines supporting AVX512IFMA instructions of the X86_64 architecture are affected by this issue.\nRyan Naraine is Editor-at-Large at SecurityWeek and host of the popular Security Conversations podcast series. He is a security community engagement expert who has built programs at major global brands, including Intel Corp., Bishop Fox and GReAT. Ryan is a founding-director of the Security Tinkerers non-profit, an advisor to early-stage entrepreneurs, and a regular speaker at security conferences around the world.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...Zero trust is not a replacement for identity and access management (IAM), but is the extension of IAM principles from people to everyone and...A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The CRYSTALS-Kyber public-key encryption and key encapsulation mechanism recommended by NIST for post-quantum cryptography has been broken using AI combined with side channel attacks.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-08",
      "title": "Microsoft Warns of  '8220 Group' Targeting Linux Servers - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-07-08",
      "title": "QNAP warns of new Checkmate ransomware targeting NAS devices",
      "text": " Network-attached storage (NAS) vendor QNAP warned customers to secure their devices against attacks using Checkmate ransomware to encrypt data.QNAP says the attacks are focused on Internet-exposed QNAP devices with the SMB service enabled and accounts with weak passwords that can easily be cracked in brute-force attacks.\"Preliminary investigation indicates that Checkmate attacks via SMB services exposed to the internet, and employs a dictionary attack to break accounts with weak passwords.\"Checkmate is a recently discovered ransomware strain, first deployed in attacks around May 28, that appends a .checkmate extension to encrypted files and drops a ransom note named !CHECKMATE_DECRYPTION_README.Based on ransom notes seen so far by BleepingComputer, the attackers ask victims to pay $15,000 worth of bitcoins to get a decryptor and a decryption key.According to QNAP, the threat actors behind this campaign will remotely login into devices exposed to remote access with the help of accounts compromised in dictionary attacks.After gaining access, they start encrypting files in shared folders (however, victim reports say that all the data is encrypted).The company warned customers not to expose their NAS devices to Internet access and to use VPN software to reduce the attack surface and block threat actors' attempts to log in using compromised accounts.QNAP users were also urged to review all their NAS accounts immediately and ensure they're using strong passwords, back up their files, and take backup snapshots regularly to restore their data.You should also disable SMB 1 by logging into QTS, QuTS hero, or QuTScloud, going to Control Panel > Network & File > Win/Mac/NFS/WebDAV > Microsoft Networking, and selecting \"SMB 2 or higher\" after clicking on Advanced Options.QNAP recommends updating your NAS device's firmware to the latest version by logging into QTS, QuTS hero, or QuTScloud as administrator, and hitting \"Check for Update\" under \"Live Update\" from Control Panel > System > Firmware Update.\"We are thoroughly investigating the case and will provide further information as soon as possible,\" QNAP added in today's advisory."
   },
   {
      "time": "2022-07-08",
      "title": "Online programming IDEs can be used to launch remote cyberattacks",
      "text": " Security researchers are warning that hackers can abuse online programming learning platforms to remotely launch cyberattacks, steal data, and scan for vulnerable devices, simply by using a web browser.At least one such platform, known as DataCamp, allows threat actors to compile malicious tools, host or distribute malware, and connect to external services.DataCamp provides integrated development environments (IDEs) to close to 10 million users that want to learn data science using various programming languages and technologies (R, Python, Shell, Excel, Git, SQL).As part of the platform, DataCamp users gain access to their own personal workspace that includes an IDE for practicing and executing custom code, uploading files, and connecting to databases.The IDE also allows users to import Python libraries, download and compile respositories, and then execute compiled programs. In other words, anything an industrious threat actor needs to launch a remote attack directly from within the DataCamp platform.After responding to an incident where a threat actor might have used DataCamp's resources to hide the origin of the attack, researchers at cybersecurity company Profero decided to investigate this scenario.They found that DataCamp's advanced online Python IDE offered users the ability to install third-party modules that allowed connecting to an Amazon S3 storage bucket.The researcher says that the activity coming from DataCamp is likely to pass by undetected and \"even those who further inspect the connection would hit a dead end because there is no known definitive source listing the IP range of Datacamp.\"The investigation into this attack scenario went further and the researchers tried to import or install tools typically used in a cyberattack, such as the Nmap network mapping tool.It was not possible to install Nmap directly but DataCamp allowed compiling it and executing the binary from the compilation directory.Profero's Incident Response Team also tested if they could upload files using a terminal and get a link to share them. They were able to upload EICAR - the standard file for testing detection from antivirus solutions, and get a link for distributing it.Profero's report today notes that the download link could be used to download additional malware to an infected system by using a simple web request.Furthermore, these download links can be abused in other types of attacks, such as hosting malware for phishing attacks, or by malware to download additional payloads.BleepingComputer reached out to DataCamp for comment about Profero's research and a spokesperson said that \"there is inherently a risk that some individuals may attempt to abuse our systems\" because the platform provides \"a live computing environment.\"DataCamp states in their Terms of Service that abusing the platform is forbidden but threat actors are not the users to respect the rules.DataCamp said that they \"have taken reasonable measures\" to prevent abuse from impacting other users on the platform and that they are monitoring their systems for misbehavior.\"In addition, in order to prevent individual malpractice, we have implemented a responsible disclosure policy and monitor our systems on an ongoing basis to mitigate risk\" - DataCampAlthough Profero did not extend their research to other learning platforms, the researchers believe that DataCamp is not the only one that hackers could abuse.The restrictions apply to resources that can be used, bandwidth, and blocking potentially malicious applications.The Binder representative said that they are willing to add more safeguards in the BinderHub source code if Profero's report shows that further steps are necessary.Profero encourages providers of online code learning platforms to keep a list of outgoing customer traffic gateways and make it publicly accessible so that defenders can locate the origin of an attack, should it be the case.The company's recommendation also includes implementing a safe and easy way for users to submit abuse reports."
   },
   {
      "time": "2022-07-08",
      "title": "https://www.cyberscoop.com/russian-information-operations-dividing-west-ukraine/",
      "text": " "
   },
   {
      "time": "2022-07-08",
      "title": "Over 1,200 NPM Packages Found Involved in \"CuteBoi\" Cryptomining Campaign",
      "text": " Researchers have disclosed what they say could be an attempt to kick-off a new large-scale cryptocurrency mining campaign targeting the NPM JavaScript package repository.All the released packages in question are said to harbor near-identical source code from an already existing package named eazyminer that's used to mine Monero by means of utilizing unused resources on web servers.One notable modification entails the URL to which the mined cryptocurrency should be sent, although installing the rogue modules will not bring about a negative effect.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-07-08",
      "title": "AsyncRAT Being Distributed to Unsecured MySQL Servers - ASEC BLOG",
      "text": " The ShadowServer foundation has recently released a report showing that there are about 3.6 million MySQL servers exposed to outside. Along with MS-SQL server, MySQL server is one of the main database servers that provides the feature of managing large amounts of data in a corporate or user environment. MS-SQL is mainly used in Windows environments, but MySQL is still being used by many in Linux environments.ASEC analysis team is constantly monitoring malware distributed to unsecured database servers. In Windows environment, the majority of the attacks were done against MS-SQL server, and this can be confirmed in AhnLab’s ASD log. Various attack cases were introduced in the previous ASEC blogs, such as Cobalt Strike, Remcos RAT, and CoinMiner.cjdmacjdmwkAccording to AhnLab’s ASD log, the majority of the malware distributed to unsecured MySQL servers are variant malware of Gh0st RAT, including Gh0stCringe above. In this blog, an analysis of attack methods used against unsecured MySQL servers and AsyncRAT found in these recent attacks will be discussed.First, attackers conduct scanning to search for a target to attack. Among externally exposed systems, the scanner searches for system that has 3306/TCP port revealed, used by MySQL server. After then, upon using brute-force attacks and dictionary attacks against the system, attackers can obtain root user account credentials if the system was being managed in improper ways.Normally, multiple methods to execute OS commands are provided in MS-SQL environment. The most well-known command is xp_cmdshell, and there are other various methods such as OLE Store Procedure, MS-SQL Agent Jobs, Extended Stored Procedure, and CLR Stored Procedure. Being able to execute a user’s command using OS commands (e.g. cmd) or powershell means that the control over the system can be obtained.In other words, logging in to the data server can execute the Windows command, eventually gaining control of the system. Thus, for security policy reasons, admin accounts should be able to use the features above. Also, additional security settings need to be changed.MySQL does not support direct OS commands such as xp_cmdshell like MS-SQL, but it can eventually be executed by an attacker using a feature called User Defined Function (UDF). UDF is an implementation of the features desired by the user in DLL, and the attackers upload a UDF library, or DLL, containing malicious commands to the infected system and then load it into the MySQL server. After then, malicious commands can be delivered to an infected system by executing the command explained above.The following are features exported by Metasploit’s UDF library DLL file, including features such as command execution (sys_exec) and environment variable return (sys_get).Taking a look into the infection log of the actual attack target system, malicious UDF DLL is also installed along with AsyncRAT (see Figure below). This malware only has the feature of simply executing the command received from the attacker.As this malware has continuously been used in the past, it has infected various systems. The following are the path names found in the infection log, and the history created in the plugin folder where UDF is installed by default can be found.Since the system is in a unsecured environment, there are already cases in which it was infected with malware by numerous attacks. Thus, we do not know whether it was installed by attacker that uses AsyncRAT, or its relations.AsyncRAT used in the attack is an open-source RAT malware developed with .NET, and it can perform various malicious actions such as remote shell, keylogging, and account credentials theft by receiving the attacker’s commands from the C&C server.As AsyncRAT is open-source, it is being distributed in various ways. Recently, it disguised itself as a crack program of commercial software and was distributed via malicious websites. In the past, it was distributed via spam email. In addition, there were cases of distribution of illegal pornography through Discord, which was introduced in the previous ASEC blog. Typical attacks that target database servers (MS-SQL, MySQL servers) include brute force attacks and dictionary attacks on systems where account credentials are poorly being managed. Although it seems like these methods make up the majority of the attacks, there can be vulnerability attacks against systems where their vulnerability has not been patched.Because of this, administrators should use passwords that are difficult to guess for their accounts and change them periodically to protect the database server from brute force attacks and dictionary attacks, and update to the latest patch to prevent vulnerability attacks. Administrators should also use security programs such as firewalls for database servers accessible from outside to restrict access of external attackers.AhnLab’s anti-malware software, V3, detects and blocks the malware using the following aliases:[File Detection]– Trojan/Win32.RL_Generic.C4239825 (2020.11.26.01)– Trojan/Win32.Inject.C500093 (2014.08.08.04)[IOC]MD5AsyncRAT– 46d552cd04ff2b41be06ba1478a97cedUDF DLL– f23b2905bf872b4a6495cecde290fd2dDownload URLsAsyncRAT– hxxp://154.19.203[.]208/Mini.exeC&CAsyncRAT– 154.19.203[.]208:7707– 154.19.203[.]208:8808– 154.19.203[.]208:6606Subscribe to AhnLab’s next-generation threat intelligence platform ‘AhnLab TIP’ to check related IOC and detailed analysis information.[Important] Consent to Collection and Use of Personal InformationΔ[Important] Consent to Collection and Use of Personal InformationΔ[…] – [ASEC Blog] Cobalt Strike Being Distributed to Unsecured MS-SQL Servers– [ASEC Blog] Cobalt Strike Being Distributed to Unsecured MS-SQL Servers (2)– [ASEC Blog] Coin Miner Being Distributed to Unsecured MS-SQL Servers– [ASEC Blog] AsyncRAT Malware Being Distributed to Unsecured MS-SQL Servers […][…] Based on the information from our AhnLab Smart Defense (ASD) logs, it appears that a majority of the malware strains targeting vulnerable MySQL servers are variants of Gh0st RAT. It is worth noting that in addition to these Gh0st RAT variants, various other types of malware can potentially be utilized as well. For example, a previous ASEC blog post covered an incident involving the use of AsyncRAT. [1] […][…] Based on the information from our AhnLab Smart Defense (ASD) logs, it appears that a majority of the malware strains targeting vulnerable MySQL servers are variants of Gh0st RAT. It is worth noting that in addition to these Gh0st RAT variants, various other types of malware can potentially be utilized as well. For example, a previous ASEC blog post covered an incident involving the use of AsyncRAT. [1] […]"
   }
]