[
   {
      "time": "2022-09-06",
      "title": "Irish watchdog fines Instagram 405M euros in teen data case | AP News",
      "text": " Copyright 2023 The Associated Press. All Rights Reserved.FILE - This Friday, Aug. 23, 2019 photo shows the Instagram app icon on the screen of a mobile device in New York. Ireland’s Data Protection Commission said by email on Monday, Sept. 5, 2022, that it made a final decision on Friday to fine the company 405 million euros ($402 million) for mishandling teenagers’ personal data. (AP Photo/Jenny Kane, file).LONDON (AP) — Irish regulators are slapping Instagram with a big fine after an investigation found the social media platform mishandled teenagers’ personal information in violation of strict European Union data privacy rules. Ireland’s Data Protection Commission said by email Monday that it made a final decision last week to fine the company 405 million euros ($402 million), though the full details won’t be released until next week.Instagram parent Meta, which also owns Facebook, said that while it had “engaged fully” with regulators throughout the investigation, “we disagree with how this fine was calculated and intend to appeal it.” \nThe investigation began after a data scientist found that users, including those under 18, were switching to business accounts and had their contact information displayed on their profiles. Users were apparently doing it to see statistics on how many likes their posts were getting after Instagram started removing the feature from personal accounts in some countries to help with mental health.Instagram said the inquiry focused on “old settings” that were updated more than a year ago, and it has since released new privacy features for teens, including automatically setting their accounts to private when they join. “We’re continuing to carefully review the rest of the decision,” the company said. Under the EU’s data privacy rules, the Irish watchdog is the lead regulator for many U.S. tech companies with European headquarters in Dublin. Copyright 2023 The Associated Press. All Rights Reserved."
   },
   {
      "time": "2022-09-06",
      "title": "FBI: Hackers use DeFi Bugs to Steal Cryptocurrency - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-09-06",
      "title": "20K Users' Data was Stolen by Blackbyte Ransomware Group - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-09-06",
      "title": "QNAP patches zero-day used in new Deadbolt ransomware attacks",
      "text": " QNAP is warning customers of ongoing DeadBolt ransomware attacks that started on Saturday by exploiting a zero-day vulnerability in Photo Station.The company has patched the security flaw but attacks continue today.The attacks were widespread, with the ID Ransomware service seeing a surge in submissions on Saturday and Sunday.QNAP released Photo Station security updates 12 hours after DeadBolt began using the zero-day vulnerability in attacks, urging NAS customers to immediately update Photo Station to the newest version.The following security updates fix the vulnerability:Alternatively, QNAP suggests users replace Photo Station with QuMagie, a safer photo storage management tool for QNAP NAS devices.“We strongly urge that their QNAP NAS should not be directly connected to the internet. We recommend users to make use of the myQNAPcloud Link feature provided by QNAP, or enable the VPN service.” - QNAP.Applying the security updates will prevent the DeadBolt ransomware and other threat actors from exploiting the vulnerability and encrypting devices. However, NAS devices should never be publicly exposed to the Internet and instead placed behind a firewall.Finally, it is recommended to use strong passwords on all NAS user accounts and take regular snapshots to prevent data loss in the case of attacks.In most of these attacks, DeadBolt demanded a payment of just over a thousand USD from impacted users in exchange for a working decryptor.However, other NAS ransomware groups demand more significant amounts from their victims."
   },
   {
      "time": "2022-09-06",
      "title": "\r\n\tSharkBot Malware Resurfaces on Google Play to Steal Users' Credentials - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe new version of SharkBot reportedly targets the banking credentials of Android users via apps that have collectively counted 60,000 installations.These apps, which have now been removed by the Play Store, are 'Mister Phone Cleaner' and 'Kylhavy Mobile Security'.\"Instead, this new version asks the victim to install the malware as a fake update for the antivirus to stay protected against threats.\"And while the method makes it more difficult for the malware to get installed (as it depends on the user interaction), it is now more challenging to detect before being published in Google Play Store since it doesn't require accessibility permissions, which are often suspicious.Further, the dropper has also removed the 'Direct Reply' feature, which is used on Android to reply to the notifications received on the infected device automatically. This is another feature that needs suspicious permissions and which, once removed, makes the malware more difficult to detect.\"On the 16th of August 2022, Fox IT's Threat Intelligence team observed new command-and-control servers (C2s) that were providing a list of targets including banks outside of the United Kingdom and Italy,\" the team said.For context, the new targeted countries in those C2s were Spain, Australia, Poland, Germany, US and Austria.In addition to targeting new countries, the novel version of SharkBot spotted by Fox-IT (2.25) featured an additional capability to steal session cookies from the victims that logged into their bank accounts.\"With all these changes and new features, we are expecting to see more campaigns, targeted applications, targeted countries and changes in Sharkbot this year,\" concluded the Fox-IT post."
   },
   {
      "time": "2022-09-06",
      "title": "TikTok denies security breach after hackers leak user data, source code",
      "text": " TikTok denies recent claims it was breached, and source code and user data were stolen, telling BleepingComputer that data posted to a hacking forum is \"completely unrelated\" to the company.On Friday, a hacking group known as 'AgainstTheWest' created a topic on a hacking forum claiming to have breached both TikTok and WeChat. The user shared screenshots of an alleged database belonging to the companies, which they say was accessed on an Alibaba cloud instance containing data for both TikTok and WeChat users.The threat actor says this server holds 2.05 billion records in a massive 790GB database containing user data, platform statistics, software code, cookies, auth tokens, server info, and many more.While the name AgainstTheWest may sound like the hacking group is targeting Western countries, the threat actors claim to only target countries and companies hostile to Western interests.TikTok has told BleepingComputer that the claims of the company being hacked are false. Furthermore, the company said the source code shared on hacking forums isn't part of its platform.\"This is an incorrect claim — our security team investigated this statement and determined that the code in question is completely unrelated to TikTok's backend source code, which has never been merged with WeChat data.\" - TikTok.TikTok also told us that the leaked user data could not result from a direct scraping of its platform, as they have adequate security safeguards to prevent automated scripts from collecting user information.BleepingComputer has also reached out to WeChat for a statement, but we have not yet received a response from them.While WeChat and TikTok are both Chinese firms, they are not owned by the same parent company, with the former belonging to Tencent and the latter to ByteDance. Therefore, seeing them both in a single database indicates that it was not a direct breach on each platform.Most likely, the unprotected database was created by a third-party data scraper or broker who scraped public data from both services and saved it into a single database.Similarly, \"database hunter\" Bob Diachenko has validated the leaked user data as real, but couldn't provide any concrete conclusions about the origin of the data.If further analysis reveals that the data is legitimate, TikTok will be forced to take action to mitigate the leak's effects even if it wasn't breached. We have requested an additional comment from the platform on that front, but we haven't received an answer.The story will be updated as soon as new evidence or conclusions become available.Update 9/6/2022: The AgainstTheWest threat actor claiming to have breached TikTok and WeChat has been banned on the Breached hacking forum where they had leaked samples of the stolen data.The owner of Breached, pompompurin, says the account was banned for not properly investigating the breach.\"This thread was restored due to multiple people asking for it back. AgainstTheWest initially deleted it. Please note that the breach is not from TikTok, and that he most likely was lying or didn't even investigate it before making such outrageous claims.\" - pompompurin."
   },
   {
      "time": "2022-09-06",
      "title": "Ransomware Attackers Abuse Genshin Impact Anti-Cheat System to Disable Antivirus",
      "text": " A vulnerable anti-cheat driver for the Genshin Impact video game has been leveraged by a cybercrime actor to disable antivirus programs to facilitate the deployment of ransomware, according to findings from Trend Micro.The ransomware infection, which was triggered in the last week of July 2022, banked on the fact that the driver in question (\"mhyprot2.sys\") is signed with a valid certificate, thereby making it possible to circumvent privileges and terminate services associated with endpoint protection applications.Genshin Impact is a popular action role-playing game that was developed and published by Shanghai-based developer miHoYo in September 2020.The idea, in a nutshell, is to use the legitimate device driver module with valid code signing to escalate privileges from user mode to kernel mode, reaffirming how adversaries are constantly looking for different ways to stealthily deploy malware.\"Organizations and security teams should be careful because of several factors: the ease of obtaining the mhyprot2.sys module, the versatility of the driver in terms of bypassing privileges, and the existence of well-made proofs of concept (PoCs).\"In the incident analyzed by Trend Micro, a compromised endpoint belonging to an unnamed entity was used as a conduit to connect to the domain controller via remote desktop protocol (RDP) and transfer to it a Windows installer posing as AVG Internet Security, which dropped and executed, among other files, the vulnerable driver.The goal, the researchers said, was to mass-deploy the ransomware to using the domain controller via a batch file that installs the driver, kills antivirus services, and launches the ransomware payload.Trend Micro pointed out that the game \"does not need to be installed on a victim's device for this to work,\" meaning threat actors can simply install the anti-cheat driver as a precursor to ransomware deployment.We have reached out to miHoYo for comment, and we will update the story if we hear back.\"It is still rare to find a module with code signing as a device driver that can be abused,\" the researchers said. \"This module is very easy to obtain and will be available to everyone until it is erased from existence. It could remain for a long time as a useful utility for bypassing privileges.\"\"Certificate revocation and antivirus detection might help to discourage the abuse, but there are no solutions at this time because it is a legitimate module.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-09-06",
      "title": "Resecurity | EvilProxy Phishing-as-a-Service with MFA Bypass Emerged in Dark Web",
      "text": " Cybercrime IntelligenceMFA, Dark Web, Phishing, PhaaS, ATO, BEC, PyPi, supply chainFollowing the recent Twilio hack leading to the leakage of 2FA (OTP) codes, cybercriminals continue to upgrade their attack arsenal to orchestrate advanced phishing campaigns targeting users worldwide. Resecurity has recently identified a new Phishing-as-a-Service (PhaaS) called EvilProxy advertised in the Dark Web. On some sources the alternative name is Moloch, which has some connection to a phishing-kit developed by several notable underground actors who targeted the financial institutions and e-commerce sector before. While the incident with Twilio is solely related to the supply chain, cybersecurity risks obviously lead to attacks against downstream targets, the productized underground service like EvilProxy enables threat actors to attack users with enabled MFA on the largest scale without the need to hack upstream services. EvilProxy actors are using Reverse Proxy and Cookie Injection methods to bypass 2FA authentication – proxyfying victim’s session. Previously such methods have been seen in targeted campaigns of APT and cyberespionage groups, however now these methods have been successfully productized in EvilProxy which highlights the significance of growth in attacks against online-services and MFA authorization mechanisms. Based on the ongoing investigation surrounding the result of attacks against multiple employees from Fortune 500 companies, Resecurity was able to obtain substantial knowledge about EvilProxy including its structure, modules, functions, and the network infrastructure used to conduct malicious activity. Early occurrences of EvilProxy have been initially identified in connection to attacks against Google and MSFT customers who have MFA enabled on their accounts – either with SMS or Application Token. The first mention of EvilProxy was detected early May 2022, this is when the actors running it released a demonstration video detailing how it could be used to deliver advanced phishing links with the intention to compromise consumer accounts belonging to major brands such as Apple, Facebook, GoDaddy, GitHub, Google, Dropbox, Instagram, Microsoft, Twitter, Yahoo, Yandex and others.Notably, EvilProxy also supports phishing attacks against Python Package Index (PyPi):Besides PyPi, the functionality of EvilProxy also supports GitHub and npmjs (widely used JavaScript Package Manager by over 11 million developers worldwide) enabling supply chain attacks via advanced phishing campaigns. It's highly likely the actors aim to target software developers and IT engineers to gain access to their repositories with the end goal to hack \"downstream\" targets. These tactics allow cybercriminals to capitalize on the end users  insecurity who assume they're downloading software packages from secure resources and don't expect it to be compromised.EvilProxy uses the “Reverse Proxy” principle. The reverse proxy concept is simple: the bad actors lead victims into a phishing page, use the reverse proxy to fetch all the legitimate content which the user expects including login pages - it sniffs their traffic as it passes through the proxy. This way they can harvest valid session cookies and bypass the need to authenticate with usernames, passwords and/or 2FA tokens. Resecurity has acquired videos released by EvilProxy actors demonstrating how it can be used to steal the victim’s session and successfully go through Microsoft 2FA and Google e-mail services to gain access to the target account.EvilProxy is offered on a subscription base, when the end user (a cybercriminal) chooses a service of interest to target (e.g., Facebook or Linkedin), the activation will be for a specific period of time (10, 20 or 31 days as per the plans description which was published by the actors on multiple Dark Web forums). One of the key actors - John_Malkovich, acting as administrator to vet new customers. The service is represented on all major underground communities including XSS, Exploit and Breached.The payment for EvilProxy is organized manually via an operator on Telegram. Once the funds for the subscription are received, they will deposit to the account in customer portal hosted in TOR. The kit is available for $400 per month in the Dark Web hosted in TOR network.The portal of EvilProxy contains multiple tutorials and interactive videos regarding the use of the service and configuration tips. Being frank – the bad actors did a great job in terms of the service usability, and configurability of new campaigns, traffic flows, and data collection. After a successful deployment, the scripts will forward the traffic from the victims via 2 gateways defined as \"upstream\":Based on further analysis, we identified some of the domain names used for phishing campaigns. The bad actors register similar (by spelling) domains with the intention of masking them under legitimate online-services. Some of the links generated by EvilProxy to impersonate Microsoft E-Mail services are provided below:\nLogin Phishing URL\nhttps://lmo.msdnmail[.]net/common/oauth2/v2.0/authorize?client_id=4765445b-32c6-49b0-83e6-1d93765276ca&redirect_uri=https%3A%2Fopenid%20profile%20https%3\r\nA%2F%2Fwwwofc.msdnmail.net%2Fv2%2FOfficeHome.All&response_mode=form_post&nonce=637975588496970710\r\n.Zjg3YzFkMmEtYTUxYy00NDliLWEzYzAtMTExZTliNjBkY2ZkY2U3NzM2MDMtZWNhZC00ZWFmLWE5YjMtYzgzZTFjM2E1ZDdl&ui_locales=en-US&mkt=en-US&state=jHi-CP0Nu4oFHIxklcT1adstnCWbwJwuXQWTxNSSsw-23qiXK-6EzyYoAyNZ6rHuHwsIYSkRp99F-bqPqhN4JVCnT4-3MQIDvdTKapKarcqaMFi6_xv2__3D0KfqBQ070ykGBGlwxFQ6Mzt9CwUsz2zdgcB4jFux2BhZQwcj-WumSBz0VQs5VePV-wz00E8rDxEXfQdlv-AT29EwdG77AmGWinyf3yQXSZTHJyo8s-IWSHoly3Kbturwnc87sDC3uwEn6VDIjKbbaJ-c-WOzrg&x-client-SKU=ID_NETSTANDARD2_0&x-client-ver=6.16.0.0Post-Authorization URL\nhttps://473126b6-bf9a-4a96-8111-fb04f6631ad8-571c4b21.msdnmail[.]net/mail/?realm=[victim_domain]&exsvurl=1&ll-cc=1033&modurl=0&JitExp=1&url=%2Fowa%2F%3Frealm%253d%2526exsvurl%253d1%2526ll-cc%253d1033%2526modurl%253d0%2526login_hint%253[victim_email]%252540[victim_domain]The bad actors are using multiple techniques and approaches to recognize victims and to protect the phishing-kit code from being detected. Like fraud prevention and cyber threat intelligence (CTI) solutions, they aggregate data about known VPN services, Proxies, TOR exit nodes and other hosts which may be used for IP reputation analysis (of potential victims). In the case they suspect a bot or researcher, they drop the connection or redirect it to a specific host (for example, ‘brave.com’). Another approach which has been identified is based on fingerprints. The bad actors are especially diligent when it comes to detecting possible virtual machines, typically used by security analysts to research malicious content and clients connecting via RDP (Remote Desktop Protocol):While the sale of EvilProxy requires vetting, cybercriminals now have a cost-effective and scalable solution to perform advanced phishing attacks to compromise consumers of popular online services with enabled MFA. The appearance of such services in Dark Web will lead to a significant increase in ATO/BEC activity and cyberattacks targeting the identity of the end users, where MFA may be easily bypassed with the help of tools like EvilProxy. Resecurity’s HUNTER team collected the following domain names and URLs related to the EvilProxy\r\ninfrastructure. Some of these hosts were mapped as a result of post-incident response engagement\r\nwith the affected victims from Fortune 500 companies and consumers of popular online-services.\r\nWhile the operations of bad actors are extremely dynamic, the information about these hosts may help\r\ncybersecurity researchers and incident responders detect and attribute possible malicious\r\nactivity to EvilProxy when investigating incidents affecting MFA (2FA).Cyber Threat LandscapeCyber Threat LandscapeKeep up to date with the latest cybersecurity news and developments.ResecurityCopyright © 2023 Resecurity, Inc. All rights reserved."
   }
]