[
   {
      "time": "2022-08-18",
      "title": "Apple Patches New macOS, iOS Zero-Days - SecurityWeek",
      "text": " Hi, what are you looking for?Apple on Wednesday rolled out emergency patches for a pair of already exploited zero-day vulnerabilities in its flagship macOS and iOS platforms.Apple confirmed in-the-wild exploitation of the vulnerabilities in separate advisories warning about code execution flaws in fully patched iPhone, iPad and macOS devices.ByFlipboardRedditWhatsappWhatsappEmailRyan Naraine is Editor-at-Large at SecurityWeek and host of the popular Security Conversations podcast series. He is a security community engagement expert who has built programs at major global brands, including Intel Corp., Bishop Fox and GReAT. Ryan is a founding-director of the Security Tinkerers non-profit, an advisor to early-stage entrepreneurs, and a regular speaker at security conferences around the world.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...Zero trust is not a replacement for identity and access management (IAM), but is the extension of IAM principles from people to everyone and...A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The CRYSTALS-Kyber public-key encryption and key encapsulation mechanism recommended by NIST for post-quantum cryptography has been broken using AI combined with side channel attacks.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-08-18",
      "title": "BlackByte ransomware gang is back with new extortion tactics",
      "text": " The BlackByte ransomware is back with version 2.0 of their operation, including a new data leak site utilizing new extortion techniques borrowed from LockBit.After a brief disappearance, the ransomware operation is now promoting a new data leak site on hacker forums and through Twitter accounts the threat actor controls.The threat actors are calling this new iteration of their operation BlackByte version 2.0, and while it is not clear if the ransomware encryptor has changed as well, the gang has launched a brand new Tor data leak site.The data leak site only includes one victim at this time but now has new extortion strategies that allow victims to pay to extend the publishing of their data by 24 hours ($5,000), download the data ($200,000), or destroy all the data ($300,000). These prices will likely change depending on the size/revenue of the victim.However, as pointed out by cybersecurity intelligence firm KELA, BlackByte's new data leak site is not correctly embedding the Bitcoin and Monero addresses that \"customers\" can use to purchase or delete the data, making these new features currently broken.The goal of these new extortion techniques is to allow the victim to pay to remove their data and for other threat actors to purchase it if they wish."
   },
   {
      "time": "2022-08-18",
      "title": "APT Lazarus Targets Engineers with macOS Malware | Threatpost",
      "text": " Share this article:The North Korean APT is using a fake job posting for Coinbase in a cyberespionage campaign targeting users of both Apple and Intel-based systems.Similarities to Previous MalwareHowever, the most recent malware is signed July 21, according to its timestamp, which means it’s either something new or a variant of the previous malware. It uses a certificate issued in February 2022 to a developer named Shankey Nohria and which was revoked by Apple on Aug. 12, researchers said. The app itself was not notarized.The malware used in the campaign also connects to a different command and control (C2) infrastructure than the malware discovered in May, https:[//]concrecapital[.]com/%user%[.]jpg, which did not respond when researchers tried to connect to it.Lazarus on the LooseNorth Korea’s Lazarus is well known as one of the most prolific APTs and already is in the crosshairs of international authorities, having been sanctioned back in 2019 by the U.S. government.Changing It Up However, more recently Lazarus has diversified its tactics, with the feds revealing that Lazarus also has been responsible for a number of crypto heists aimed at padding the regime of Jong-un with cash.Share this article:Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk. Separate fixes to macOS and iOS patch respective flaws in the kernel and WebKit that can allow threat actors to take over devices and are under attack.Infosec Insider content is written by a trusted community of Threatpost cybersecurity subject matter experts. Each contribution has a goal of bringing a unique voice to important cybersecurity topics. Content strives to be of the highest quality, objective and non-commercial.Sponsored Content is paid for by an advertiser. Sponsored content is written and edited by members of our sponsor community. This content creates an opportunity for a sponsor to provide insight and commentary from their point-of-view directly to the Threatpost audience. The Threatpost editorial team does not participate in the writing or editing of Sponsored Content."
   },
   {
      "time": "2022-08-18",
      "title": "\r\n\tCISA Warns of Hackers Exploiting Multiple Vulnerabilities in the Zimbra Collaboration Suite - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe Cybersecurity and Infrastructure Security Agency (CISA) has published a new advisory warning of threat actors actively exploiting five different vulnerabilities in the Zimbra Collaboration Suite (ZCS).The document was compiled in collaboration with the Multi-State Information Sharing & Analysis Center (MS-ISAC) and explains how threat actors may be targeting unpatched ZCS instances in both government and private sector networks.The first of the discovered vulnerabilities (tracked CVE-2022-27924) is a high-severity vulnerability enabling an unauthenticated threat actor to inject arbitrary memcache commands into a ZCS instance and cause an overwrite of arbitrary cached entries.“The actor can then steal ZCS email account credentials in cleartext form without any user interaction,” the advisory read.The remaining Zimbra vulnerabilities mentioned in the CISA report are CVE-2022-30333, a high-severity directory traversal vulnerability in RARLAB UnRAR on Linux and UNIX, and CVE-2022-24682, a medium-severity vulnerability that impacts ZCS webmail clients.Further, the document recommended organizations apply a number of best practices to reduce the risk of compromise, including maintaining and testing an incident response plan, ensuring organizations have a vulnerability management program, are properly configuring and securing internet-facing network devices and adopting zero-trust principles and architecture.CISA and the MS-ISAC said they will update the advisory to include additional indicators of compromise (IOCs) and signatures as further information becomes available. "
   },
   {
      "time": "2022-08-18",
      "title": "Brazilian police launch investigation targeting Lapsus$ group",
      "text": " Police did not specifically name Lapsus$ Group in the announcement. However, the details described line up with the Lapsus$ Group attack and the agency wrote that the investigation connected the attacks to a “transnational criminal organization” focused on cybercrime “targeting public and private entities in Brazil, the United States, Portugal and Colombia.”In addition to the Ministry of Health, Brazilian police wrote, the attacker infiltrated nine other local entities — including the Ministry of the Economy and the National Electric Energy Agency. The group used a variety of different techniques to carry out its attacks. Andrea Peterson (they/them) is a longtime cybersecurity journalist who cut their teeth covering technology policy at ThinkProgress (RIP) and The Washington Post before doing deep-dive public records investigations at the Project on Government Oversight and American Oversight.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-18",
      "title": "Ukraine\\'s state-owned nuclear power operator said Russian hackers attacked website",
      "text": " Ukraine’s state nuclear power company Energoatom said on Tuesday that Russian hackers had launched an “unprecedented” cyberattack on the company’s official website.The Russian hacktivist group People’s Cyber Army, which claims to include more than 8,200 volunteer members, used 7.25 million bot accounts to flood Energoatom’s website with junk traffic, making it unreachable.The People's Cyber Army boasted of the attack on Telegram late on Tuesday and switched to other targets — the websites of Ukrainian steel manufacturer Dneprospetsstal and the government-run Ukrainian Institute of National Memory. Both websites continue to operate normally as of Wednesday morning.Russia-based People’s Cyber Army is an analog of the Ukrainian hacktivist group IT Army, which has more than 235,000 followers on Telegram. Both groups carry out distributed denial-of-service attacks on “enemy” websites, fueling the cyber tit-for-tat between Russia and Ukraine.Most of these attacks have no lasting impact, but they can temporarily disrupt businesses and their customers, who in past incidents haven’t been able to buy train tickets, order food delivery, or watch a movie online while the DDoS attack is underway.Although the Tuesday attack had no lasting impact on Energoatom, it’s still worth paying attention to, cybersecurity experts say. Ukraine relies on nuclear energy supplied by 15 reactors. In early March, Russia occupied a six-reactor nuclear power plant in the city of Zaporizhzhia and pulled its military equipment there, causing one of the reactors to shut down.In addition to attacks on the ground, Russia is also actively spreading fake news about Ukraine's nuclear energy sector. For example, Russian news sites have warned about the possible explosion of the station in Zaporizhzhia due to shelling by Ukraine.According to Energoatom, Russia wants to instill a fear of a nuclear disaster to reduce foreign military support for Ukraine. Energoatom did not immediately respond to requests for comment on Wednesday.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-18",
      "title": "Malicious PyPi packages turn Discord into password-stealing malware",
      "text": " A dozen malicious PyPi packages have been discovered installing malware that modifies the Discord client to become an information-sealing backdoor and stealing data from web browsers and Roblox.Contrary to the common typo-squatting approach, these packages use their own names and promise various features to promote themselves to interested developers.The Python packages pretend to be Roblox tools, thread management, and basic hacking modules, but none feature the promised functionality. Instead, the packages install password-stealing malware on developers’ devices.Unfortunately, this malicious set of PyPi Python packages has not been removed from the open source package repository at the time of writing this, so software developers are still at risk.The behavior is the same for all packages in the set, except for “hackerfilelol” and “hackerfileloll,” which use a single malicious executable named “Main.exe.”The first binary, ZYXMN.exe, is used to steal information from Google Chrome, Chromium, Microsoft Edge, Firefox, and Opera, including stored passwords, browser history, cookies, and search history.To steal information from browsers, the malware will decrypt the web browser’s local database master key to retrieve cleartext data of the victim’s search history, browsing history, cookies, bookmarks, stored passwords, and stored credit cards. This information is then uploaded to the threat actors via a Discord webhook.However, even more interesting, the malware will modify the actual JavaScript files used by the Discord client to inject a backdoor that can steal information directly from your Discord account.With the script injected, when Discord is restarted, it will perform a variety of negative behavior, including stealing authentication tokens, Nitro status, billing information, and credit cards.The second malware, ZYRBX.exe, focuses solely on Roblox, attempting to steal the account cookie, user ID, Robux balance, and account Premium status of the online gaming platform and exfiltrate it to a Discord webhook.The stealers in those packages focus on collecting account credentials from cryptocurrency wallets, Steam, and Minecraft, while an injected script monitors for inputs like email addresses, passwords, and billing information.After this step, the stealer scans the host’s Downloads, Documents, and Desktop folders to locate 2FA recovery lists, password text files, Discord tokens, Paypal account info, and more.The malicious duo discovered by Kaspersky are “pyquest” and “ultrarequests,” mimicking projects with millions of downloads and even cloning their code.Unfortunately, this gives more uptime to the malicious packages and increases the chances of software developers becoming victims of this malware."
   },
   {
      "time": "2022-08-18",
      "title": "Iranian Hackers Allegedly Exploiting Israeli Entities - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " Mandiant has been analyzing UNC3890, a group of hackers that uses social engineering lures and a possible watering hole to target Israeli maritime, government, energy, and healthcare institutions, for the past year.your nameYour Emailyour message"
   },
   {
      "time": "2022-08-18",
      "title": "Malware devs already bypassed Android 13's new security feature",
      "text": " Android malware developers are already adjusting their tactics to bypass a new 'Restricted setting' security feature introduced by Google in the newly released Android 13.As part of this release, Google attempted to cripple mobile malware that attempted to enable powerful Android permissions, such as AccessibilityService, to perform malicious, stealthy behavior in the background.However, analysts at Threat Fabric today say malware authors are already developing Android malware droppers that can bypass these restrictions and deliver payloads that enjoy high privileges on a user's device.In previous Android versions, most mobile malware found its way inside millions of devices via dropper apps available on the Play Store, which masquerade as legitimate apps.During installation, the malware apps prompt users to grant access to risky permissions and then sideload (or drop) malicious payloads by abusing Accessibility Service privileges.Accessibility Services is a massively abused disability assistance system on Android that enables apps to perform swipes and taps, go back or return to the home screen. All of this is done without the knowledge or permission of the user.Typically, the malware uses the service to grant itself additional permissions and stop the victim from manually deleting the malicious app.In Android 13, Google's security engineers introduced a 'Restricted setting' feature, which blocks sideloaded applications from requesting Accessibility Service privileges, limiting the function to Google Play-sourced APKs.In a new report released today, Threat Fabric has discovered a new Android malware dropper that is already adding new features to bypass the new Restricted setting security feature.This novel dropper features code similar to Brox, a freely distributed malware development tutorial project circulating on hacker forums, but with a modification in one string of the installer function.\"This string, which is not present in the original Brox code, corresponds to the action required by intents to create an installation process by session.\"Third-party apps have two methods to install other apps. The first and most common is the non-session-based installation method, which essentially hands off the installation of a single APK file to the system package installer.The second is the session-based installation method, which lets apps commit the installation of one or more APK files at once. Commonly used by app stores, it allows for installing multiple APK files in one go, with apps distributed as a single \"base\" APK and multiple \"split\" APKs (i.e. language packs).On Android 13, Google decided to restrict access to Accessibility Service and Notification Listener, two highly privileged APIs, only to apps that are installed using the session-based installation method.Apps sideloaded through the session-based installation method will not see the \"Restricted Setting\" dialog and hence users can enable their Accessibility Service and/or Notification Listener.If malware droppers like BugDrop use this installation method to side-load the malware payload, Android 13 recognizes the use of the API and doesn't apply the restriction.\"When fully implemented, this slight modification would circumvent Google's new security measures fully, even before they are effectively in place,\" comments Threat Fabric.BleepingComputer has reached out to Google with further questions about this bypass and will update the story with any response.BugDrop is still a work in progress by a group of malware authors and operators named 'Hakoden,' who are also responsible for creating the Gymdrop dropper and the Xenomorph Android banking trojan.When BugDrop is ready for mass deployment, it is expected to be used in Xenomorph campaigns, enabling on-device credential theft and fraud behavior on the most recent Android devices.Additionally, the latest Xenomorph samples analyzed by Threat Fabric have added remote access trojan (RAT) modules, making the malware an even more potent threat."
   },
   {
      "time": "2022-08-18",
      "title": "Google fixes fifth Chrome zero-day bug exploited this year",
      "text": " Google has released a security update for the Chrome browser that addresses close to a dozen vulnerabilities, including a zero-day flaw that is being exploited in the wild.The security update is currently rolling out for Windows, Mac and Linux. Users who have automatic updates turned on should receive it in the coming days/weeks.Google doesn’t typically provide many technical details about the zero-day vulnerabilities they fix until a large number of Chrome users have applied the security update.The most recent one is tracked as CVE-2022-2856 and it is described as a high-severity security issue due to “insufficient validation of untrusted input in Intents,” a feature that enables launching applications and web services directly from a web page.Bad input validation in software can serve as a pathway to overriding protections or exceeding the scope of the intended functionality, potentially leading to buffer overflow, directory traversal, SQL injection, cross-site scripting, null byte injection, and more.The vulnerability was discovered and reported by Ashley Shen and Christian Resell, both members of the Google Threat Analysis Group (TAG).The current Chrome update addresses the fifth zero-day vulnerability in Google Chrome this year that is actively exploited by threat actors:The previous four were:To perform the update now, head to the browser’s settings, select “About Chrome” and let the browser’s internal checker scan for available updates. After the download is complete, restart the program to apply the security update.Because the latest Google Chrome update fixes a flaw already exploited by threat actors, it is recommended switch to the latest version of the browser as soon as possible."
   }
]