[
   {
      "time": "2022-12-20",
      "title": "HHS urges prompt patch of critical Citrix flaw after healthcare entities exploited | SC Media",
      "text": "  Ranked 9.8 in severity, the Department of Health and Human Services Cybersecurity Coordination Center alert warns the vulnerability can allow an unauthenticated remote attacker to execute commands and completely compromise targeted systems.“Targeting Citrix ADCs can facilitate illegitimate access to targeted organizations by bypassing normal authentication controls,” according to the National Security Agency threat hunting guidance specific to the Citrix ADC targeting. As noted in the HC3 alert, the concern is that the flaw is currently being targeted and successfully exploited by APT5, or UNC2630, a Chinese state-sponsored advanced persistent threat. HCS notes that the specific attacker has not yet been identified in the attacks and compromises on U.S. healthcare organizations. Versions 12.1, including FIPS and NDcPP, and 13.0 before 13.0-58.32 are affected by the flaw. Citrix researchers explained that both of the platforms “must be configured with an SAML SP or IdP configuration to be affected. Entities using “an affected build with a SAML SP or IdP configuration are urged to install the recommended builds immediately.”There are no available workarounds for the security issue and it’s “not possible to fix the vulnerability with Web Application Firewall signatures.”Provider organizations should review the HC3 alert and Citrix security bulletin for details into remediation needs. Those ‘running affected builds” should review their inventory for these systems and prioritize the implementation of these patches and “set up audit logging to monitor for unauthorized activity on ADC or Gateway devices.”NSA also share IOCs and YARA signatures that can detect malware the agency has observed threat actors using in this particular campaign.“Treat these detection mechanisms as independent ways of identifying potentially malicious activity on impacted systems,” according to the NSA guidance. “Artifacts may vary based on the environment and the stage of that activity. As such, NSA recommends investigating any positive result even if other detections return no findings.”Further, if a compromise is detected, entities should shift all Citrix ADC instances behind a virtual private network or another tool that requires a valid user authentication before it’s allowed to access the ADC. The Citrix ADC appliances should also be isolated from the environment to contain any malicious activity, while restoring the affected platform to a known good state.The NSA added that even if an entity does not find any indications of malicious activity during its investigation, it’s imperative to verify that the organization is running current versions of Citrix ADC appliances. Those who find new discoveries or additional information should share it with the NSA.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Ukraine had experienced a less than a day-long power outage in October 2022 following an attack by Russian state-sponsored hacking operation Sandworm targeted at an electrical substation amid the ongoing Russia-Ukraine war, marking the first cyberattack-related power interruption in the country since 2017, CyberScoop reports.Attacks deployed by Iranian state-backed threat operation MuddyWater against Israel saw the utilization of the new MuddyC2Go command-and-control framework, which replaced the PhonyC2 custom platform following the exposure of its source code, reports The Hacker News.Israel had its technology, logistics, and transportation industries targeted by Iranian advanced persistent threat operation Charming Kitten, also known as APT35 and Imperial Kitten, last month amid its ongoing war with Palestinian militant group Hamas, according to The Record, a news site by cybersecurity firm Recorded Future.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-12-20",
      "title": "Play ransomware claims attack on German hotel chain H-Hotels",
      "text": " The Play ransomware gang has claimed responsibility for a cyber attack on H-Hotels (h-hotels.com) that has resulted in communication outages for the company.H-Hotels is a hospitality business with 60 hotels in 50 locations across Germany, Austria, and Switzerland, offering a total capacity of 9,600 rooms.The hotel chain employs 2,500 people and is one of the largest in the DACH region, operating under 'H-Hotels' and the sub-brands Hyperion, H4 Hotels, H2 Hotels, H + Hotels, H.ostels, and H.omes.H-Hotels disclosed the cyberattack last week and stated that the security incident occurred on Sunday, December 11th, 2022.\"After the cyber attack was found, the IT systems were immediately shut down and disconnected from the Internet in order to ward off further spread.\"Although the attack did not impact guests' bookings, hotel staff still can't receive or answer customer requests sent via email, so it is recommended to contact H-Hotels by phone if necessary.The firm has informed the German investigative authorities of the incident and is working with an IT forensics firm to restore systems as quickly as possible. H-Hotels also states that they are ensuring they will be adequately protected against similar cyberattacks in the future.Play ransomware has claimed the attack on H-Hotels and listed the company on its Tor site today, claiming to have stolen an undisclosed amount of data during the cyberattack.The ransomware gang claims to have stolen private and personal data, including client documents, passports, IDs, and more. However, the threat actors have not released any samples to support these claims.Furthermore, H-Hotels denied seeing any evidence of data exfiltration in last week’s announcement, and there has been no update on the matter since then.“As of today, the commissioned IT forensic scientists have no evidence that relevant or personal data could be stolen by the cyber attack,” reads the announcement.“Should a data outflow of personal data be determined in the course of these investigations, H-Hotels.com will inform the data subjects.”Being an EU-based company, a large-scale data leak impacting customer data would have GDPR repercussions, making the cyberattack even more damaging.For hotel guests, the potential exposure of their details and booking data can be a severe case of a privacy breach, providing information about future locations, financial information, and more."
   },
   {
      "time": "2022-12-20",
      "title": "Fortnite Developer Epic Games Slapped With $275M Penalty",
      "text": " The Federal Trade Commission announced it has reached a settlement with Epic Games, the developer behind the wildly popular online game Fortnite, for its violation of the Children's Online Privacy Protection Act (COPPA). The settlement still requires approval from a US federal court. Fortnite, created by Epic Games, has more than 80 million players and is responsible for nearly half of the video game developer's estimated value of $5 billion to $8 billion. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-20",
      "title": "Malicious Python Trojan Impersonates SentinelOne Security Client",
      "text": " In the latest supply chain attack, an unknown threat actor has created a malicious Python package that appears to be a software development kit (SDK) for a well-known security client from SentinelOne. According to an advisory from cybersecurity firm ReversingLabs issued on Monday, the package, dubbed SentinelSneak, appears to be a \"fully functional SentinelOne client\" and is currently under development with frequent updates appearing on the Python Package Index (PyPI), the main repository for Python code. SentinelSneak does not attempt malicious actions when it is installed, but it waits for its function to be called by another program, researchers noted. As such, the attack highlights attackers' focus on the software supply chain as a way to inject compromised code into targeted systems as a beachhead for further attacks. So far, those further attacks have likely not happened, researchers said. \"A cursory glance at the source of this package would have easily missed the malicious functionality injected in the otherwise legitimate SDK code,\" says Tomislav Pericin, chief software architect at ReversingLabs.In the latest effort, the fake SentinelOne 1.2.1 package raises many red flags, the advisory stated. The suspicious behaviors include the execution of files, the creation of new processes, and communicating with external servers using their IP address rather than a domain name.ReversingLabs stressed that the client has no connection to SentinelOne, besides using the security firm's name. The PyPI package appears to be an SDK that helps simplify programmatic access to the client.\"It could be that malicious actors are attempting to draft on SentinelOne’s strong brand recognition and reputation, leading PyPI users to believe that they have deployed SentinelOne's security solution, without taking the — necessary — step of becoming a SentinelOne customer,\" ReversingLabs stated in its advisory. \"This PyPI package is intended to serve as an SDK to abstract the access to SentinelOne’s APIs and make programmatic consumption of the APIs simpler.\"In a statement to Dark Reading, SentinelOne reiterated that the package is fake: \"SentinelOne is not involved with the recent malicious Python package leveraging our name. Attackers will put any name on their campaigns that they think may help them deceive their intended targets, however this package is not affiliated with SentinelOne in any way. Our customers are secure, we have not seen any evidence of compromise due to this campaign, and PyPI has removed the package.\"The attack also shows that developers are becoming an increasing target of attackers, who see them as a weak point in targeted companies' defenses, as well as a potential way to infect those companies' customers. For that reason, companies should help their developers understand which software components could pose a risk, Pericin says.\"Developers should put new project dependencies under a higher degree of scrutiny before opting to install them,\" he says. \"Given that the malware only activates when used, not when installed, a developer might have even built a new app on top of this malicious SDK without noticing anything odd.\"In the case of SentinelSneak, the threat actor behind the Trojan horse published five additional packages, using variations on the SentinelOne name. The variations appear to be tests and did not have a key file that encapsulated much of the malicious functionality.ReversingLabs reported the incident to the PyPI security team on Dec. 15, the company said. SentinelOne was notified the next day.\"We've caught this malicious package very early,\" the company said. \"There's no indication that anybody has yet been affected by this malware.\"Story was updated to include a statement from SentinelOne.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-20",
      "title": "Microsoft finds macOS bug that lets malware bypass security checks",
      "text": " Apple has fixed a vulnerability attackers could leverage to deploy malware on vulnerable macOS devices via untrusted applications capable of bypassing Gatekeeper application execution restrictions.This is achieved by checking an extended attribute named com.apple.quarantine which is assigned by web browsers to all downloaded files, similar to Mark of the Web in Windows.The Achilles flaw allows specially-crafted payloads to abuse a logic issue to set restrictive Access Control List (ACL) permissions that block web browsers and Internet downloaders from setting the com.apple.quarantine attribute for downloaded the payload archived as ZIP files.As a result, the malicious app contained within an archived payload launches on the target's system instead of getting blocked by Gatekeeper, allowing attackers to download and deploy malware.Microsoft said on Monday that \"Apple's Lockdown Mode, introduced in macOS Ventura as an optional protection feature for high-risk users that might be personally targeted by a sophisticated cyberattack, is aimed to stop zero-click remote code execution exploits, and therefore does not defend against Achilles.\"This is just one of multiple Gatekeeper bypasses found in the last several years, with many of them abused in the wild by attackers to circumvent macOS security mechanisms like Gatekeeper, File Quarantine, and System Integrity Protection (SIP) on fully patched Macs."
   },
   {
      "time": "2022-12-20",
      "title": "Ukraine's DELTA military system users targeted by info-stealing malware",
      "text": " A compromised Ukrainian Ministry of Defense email account was found sending phishing emails and instant messages to users of the 'DELTA' situational awareness program to infect systems with information-stealing malware.DELTA is an intelligence collection and management system created by Ukraine with the help of its allies to help the military track the movements of enemy forces.The system provides comprehensive real-time information with high-level integration from multiple sources on a digital map that can run on any electronic device, from a laptop to a smartphone.Digital certificates are used for signing software code and authenticating servers, telling security products running on the OS that the application has not been tampered with and that the server operator is who they claim to be.As part of this campaign, threat actors used email or instant messages with fake warnings that users need to update the 'Delta' certificates to continue using the system securely.The malicious email contains a PDF document purportedly with certificate installation instructions, which includes links to download a ZIP archive named \"certificates_rootCA.zip.\"The archive contains a digitally signed executable named \"certificates_rootCA.exe,\" which, upon launch, creates several DLL files on the victim's system and launches \"ais.exe,\" which simulates the certificate installation process.This step convinces the victim that the process was legitimate and reduces the chances of them realizing they have been breached.Both the EXE files and the DLLs are protected by VMProtect, a legitimate software that is used for wrapping files in standalone virtualized machines, encrypting their content, and making AV analysis or detection impossible.The dropped DLLs, \"FileInfo.dll\" and \"procsys.dll,\" are malware, identified by CERT-UA as 'FateGrab' and 'StealDeal.'FateGrab is an FTP file stealer targeting documents and emails of the following file formats: '.txt', '.rtf', '.xls', '.xlsx', '.ods', '.cmd', '.pdf', '.vbs', '.ps1', '.one', '.kdb', '.kdbx', '.doc', '.docx', '.odt', '.eml', '.msg', '.email.'StealDeal is an information stealer malware that can, among other things, steal internet browsing data and passwords stored on the web browser.CERT-UA was unable to link the above operation to any known threat actors."
   },
   {
      "time": "2022-12-20",
      "title": "DraftKings warns data of 67K people was exposed in account hacks",
      "text": " In credential stuffing attacks, automated tools are used to make a massive number of attempts (up to millions at a time) to sign into accounts using credentials (user/password pairs) stolen from other online services.This tactic works exceptionally well against user accounts whose owners have reused the same login information across multiple platforms.The attackers aim to take over as many accounts as possible to steal personal and financial info, which gets sold on hacking forums or the dark web. However, the stolen information may also be used in identity theft scams to make unauthorized purchases or empty banking accounts linked to compromised accounts.The company said the attackers obtained the credentials needed to log into the customers' accounts from a non-DraftKings source.\"In the event an account was accessed, among other things, the attacker could have viewed the account holder's name, address, phone number, email address, last four digits of payment card, profile photo, information about prior transactions, account balance, and last date of password change,\" the breach notification reads.\"At this time, there is currently no evidence that the attackers accessed your Social Security number, driver's license number or financial account number.\"While bad actors may have viewed the last four digits of your payment card, your full payment card number, expiration date, and your CVV are not stored in your account.\"After detecting the attack, DraftKings reset the affected accounts' passwords and said it implemented additional fraud alerts.It also restored the funds withdrawn as a result of the credential attack, refunding up to $300,000 identified as stolen during the incident, as DraftKings President and Cofounder Paul Liberman said in November.The common denominator for user accounts that got hijacked seems to be an initial $5 deposit followed by a password change, enabling two-factor authentication (2FA) on a different phone number and then withdrawing as much as possible from the victims' linked bank accounts.While DraftKings has not shared additional info on how the attackers stole funds, BleepingComputer has since learned that the attack was conducted by a threat actor selling stolen accounts with deposit balances on an online marketplace for $10 to $35.The sales included instructions on how the buyers could make $5 deposits and withdraw all of the money from hijacked DraftKings user accounts.​After DraftKings announced the credential stuffing attack, they locked down the breached accounts, with the threat actors warning that their campaign was no longer working.​The company is now advising customers never to use the same password for multiple online services, never share their credentials with third-party platforms, turn on 2FA on their accounts immediately, and remove banking details or unlink their bank accounts to block future fraudulent withdrawal requests.​This amounts to roughly 34% of the overall authentication traffic tracked by Okta, which means that one in three sign-in attempts are malicious and fraudulent."
   },
   {
      "time": "2022-12-20",
      "title": "Antwerp denies negotiating ransomware payment as city disappears from leak site",
      "text": " A listing for the City of Antwerp was removed from the PLAY ransomware group’s leak site this weekend, despite its mayor announcing that the municipality did not pay the gang to unlock its data.Council websites, public libraries and online museum booking services were also impacted by the attack, although some may have been taken offline as a precaution.Typically these extortion listings are only removed after the target makes a payment to the criminals or begins to negotiate with them, however the City of Anterp’s mayor Bart de Wever denied that either was happening.A number of digital services had resumed by that point, including the City of Antwerp’s email network and some citizen services.“A number of systems and applications will gradually be able to be used again. However, getting everything fully digital again will take weeks to months,” said Delechambre.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-12-20",
      "title": "Cisco Warns of Many Old Vulnerabilities Being Exploited in Attacks - SecurityWeek",
      "text": " Hi, what are you looking for?Cisco has updated multiple security advisories to warn of the malicious exploitation of severe vulnerabilities impacting its networking devices.Many of the bugs, which carry severity ratings of ‘critical’ or ‘high’, have been addressed 4-5 years ago, but organizations that haven’t patched their devices continue to be impacted.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-20",
      "title": "Microsoft: KB5021233 causes blue screens with 0xc000021a errors",
      "text": " Microsoft is investigating a known issue leading to Blue Screen of Death (BSOD) crashes with 0xc000021a errors after installing the Windows 10 KB5021233 cumulative update released during this month's Patch Tuesday.The company warned over the weekend that \"after installing KB5021233, some Windows devices might start up to an error (0xc000021a) with a blue screen.\"The known issue is likely caused by a mismatch between the file versions of hidparse.sys in system32 and system32/drivers in the Windows folder, \"which might cause signature validation to fail when cleanup occurs.\"The list of affected platforms includes only client Windows 10 versions, from Windows 10 20H2 to the latest release, Windows 10 22H2.Redmond added that it's already working on a fix to address this newly acknowledged issue but hasn't yet shared when it will be available.However, the company did share a temporary solution to workaround the blue screen issue and revive the affected systems to start as expected.This requires users to copy the hidparse.sys file from the system32\\drivers folder into system32 via the Windows Recovery Environment (WinRE) so that the signature validation no longer fails during cleanup.To mitigate this issue on impacted devices, you need to go through the following steps:"
   },
   {
      "time": "2022-12-20",
      "title": "DarkTortilla malware spreads on phishing sites masquerading as legitimate domains | SC Media",
      "text": "   The group behind this attack has been repurposing existing malware (think-cheap-to-do) and coupling an attack style known as a watering hole attack, said Andrew Barratt, vice president at Coalfire. Barratt said the “watering holes” are all intended to look like common websites using a typo-squat — where a misspell of a common domain name is used. This potentially lets them attract victims who have limited defenses, which then in turn means that a repurposed and quite an old piece of malware may still be effective against them. “When you look at some of the names the malware is masquerading as, one is the blizzard installer — a common installer for gamers,” Barratt said. “The group could be trying to use this to target gamers who have a habit of switching off their antivirus to increase game performance. The capabilities are highly versatile, so I’d bet the threat actor behind this is looking to build up a portfolio of initial access — to then sell on the wholesale market.”Malicious Python packages spread BlazeStealer malware Eight new Python packages masquerading as obfuscation tools have been used to facilitate the distribution of the BlazeStealer malware since January, The Hacker News reports.Hackread reports that Microsoft Azure's Automation Service has been leveraged to create the first cryptocurrency miner that could not be detected by security systems.Indian government organizations had their Windows and Linux systems subjected to two new attack campaigns by Pakistan-linked advanced persistent threat operation SideCopy, one of which involved the exploitation of a WinRAR security vulnerability, aimed at facilitating the deployment of various remote access trojans, The Hacker News reports.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   }
]