[
   {
      "time": "2022-09-19",
      "title": "Gamaredon APT targets Ukrainian government agencies in new campaign",
      "text": " Gamaredon APT actors likely gained initial footholds into targeted networks through malicious Microsoft Office documents distributed via email. This is consistent with spear-phishing techniques common to this APT.Malicious VBS macros concealed within remote templates execute when the user opens the document. The macros download RAR archives containing LNK files. The naming convention of the RAR archives in this campaign follows a similar pattern:These compressed archives usually contain just the LNK file. The LNK files and Microsoft Office document names contain references pertinent to the Russian invasion of Ukraine:The instrumentor PowerShell script usually consists of a function that decodes the encrypted response from the command and control (C2) server and executes it as a VBScript object. The key used in the XOR decoder is calculated based on the machine's volume serial number plus index parameters passed in the response blob. This method makes it difficult to decode the malicious content if an observer looking at the data doesn't have both parameters available.The PowerShell script also repeatedly captures the current user's screen. This code uses the \"System.Windows.Forms\" object to capture a copy of the virtual desktop, including setups with multiple screens. The screen capture is executed nine times, but the resulting screenshot is always saved to \"%TEMP%\\test.png\", which gets overwritten every time. The resulting image (PNG file) is then converted to a base64-encoded string, stored in a variable and the screenshot image file is removed from the disk.The script then proceeds to upload the victim's information to the remote server. The following information is then collected and exfiltrated to a hardcoded C2 URL.Upon sending the system information, the server response is parsed to see if there are commands to be executed. The entire script runs up to four times, thus up to four different commands can be executed each time.The code checks if the first character is an exclamation point (\"!\"). If so, the remainder of the response is expected to be a PowerShell code that is passed directly to the command IEX. The output of that command is then added to the variable \"cmd\" and sent back to the C2 server.If the response starts with any other character, it is treated as an encrypted blob and passed to the decoder function, along with the volume serial number to be decoded and executed as VBScript.One of the payloads served to the instrumentor script was PowerShell code used to set an environmental variable with PowerShell code in it and a Registry RUN key to run every time the user logs in.There are two key components to this script:This script uses the same Get-IP() function to get a random IP assigned to the domain and queries a URL constructed from the IP address and a hardcoded extended resource. Just like the previous script, the computer name and volume serial number are used again in communications with the C2 server. The C2 server uses them to encode the next-stage payload subsequently served to the script.If the response from the C2 starts with the string \"http\", the content is treated as the URL to download the final payload binary. The Volume Serial Number and Computer Name are passed to this URL and the response is decoded using the XorBytes function.The decrypted binary is then saved to the \"%TEMP%\" folder with a name consisting of a random string of numbers and the \".exe\" file extension and is executed.Alternatively, if the response from the C2 does not begin with the \"http\" string, the content is treated as a VBS and executed via a COM object.One of the executables deployed by the attackers via the PowerShell script consisted of an information stealer that exfiltrates files of specific extensions from the infected endpoint: .doc, .docx, .xls, .rtf, .odt, .txt, .jpg, .jpeg, .pdf, .ps1, .rar, .zip, .7z and .mdb. This is a new infostealer that Gamaredon has not previously used in other campaigns. We suspect it may be a component of Gamaredon's \"Giddome'' backdoor family, but we are unable to confirm that at this time.The malicious binary keeps track of what has been exfiltrated in a file named \"profiles_c.ini\" in the \"%USERPROFILE%\\Appdata\\Local\" folder. The malware stores the MD5 hash of a string containing the filename, file size and modification date of the exfiltrated file.Once started, the malware scans all attached storage devices looking for files with the aforementioned extensions. For each one, the malware makes a POST request with metadata about the exfiltrated file and its content.The parameter \"p\" contains metadata about the stolen file and the victim machine using the following format:%u&&%s&&%s&&%s&&%s&&%sWhere the various parameters are:<Hard_coded_value>&&<File_name>&&<File_Modification_Date_time>&&<FileSize>&&__&&<Computer_Name>&&<Username>&&<Victim_ID_randomly_generated_string_12_chars>&&<Volume Serial Number>The raw content of the file comes after the metadata. The request is made to a random URI under the parent C2 domain. The implant generates a random 12-character string that acts as a subdomain for the C2 domain to send requests to:E.g. <random_12_char_string>[.]celticso[.]ruThe implant will also search for the relevant file extensions in fixed and remote drives and specifically in the \"C:\\Users\" folder. The implant enumerates all the files recursively in the directories on the system while avoiding enumeration of any folder containing the following strings in the path:Avoiding these folders is likely an attempt by the malware to avoid exfiltrating system files thereby focussing on user files of interest only.For each file exfiltrated to the C2, the implant calculates the MD5 hash for the following information and stores it in the \"%LocalAppData%\\profiles_c.ini\" file:<file_path><File_size><File_modification_date_time>The implant also steals files from removable drives connected to the infected endpoint. When the implant finds a removable drive, it looks for files with the file extensions listed earlier. Once a file is found, the implant creates a randomly named folder in the %TEMP% directory and copies the original file from its original location to:%Temp%\\<randomly_named_folder>\\connect\\<removable_vol_serial_number>\\<original file path>For example, a user file found in a remote drive \"E:\" at path \"E:\\top_secret_docs\\isengard.doc\" will be copied to\"%temp%\\randomly_named_folder\\connect\\<removable_vol_serial_number>\\top_secret_docs\\isengard.doc\"The contents of the folder in the temp directory are subsequently exfiltrated to the C2.As with this actor's previous tools (e.g., the PS1 scripts), this binary also parses the server response and downloads additional payloads if requested. The response from the server consists of a flag indicating how the data should be treated:There are other indications this malware may be present on the system, listed below:Ways our customers can detect and block this threat are listed below. Documents4aa2c783ae3d2d58f12d5e89282069533a80a7ba6f7fe6c548c6230a9601e650 Files581ed090237b314a9f5cd65076cd876c229e1d51328a24effd9c8d812eaebe6a34bf1a232870df28809597d49a70d9b549d776e1e4beb3308ff6d169a59ecd0278c6b489ac6cebf846aab3687bbe64801fdf924f36f312802c6bb815ed6400ba1cb2d299508739ae85d655efd6470c7402327d799eb4b69974e2efdb9226e447a9916af0476243e6e0dbef9c45b955959772c4d18b7d1df583623e06414e53b78294815c2342ff11739aff5a55c993f5dd23c6c7caff2ee770e69e88a7c4cb6abe79d470c081975528c0736a0aa10214e10e182c8948bc4526138846512f19e75264e8a8571fe0ef689933b8bc2ebe46b985c9263b24ea34e306d54358380cbbff7e8580ce6df5d5f5a2448b4646690a6f6d66b1db37f887b451665f4115d1a21ec69271abd8ebd1a42ac1c2fa5cdd9373ff936dc73f246e7f77435c8fa0f84c Files750bcec54a2e51f3409c83e2100dfb23d30391e20e1c8051c2bc695914c413e3139547707f38622c67c8ce2c026bf32052edd4d344f03a0b37895b5de016641ahxxp://a0698649.xsph[.]ru/barley/barley.xmlhxxp://a0700343.xsph[.]ru/new/preach.xmlhxxp://a0700462.xsph[.]ru/grow/guests.xmlhxxp://a0700462.xsph[.]ru/seek/lost.xmlhxxp://a0701919.xsph[.]ru/head/selling.xmlhxxp://a0701919.xsph[.]ru/predator/decimal.xmlhxxp://a0701919.xsph[.]ru/registry/prediction.xmlhxxp://a0704093.xsph[.]ru/basement/insufficient.xmlhxxp://a0704093.xsph[.]ru/bass/grudge.xmlhxxp://a0705076.xsph[.]ru/ramzeses1.htmlhxxp://a0705076.xsph[.]ru/regiment.txthxxp://a0705269.xsph[.]ru/bars/dearest.txthxxp://a0705269.xsph[.]ru/instruct/deaf.txthxxp://a0705269.xsph[.]ru/prok/gur.htmlhxxp://a0705581.xsph[.]ru/guinea/preservation.txthxxp://a0705880.xsph[.]ru/band/sentiment.txthxxp://a0705880.xsph[.]ru/based/pre.txthxxp://a0705880.xsph[.]ru/selection/seedling.txthxxp://a0706248.xsph[.]ru/reject/headlong.txthxxp://a0707763.xsph[.]ru/decipher/prayer.txthxxp://155.138.252[.]221/get.phphxxp://45.77.237[.]252/get.phphxxp://motoristo[.]ru/get.phphxxp://heato[.]ru/index.phphxxps://<random_string>.celticso[.]ru162[.]33[.]178[.]129kuckuduk[.]rupasamart[.]rucelticso[.]ruCisco Talos has recently observed an increase in activity conducted by 8Base, a ransomware group that uses a variant of the Phobos ransomware and other publicly available tools to facilitate their operations.Cisco Talos identified the most prolific Phobos variants, TTPs and affiliate structure, based on their activity and analysis of over 1,000 samples from VirusTotal dating back to 2019. We assess with moderate confidence Eking, Eight, Elbie, Devos and Faust are the most common variantsCisco Talos has recently observed an increase in spam messages abusing a feature of quizzes created within Google Forms."
   },
   {
      "time": "2022-09-19",
      "title": "GTA 6 source code and videos leaked after Rockstar Games hack",
      "text": " Updated on 9/19/22 to add Rockstar's statement at the end of the article.Grand Theft Auto 6 gameplay videos and source code have been leaked after a hacker breached Rockstar Game's Slack server and Confluence wiki.The videos and source code were first leaked on GTAForums yesterday, where a threat actor named ‘teapotuberhacker’ shared a link to a RAR archive containing 90 stolen videos.The videos appear to be created by developers debugging various features in the game, such as camera angles, NPC tracking, and locations in Vice City. In addition, some of the videos contain voiced conversations between the protagonist and other NPCs.The hacker claims to have stolen \"GTA 5 and 6 source code and assets, GTA 6 testing build,\" but is trying to extort Rockstar Games to prevent further data from being released. However, the threat actor says they are accepting offers over $10,000 for the GTA V source code and assets but are not selling the GTA 6 source code at this time.Rockstar games have not released a statement or responded to our email about the attack at this time. However, Bloomberg's Jason Schreier confirmed the leak was valid after speaking to sources at Rockstar.The leaked videos have since made it onto YouTube and Twitter, with Rockstar Games issuing DMCA infringement notices and takedown requests to get the videos offline.\"This video is no longer available due to a copyright claim by Take 2 Interactive,\" reads a copyright claim by Take 2 Interactive, the owner of Rockstar Games. These takedown demands lend further validity to the fact that the leaked GTA 6 videos are real.However, Rockstar Game's efforts come too late, as the threat actor and others had already started leaking the stolen GTA 6 videos and portions of the source code on Telegram.For example, the threat actor leaked a GTA 6 source code file today that is 9,500 lines long and appears to be related to executing scripts for various in-game actions.The hacker hasn’t shared details on how they gained access to the GTA 6 videos and source code other than claiming to have stolen them from Rockstar’s Slack and Confluence servers.The threat actor also claims to be the same hacker, named 'TeaPots,' behind the recent Uber cyberattack, but BleepingComputer could not confirm whether these claims are valid.However, during the cyberattack on Uber, the threat actor also gained access to the company's Slack server and other internal services after performing a social engineering attack on an employee.While there are not enough details about the Rockstar Games hack, the types of servers accessed and the very public announcements are similar to the Uber hacker’s tactics.Update 9/19/22:On Monday morning, Rockstar Games confirmed that they suffered a network intrusion allowing hackers to download company data from their systems.BleepingComputer has shared the full statement below:\"We recently suffered a network intrusion in which an unauthorized third party illegally accessed and downloaded confidential information from our systems, including early development footage for the next Grand Theft Auto. At this time, we do not anticipate any disruption to our live game services nor any long-term effect on the development of our ongoing projects.We are extremely disappointed to have any details of our next game shared with you all in this way. Our work on the next Grand Theft Auto game will continue as planned and we remain as committed as ever to delivering an experience to you, our players, that truly exceeds your expectations.  We will update everyone again soon and, of course, will properly introduce you to this next game when it is ready. We want to thank everyone for their ongoing support through this situation.\" - Rockstar Games.Unfortunately, the company has not shared any technical details or IOCs related to their attack to help security professionals better defend their networks.BleepingComputer has asked for further details about the cyberattack and will update this article if we learn anything new."
   },
   {
      "time": "2022-09-19",
      "title": "Critical Bug Identified in Kingspan TMS300 CS Water Tank Management System - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-09-19",
      "title": "TeamTNT hijacking servers to run Bitcoin encryption solvers",
      "text": " Threat analysts at AquaSec have spotted signs of TeamTNT activity on their honeypots since early September, leading them to believe the notorious hacking group is back in action.TeamTNT announced it was quitting back in November 2021, and indeed, most associated observations since then involved remnants of past infections like automated scripts but no new payloads.However, the recent attacks bear various signatures linked to TeamTNT and rely on tools previously deployed by the gang, indicating that the threat actor is likely making a comeback.The researchers observed three attack types being used in the allegedly new TeamTNT attacks, with the most interesting one being to use the computational power of hijacked servers to run Bitcoin encryption solvers.Named “the Kangaroo attack,” due to using Pollard’s Kangaroo WIF solver, the attack scans for vulnerable Docker Daemons, deploys an AlpineOS image, drops a script (“k.sh”), and eventually fetches the solver from GitHub.Possibly, the threat actors are merely experimenting with new attack pathways, payload deployment, and evading detection while performing intensive operations on captured systems, with the Kangaroo attack ticking all boxes.The “Cronb Attack” uses documented rootkits, cron jobs for persistence, cryptominers for profit, and tools for lateral movement. The novel element is the appearance of new C2 infrastructure addresses and more elaborate data exchange.The “What Will Be” attack targets Docker Daemons with shell-file dropping Alpine images again, exploiting a vulnerability to escape from the container to the host.Next, the intruders download and execute additional scripts, rootkits, and a cryptominer, while they also add cronjobs and perform SSH scans on the network.One new trick in this attack is introduced via those scripts, enabling the threat actors to optimize cryptomining performance by modifying CPU model-specific registers for the architecture.Whether it is TeamTNT conducting these attacks or someone else, organizations should ramp up their cloud security, strengthen Docker configuration, and apply all available security updates before it's too late."
   },
   {
      "time": "2022-09-19",
      "title": "Malware Targets Weblog Servers And Dockers APIs For Cryptomining - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-09-19",
      "title": "Major Vulnerabilities Found in Wireless LAN Devices in Airlines - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-09-19",
      "title": "New York ambulance service discloses data breach after ransomware attack",
      "text": " Empress EMS (Emergency Medical Services), a New York-based emergency response and ambulance service provider, has disclosed a data breach that exposed customer information.According to the notification, the company suffered a ransomware attack on July 14, 2022.An investigation into the incident revealed that the intruder had gained access to Empress EMS’ systems on May 26, 2022. About a month and a half later, on July 13, the hackers exfiltrated “a small subset of files,” a day before deploying the encryption.“Empress EMS is mailing letters to affected individuals and offering eligible individuals credit monitoring services,” the company announced.The details of the attack describe a standard double-extortion ransomware incident where cybercriminals steal files, encrypt systems, and then threaten the victim to publish the data unless a ransom is paid.Although the company does not mention the group responsible for the attack. However, BleepingComputer found that the Hive ransomware gang had prepared on July 26 a non-public entry for the Empress EMS data leak.The notice explains that even those who haven’t received a letter but can confirm they used Empress EMS’ services via healthcare statements, should contact the firm by October 9, 2022, to benefit from credit monitoring services.Empress EMS states it has strengthened the security of its systems and protocols to prevent similar incidents from happening in the future.Additionally, the publication was able to retrieve a sample of the stolen data and confirmed that many entries appear to belong to Empress EMS customers."
   },
   {
      "time": "2022-09-19",
      "title": "Uber Claims No Sensitive Data Exposed in Latest Breach… But There's More to This",
      "text": " Uber, in an update, said there is \"no evidence\" that users' private information was compromised in a breach of its internal computer systems that was discovered late Thursday.The ride-hailing company also said it's brought back online all the internal software tools it took down previously as a precaution, reiterating it's notified law enforcement of the matter.It's not immediately clear if the incident resulted in the theft of any other information or how long the intruder was inside Uber's network.Uber has not provided more specifics of how the incident played out beyond saying its investigation and response efforts are ongoing. But independent security researcher Bill Demirkapi characterized the company's \"no evidence\" stance as \"sketchy.\"Singapore-based Group-IB's follow-up analysis of downloaded artifacts as captured in some of the screenshots shared by the threat actor has revealed them to be logs gathered from info-stealing malware that were put up for sale just days before on the cybercriminal underground.\"These logs indicate that at least two Uber employees (from Indonesia and Brazil) have been infected by stealer malware: Raccoon and Vidar stealers,\" Group-IB said, suggesting the hacker may also have attempted to use the purchased stolen data to advance through Uber's network.\"Many times we only talk about APTs, like nation states, and we forget about other threat actors including disgruntled employees, insiders, and like in this case, hacktivists,\" Ismael Valenzuela Espejo, vice president of threat research and intelligence at BlackBerry, said.\"Organizations should include these as part of their threat modeling exercises to determine who may have a motivation to attack the company, their skill level and capabilities, and what the impact could be according to that analysis.\"It also shows that all it takes for a breach to take place is an employee to share their login credentials, proving that password-based authentication is a weak link in account security.\"Once again, we see that a company's security is only as good as their most vulnerable employees,\" Masha Sedova, co-founder and president of Elevate Security, said in a statement.\"We need to think beyond generic training, instead let's pair our riskiest employees with more specific protective controls. As long as we continue to address cybersecurity as solely a technical challenge, we will continue to lose this battle,\" Sedova added.Episodes like these are also proof that Time-based One Time Password (TOTP) codes – typically generated via authenticator apps or sent as SMS messages – are inadequate at securing 2FA roadblocks.\"MFA providers should *by default* automatically lock accounts out temporarily when too many prompts are sent in a short period of time,\" Demirkapi alternatively suggested, urging organizations to limit privileged access.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-09-19",
      "title": "Hacker sells stolen Starbucks data of 219,000 Singapore customers",
      "text": " The Singapore division of Starbucks, the popular American coffeehouse chain, has admitted that it suffered a data breach incident impacting over 219,000 of its customers.The first clue that they were breached came on September 10, when a threat actor offered to sell a database containing sensitive details of 219,675 Starbucks customers on a popular hacking forum.The hacking forum's owner, \"pompompurin,\" joined the discussion to back the validity of the stolen data, saying that the provided samples contain substantial proof of authenticity.Today, Starbucks Singapore sent out letters to notify its customers of a data breach, explaining that hackers may have stolen the following details:This breach concerns only customers who have used the Starbucks mobile app to make orders or used the chain's online store to purchase goods from one of the 125 shops the chain operates in Singapore.Additionally, the company said that no financial details, such as credit card information, have been compromised, as Starbucks does not store the data.Even though account passwords, Rewards membership, or credits aren't considered impacted, Starbucks Singapore urges customers to reset their passwords and remain vigilant against suspicious communications.The data seller on the hacking forums claims to have already sold one copy of the stolen data for $3,500 and is willing to offer at least four more copies to interested buyers.The reason for this limitation is to artificially keep the value of the offered data high, as selling it to many threat actors would diminish the value as multiple attacks are launched simultaneously.This approach raises the risk of Starbucks Singapore customers becoming targets of phishing attacks, social engineering, and scamming.It is also worth noting that the hacker initially offered access to the compromised admin panel for $25,000, enabling intruders to fabricate promo codes, change membership tiers, and more.However, access to the admin panel was lost at some point, so that offer has been retracted, and the sale is now limited to the database contents.Update 9/17/2022: A Starbucks spokesperson has sent BleepingComputer the following comment:We are aware of the unauthorized activity impacting a select number of customer accounts in Singapore and are working with our licensed operator in the market to protect customer information.Like all major retailers, Starbucks has safeguards in place to constantly monitor for fraudulent activity, which in this case, enabled early detection of the unauthorized activity.Customers are encouraged to use different usernames and passwords for different sites, especially those that keep financial information, to protect their data security."
   },
   {
      "time": "2022-09-19",
      "title": "Japanese Payment System Attacked By Fake Security App - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " A new malware has been observed by the Research team at McAfee Corp. This malware is found to be attacking NTT DOCOMO customers in Japan. The malware that is distributed via the Google Play Store pretends to be a legitimate mobile security app, \nbut in reality, it is a fraud malware designed to steal passwords and abuse reverse proxy focusing on \nNTT DOCOMO mobile service customers. The McAfee Cell Analysis team informed Google regarding the notoriety of the malware. In response, Google has made the application unavailable in Google Play Store and \nremoved known Google Drive files that are associated with the malware. In addition to this, Google Play \nShield has now alerted the customers by disabling the apps and displaying a warning. The malware publishes malicious fake apps on Google Play Store with various developer accounts that \nappear like some legitimate apps. According to a tweet by Yusuke Osumi, a Security Researcher at \nYahoo, the attacker lures the victims into installing the malware in their systems by sending \nthem an SMS message with a Google Play Store link, reportedly sent from overseas. Additionally, \nthey entice the users by displaying a requirement to update their security software. This way, the victim ignorantly installs the fraudulent app from Google Play Store and ends up installing the \nmalware. The malware asks the user for a community password but cleverly enough, it claims the \npassword is incorrect, so the user has to enter a more precise password. It does not matter if the password \nis incorrect or not, as this community password can later be used by the attacker for the NTT DOCOMO \nfee services and gives way to online funds. Thereafter, the malware displays a fake ‘Mobile Security’ structure on the user’s screen; the structure of \nthis Mobile Security structure interestingly resembles that of an outdated display of McAfee cell security. How does the malware functionA native library called ‘libmyapp.so’ written in Golang, is loaded through the app execution. When the \nlibrary is loaded, it attempts to connect with C&C servers utilizing an Internet Socket. WAMP (Internet \nSoftware Messaging Protocol) is then employed to speak and initiate Distant Process Calls (DPC). When the \nlink is formulated, the malware transmits the community data and the victim’s phone number, \nregistering the client’s procedural commands. The connection is then processed when the command is \nreceived from the server like an Agent. Wherein, the socket is used to transmit the victim’s Community \npassword to the attacker, when the victim enters his network password in the process.The attacker makes fraudulent purchases using this leaked information. For this, the RPC command \n‘toggle_wifi’ switch the victim’s Wi-Fi connection status, and a reverse proxy is provided to the attacker \nthrough ‘connect_to’. This would allow connecting the host behind a Community Handle Translation \n(NAT) or firewall. With the help of a proxy, now the attacker can ship by request through the victim’s \n \ncommunity network. Along with any other methods that the attackers may use, the malware can also use reverse proxy to \nacquire a user’s mobile and network information and implement an Agent service with WAMP for \nfraudulent motives. Thus, it is always advised by Mobile Security Organizations to be careful while \nentering a password or confidential information into a lesser-known or suspicious application.your nameYour Emailyour message"
   },
   {
      "time": "2022-09-19",
      "title": "Fake cryptocurrency giveaway sites have tripled this year",
      "text": " The number of websites promoting cryptocurrency giveaway scams to lure gullible victims has increased by more than 300% in the first half of this year, targeting mostly English and Spanish speakers using celebrity deepfakes.Security researchers at cybersecurity company Group-IB have identified more than 2,000 domains registered in 2022 specifically for this purpose.Each of these sites has an average reach of about 15,000 viewers. If this data is accuarte, scammers have a targeting pool of about 30 million people. The use of top-level domains (TLDs) that are considered more trustworthy (“.COM”, “.NET”), and “.ORG”) have also contributed to this success.Group-IB says that scammers abuse several video platforms to promote the fake giveaways in live streams with deepfakes of Elon Musk, Garlinghouse, Michael J. Saylor, and Cathie Wood. YouTube is first on the list, followed by Twitch.The promotional streams come from accounts that have been hijacked or rented from underground hackers who receive between 10% and 50% of the earnings, depending on the size of the channel.The more subscribers the channel has, the harder it is to block the stream, as it would take a higher number of reports to trigger YouTube’s moderation system.Additionally, the scammers have set up campaigns using the image of El Salvador’s president, Nayib Bukele, who has declared Bitcoin a legal tender in the country, or soccer player Cristiano Rolando who signed an exclusive partnership with Binance this summer.This shows that scammers are quick to adjust to new developments in the field and take advantage of the current context to promote realistic scams.Group-IB explains that the primary reason behind the sudden surge of cryptocurrency scams this year is the significant rise in the broader availability of tools that help in their making.“The phenomenal growth of fake crypto giveaways can be explained by a significantly enhanced arsenal and availability of tools for crypto scammers, even with low technical skills,” explains the cyber-intelligence firm.“Group-IB revealed that forums used by scammers make up a full-fledged marketplace that can help even first-time non-tech-savvy scammers carry out a crypto fraud scheme,” the researchers say.Russian-speaking forums today offer a dedicated market for hacked YouTube accounts, viewer boosting services, detailed tutorials on how to set up scams, drag-and-drop website creating platforms, bulletproof hosting services, and deepfake creation tools.Moreover, these forums are stamping grounds for scam mentors, fake giveaway promotion specialists, and various service contractors, so the fraudsters don't need any knowledge to run these campaigns.Group-IB says a complete crypto stream design costs around $200, while the production of a celebrity deepfake video would set the crooks back around $30.Fake giveaway landing pages cost between $200 and $600, manuals are sold for around $100, and fully automated toolkits range between $500 and $1,500 per month.\"Scams targeting crypto enthusiasts are becoming increasingly common, and their scope and sophistication are growing. Crypto giveaway scams have evolved into a profitable illicit market segment. Small-time scammers and more advanced cybercriminals band together, allowing them to automate and streamline operations.” - Group IBProspective investors and digital asset enthusiasts should be vigilant about cryptocoin giveaways and always do a thorough check of the details behind such promos before providing any sensitive information.When a celebrity-endorsed promotion on YouTube looks too good, an easy way to figure out if it's a scam or not is to check the channel name and history. If it’s not the official channel of the celebrity, the giveaway is most likely a scam attempt."
   }
]