[
   {
      "time": "2022-10-27",
      "title": "SiriSpy - iOS bug allowed apps to eavesdrop on your conversations with Siri | Rambo Codes",
      "text": " TL;DR: Any app with access to Bluetooth could record your conversations with Siri and audio from the iOS keyboard dictation feature when using AirPods or Beats headsets. This would happen without the app requesting microphone access permission and without the app leaving any trace that it was listening to the microphone.One of the biggest myths when it comes to security and privacy on mobile devices is the old saying that Facebook is using your device's microphone to listen to everything you say, in order to sell more targeted ads. There's never been any evidence of that, and iPhones have very strong security measures in place to prevent such a thing.This section might be too basic for folks who are already familiar with how this stuff works under the hood, feel free to skip it.The system that protects you from unfettered access to your sensitive data on Apple's operating systems is TCC (Transparency, Consent, and Control), which is directly responsible for most of the permission prompts you see when an app asks to access your location, calendar, microphone, camera, etc.Access to system resources is mediated with the use of daemons, which are system processes that run in the background, many times with elevated privileges when compared to regular apps. Apps can then request information from those daemons, effectively opening a little door from their sandbox to the outside world.Those doors are usually very tightly controlled on Apple's platforms with the use of code signing and entitlements. Out of the box, modern Apple devices will only run apps with a code signature that's been approved by Apple. You can think of a code signature of an app as the equivalent of a government-issued ID, where the government is Apple. Entitlements are like licenses, little bits of information that have also been verified by Apple and can give apps access to system resources that are normally not accessible.All of these protections can be quite effective. However, their effectiveness relies heavily on how well Apple's engineers have implemented them in the system daemons, and sometimes unforeseen workarounds can result in a situation where the door has been very well shut and secured, but the window has been left wide open.Since the introduction of the H1 chip with the AirPods (2nd generation), users can trigger \"Hey, Siri\" with AirPods, and talk to the assistant without much effort and then receive a reply in the form of \"here's what I found on the web...\". One thing you may or may not have noticed if you've used Siri with modern AirPods is that there's no disruption to audio quality when you're talking to Siri, even though you're using the microphone in the AirPods to do so. This is very different from when you're using it for a video conference, for example, where you'll notice a significant drop in the output audio quality.I always wondered why that was the case. Knowing that the drop in output quality when using the microphone is a physical limitation of the Bluetooth standards used by AirPods and other similar headsets, how talk to Siri had been implemented on AirPods without disrupting audio quality had always been a bit of a mystery to me, but I never put much thought or effort into figuring that out.I'm a fan of creating tools that make my job easier, so a while back I wrote a little command-line tool that I call bleutil, which can be used to interact with Bluetooth Low Energy devices on macOS. I use it all the time to debug what's going on with my AirPods by looking at the advertisement packets they're sending out.While working on a new feature for this tool, which can be used to connect to a Bluetooth LE device and query its GATT¹ database, I decided to add the ability to subscribe to notifications to a service's characteristics using this tool, which would then stream a hexadecimal representation of the values over time to the Terminal window.¹ If you're not familiar with Bluetooth Low Energy terminology, GATT stands for \"Generic Attribute Profile\". It's a standard adopted by Bluetooth LE devices that allows them to send data back and forth using services and characteristics. You can think of services as folders on a file system, where each service can have a bunch of characteristics within it, which are like files.I had never looked into the services and characteristics present on AirPods and similar devices because most of the information I use to power AirBuddy's features comes from advertisements or Bluetooth Classic, which don't require me to connect to the devices over Bluetooth LE and interact with the GATT database.Naturally, while testing this new feature I was working on, I was wearing my AirPods. I noticed that the AirPods included a service with the UUID 9bd708d7-64c7-4e9f-9ded-f6b6c4551967, and with characteristics that supported notifications². I ran my tool against my AirPods and left it running for a while, but no events came through.² In Bluetooth LE GATT, when a characteristic supports notifications (or indications), it means that other devices can subscribe to be notified when the data stored by that characteristic changes, without having to be constantly asking (polling) for the current data. It's essential for real-time communication between devices.Digging a bit into it, I learned that 9bd708d7-64c7-4e9f-9ded-f6b6c4551967 is the DoAP service, a service used for Siri and Dictation support.I decided to test it again. This time, while my tool was running and waiting for events to come from the AirPods, I invoked Siri while wearing them. As soon as I did that, a firehose of hex bytes started to stream down my Terminal window. Not only that, but as I spoke to Siri through my AirPods, I noticed that the bytes would change rapidly, and would settle down as I went silent again. Could it be that I was looking at audio data? 😨You can watch a reproduction in the video below:As it turns out, I was in fact looking at audio data coming from the AirPods. My first thought was \"oh, so that's how they do it, this is cool\". My second thought was \"oh, no!\".I always have mixed feelings when I discover something like this: a mix of excitement for having found a cool new thing to investigate and learn from, and disappointment/concern that this issue has been there in the wild, sometimes for years.Finding out that I could get audio from AirPods without asking for permission to use the microphone on macOS was the first step.The second step was checking Apple's other platforms to see if they were also affected. So I wrote a little app that I could run on iPhone, iPad, Apple Watch, and the Apple TV, then tried it out on devices running both the shipping version of iOS 15 and the latest iOS 16 beta at the time (this happened in late August).The third step was figuring out what the audio data was. I was definitely seeing a bunch of bytes coming in, but who knows, maybe they were encrypted or something. The seemingly direct correlation between me speaking to Siri and the bytes changing had already made me think they weren't, but I had to confirm it.I know a little bit about how digital audio works, but it's definitely an area I've had very little experience in throughout my career in software development, limiting myself to using high level APIs such as Apple's AVFoundation whenever I have to deal with audio or video.I did notice with some combinations of parameters that the garbled mess I was hearing did vaguely match the loudness of what I had said during the recording, which again told me the data was likely unencrypted.In hindsight, I should've realized that it wouldn't make any sense for the audio being sent over Bluetooth LE to be uncompressed, given the bandwidth constraints of the technology. Now all I had to do was figure out which codec was being used, then I'd be able to decode the audio and play it back.Opus is unmatched for interactive speech [...]Well, sounds a lot like the sort of thing you'd use for talking to digital assistants.So I compiled the Opus library for all of Apple's platforms, then wrote a little app that would connect to the AirPods and keep the connection open in the background, listening to notifications and audio data.It sounds simple, but the paragraph above comprises several hours of work – almost a full day – after which I had this:Here's a summary of what the app does:In a real-world exploit scenario, an app that already has Bluetooth permission for some other reason could be doing this without any indication to the user that it's going on, because there's no request to access the microphone, and the indication in Control Center only lists \"Siri & Dictation\", not the app that was bypassing the microphone permission by talking directly to the AirPods over Bluetooth LE.³ Yes, even though this exploit bypasses the microphone permission, it still needs access to Bluetooth, so that permission is not bypassed. However, most users would not expect that giving an app access to Bluetooth could also give it access to their conversations with Siri and audio from dictation. And, as you'll see in the following paragraphs, I was also able to find a way around the Bluetooth permission on macOS.In the course of figuring out how things work for my report on the vulnerability described above, I had to investigate how Apple's operating systems communicate with the AirPods, which led me to discover another issue.The system process responsible for handling of the DoAP protocol on Apple's platforms is BTLEServerAgent (or BTLEServer, depending on the platform). This agent or daemon provides an interface over the mach service com.apple.BTLEAudioController.xpc, which other processes on the system can use to request audio from the AirPods DoAP service.There are hundreds (if not thousands) of mach services exposed by system agents and daemons on Apple's operating systems, but sandboxing restrictions and entitlement requirements prevent most apps from talking to them.For services that are exposed to third-party apps, system daemons usually check for a specific entitlement before allowing an app to send requests to them, or put up a TCC prompt on the app's behalf, only allowing the communication to go through once the user has approved it.So at least on macOS, apps would be able to record your conversations with Siri or dictation audio without any permission prompts at all. Even worse, this particular exploit would also allow the app to request DoAP audio on-demand, bypassing the need to wait for the user to talk to Siri or use dictation.Here's a demo of this in action:Once again, these issues show that no matter how private and secure Apple's products and software can be, there's always more work to be done.November 9, 2022 - Update: The original version of this article mentioned a bug bounty payment of US$7000. However, this was due to an issue with the way Apple's security team had communicated about the bounty. They broke down the two vulnerabilities discovered into separate CVEs, one of which was awarded a bounty of US$7000, while the other one was awarded US$22500. So the total bounty payment for the bugs described in this report was of US$29500. Apple's security team apologized for the confusion, and has since released a new web platform for bug submissions, which should make this a lot better going forward.When I first published this writeup, I hadn't included details about the mitigations Apple has put in place for the issues discussed, because to be honest they're not that interesting. Since a few folks have asked for details on this, here they are.The main issue – direct access to AirPods DoAP over BLE GATT – was addressed by restricting access to the service. Even though AirPods and iPhones, Macs, etc are standard Bluetooth devices, Apple has a system in place to limit which services third-party apps can access, so they just added the DoAP service to that deny list.For the second issue – talking to BTLEServerAgent on macOS – the system agent now correctly checks that the calling process has the com.apple.bluetooth.system entitlement before allowing communication to continue. This is the same entitlement that also opens up access to those \"forbidden\" GATT services.Now, if an app attempts to talk to the agent without the appropriate entitlement, it closes the connection, then logs a passive-aggressive message to the console:Guilherme Rambo writes about his coding and reverse engineering adventures."
   },
   {
      "time": "2022-10-27",
      "title": "Leeloo Multipath: Authorization bypass and symlink attack in multipathd (CVE-2022-41974 and CVE-2022-41973) | Qualys Security Blog",
      "text": " Last updated on: December 21, 2022The Qualys Research Team has discovered two vulnerabilities in multipathd, the most important of which can be exploited for authorization bypass. Qualys recommends security teams apply patches for these vulnerabilities as soon as possible.The Qualys Research Team combined these two vulnerabilities with the third vulnerability in another package installed by default on Ubuntu Server and obtained full root privileges on Ubuntu Server 22.04; other releases are probably also exploitable. We will publish this third vulnerability, and the complete details of this local privilege escalation, in an upcoming advisory next month.The multipathd daemon oversees checking for failed paths. When this happens, it will reconfigure the multipath map the path belongs to so that this map regains its maximum performance and redundancy. The multipathd daemon runs as a root in the default installation of  Linux Operating Systems like Ubuntu Server.Successful exploitation of the three vulnerabilities allows any unprivileged user to gain root privileges on the vulnerable host. Qualys security researchers have independently verified the vulnerability, developed an exploit and obtained full root privileges on default installations of Ubuntu.As soon as the Qualys Research Team confirmed the vulnerability, we engaged in responsible vulnerability disclosure and coordinated with vendors and open-source distributions to announce this newly discovered vulnerability.The technical details of Leeloo Multipath vulnerabilities can be found at:Qualys is releasing the QIDs in the table below as they become available, starting with vulnsigs version VULNSIGS-2.5.615-2 and in Linux Cloud Agent manifest version lx_manifest-2.5.615.2-1Please check Qualys Vulnerability Knowledgebase for the full list of coverage for these vulnerabilities.The following instructs current Qualys customers on how to detect Leeloo Multipath in their environment.operatingSystem.name:”Linux”Using Qualys VMDR, the Leeloo Multipath vulnerability can be prioritized using the following real-time threat indicators (RTIs):We expect vendors to release patches for this vulnerability in the short term. Qualys Patch Management can be used to deploy those patches to vulnerable assets, when available.Using the same prioritization based on RTI method as described above, customers can use the “patch now” button found to the right of the vulnerability to add Leeloo Multipath to a patch job. Once patches are released, Qualys will find the relevant patches for this vulnerability and automatically add those patches to a patch job. This will allow customers to deploy those patches to vulnerable devices, all from Qualys Cloud Platform.With the Qualys Unified Dashboard, you can track the vulnerability exposure within your organization and view your impacted hosts, their status, distribution across environments and overall management in real-time, allowing you to see your MTTR.  “Leeloo Multipath” Dashboard.No. Not at this time. No. No. But if an attacker can log in as an unprivileged user, the vulnerability can be quickly exploited to gain root privileges.  This is a pun/reference to “Leeloo Multipass” (which is actually related to authentication and authorization) from the movie “The Fifth Element”. An attacker who has unprivileged access to an unpatched Linux system can exploit these vulnerabilities to obtain full root privileges; i.e., this is a Local Privilege Escalation to administrator privileges. The first vulnerability is an authorization bypass (CVE-2022-41974) that allows an unprivileged attacker to trigger the second vulnerability, a symlink attack (CVE-2022-41973). This allows the attacker to create files and directories in arbitrary places of the filesystem. To the best of our knowledge, these two vulnerabilities are not powerful enough to lead to full root privileges on their own. However, we were able to combine them with a third vulnerability that we discovered in another package, and obtained full root privileges on Ubuntu Server.  We will publish this third vulnerability, and hence this complete exploit chain (of these three otherwise unexploitable vulnerabilities), in an upcoming advisory. No, not urgently, since this is a Local Privilege Escalation that (to the best of our knowledge) requires an additional vulnerability to be successfully exploited. Nonetheless, since this additional vulnerability will become public in a few weeks, the multipathd vulnerabilities should be patched as part of a normal patch management life cycle. To the best of our knowledge, no. These vulnerabilities affect all Linux distributions; multipathd is a common Linux daemon, especially on servers. For example, our complete exploit chain targets the default installation of Ubuntu Server. We contacted the SUSE Security Team because one of multipathd’s most active developers works for SUSE, so they were able to put us in direct contact with him, via encrypted email. Your email address will not be published. Required fields are marked *CommentNameEmail Save my name, email, and website in this browser for the next time I comment. \n\nΔ\nLearn more about Qualys and industry best practices.\n\t\t\t\t\nShare what you know and build a reputation.\n\t\t\t\t\nSecure your systems and improve security for everyone.\n\t\t\t\t"
   },
   {
      "time": "2022-10-27",
      "title": "Notorious ‘BestBuy’ hacker arraigned for running dark web market",
      "text": " A notorious British hacker was arraigned on Wednesday by the U.S. Department of Justice for allegedly running the now defunct 'The Real Deal\" dark web marketplace.Threat actors used this platform to sell anything from stolen credentials for U.S. government agencies' systems and hacking tools to drugs, weapons, and government data.Kaye also allegedly trafficked Twitter and Linked accounts and conspired with a threat actor known as TheDarkOverlord to sell stolen Social Security numbers.He laundered the cryptocurrency obtained while operating The Real Deal using the Bitmixer.io Bitcoin mixer service to hide the illicit gains from law enforcement's blockchain tracing analysis efforts.According to DOJ's press release, Kaye was overseas when the indictment was filed, and he consented in September 2022 to his extradition from Cyprus to the U.S."
   },
   {
      "time": "2022-10-27",
      "title": "White House announces 100-day sprint on chemical sector cybersecurity",
      "text": " The Biden administration on Wednesday launched an effort to protect the country’s chemical sector from cyberattacks, the latest bid to shore up the nation’s critical infrastructure against digital assault.The latest 100-day sprint, led by the Cybersecurity and Infrastructure Security Agency (CISA), will seek to encourage companies to share threat information with the federal government, the fact sheet states.Today's announcement comes as CISA and the National Institute of Standards and Technology are readying to unveil voluntary cybersecurity performance goals for critical infrastructure that will set the government’s expectations for private sector entities.“Strengthening the resiliency of US critical infrastructure to protect the services Americans rely on is hallmark of our cybersecurity strategy,” Adrienne Watson, spokesperson for the White House's National Security Council, tweeted.Martin Matishak is a senior cybersecurity reporter for The Record. He spent the last five years at Politico, where he covered Congress, the Pentagon and the U.S. intelligence community and was a driving force behind the publication's cybersecurity newsletter.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-27",
      "title": "LinkedIn's new security features combat fake profiles, threat actors",
      "text": " LinkedIn has introduced three new features to fight fake profiles and malicious use of the platform, including a new method to confirm whether a profile is authentic by showing whether it has a verified work email or phone number.Over the past couple of years, LinkedIn has become heavily abused by threat actors to initiate communication with targets to distribute malware, perform cyberespionage, steal credentials, or conduct financial fraud.Today, LinkedIn announced that it has begun to display more information about accounts to verify their authenticity, actively hunt for fakes using AI, and warn users when they receive suspicious messages.The first step to fighting fake accounts on LinkedIn is introducing a new \"About this profile\" section that gives users information like when the user created their profile, if the holder has verified their number, and if they linked a work email.If a cybercriminal was to use a fake/impersonated account to approach a target on LinkedIn, they'd have to invest unrealistic amounts of time maintaining and operating a fake account that has a believable creation date.Also, having no access to a corporate email from the impersonated company, it would be challenging for threat actors to validate their accounts as authentic.The second step is to use AI to catch accounts using AI-generated images as profile photos to give a false sense of authenticity, which is a clear sign of fraudulent activity.Lastly, LinkedIn now displays warnings when a chat participant proposes to take communications outside the platform.In most of these cases, the victims are convinced to download an IM clone, which installs a modified version of a communication app along with spyware.Only time will tell if these safety features will prove adequate to stop bad actors from abusing LinkedIn, but the targeted measures the platform introduced should make hackers' operations much harder."
   },
   {
      "time": "2022-10-27",
      "title": " UK Penalizes Interserve £4.4 Million for Security Breach - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-10-27",
      "title": "India Fines Google $113 Million To Not Allow Third-Party Payments",
      "text": " Antitrust Fines have now become an everyday problem for Google.The Competition Commission of India (CCI) has ordered Google to allow app developers to use third-party payment processing services for in-app purchases or for purchasing apps from the Play Store.The CCI order stated, “Google has been given 30 days to provide the requisite financial details and supporting documents.”According to CCI, Play Store policies require app developers to exclusively and mandatorily use Google Play’s billing system (GPBS) not only for receiving payments for apps and other digital products but also for certain in-app purchases.Furthermore, app developers can’t provide users with a direct link to a webpage containing an alternative payment method within the app. Google Play’s billing system also eliminates the use of a language that encourages a user to purchase a digital item outside of the app.The investigation of the aforementioned matter begin in late 2020 after CCI claimed that GPBS imposes an “unfair condition” on consumers and developers, so is in violation of India’s laws.CCI also correctly claimed that Google is not using its own billing system for its own apps like YouTube and that the “imposition of discriminatory conditions as well as pricing as YouTube is not paying the service fee as being imposed on other apps covered in the GPBS requirements.”Naval Chopra, an antitrust partner at India’s Shardul Amarchand law firm which represented that complainant, told Reuters on Tuesday that,“CCI’s order will help ensure healthy competition and reduce costs for app developers.” He further added that “The CCI order directing Google to allow alternate payment processing systems will remove the artificial barrier that Google had erected.”Last week Google was fined $161m by India for using its Android platform to dominate the market.You will be surprised to know that, Apple also faced an almost similar legal issue in South Korea recently and the company was ordered to accept external payment gateways for App Store purchases."
   },
   {
      "time": "2022-10-27",
      "title": "Battling the Russian Disinformation War - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-27",
      "title": "Medibank now says hackers accessed all its customers’ personal data",
      "text": " ​Australian insurance firm Medibank has confirmed that hackers accessed all of its customers' personal data and a large amount of health claims data during a recent ransomware attack.In an announcement published today, the companies warned that an internal investigation into the attack has shown that the threat actors had far greater access to customer data than initially thought.More specifically, Medibank has confirmed that the following data was compromised:While data access and data exfiltration are separate things, Medibank found evidence that, in some cases, the threat actors managed to remove some of the accessed data, so customers should assume that all of this data was stolen.\"As a result, we expect that the number of affected customers could grow substantially.\"However, many ransomware gangs steal corporate data before attempting to encrypt devices, which appears to have happened during this attack.Medibank soon realized that the threat actors had exfiltrated client data, so the internal investigation took a more targeted approach, eventually revealing a full-scale data breach.Based on this development, Medibank now upgrades its response and support to customers by providing the following:Meanwhile, following a series of high-profile and damaging data breaches that hit several Australian firms in the past couple of weeks, the government is working to introduce stricter data protection laws.The Bill will also give the Australian Information Commissioner greater powers to resolve privacy breaches and force companies to share all details about what was compromised with the agency.It also establishes a data-sharing channel between the Commissioner and the Australian Communications and Media Authority."
   },
   {
      "time": "2022-10-27",
      "title": "LV Ransomware Exploits ProxyShell in Attack on a Jordan-based Company",
      "text": " BusinessImprove your risk posture with attack surface managementSecurity that enables business outcomesGain visibility and meet business needs with securityConnect with confidence from anywhere, on any deviceSecure users and key operations throughout your environmentMove faster than your adversaries with powerful purpose-built XDR, attack surface risk management, and zero trust capabilitiesMaximize effectiveness with proactive risk reduction and managed servicesUnderstand your attack surface, assess your risk in real time, and adjust policies across network, workloads, and devices from a single consoleDrive business value with measurable cybersecurity outcomesSee more, act fasterEvolve your security to mitigate threats quickly and effectivelyEnsure code runs only as intendedGain visibility and control with security designed for cloud environmentsProtect patient data, devices, and networks while meeting regulationsProtecting your factory environments – from traditional devices to state-of-the-art infrastructuresICS/OT Security for the oil and gas utility industryICS/OT Security for the electric utilityStop threats with comprehensive, set-it-and-forget-it protectionBridge threat protection and cyber risk managementOperationalize a zero trust strategyStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformThe most trusted cloud security platform for developers, security teams, and businessesProactively discover, assess, and reduce cyber riskStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformSecure your data center, cloud, and containers without compromising performance by leveraging a cloud security platform with CNAPP capabilitiesSimplify security for your cloud-native applications with advanced container image scanning, policy-based admission control, and container runtime protectionSecurity for cloud file/object storage services leveraging cloud-native application architecturesDefend the endpoint through every stage of an attackStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformOptimized prevention, detection, and response for endpoints, servers, and cloud workloadsOn-premises and cloud protection against malware, malicious applications, and other mobile threatsExpand the power of XDR with network detection and responseStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformProtect against known, unknown, and undisclosed vulnerabilities in your networkDetect and respond to targeted attacks moving inbound, outbound, and laterallyRedefine trust and secure digital transformation with continuous risk assessmentsStop phishing, malware, ransomware, fraud, and targeted attacks from infiltrating your enterpriseLearn about solutions for ICS / OT security.Stop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformKeep ahead of the latest threats and protect your critical data with ongoing threat prevention and analysisAugment security teams with 24/7/365 managed detection, response, and supportAugment threat detection with expertly managed detection and response (MDR) for email, endpoints, servers, cloud workloads, and networksOur trusted experts are on call whether you're experiencing a breach or looking to proactively improve your IR plansStop breaches with the best response and detection technology on the market and reduce clients’ downtime and claim costsGrow your business and protect your customers with the best-in-class complete, multilayered securityDeliver modern security operations services with our industry-leading XDRPartner with a leading expert in cybersecurity, leverage proven solutions designed for MSPsAdd market-leading security to your cloud service offerings – no matter which platform you useIncrease revenue with industry-leading securityDiscover the possibilitiesWe work with the best to help you optimize performance and valueJoin us at AWS re:Invent Nov. 27-Dec. 1Engage with us >Understanding ChatGPT's potential for misuse via malware creationLearn more >How threat actors leverage file-sharing to harvest credentialsLearn more >Understanding how stolen data is acquired and soldProtect your organization >Content has been added to your FolioOur blog entry provides a look at an attack involving the LV ransomware on a Jordan-based company from an intrusion analysis standpointBy: Mohamed Fahmy, Sherif Magdy, Ahmed Samir\n\t\t\n\t\t\tOctober 25, 2022\nRead time:  ( words)\n\tSave to FolioIn this blog entry, we will provide details on a recent intrusion performed by a group affiliate that involved the compromise of the corporate environment of a Jordan-based company. In this incident, the attackers used the double-extortion technique to blackmail their victims, threatening to release allegedly stolen data in addition to encrypting the victim’s files.In December 2021, we observed a post on a cybercrime forum from a malicious actor claiming to operate the LV ransomware and seeking network access brokers. The malicious actor expressed interest in obtaining network access to Canadian, European and U.S. entities and then monetizing them by deploying the ransomware.Reported LV ransomware breaches have been increasing since the second quarter of 2022, which aligns with the malicious actor’s efforts to expand its affiliates program. The chart shown in figure 3 illustrates this increase in activity. Based on data from Trend Micro™ Smart Protection Network™ and other internal sources, Europe was the region with the highest number of breach alerts, while the US and Saudi Arabia were the countries with the highest number of reported incidents caused by the ransomware payload. The attacks spanned multiple industry verticals — with manufacturing and technology being the most affected industries — demonstrating the group’s opportunistic approach. This section details the tools, tactics, and procedures (TTPs) used by the affiliate that infiltrated one of the targeted victims’ environments, as observed from an incident response viewpoint.The attacker then executed a persistent malicious PowerShell code that was used to download and execute another PowerShell backdoor file in the server from the malicious IP address 185[.]82[.]219[.]201, as shown in Figure 7.The same IP address that hosted the malicious PowerShell code was also found serving a tunneling tool that we believe was used for data exfiltration.Based on our analysis of the Internet Information Services (IIS) access logs on the infected Exchange servers, the following IP addresses were exploiting the Proxyshell vulnerability during the same timeframe as the intrusion.For the credential access and lateral movement phases, the attackers used Mimikatz to dump credentials, while NetScan and Advanced Port Scanner were used for discovery. Based on the event logs collected from one of the infected Exchange servers, there were many successful logins using compromised user accounts a day before the ransomware infection occurred on September 8, 2022.Once the attacker gained access to the domain controller via remote desktop protocol (RDP) using the compromised account of the domain administrator, the ransomware samples were dropped on the server and a malicious group policy containing a malicious scheduled task was created on Sep 9, 2022 to execute ransomware from the shared folder hosted on the Domain Controller server. The domain controller server was used by the attackers to create a malicious group policy object (GPO) on Sep 9, 2022. The GPO then created a malicious scheduled task that ran the malicious batch files “1.bat” and “install.bat” to deploy the ransomware on the rest of the machines that are connected to the domain controller. The batch file “install.bat” was used to disable the security agent services found on the targeted machines.After deploying the ransomware, the attacker deleted the scripts folder that contained the malicious file samples.The dropped ransom note showed that the files were encrypted with the l7dm4566n extension on the specific machine we analyzed.The PowerShell command executed after the Microsoft Exchange exploitation is responsible for downloading and executing another PowerShell script from the command-and-control (C&C) server 185[.]82[.]219[.]201. The downloaded PowerShell will be executed directly from memory to bypass detection. The packed executable stores the LV ransomware binary as an RC4-encrypted data within a section named “enc.”After unpacking the new payloads and comparing them to the old payloads from the previous research, we determined that both payloads were identical, indicating that the threat actor behind the LV ransomware did not enhance the main capabilities of their payload, but instead expanded the affiliate programs as shown in the first section. The similarity results between both samples (shown in Figure 25) indicate that both have the same capabilities.By partnering with threat actors that have access to networks via the underground, the LV ransomware has been able to target multiple regions and industries. This development shows that the impact of a ransomware variant is not solely reliant on the addition of new capabilities, but also on other factors such as a greater reach and better distribution networks.Ransomware operators commonly employ vulnerability exploitation techniques as part of their routines. Organizations should consider allocating enough resources into regularly patching and updating their infrastructure and software, especially if it involves addressing major vulnerabilities such as ProxyShell. Furthermore, regular auditing and taking inventory of assets and data helps ensure that enterprises are up to date on what is happening within their system. Finally, implementing data protection, backup, and recovery measures ensures that data is not lost even if a successful ransomware infection occurs.A multilayered approach can help organizations guard all possible entry points into the system for endpoints, emails, web, and networks. Security technologies that can detect malicious components and suspicious behavior that enterprises can consider include:FilenameSHA-256Detection nameenc_.exefc0d749c75ccd5bd8811b98dd055f9fa287286f7Ransom.Win32.LVRAN.YMCIKTenc_.exeB8FF09ABEAD5BAF707B40C84CAF58A3A46F1E05ARansom.Win32.LVRAN.YMCIKT2.txt2e02a6858b4e8dd8b4bb1691b87bc7d5545297bcTrojan.BAT.LVRAN.YMCIL3.txtf25c9b5f42b19898b2e3df9723bce95cf412a8ffTrojan.BAT.LVRAN.YMCILl7dm4566n-README.txt027889533afe809b68c0955a7fc3cb8f3ae33c08Ransom.Win32.LVRAN.YMCIK.note1.bat3ffc87d9b429b64c09fcc26f1561993c3fb698f4Trojan.BAT.LVRAN.YMCILno.txt1b67e4672b2734eb1f00967a0d6dd8b8acc9091eTrojan.Win32.LVRAN.YMCILShortcuts.xml9cb059d2c74266b8a42017df8544ea76daae1e87Trojan.XML.LVRAN.YMCIKpowershell code.txt97822c165acd1c0fd4ff79bbad146f93f367e18cTrojan.Win32.FRS.VSNW0CI22Backdoor PowerShell variant9e0026572e3c839356d053cb71b8cbbbacb2627bTrojan.Win32.FRS.VSNW04J22Backdoor PowerShell variantb7d57bfbe8aa31bf4cacb960a390e5a519ce2eedTrojan.Win32.FRS.VSNW04J22Backdoor PowerShell variant3e4a30a16b1521f8a7d1855b4181f19f8d00b83bBackdoor.PS1.SYSTEMBC.THIBOBBBackdoor PowerShell variant49c35b2916f664e690a5c3ef838681c8978311caBackdoor.PS1.LVRAN.YMCIOURLWRS RatingURL Catergory182[.]82[.]219[.]201DangerousMalware Accomplice185[.]82[.]217[.]131DangerousMalware Accomplice Mohamed FahmyThreat Intelligence AnalystSherif MagdyThreat Intelligence AnalystAhmed SamirIncident Response AnalystTry our services free for 30 daysSelect a country / regionCopyright ©2023 Trend Micro Incorporated. All rights reserved"
   }
]