[
   {
      "time": "2023-03-08",
      "title": "Nvidia releases driver hotfix for Windows performance issues",
      "text": " Unlike Game Ready drivers, these drivers contain quick fixes, aren't WHQL-certified, and don't go through the usual testing process.\"These fixes (and more) will be in the next Game Ready Driver which will be WHQL-certified and delivered to gamers via GeForce Experience and usual driver download page,\" Pelletier added.Until the fix gets added to a Game Ready driver release, affected users who don't want to install today's hotfix can mitigate the game crashes and the general OS performance issues by killing the NVIDIA Container process via the Windows task manager.To address the BSODs, you will have to roll back the driver using the following steps:"
   },
   {
      "time": "2023-03-08",
      "title": "Microsoft discovers Shein app accessing clipboard on Android devices | SC Media",
      "text": "  Microsoft said they could not specify malicious intent regarding SHEIN's case but suggested that the feature of accessing clipboards was not necessary. SC Media has reached out to Shein for further information.  \"Even if SHEIN's clipboard behavior involved no malicious intent, this example case highlights the risks that installed applications can pose, including those that are highly popular and obtained from the platform's official app store,\" Microsoft said.  The tech giant identified and verified Shein’s clipboard behavior by performing static analysis of the app to find \"the relevant code responsible for the behavior\" and then doing a dynamic analysis to run the app \"in an instrumented environment to observe the code.\"  Following Microsoft's research findings, Google recognized the potential threats associated with clipboards and has made the following efforts to secure the Android platform.  Menghan Xiao is a cybersecurity reporter at SC Media, covering software supply chain security, workforce/business, and threat intelligence. Before SC Media, Xiao studied journalism at Northwestern University, where she received a merit-based scholarship from Medill and Jack Modzelewski Scholarship Fund.It’s clear iLeakage presents itself as a major flaw with no known mitigation and it’s a real problem for iOS devices – here are some ideas on how to respond. Malware distribution on Android devices has been facilitated by the new SecuriDropper dropper-as-a-service operation by evading Android 13's \"Restricted Settings\" functionality to breach \"Accessibility Services,\" BleepingComputer reports.Jamf says North Korean subgroup of the financially motivated Lazarus Group targets specific users the threat actors believe have access to cryptocurrency.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-03-08",
      "title": "Acer Confirms Data Offered Up for Sale Was Stolen",
      "text": " Acer has confirmed its systems were breached after a threat actor offered 160GB of data they say was stolen from the electronics company. Acer sells a variety of consumer electronics products, including Chromebooks, monitors, laptops, and desktop PCs. The post in the cybercrime forum claims to have a slew of secret information for sale, including Acer slides, employee manuals, and product information. Acer said in a statement reacting to the claims that the compromised data doesn't appear to include customer information. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-03-08",
      "title": "Hacker Cracks Toyota Customer Search Tool",
      "text": " A production API in Toyota's C360 customer relationship management (CRM) tool loaded with the personal information of an unknown number of the carmaker's customers in Mexico was found to expose reams of sensitive data.A disclosure from threat hunter Eaton Zveare outlines how it was possible to access Toyota customers' names, addresses, phone numbers, emails, and tax identification numbers, as well as vehicle ownership and service history stored in the C360 CRM.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-03-08",
      "title": "Emotet malware attacks return after three-month break",
      "text": " The Emotet malware operation is again spamming malicious emails as of Tuesday morning after a three-month break, rebuilding its network and infecting devices worldwide.Emotet is a notorious malware distributed through email containing malicious Microsoft Word and Excel document attachments. When users open these documents and macros are enabled, the Emotet DLL will be downloaded and loaded into memory.Once Emotet is loaded, the malware will sit quietly, waiting for instructions from a remote command and control server.While Emotet has been considered the most distributed malware in the past, it has gradually slowed down, with its last spam operation seen in November 2022. However, even then, the spamming only lasted two weeks.Cofense also confirmed to BleepingComputer that the spam campaign began at 7:00 AM ET, with current volumes remaining low.\"The first email we saw was around 7am EST. Volume remains low at this time as they continue to rebuild and gather new credentials to leverage and address books to target,\" Cofense told BleepingComputer.Instead of using reply-chain emails like in the previous campaign, the threat actors are utilizing emails that pretend to be invoices, as shown below.Attached to these emails are ZIP archives containing inflated Word documents that are over 500 MB in size. They are padded with unused data to make the files larger and harder for antivirus solutions to scan and detect them as malicious.These documents contain a mess of macros that will download the Emotet loader as a DLL from compromised sites, many of which are hacked WordPress blogs. When downloaded, Emotet will be saved to a random-named folder under %LocalAppData% and launched using regsvr32.exe.Like the Word document, the Emotet DLL has been also padded to be be 526MB to hinder the ability to detect it as malicious by antivirus software.Once running, the malware will run in the background, awaiting commands, which will likely install further payloads on the deviceThe payloads allow other threat actors to remotely access the device, which is then used to spread further in the compromised network.These attacks commonly lead to data theft and full-blown ransomware attacks on breached networks.Cofense says that they have not seen any additional payloads being dropped now, and the malware is just collecting data for future spam campaigns.While Emotet is rebuilding its network, the current method may not have much success after recent changes by Microsoft.Due to this change, users who open an Emotet document will be greeted with a message stating that the macros are disabled because the source of the file is not trusted.For most users receiving Emotet emails, this feature will likely protect them from mistakenly enabling macros unless they make a concerted effort to enable them.It would not be surprising to see Emotet also move to different attachment types after this initial campaign does not go as intended."
   },
   {
      "time": "2023-03-08",
      "title": "Microsoft Excel now blocking untrusted XLL add-ins by default",
      "text": " Microsoft says the Excel spreadsheet software is now blocking untrusted XLL add-ins by default in Microsoft 365 tenants worldwide.The new feature will be generally available in multi-tenants worldwide by late March after rolling out to all desktop users in the Current, Monthly Enterprise, and Semi-Annual Enterprise channels.\"We are introducing a default change for Excel Windows desktop apps that run XLL add-ins: XLL add-ins from untrusted locations will now be blocked by default,\" Microsoft said in a new Microsoft 365 message center post.\"We have already completed rolling out to Insiders preview. We will begin rolling out early March and expect to complete by late March.\"Moving forward, in tenants where the XLL blocking will get enabled by default, an alert will be displayed when users try to enable content from untrusted locations, informing them of the potential risk and allowing them to find more information about why they're seeing the warning.This is part of a broader effort to tackle the rise of malware campaigns abusing various Office document formats as an infection vector throughout recent years.Excel XLL files are dynamic-link libraries (DLLs) used to expand the functionality of Microsoft Excel with additional features like custom functions, dialog boxes, and toolbars.Before being blocked by default, XLLs would allow attackers to infect victims that enabled the untrusted add-ins and opened them even though they were warned that the \"add-ins might contain viruses or other security hazards.\"After opening the add-ins, the malware got installed in the background without requiring user interaction.\"Their usage significantly increased over the last two years as more commodity malware families adopted XLLs as their infection vector,\" Cisco Talos said."
   },
   {
      "time": "2023-03-08",
      "title": "Northern Essex Community College remains shuttered after cyberattack",
      "text": " A Massachusetts community college has closed its doors for a second day after a cyberattack took down significant parts of its network.Northern Essex Community College serves more than 6,000 students across Massachusetts and southern New Hampshire, with campuses in Haverhill and Lawrence.A spokesperson for the school told The Record that they did not know if the attack was ransomware, and claimed they “do not have evidence of any personal data being compromised.” On Tuesday, the school confirmed it would not open for the day.“All employees with a NECC laptop should cease using their laptops and are asked to bring their computers in as soon as possible and leave them in your office so that our IT team can install protection-clients and perform forensics.”The statement adds that remote work will be suspended for the rest of the week due to issues with VPN access, but employees of the college will be required to come to their offices. Microsoft Office 365, Zoom and some web-based services are still functioning, the college said.The college contacted law enforcement and cybersecurity experts to help with an investigation. They urged students and employees to regularly change passwords and said anyone whose information may have been accessed will be contacted with guidance.Since then, Emsisoft ransomware expert Brett Callow said at least 10 colleges have been hit with ransomware or cyberattacks, including last week’s attacks on colleges in Tennessee and Louisiana.“By the end of February this year, there were 19 incidents. The yearly numbers have remained very similar too, having remained within the range of 84 - 89 incidents per year since 2019,” Callow told The Record.“It’s clear that we’re not getting a handle on ransomware in the education sector. In fact, the problem may even be getting worse.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-08",
      "title": "Hospital Clínic de Barcelona severely impacted by ransomware attack",
      "text": " The Hospital Clínic de Barcelona suffered a ransomware attack on Sunday morning, severely disrupting its healthcare services after the institution's virtual machines were targeted by the attacks.The 819-bed hospital is based in Barcelona, Spain, and serves over half a million people seeking medical attention and healthcare services.According to a statement issued by the Government of Catalonia, the Hospital Clínic de Barcelona suffered an attack by the RansomHouse ransomware operation.The government statement also mentions that the cyberattack impacted the emergency services of three medical centers associated with Clínic de Barcelona, including CAP Casanova, CAP Borrell, and CAP Les Corts.\"Work is underway to determine the extent of the damage and the infiltration in a coordinated manner with the Mossos d'Esquadra and Interpol.\"The hospital's SAP system wasn't impacted, but all applications and communications remain broken as work to restore critical systems continues. This means that patient information for physicians is out of reach, and the situation impacts care services.Moreover, 800 urgent cases admitted to the hospital on Sunday had to be dealt with manually, and hence more slowly, so some cases were diverted to other hospitals in Barcelona.Additional health assistants and administrative staff have been added in Clínic de Barcelona to minimize the impact and help bridge communication between the various departments.Radiology, endoscopic tests, radiological scans, dialysis, and outpatient pharmacy services will continue operating normally.Unfortunately, 150 non-urgent operations scheduled for the upcoming weeks have been canceled, and 3,000 appointments were called off.These urgent plans will remain in place for at least a couple of days more, while the time to return to normal operations is impossible to determine currently, according to Clínic Barcelona's hospital director, A. Castells.When writing this, the RansomHouse data leak site has not leaked any data belonging to the Spanish hospital, but it might be too soon for the victim to appear on the threat actor's site."
   },
   {
      "time": "2023-03-08",
      "title": "Transparent Tribe Hackers Distribute CapraRAT via Trojanized Messaging Apps",
      "text": " It's being suspected that the targets are lured through a honeytrap romance scam wherein the threat actor approaches the victims via another platform and persuades them to install the malware-laced apps under the pretext of \"secure\" messaging and calling.The backdoor is packed with an extensive set of features that allows it to take screenshots and photos, record phone calls and surrounding audio, and exfiltrate other sensitive information. It can also make calls, send SMS messages, and receive commands to download files.That having said, users are also required to create an account by linking their phone numbers and completing an SMS verification step in order to access the app's functionalities.The Slovak cybersecurity company stated the campaign is narrowly targeted and that it found no evidence that indicates the apps were available on the Google Play Store.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-03-07",
      "title": "\r\n\tEPA Calls For Cybersecurity Improvements in Public Water Systems - Infosecurity Magazine\r\n",
      "text": " Freelance Journalist“Cyber-attacks against critical infrastructure facilities, including drinking water systems, are increasing, and public water systems are vulnerable. [They] have the potential to contaminate drinking water, which threatens public health,” said EPA Assistant Administrator for Water, Radhika Fox.“EPA is taking action to protect our public water systems by issuing this memorandum requiring states to audit the cybersecurity practices of local water systems.”In particular, the memorandum highlights the need for states to include cybersecurity when conducting periodic audits of water systems (“sanitary surveys”). To this end, EPA is providing guidance in the form of a survey designed to assist states in implementing cybersecurity strategies into sanitary surveys.“The program armed us with the tools to have the appropriate conversations with the Town’s IT staff and our water/sewer staff to take small steps towards improvement. The roadmap for how to correct the Town’s vulnerabilities is still driving decisions today.”The Agency clarified that while the guidelines can be used as they are, EPA is also open to receiving public comment on Sections 4–8 of the guidance and all document Appendices until May 31 2023."
   },
   {
      "time": "2023-03-07",
      "title": "EV Charging Infrastructure Offers an Electric Cyberattack Opportunity",
      "text": " As electric vehicle (EV) charging infrastructure rushes to keep pace with the dramatic rise in sales of electric vehicles in the United States, cyberattackers and security researchers alike have already started focusing on security weaknesses in the infrastructure.The risks are not just theoretical: A year ago, after Russia invaded Ukraine, hacktivists compromised charging stations near Moscow to disable them and display their support for Ukraine and their contempt for Russian President Vladamir Putin.\"Most EV chargers can be considered an Internet of Things (IoT) technology, but they are one of the first that has control over such a significant amount of electrical load,\" he says. He adds, \"The aggregated risk of so many devices, often connected to a small number of single systems, means that devices of this type need to be implemented with care.\"In many ways, EV charging infrastructure represents a perfect storm of technologies. The devices are connected via mobile applications and carry the same risks as other IoT devices, but they're also set to become a critical part of transportation network in the United States, like other operational technology (OT). And because EV charging stations must be connected to public networks, ensuring that their communications are encrypted will be critical to maintaining the security of the devices, says Dragos' Tonkin.\"Hacktivists will always be looking for poorly secured devices on public networks, it's important that the owners of EV put in place controls to ensure they are not easy targets,\" he says. \"The crown jewels of the operators of EV chargers have to be their central platforms, the chargers themselves intrinsically trust the instructions pushed down from the center.\"\"It's not practical for the average domestic customer to have to put in place the right security, therefore making sure the device itself and the methods it uses to communicate with cloud-based services should always be on the vendor,\" he says.The US government should make standards and best practices available to companies to prevent cybersecurity weaknesses, some say. Sandia National Laboratories, for instance, has recommended a number of initiatives to strengthen cybersecurity, including improving EV owner authentication and authorization, adding more security to the cloud component of the charging infrastructure, and hardening the actual charging units against physical tampering.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-03-07",
      "title": "Spanish amusement park giant hit with cyberattack",
      "text": " A Spanish amusement park company with businesses around the globe is investigating a cyberattack after a ransomware group claimed to have stolen sensitive information.Parques Reunidos Group runs more than 60 water and amusement parks, zoos, aquariums and entertainment centers across Europe, the United States, the United Arab Emirates and Australia. The company brings in hundreds of millions of dollars each year and welcomes more than 22 million people to its parks annually.BianLian has targeted the healthcare, education, insurance and media industries since at least December 2021. Little is known about where the group is based.The Spanish Data Protection Authority and law enforcement agencies were contacted about the incident.When the company’s IT team discovered the attack,it attempted to contain the damage, hired cybersecurity experts to investigate the incident and shut down affected systems. The team also blocked “users with affected information systems” and remote access connections, isolating its data center, and changed all passwords that allowed employees to access information systems.“Additionally, the following measures are also going to be taken: extraordinary awareness and training actions, implementation of conditional access for certain accounts to ensure only internal access, and planning actions to increase the number of sources reporting to the log event collector (SIEM) and the number of licenses with enhanced security measures,” the company said.“We continue with forensic investigations into our systems and are committed to taking action to further boost our cybersecurity safeguards as appropriate.”The company urged customers or employees to contact a the company’s data protection officer if they discover that their personal data is being misused or if they see “phishing or spamming campaigns from Parques Reunidos.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-07",
      "title": "Hackers using pirated Final Cut Pro to install cryptominers on Apple devices",
      "text": " Hackers are using pirated versions of video editing software Final Cut Pro to install malicious cryptomining software on Apple devices, according to a new report.Researchers at device management company Jamf said they have been monitoring a family of malware that has resurfaced over the past few months and has been operating undetected.Jaron Bradley, senior manager of MacOS detections at the Minneapolis-based firm, told The Record that malware disguised as or embedded inside of pirated applications has been an issue since the early days of software pirating.“Attackers see an easy opportunity when they don’t have to convince users to run their malware, but rather the users come to them willing to install something they know is illegal,” he said.Final Cut Pro, a popular suite of video-editing tools, costs about $300 for Apple users.“Apple is at a bit of a disadvantage in this particular scenario as users who opt to run pirated software have essentially already accepted that getting applications for free is worth the risk of whatever threat the application may pose,” Bradley said.The cryptomining tool – named XMRig – can be legitimately used to mine cryptocurrency on one’s own devices, but is adaptable and has been widely abused by cybercriminals.In the examples Jamf examined, hackers modified a version of Final Cut Pro to execute XMRig in the background. At the time of its discovery, Jamf said the sample was not detected as malicious by any security vendors on VirusTotal — a platform used to catalog malware. Since January, however, several vendors have begun to detect the malware.Yet in recent months researchers have found more instances of cryptomining targeting Mac users. Most Macs come equipped with powerful ARM processors which make them attractive targets for the malware, Jamf researchers said. Miners perform complex math problems for the chance to receive new coins such as bitcoin or Ethereum.The researchers traced the tainted software back to Pirate Bay, which allows people to download content and programs illegally. They saw that it was uploaded by someone who had spent years sharing pirated macOS software, and much of it was among the most widely shared versions for the respective titles.After examining each file, the researchers found that all of the person’s uploads since 2019 were compromised with malicious cryptomining malware.According to Bradley, what jumped out to his team the most was the inability of antivirus vendors to detect the malware even though some of the details around it have been shared in the past. The researchers were able to pinpoint specific changes in the cryptomining malware that allowed the hackers to dodge detection.One newer feature is that it runs a script that checks every three seconds whether the device’s Activity Monitor is active. If it finds that the Activity Monitor is active, it stops all malicious processing. The goal of the feature is to make sure that even if a victim realizes that their computer is running hotter than normal and checks to see why, they will not see the cryptominer operating.Later versions of the malware also only run when the application is launched, allowing it to hide activity until the victim uses the specific application.But Apple has created security features to combat tactics like this in newer versions of its operating system, according to Jamf. With its latest operating system update — macOS Ventura — Apple created a tool that checks whether apps have been changed by unauthorized processes, even after the first time they launch.This is a departure from past versions, where the operating system would only perform checks like that when an application was opened for the first time.On macOS Ventura, the changed version of Final Cut Pro does not even launch, according to Jamf.“This discovery presented a rare opportunity to trace the evolution of a malware family. What started as a rudimentary and conspicuous scheme had iterated through three distinct stages of evolution into something with creative evasion techniques,” they said, adding that only samples from the first generation of the malware family had been reported on.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-07",
      "title": "Thousands of appointments canceled after ransomware hits major Barcelona hospital",
      "text": " A ransomware attack on the city of Barcelona’s main hospital has forced thousands of appointments to be canceled, officials announced Monday.The Hospital Clinic de Barcelona was attacked Saturday, with computers across the institutions’ numerous laboratories, clinics and emergency room shut down. Its website was unavailable on Monday.The Ransom House gang — which lists semiconductor company AMD as a previous victim, claiming to have sold data stolen by its \"partners\" — was responsible for the attack, according to the regional Catalonian Cybersecurity Agency. The gang itself claims on its leak site to “have nothing to do with any breaches” and doesn’t “produce or use any ransomware.” It describes itself as a “professional mediators community.”Segi Marcén, telecommunications secretary for the regional Catalonia government, said that no extortion demand had yet been received but that the hospital would not be making a ransom payment even if one was.“We will not pay a cent,” Marcén said. Ransomware gangs typically threaten to release stolen data publicly if an extortion payment doesn’t come by a certain deadline. As of Monday, nothing from the hospital was on Ransom House’s leak site.Marcén added that the regional government was “focusing on recovering the information” impacted by the attack, although it was not yet clear whether the hospital’s data backups were also compromised, El País reported.Staff at the hospital have been forced to write on paper and do not have access to electronic patient data-sharing systems. The facility’s press department announced that urgent cases are being diverted to other hospitals.“We can’t make any prediction as to when the system will be back up to normal,” the hospital’s director, Antoni Castells, told journalists, adding that there was a contingency plan to keep services functioning for several days although he hoped the system would be fixed sooner.Tomàs Roy, the general director of the Catalan Cybersecurity Agency, said the attackers “have used new attack techniques,” but didn’t specify what they were.Recovering from the attack will be “gradual,” reported El País, as IT staff will need to ensure that systems aren’t restored while the attackers maintain some access to the system.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-07",
      "title": "Vice Society ransomware group claims German university as latest victim",
      "text": " The Vice Society ransomware group added the Hamburg University of Applied Sciences (HAW Hamburg) to its leak site this weekend following an attack that the institution said took place late last year.HAW Hamburg is one of several German-speaking institutions with a focus on applied sciences to be targeted by ransomware gangs in recent months.“The attackers worked their way manually from decentralized IT systems via the network to the central IT and security components of HAW Hamburg. They also gained administrative rights to the central storage systems via this attack path and thus compromised the central data storage,” the statement explained.“With the administrative rights obtained, the encryption of various virtualized platforms and the deletion of saved backups were finally started,” it added.The university warned that “significant amounts of data from various areas” were copied, including usernames and “cryptographically secured” passwords, email addresses and mobile phone numbers.Despite describing the compromised passwords as “cryptographically secured” the IT team recommended that students and staff change their passwords “for all internal university applications,” adding “in particular, change your password for Microsoft Teams and avoid using passwords that you have already used before.”The university said it had to rebuild its IT systems, including the existing Microsoft cloud environment, and was “trying to restore a backup of the email data from the old mail server as of December 14.”Following the attack, HAW Hamburg’s IT security said it had “received several reports from students about attempts to log on to Internet portals such as Amazon and eBay by unauthorized third parties.”“After reviewing all previous reports, and taking into account the attacker group's previous approach, it can be ruled out that the login attempts are related to the security incident at HAW Hamburg or the attacker group,” the team added.Then in February the University of Zurich, Switzerland’s largest university, announced it was the target of a “serious cyberattack,” which a spokesperson described to The Record as “part of a current accumulation of attacks on educational and health institutions.”Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-07",
      "title": "Nvidia working on driver fix for Windows BSOD, high CPU usage",
      "text": " Nvidia confirmed today that it's working to fix a driver issue causing high CPU usage and blue screens of death (BSODs) on Windows systems.\"I had none of these issues prior to this release, and after reverting back to the previous release, I have yet to reencounter any of the issues again; it appears this driver release is the clear culprit (please advise if I can provide any diagnostics that would help resolve this).\"Until the issue gets addressed, users can kill the NVIDIA Container process via the Windows task manager to get rid of the general OS lagginess.If you are also experiencing Windows BSODs, game crashes, reduced in-game performance, and, in some cases, games not launching, you should roll back to your older driver.To do that, you have to go through this procedure on Windows 10 and Windows 11 devices:"
   },
   {
      "time": "2023-03-07",
      "title": "Old Windows ‘Mock Folders’ UAC bypass used to drop malware",
      "text": " A new phishing campaign targets organizations in Eastern European countries with the Remcos RAT malware with aid from an old Windows User Account Control bypass discovered over two years ago.The use of mock trusted directories to bypass Windows User Account Control stands out in the attack as it's been known since 2020 but remains effective today.The latest Remcos campaign was observed and analyzed by SentinelOne researchers, who documented their findings in a report published today.The phishing campaign emails are sent from top-level domains that match the recipient's country and are typically masked as invoices, tender documentation, and other financial documents.The emails don't contain much text other than what is required to point the recipient's attention to the attachment, a tar.lz archive containing the DBatLoader executable.Such an unusual choice of file format reduces the chances of the victims successfully opening the attachment but also helps in evading detection from antivirus software and email security tools.The first stage payload of the malware loader is disguised as a Microsoft Office, LibreOffice, or PDF document using double extensions and app icons to trick the victim into opening it.Upon launching the malware loader, a second-stage payload is fetched from a public cloud service, such as Microsoft OneDrive or Google Drive.Sentinel One reports that in one case, the cloud service was abused for hosting DBatLoader for over a month, although it's not clear if the threat actors used their own or a compromised account with a clean history.Before loading Remcos RAT, DBatLoader creates and executes a Windows batch script to abuse a Windows UAC bypassing method documented in 2020.Windows UAC is a protection mechanism that Microsoft introduced in Windows Vista, asking users to confirm the execution of high-risk applications.Some folders, such as C:\\Windows\\System32\\, are trusted by Windows, allowing executables to auto-elevate without displaying a UAC prompt. A mock directory is an imitation directory with a trailing space. For example, the \"C:\\Windows\\System32\" is a legitimate folder and is considered a trusted location in Windows. A mock directory would look like \"C:\\Windows \\System32\", with an extra space after C:\\Windows\\. The problem is that some Windows programs, like File Explorer, treat \"C:\\Windows\" and \"C:\\Windows \" as the same folder, thus tricking the operating system into thinking C:\\Windows \\System32 is a trusted folder and should have its files auto-elevate without a UAC prompt.The script used by DBatLoader, in this case, creates mock trusted directories in the same way, creating a \"C:\\Windows \\System32\" folder and copying legitimate executables (\"easinvoker.exe\") and malicious DLLs (\"netutils.dll\") to it.\"easinvoker.exe is an auto-elevated executable, meaning that Windows automatically elevates this process without issuing a UAC prompt if located in a trusted directory – the mock %SystemRoot%\\System32 directory ensures this criteria is fulfilled.\"The malware loader adds the malicious script (\"KDECO.bat\") that hides in the DLL to Microsoft's Defender exclusion list and then establishes persistence for Remcos by creating a new registry key.Eventually, Remcos is executed through process injection, configured with keylogging and screenshot-snapping capabilities.SentinelOne suggests that system administrators configure Windows UAC to \"Always Notify,\" albeit this might be too obstructive and noisy.Admins should also monitor for suspicious file creations or process executions in trust filesystem paths with trailing spaces, especially folders containing the string \"\\Windows\"."
   },
   {
      "time": "2023-03-07",
      "title": "Ukraine, Germany lead takedown of  DoppelPaymer ransomware gang | SC Media",
      "text": "  German and Ukrainian law enforcement agencies said Monday they conducted simultaneous raids, seizing evidence and detaining several suspects connected with the DoppelPaymer ransomware gang. Europol authorities say they sent three experts to Germany to cross-check information from the raids against Europol databases, provide operational analysis, tracing of cryptocurrency funds and forensic support.\"The analysis of this data and other related cases is expected to trigger further investigative activities,\" the agency said in the release. \"Europol also set up a Virtual Command Post to connect the investigators and experts from Europol, Germany, Ukraine, the Netherlands and the United States in real time and to coordinate activities during the house searches.\"German law enforcement authorities said they were able to identify 11 individuals linked to a group that has operated in various guises since at least 2010, but gave no specific number on how many members of the group were arrested.Ukraine had experienced a less than a day-long power outage in October 2022 following an attack by Russian state-sponsored hacking operation Sandworm targeted at an electrical substation amid the ongoing Russia-Ukraine war, marking the first cyberattack-related power interruption in the country since 2017, CyberScoop reports.Attacks deployed by Iranian state-backed threat operation MuddyWater against Israel saw the utilization of the new MuddyC2Go command-and-control framework, which replaced the PhonyC2 custom platform following the exposure of its source code, reports The Hacker News.Israel had its technology, logistics, and transportation industries targeted by Iranian advanced persistent threat operation Charming Kitten, also known as APT35 and Imperial Kitten, last month amid its ongoing war with Palestinian militant group Hamas, according to The Record, a news site by cybersecurity firm Recorded Future.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-03-07",
      "title": "Alert: Scammers Pose as ChatGPT in New Phishing Scam",
      "text": " The modus operandi of this scam involves users receiving a scam email containing a link to ChatGPT, which is, of course, fake.According to Bitdefender, the scam is a “highly sophisticated financial scam” involving innovative lures, since previously, threat actors have mostly relied on weekly or monthly subscription-based lures.The email itself offers insufficient details, and the recipient has to click on an embedded link for more information. This link leads them to a fake version of the ChatGPT chatbot, where they are asked to invest at least €250 and enter their banking card details, email address, ID credentials, and phone number.Then, a copycat version of ChatGPT is delivered to the victim, which differs from the original chatbot as it offers a few pre-determined answers to the user’s queries. This chatbot was accessible only through a blacklisted domain (timegaeacom).The researchers at Bitdefender, headquartered in Bucharest, noticed that the fake ChatGPT first offered a brief introduction to how it could help them become successful investors. It asked for their email address for instant verification and their phone number for setting up a WhatsApp account for the promised investment.Afterwards, they receive a call from in which scammers claim to represent a London-based firm called Import Capital. Speaking in Romanian, the rep asks victims to invest in crypto and international stock.Further, they request crucial financial information like their permission to calculate their and their family members’ median daily salary, passive income sources, hours they daily spend working, and if they are satisfied with their current income.They are then asked to invest €250 and provide the last six digits of their valid ID card. However, while digging deeper into the scam, Bitdefender researchers requested that a link to the investment portal be sent via email. A form was sent to them, in which they inserted a false code, so the investment was declined.This campaign is quickly expanding to other regions, so users must stay alert. That’s why it is necessary to use ChatGPT only through its official website.Remember, as an AI language model, ChatGPT does not engage in any phishing scams. However, scammers are using the ChatGPT name to try to trick people into revealing personal information or clicking on malicious links. Here are some tips to stay safe:Super secure VPNMinimal data loggingFavorable privacy policy\n\tHackread.com is among the registered trademarks of Gray Dot Media Group Ltd. Company registration number 12903776 in regulation with the United Kingdom Companies House. The registered address is 85 Great Portland Street, London, England, W1W 7LT The display of third-party trademarks and trade names on the site do not necessarily indicate any affiliation or endorsement of Hackread.com. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n\t\t\t\t"
   },
   {
      "time": "2023-03-06",
      "title": "How to prevent Microsoft OneNote files from infecting Windows with malware",
      "text": " The seemingly innocuous Microsoft OneNote file has become a popular file format used by hackers to spread malware and breach corporate networks. Here's how to block malicious OneNote phishing attachments from infecting Windows.To give a little background on how we got to Microsoft OneNote files becoming the tool of choice for malware-distributing phishing attacks, we first need to explain how we got here.Threat actors have been abusing macros in Microsoft Word and Excel documents for years to download and install malware on Windows devices.These were popular file formats as a Windows bug allowed files in ISO images to bypass Mark-of-the-Web (MoTW) security warnings, and the popular 7-Zip archive utility did not propagate MoTW flags to files extracted from ZIP archives.Microsoft OneNote attachments use the '.one' file extension and are an interesting choice, as they do not distribute malware through macros or vulnerabilities.Instead, threat actors create intricate templates that appear to be a protected document with a message to 'double-click' a design element to view the file, as shown below.What you do not see from the above attachment, though, is that the 'Double Click to View File' is actually hiding a series of embedded files that sit underneath the button layer, as illustrated below.When double-clicking on the button, you are double-clicking on the embedded file and causing the file to launch.While double-clicking an embedded file will display a security warning, as we know from previous phishing attacks abusing Microsoft Office macros, users commonly ignore warnings and allow the file to run anyway.Sadly, you just need one user to accidentally allow a malicious file to run for an entire corporate network to be compromised in a full blown ransomware attack.The best way to prevent malicious Microsoft OneNote attachments from infecting Windows is to block the '.one' file extension at your secure mail gateways or mail servers.However, if that is not possible for your environment, you can also use Microsoft Office group policies to restrict the launching of embedded file attachments in Microsoft OneNote files.Now that the policies are installed, you will find new Microsoft OneNote policies named 'Disable embedded files' and 'Embedded Files Blocked Extensions,' as shown below.The 'Disable embedded files' group policy is the most restrictive as it prevents all embedded OneNote files from being launched. You should enable this option if you have no use case for using embedded OneNote attachments.\"To disable the ability to embed files on a OneNote page, so people cannot transmit files that might not be caught by anti-virus software, etc,\" reads the group policy description.When enabled, the following Windows Registry key will be created. Note that the paths may differ depending on your Microsoft Office version.Windows Registry Editor Version 5.00[HKEY_CURRENT_USER\\SOFTWARE\\Policies\\Microsoft\\office\\16.0\\onenote\\options]\n\"disableembeddedfiles\"=dword:00000001Now, when a user attempts to open any attachments embedded in a Microsoft OneNote document, they will receive the following error.A less restrictive option, but potentially more unsafe, is the 'Embedded Files Blocked Extensions' group policy, which allows you to input a list of embedded file extensions that will be blocked from opening in a Microsoft OneNote document.\"To disable the ability of the users in your organization from being able to open a file attachment of a specific file type from a Microsoft OneNote page, add the extensions you want to disable using this format: '.ext1;.ext2;',\" reads the policy description.\"f you want to disable the opening of any attachment from a OneNote page, see the Disable embedded files policy. You cannot block embedded audio and video recordings (WMA & WMV) with this policy instead refer to the Disable embedded files policy.\"When enabled, the following Windows Registry key will be created with the list of blocked extensions you entered.Windows Registry Editor Version 5.00[HKEY_CURRENT_USER\\SOFTWARE\\Policies\\Microsoft\\office\\16.0\\onenote\\options\\embeddedfileopenoptions]\n\"blockedextensions\"=\".js;.exe;.bat;.vbs;.com;.scr;.cmd;.ps1\"Now, when a user attempts to open a blocked file extension in a Microsoft OneNote document, they will receive the following error.Some suggested file extensions to block are .js, .exe, .com, .cmd, .scr, .ps1, .vbs, and .lnk. However, as threat actors discover new file extensions to abuse, this list may be bypassed by other malicious file types.While blocking any file type is not always a perfect solution due to an environment's requirements, the results of not doing anything to restrict the abuse of Microsoft OneNote files can be even worse.Therefore, it is strongly advised to block OneNote attachments, or at least the abuse of embedded file types, in your environment to prevent a cyberattack."
   },
   {
      "time": "2023-03-06",
      "title": "Dubai's Crypto Industry Introduces New Licensing Regulations - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " The framework was developed in response to the collapse of the cryptocurrency markets in 2022, which caused authorities worldwide to step up their efforts to establish or enforce protections and left businesses and investors worried about the future of cryptocurrencies. These new regulations involve the authorities seeking necessary permits and licenses in order to provide users with one or more crypto-related services in Dubai. The framework is accompanied by seven activity-based rulebooks that specify standards based on the type of service supplied and four mandatory rulebooks for service providers, which Talal Tabbaa, founder of the regional cryptocurrency exchange CoinMENA, hailed as being \"elegantly designed.\"  Dubai is one among the seven emirates of the United Arab Emirates with a goal to emerge as a global hub for crypto and blockchain activities, and in order to accomplish this it was courting companies to systemize the jurisdiction even before publishing its strategized rules for the sector. In the wake of the new rules being published, the institutional crypto custody provider Hex Trust became one of the first to receive an operational green light from the emirate's watchdog, the Virtual Asset Regulation Authority.\nStating the time before VARA, which was established in 2022, Mohamed Reda El Sheikh, head of compliance at Hex Trust for the Middle East and North Africa (MENA) says \"We were waiting for a licensing framework. We were waiting for somebody with interest to take the responsibility.\" However, these new regulations set up by Dubai are still a work in progress, because of their comprehensive nature, which allows for potential development. The emerging hub's new regulatory structure also reveals the expense of compliance in the area, which may make it more difficult for start-up businesses to locate there. While Tabbaa called the licencing costs \"peanuts\" when compared to other operating costs like hiring staff or maintaining offices locally, and compliance fees are not something crypto companies focus on when looking to enter a market, even he acknowledges that some of Dubai's fees can be viewed as being on the expensive side. A company seeking to provide exchange services is required to pay an application cost of 100,000 UAE dirham (US$27,200) and an annual supervision fee that is double that amount, says the document. The application fee does not guarantee acceptance, and if the business wishes to provide additional services such as custody, lending, or payments, it must submit additional licensing applications (at a 50% reduction off the application charge) and pay additional monitoring fees. For comparison, the application fee in Abu Dhabi, another emirate of the UAE, is $20,000, while the yearly monitoring fee is $15,000. However, the Abu Dhabi Global Market (ADGM) stated in an email to CoinDesk that goes up if businesses seek to provide additional kinds of assets. “Apart from any tokenized securities, under ADGM’s regulations, any crypto exchange that operates a spot or derivative market in relation to virtual assets (which include cryptocurrencies such as bitcoin and ether) will have to apply for a Multilateral Trading Facility license,” the ADGM said. Companies that are likely to operate MTFs must pay an application fee of $125,000 and an annual supervision fee of $60,000. In Singapore, crypto exchanges that are not involved in fiat currencies usually apply for a Major Payments Institution license (for digital payment token service), which comes with a 10,000 Singapore dollar ($7,500) annual fee. Wherein, New York's BitLicense comes with a $5,000 application fee, although companies have reported bearing a cost of around $100,000 for time allocation, and legal and compliance fees. Dubai’s fees, on the other hand, are much more reasonable for larger companies. Although, it may not be very sustainable for startups, says Irina Heaver, a crypto lawyer based in the UAE. “However, I fully agree that Dubai needed to step up and to regulate the space, with so many bottom feeding scammers trying to establish here, enough is enough. Hopefully, these regulations will be used to really target those bad players,” Heaver said.\n your nameYour Emailyour message"
   },
   {
      "time": "2023-03-06",
      "title": "A GoAnywhere MFT hack Exposes Hatch Bank's Data Breach - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2023-03-06",
      "title": "FTC to ban BetterHelp from sharing mental health data with advertisers  ",
      "text": " The Federal Trade Commission (FTC) has proposed to ban the online counseling service BetterHelp from sharing its customers’ sensitive mental health data with advertising networks and marketers.A settlement between the FTC and BetterHelp also requires the company to pay $7.8 million as restitution to its users whose sensitive data has been shared with third parties such as Facebook and Snapchat.BetterHelp is a popular online counseling service providing therapy services to individuals needing support, like people who suffer from depression, anxiety disorders, post-traumatic stress, substance abuse, addiction, etc.FTC alleges that BetterHelp followed bad practices in handling the data of people who visited its website or used its apps, including those who have not signed up for its counseling services.The FTC says these practices, which the government agency characterizes as “illegal,” can introduce grave risks to the well-being of vulnerable people in unstable states, threatening to aggravate their condition.“Instead, BetterHelp betrayed consumers’ most personal health information for profit.”The FTC claims that third parties used this information for advertising purposes and, more specifically, to identify consumers with similar profiles and promote BetterHelp’s counseling services.FTC further explains that the way the prompts to enter sensitive information were presented to users left them no choice but to disclose that data to sign up for counseling services.They further alleged that BetterHelp did not secure consent from the subjects to use their data for advertising. Moreover, it did not take any precautions to limit how the receiving third parties can use the shared health information or with what other entities they’re allowed to share it.In addition to that, if the order is approved, BetterHelp will also be obliged to:BetterHelp responded to FTC’s proposal and allegations with an official statement on its site, claiming that the advertising strategy it followed between 2017 and 2022 didn’t deviate from industry-standard practices used by all major health providers and healthcare systems in the country.“In addition, we do not receive and have never received any payment from any third party for any kind of information about any of our members.”The counseling service provider says it has reached a settlement with the FTC to pay $7.8 million, but did not admit any wrongdoing."
   },
   {
      "time": "2023-03-06",
      "title": "AMD Confirms Radeon Driver Bug Crashing Windows OS",
      "text": " Last month, AMD released its newest AMD Software: Adrenalin Edition application driver 23.2.1 with updates to the RX 6000 and RX 7000 series.However, immediately after the release, users started complaining that the updates kept them from booting into Windows.While the issue was never acknowledged by the semiconductor company, it has been found that the same issue is also existing in AMD’s latest WQHL-certified Radeon driver, Adrenalin 23.2.2.Apparently, the issue was encountered by the editor and reviewer Brad Chacos from PCWorld, who immediately contacted AMD engineers and started working together to resolve the root problem and a temporary workaround.Now, AMD has more or less confirmed that the problem occurs when the user updates the driver while installing Windows updates. The company advises its users to abstain from using the “Factory Reset” option when updating AMD Radeon drivers, as it causes the “Inaccessible Boot Device” error, rendering the Windows installation unusable.While the issue occurs in an extremely small number of PC update instances, AMD recommends its users ensure that all system updates are applied or paused before installing the driver and the “Factory Reset” option must be unchecked when installing new AMD Radeon drivers on the computer.If the installation is carried out during a Windows update, the system can restart in factory default mode, and could even personal data from the PC.AMD has already started investigating the issue and is working on a fix for the problem.“We have reproduced an issue that can occur in an extremely small number of instances if a PC update occurs during the installation of AMD Software: Adrenalin Edition, and we are actively investigating,” said an AMD spokesperson to PCWorld.“We recommend users ensure all system updates are applied or paused before installing the driver, and that the “Factory Reset” option is unchecked during the AMD driver installation process. We are committed to resolve issues as quickly as possible and strongly encourage users to submit issues with AMD Software: Adrenalin Edition via the Bug Report Tool.”In order to minimize the risk of encountering the bug, it is advisable not to install the current WHQL driver Adrenalin 23.2.2 until AMD finds a permanent fix.Alternatively, users who depend on Windows update packages for their graphics drivers can uncheck the “Factory Reset” option while installing the Adrenalin drivers, and also use Display Driver Uninstaller (DDU) which prevents Windows Update from downloading drivers when the program is running."
   },
   {
      "time": "2023-03-06",
      "title": "Russia Bans Messengers, Including WhatsApp, Telegram, And More",
      "text": " The regulations prohibiting the use of numerous international private messaging services in the Russian government and state entities went into effect today, according to Roskomnadzor, a Russian internet regulatory organization.The use of foreign messengers, which are defined as “information systems and computer programs owned by foreign persons. That is designed and (or) used for exchanging messages exclusively between their users. The following are among Roskomnadzor’s list of prohibited services:Unsurprisingly, Roskomnadzor’s list does not include the California-based “Zoom,” one of the world’s leading video conferencing, instant messaging, and voice call systems. Similarly, “Signal,” an encrypted messaging service, is not featured on the list.Discord and Telegram are two products mentioned above that the Russian government has previously demanded to remove “misinformation” from their services.The current prohibition, however, is not an attempt to stop the influx of foreign material that might affect local opinion but rather a precaution to stop the leakage of critical information to foreign organizations.In order to reduce the likelihood that sensitive information will be obtained by foreign intelligence, Russia is highly cautious and deliberately restricts the adoption of foreign software in essential areas.The use of foreign communication platforms is forbidden by law for those who carry out official duties or provide state services. State-run organizations are not permitted to utilize international messaging services as of March 1st, according to the Russian statute “On Information, Information Technologies, and Information Protection.” The Russian Federal Agency has outlawed apps like WhatsApp, Teams, and Skype for Business. In addition, others are to oversee mass media, information technology, and communications (Roskomnadzor) for use by state personnel. This resulted in Russian President Vladimir Putin passing the law in December 2022. State-owned businesses, municipal unitary enterprises, businesses in which the state controls more than 50% of the allowed capital, and a number of credit institutions are also subject to the prohibition.2020 Cybersecurity Landscape: 100+ Experts’ PredictionsCyber Security Predictions 2021: Experts’ ResponsesExperts’ Responses: Cyber Security Predictions 2023Celebrating Data Privacy Day – 28th January 2023Data Privacy Protection Day (Thursday 28th) – Experts Comments“Cybersecurity Awareness Month’s new evergreen theme \"Secure Our World” is…“Avoid storing data on personal devices: A crucial but often overlooked…“I recommend a new nuance to passwords that isn’t often…“In my role overseeing cloud environments and incident response, I'm…“​​Cybersecurity Awareness Month serves as a reminder to confront the…Information Security Buzz (aka ISBuzz News) is an independent resource that provides the experts comments, analysis and opinion on the latest Information Security news and topics "
   },
   {
      "time": "2023-03-06",
      "title": "New TPM 2.0 flaws could let hackers steal cryptographic keys",
      "text": " The Trusted Platform Module (TPM) 2.0 specification is affected by two buffer overflow vulnerabilities that could allow attackers to access or overwrite sensitive data, such as cryptographic keys.TPM is a hardware-based technology that provides operating systems with tamper-resistant secure cryptographic functions. It can be used to store cryptographic keys, passwords, and other critical data, making any vulnerability in its implementation a cause for concern.While a TPM is required for some Windows security features, such as Measured Boot, Device Encryption, Windows Defender System Guard (DRTM), Device Health Attestation, it is not required for other more commonly used features.However, when a Trusted Platform Module is available, Windows security features get enhanced security in protecting sensitive information and encrypting data.The new vulnerabilities in TPM 2.0 were discovered by Quarkslab’s researchers Francisco Falcon and Ivan Arce who said the flaws could impact billions of devices. The vulnerabilities are tracked as CVE-2023-1017 (out-of-bounds read) and CVE-2023-1018 (out-of-bounds write).Both flaws arise from how the specification processes the parameters for some TPM commands, allowing an authenticated local attacker to exploit them by sending maliciously crafted commands to execute code within the TPM.The Trusted Computing Group explains that the buffer overflow problems concern reading or writing 2 bytes after the end of the buffer passed to the ExecuteCommand() entry point.The impact of this depends on what vendors have implemented on that memory location, i.e., if it’s unused memory or if it contains live data.The CERT Coordination Center has published an alert about the vulnerabilities and has been informing vendors for months, trying to raise awareness while mapping the impact. Unfortunately, only a handful of entities have confirmed they are impacted.\"This allows either read-only access to sensitive data or overwriting of normally protected data that is only available to the TPM (e.g., cryptographic keys).\"The solution for impacted vendors is to move to a fixed version of the specification, which includes one of the following:While these flaws require authenticated local access to a device, it is important to remember that malware running on the device would meet that condition.TPM is a highly-secured space that should theoretically be shielded even from malware running on the device, so the practical importance of these vulnerabilities shouldn’t be ignored or downplayed.Users are recommended to limit physical access to their devices to trusted users, only use signed applications from reputable vendors, and apply firmware updates as soon as they become available for their devices."
   },
   {
      "time": "2023-03-06",
      "title": "Ransomware gang leaks data stolen from City of Oakland",
      "text": " The Play ransomware gang has begun to leak data from the City of Oakland, California, that was stolen in a recent cyberattack.The initial data leak consists of a 10GB multi-part RAR archive allegedly containing confidential documents, employee information, passports, and IDs.\"Private and personal confidential data, financial information. IDs, passports, employee full info, human rights violation information. For now partially published compressed 10gb,\" stated the cybercriminals on their data leak site.\n​In an updated statement posted yesterday, the City stays that they are monitoring the situation and will notify any individuals whose personal information was exposed.\"We are working with third-party specialists and law enforcement on this issue and are actively monitoring the unauthorized third party's claims to investigate their validity. If we determine that any individual's personal information is involved, we will notify those individuals in accordance with applicable law.\"While the attack did not impact 911 and emergency services, many other systems were taken offline, including phone service and systems used to collect payments, process reports, and issue permits and licenses."
   },
   {
      "time": "2023-03-06",
      "title": "PayPal Sued Over Data Breach that Impacted 35,000 users",
      "text": " In December 2022, PayPal announced a data breach, but it claimed that the login credentials used in the attack were not obtained from its network.While PayPal was quick to identify and contain the breach as soon as it happened, the investigation took nearly two weeks to complete. During this time, the company confirmed that the hackers had gained access to the user accounts using valid credentials, although they denied that this was a result of a breach in their systems.According to PayPal, there was no evidence to suggest that the user credentials were obtained directly from them, but the company is taking all necessary steps to ensure the safety and security of its users’ accounts. The affected users were been advised to reset their passwords and enable two-factor authentication (2FA) as a precautionary measure. \n\n\n\nIn 2022, PayPal reportedly had a user base of 435 million, which includes users who have made at least one transaction during the year. The online payment giant has been experiencing a steady increase in its user base, with more and more people relying on its services for digital transactions.\nHowever, with this new lawsuit, the company is once again under scrutiny for its handling of sensitive data and failure to protect its users’ privacy.\nIn 2022, PayPal reportedly had a user base of 435 million, which includes users who have made at least one transaction during the year. The online payment giant has been experiencing a steady increase in its user base, with more and more people relying on its services for digital transactions.However, with this new lawsuit, the company is once again under scrutiny for its handling of sensitive data and failure to protect its users’ privacy.Super secure VPNMinimal data loggingFavorable privacy policy\n\tHackread.com is among the registered trademarks of Gray Dot Media Group Ltd. Company registration number 12903776 in regulation with the United Kingdom Companies House. The registered address is 85 Great Portland Street, London, England, W1W 7LT The display of third-party trademarks and trade names on the site do not necessarily indicate any affiliation or endorsement of Hackread.com. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n\t\t\t\t"
   },
   {
      "time": "2023-03-06",
      "title": "BidenCash leaks 2.1M stolen credit/debit cards",
      "text": " The dump was released on February 28, it was published through the Russian-speaking cybercrime forum XSS. The decision to release free samples aims at attracting new customers and gain notoriety in the cybercrime ecosystem.Flashpoint researchers who analyzed the collection reported that the text file leaked by BidenCash includes credit card numbers along with cardholder’s personally identifiable information (PII) (name, address) and financial data such as the  full card number, expiration date, CVV code, and bank name.The experts reported that about 70% of the cards have expiration dates in 2023, while 50% of the cards belong to US-based cardholders.Researchers from threat intelligence firm Cyble who analyzed the leak, reported that it contains at least 740,858 credit cards, 811,676 debit cards, and 293 charge cards. The experts pointed out that the risk is higher for debit card holders than credit card holders, due to different fraud protection.The following table reports the most records leaked by country are:Even if some of the payment cards are expired, threat actors can use the data to carry out multiple attacks against the victims, including spear-phishing attacks and financial scams.After the retirement, other carding websites such as ‘Ferum Shop’, ‘UAS’, and ‘Trump Dump’ gained popularity in the underground marketplace.“Since that time, we saw a rise in the emergence of several new debit and credit card shops to fulfill the illicit demand for compromised payment cards.” continues Cyble.‘BidenCash’ was launched in April 2022 and was considered a low-profile credit card shop. The ability of its operators to periodically release fresh dumps and promotional lots for free increased rapidly increased its popularity.In June 2022, BidenCash released over 7.9 million payment card data dating from 2019 to 2022 on a cybercrime forum. However, the dump only contained 6,581 records exposing credit card numbers.Banking institutions should monitor the dark web for the offering of credit/debit cards to prevent fraudulent activities.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-03-06",
      "title": " Trezor Users: Target of a Major Cryptocurrency Wallet Phishing Campaign - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2023-03-03",
      "title": "Microsoft releases Windows security updates for Intel CPU flaws",
      "text": " Microsoft has released out-of-band security updates for 'Memory Mapped I/O Stale Data (MMIO)' information disclosure vulnerabilities in Intel CPUs.This class of vulnerabilities is tracked under the following CVEs:\"An attacker who successfully exploited these vulnerabilities might be able to read privileged data across trust boundaries,\" explained Microsoft.\"In shared resource environments (such as exists in some cloud services configurations), these vulnerabilities could allow one virtual machine to improperly access information from another.\"\"In non-browsing scenarios on standalone systems, an attacker would need prior access to the system or an ability to run a specially crafted application on the target system to leverage these vulnerabilities.\"Microsoft has released a somewhat confusing set of security updates for Windows 10, Windows 11, and Windows Server that address these vulnerabilities. From the support bulletins, it is unclear if they are new Intel microcodes or other mitigations that will be applied to devices.These updates are being released as manual updates in the Microsoft Update Catalog:These are likely being released as optional, manual updates as the mitigations for these vulnerabilities can cause performance issues, and the flaws may not be fully resolved without disabling Intel Hyper-Threading Technology (Intel HT Technology) in some scenarios.Therefore, it is strongly advised that you read both Intel's and Microsoft's advisories before applying these updates."
   },
   {
      "time": "2023-03-03",
      "title": "Cisco patches critical bugs in IP Phones | SC Media",
      "text": "  CVE-2023-20078 was caused by an insufficient validation of user-supplied input, a web UI vulnerability. Cisco said an attacker could exploit this vulnerability by sending a crafted request to the web-based management interface. A successful exploit could let an attacker execute arbitrary commands on the underlying operating system of the affected device.The other vulnerability – CVE-2023-20079 – was rated as high-severity with a CVSS score of 7.5. It affected Cisco IP Phone 6800, 7800, and 8800 Series Multiplatform Phones, as well as Cisco Unified IP Conference Phone 8831 and Unified IP Phone 7900 Series Phones. Cisco released updates to address the two vulnerabilities, there are no workarounds. The vendor said its customers with service contracts that entitle them to regular software updates should obtain security fixes through the usual update channels. Customers may only install and expect support for software versions and feature sets for which they have purchased a license. BleepingComputer reports that Russian majority state-owned financial services firm Sberbank has been disrupted by a distributed denial-of-service attack that peaked at one million requests per second.OpenAI reported multiple disruptions this week, culminating in a distributed-denial-of-service attack on ChatGPT on Nov. 8.SecurityWeek reports that patches have been released by Veeam to remediate four security vulnerabilities impacting its Veeam ONE IT monitoring and analytics solution.Tue Dec 17On-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-03-03",
      "title": "Retailer WH Smith reports cyberattack, says employee data compromised",
      "text": " WH Smith said Thursday that it was the target of a cybersecurity incident in which attackers were able to access company data.“Upon becoming aware of the incident, we immediately launched an investigation, engaged specialist support services and implemented our incident response plans, which included notifying the relevant authorities,” the filing said. The company did not specify a date for the attack.WH Smith, which runs more than 1,700 stores primarily in the United Kingdom, is a regular on most of the country’s high streets, where it sells magazines, stationery, books and sweets.A spokesperson for the company told The Record they were unable to provide any more details at the time.WH Smith’s regulatory statement said that its investigations into the incident are ongoing and that it is notifying “all affected colleagues” and has “put measures in place to support them.”“There has been no impact on the trading activities of the Group. Our website, customer accounts and underlying customer databases are on separate systems that are unaffected by this incident,” the statement added.The move has been long-awaited. As of last November, ransomware incidents had been responsible for the majority of the British government’s recent crisis management “Cobra” meetings attended by officials across different government departments.At the time they said they were seeing “an increasingly successful business model” with “ransom demands increasing” and “payments increasing” and it becoming “harder to avoid paying a ransom because the entire ecosystem is pushing that way.”Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-03",
      "title": "BlackLotus Becomes First UEFI Bootkit Malware to Bypass Secure Boot on Windows 11",
      "text": " Offered for sale at $5,000 (and $200 per new subsequent version), the powerful and persistent toolkit is programmed in Assembly and C and is 80 kilobytes in size. It also features geofencing capabilities to avoid infecting computers in Armenia, Belarus, Kazakhstan, Moldova, Romania, Russia, and Ukraine.A successful exploitation of the vulnerability, according to ESET, allows arbitrary code execution during early boot phases, permitting a threat actor to carry out malicious actions on a system with UEFI Secure Boot enabled without having physical access to it.The restart is followed by the weaponization of CVE-2022-21894 to achieve persistence and install the bootkit, after which it is automatically executed on every system start to deploy the kernel driver.While the driver is tasked with launching the user-mode HTTP downloader and running next-stage kernel-mode payloads, the latter is capable of executing commands received from the C2 server over HTTPS.This includes downloading and executing a kernel driver, DLL, or a regular executable; fetching bootkit updates, and even uninstalling the bootkit from the infected system.\"Many critical vulnerabilities affecting security of UEFI systems have been discovered in the last few years,\" Smolár said. \"Unfortunately, due the complexity of the whole UEFI ecosystem and related supply-chain problems, many of these vulnerabilities have left many systems vulnerable even a long time after the vulnerabilities have been fixed – or at least after we were told they were fixed.\"\"It was just a matter of time before someone would take advantage of these failures and create a UEFI bootkit capable of operating on systems with UEFI Secure Boot enabled.\"(A previous version of the article erroneously mentioned that the UEFI bootkit was loaded to the system firmware. It has been updated to clarify that it's deployed in the EFI system partition.)Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-03-03",
      "title": "Poland blames Russian hackers for cyberattack on tax service website",
      "text": " Poland’s tax service website was hit by a cyberattack believed to have been carried out by Russian hackers, according to the country’s top cybersecurity official.The distributed denial-of-service (DDoS) attack occurred on Tuesday, causing the website to crash for approximately one hour and blocking users’ access to the online tax filing system.No data was leaked as a result of the attack, Cieszynski said. The tax service did not respond to The Record’s request for comment.Hackers siding with Moscow have used cyberattacks in recent months to take revenge on Poland and other countries for supporting Ukraine during the war.Poland’s security agency has repeatedly expressed concern that the country has been a “constant target” of pro-Russian hackers since the start of the war.“Through hostile operations in cyberspace, Russia wants to exert pressure on Poland, as a frontline country and a key Ukraine ally on the NATO eastern flank,” Poland’s security agency said in December.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-03",
      "title": "Chick-fil-A confirms accounts hacked in months-long \"automated\" attack",
      "text": " American fast food chain Chick-fil-A has confirmed that over 71,000 customers' accounts were breached in a months-long credential stuffing attack, allowing threat actors to use stored rewards balances and access personal information.At the time, Chick-fil-A set up a support page with information on what customers should do if they detect suspicious activity on their accounts.This warning came after BleepingComputer emailed Chick-fil-A before Christmas about reports of Chick-fil-A user accounts being stolen in credential-stuffing attacks and sold online.These accounts were sold for prices ranging from $2 to $200, depending on the rewards account balance and linked payment methods.One Telegram channel seen by BleepingComputer showed people purchasing these accounts and then sharing pictures of their purchases made through these accounts.Today, Chick-fil-A confirmed our reporting in a security notice submitted to multiple Attorney General offices, stating that they suffered a credential stuffing attack between December 18th, 2022, and February 12th, 2023. This sustained attack allowed the threat actors to hack a total of 71,473 Chick-fil-A accounts.\"Following a careful investigation, we determined that unauthorized parties launched an automated attack against our website and mobile application between December 18, 2022 and February 12, 2023 using account credentials (e.g., email addresses and passwords) obtained from a third-party source.The fast food chain is warning impacted customers that threat actors who accessed their account would have also had access to their personal information, including their name, email address, Chick-fil-A One membership number and mobile pay number, QR code, masked credit/debit card number, and the amount of Chick-fil-A credit (e.g., e-gift card balance) on your account (if any).For some customers, the information may have included birthdays, phone numbers, physical addresses, and the last four digits of credit cards.In response to the attack, Chick-fil-A forced customers to reset passwords, froze funds loaded into accounts, and removed any stored payment information from accounts.Chick-fil-A also states that they restored Chick-fil-A One account balances and added rewards to impacted accounts as a way of apologizing.As the accounts were breached using credentials exposed in other data breaches, impacted users must change their passwords at all sites they frequent, especially if they use the same Chick-fil-A password.When resetting passwords, use a unique password for each site and store them in a password manager, like Bitwarden, so that they can be easily managed.While there is no evidence that personal information was abused, impacted customers should also be on the lookout for potentially targeted phishing emails utilizing this information."
   },
   {
      "time": "2023-03-03",
      "title": "Tennessee State, Southeastern Louisiana universities hit with cyberattacks",
      "text": " Two universities in Tennessee and Louisiana are struggling with cyberattacks that have crippled campus services and left students scrambling to find alternative tools.Tennessee State University — a public historically black land-grant university in Nashville — notified its more than 8,000 students on Wednesday that its IT systems were brought down by a ransomware attack. “We take ransomware very seriously and protecting the integrity of your data is of the upmost importance,” the university’s IT team said. “Students should contact their instructors and/or advisor by email or phone if you have issues with accessing assignments and/or assessments.”On Tuesday, the university confirmed in a statement that the incident was a cyberattack. The school did not respond to questions about whether ransomware was involved but noted that it had taken the entire campus network offline “as a preventative measure.”We also reported the incident to the Louisiana State Police, which is conducting an investigation into this matter. We ask that everyone please continue to be patient while this work continues as the University is steadily working to restore services for the University community.“We also reported the incident to the Louisiana State Police, which is conducting an investigation into this matter. We ask that everyone please continue to be patient while this work continues as the University is steadily working to restore services for the University community,” the school said. “Once systems return to service, you will be prompted to create a new password the first time you login to the system, and you may then return to normal usage. We apologize for any inconvenience that this incident has caused.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-03",
      "title": "A key post-quantum algorithm may be vulnerable to side-channel attacks",
      "text": " As companies and governments around the world work on creating usable quantum computers, security researchers are also devising ways to protect data once those machines are available.According to the Swedish team, CRYSTALS-Kyber is vulnerable to side-channel attacks, which use information leaked by a computer system to gain unauthorized access or extract sensitive information. Instead of trying to guess a secret key, a side-channel technique analyzes data such as small variations in power consumption or electromagnetic radiation to reconstruct what the machine is doing and find clues that would enable access.Machine learning “can overcome conventional countermeasures,” such as “masking,” which involves hiding the secret key using random numbers. Even if someone observes the encryption process, they can't discover the key.Previous research on CRYSTALS-Kyber analyzed the algorithm with up to three “orders” of masking, but the Swedish team said it demonstrated its technique on fifth-order masking.“The presented approach is not specific for CRYSTALS-Kyber and can potentially be applied to other schemes,” the researchers said.The machine learning in the side-channel attack involved a neural network training method called recursive learning. This method made it possible to extract the smallest data units with high probability, the researchers said.“This is a very notable, and novel, aspect of the research,” said Lukasz Olejnik, an independent cybersecurity researcher and consultant who did not participate in the study.According to him, machine learning can be used to efficiently analyze data and learn patterns that reveal security weaknesses of the system. The researchers also said they could use machine learning to test algorithms for resistance to other types of attacks.The attack targeted the specific implementation of CRYSTALS-Kyber, not its principles. A specific implementation of a post-quantum algorithm refers to its practical application in a software or hardware system.“As long as the core principles stand and remain robust, we'll live with those,” Olejnik said.The agency did not respond to The Record’s request for comment.According to Olejnik, it is necessary to research such attacks because they help create secure methods for implementing, deploying and utilizing the new cryptosystems.CRYSTALS-Kyber is the only general-purpose algorithm selected so far for the NIST program. Three others are used for digital signature and identity verification.Researchers need several post-quantum algorithms because it is currently unclear which ones will be most effective and secure against quantum computers.Correction: A previous version of this story misstated the first name of NIST's Dustin Moody.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-03",
      "title": "Hatch Bank discloses data breach after GoAnywhere MFT hack",
      "text": " Fintech banking platform Hatch Bank has reported a data breach after hackers stole the personal information of almost 140,000 customers from the company's Fortra GoAnywhere MFT secure file-sharing platform.Hatch Bank is a financial technology firm allowing small businesses to access bank services from other financial institutions.\"On January 29, 2023, Fortra experienced a cyber incident when they learned of a vulnerability located in their software,\" warned the Hatch Bank data breach notification.\"On February 3, 2023, Hatch Bank was notified by Fortra of the incident and learned that its files contained on Fortra’s GoAnywhere site were subject to unauthorized access.\"Hatch says they conducted a review of the data that was stolen and determined that that customers' names and social security numbers were stolen by the attackers.The bank added that it is providing free access to credit monitoring services for twelve months to affected individuals.The ransomware gang says they utilized the zero-day vulnerability in Fortra's GoAnywhere MFT secure file-sharing platform to steal data over ten days.BleepingComputer could not independently confirm Clop's claims that they were behind the attacks, and Fortra never replied to our emails.Like GoAnywhere MFT, Accellion FTA allows organizations to share files with their customers securely.As part of these attacks, the Clop ransomware gang attempted to extort victims by demanding a $10 million ransom to prevent the stolen data from being published.While it is unknown if Clop is demanding similar ransoms to victims of the GoAnywhere MFT attacks, if the gang follows similar tactics, we will begin to see stolen data appear on their data leak site in the future."
   },
   {
      "time": "2023-03-03",
      "title": "Australian woman arrested for email bombing a government office",
      "text": " The Australian Federal Police arrested a woman in Werrington, Sydney, for allegedly email bombing the office of a Federal Member of Parliament.Email bombing is an online attack where attackers bombard an email address with thousands of emails to overwhelm a recipient's inbox or mail server.The AFP says the women sent over 32,000 emails to the MP's office over 24 hours, preventing employees from using the IT systems and the public from contacting the office.The alleged email bomber is to be charged with one count of committing unauthorized impairment of electronic communications, which violates section 477.3 of the Criminal Code Act 1995 (Cth). The maximum imprisonment penalty for this particular offense is ten years.Although the AFP does not elaborate on the exact means by which the arrested woman sent a large volume of emails to the MP office within such a short time, they state that the attack used multiple domains when sending the emails.This likely means that the arrested woman used an \"email bombing\" service that allows customers to send many emails to a target from different addresses, thus making it challenging for the recipient to contain and manage the atypical denial of service attack.Many of these services can bypass spam filters in use today, filling employee inboxes and overwhelming the targeted organization's email server.These email bombing services are typically offered on the dark web or underground hacking forums and marketplaces, such as the promoted ones shown below.Alternatively, the attacker might have used scripts that automate registering the target's email address to many websites, which then sent registration confirmations to the MP office. Since these sites are legitimate, their messages bypass spam filters.Unfortunately, due to these attacks involving a large number of senders, blocking the email addresses or marking their messages as spam isn’t a very effective defense method.The only way to deal with this type of threat is to set up an advanced filtering tool that will block messages based on specific criteria, such as keywords in the content."
   },
   {
      "time": "2023-03-02",
      "title": "Aruba Networks fixes six critical vulnerabilities in ArubaOS",
      "text": " Aruba Networks published a security advisory to inform customers about six critical-severity vulnerabilities impacting multiple versions of ArubaOS, its proprietary network operating system.The flaws impact Aruba Mobility Conductor, Aruba Mobility Controllers, and Aruba-managed WLAN Gateways and SD-WAN Gateways.Aruba Networks is a California-based subsidiary of Hewlett Packard Enterprise, specializing in computer networking and wireless connectivity solutions.The critical flaws addressed by Aruba this time can be separated into two categories: command injection flaws and stack-based buffer overflow problems in the PAPI protocol (Aruba Networks access point management protocol).All flaws were discovered by security analyst Erik de Jong, who reported them to the vendor via the official bug bounty program.The command injection vulnerabilities are tracked as CVE-2023-22747, CVE-2023-22748, CVE-2023-22749, and CVE-2023-22750, with a CVSS v3 rating of 9.8 out of 10.0.An unauthenticated, remote attacker can leverage them by sending specially crafted packets to the PAPI over UDP port 8211, resulting in arbitrary code execution as a privileged user on ArubaOS.The stack-based buffer overflow bugs are tracked as CVE-2023-22751 and CVE-2023-22752, and also have a CVSS v3 rating of 9.8.These flaws are exploitable by sending specially crafted packets to the PAPI over UDP port 8211, allowing unauthenticated, remote attackers to run arbitrary code as privileged users on ArubaOS.The impacted versions are:The target upgrade versions, according to Aruba, should be:Unfortunately, several product versions that have reached End of Life (EoL) are also affected by these vulnerabilities and will not receive a fixing update. These are:A workaround for system administrators who cannot apply the security updates or are using EoL devices is to enable the “Enhanced PAPI Security” mode using a non-default key. Aruba states that it is unaware of any public discussion, exploit code, or active exploitation of these vulnerabilities as of the release date of the advisory, February 28, 2022."
   },
   {
      "time": "2023-03-02",
      "title": "Trezor warns of massive crypto wallet phishing campaign",
      "text": " An ongoing phishing campaign is pretending to be Trezor data breach notifications attempting to steal a target's cryptocurrency wallet and its assets.Trezor is a hardware cryptocurrency wallet where users can store their cryptocurrency offline rather than in cloud-based wallets or wallets stored on their devices. Using a hardware wallet like Trezor adds protection from malware and compromised devices, as the wallet is not meant to be connected to your PC.When setting up a new Trezor wallet, users are given a 12 or 24-word recovery seed that can be used to recover a wallet if a device is stolen, lost, or malfunctions.However, anyone who gains access to this seed can also restore the wallet on their own devices, making them juicy targets for threat actors.Starting on February 27th, Trezor customers began receiving SMS and email phishing messages stating that Trezor had suffered a data breach. These messages prompt the target to visit a listed website to secure their device.\"Trezor Suite has recently endured a security breach, assume all your assets are vulnerable. Please follow the security procedure to secure your assets: [phishing-site],\" reads the fake Trezor data breach warning messages.When visiting the listed domain, visitors will be shown a fake Trezor site that states, \"Your assets might be at risk!\" and then prompts you to start securing your wallet.When users click the 'Start' button, they will ultimately be prompted to enter their recovery seed, which the threat actors will then steal.Once a recovery seed is stolen, it is game over for the wallet owner, as the threat actors will likely quickly transfer any assets to another address under their control.Therefore, it is vital to never share your wallet's recovery passwords, seeds, or phrases with anyone else or enter them on any sites.Trezor is aware of the phishing campaign and warned users to beware of phishing SMS and emails warning of a fake data breach. The company also states that they have not found any evidence of a recent data breach in its systems.\"Please ignore these messages as they are not from Trezor.\"\"We have not found any evidence of a recent database breach. We will never contact you via calls or SMS.\"MailChimp told BleepingComputer then that the threat actors stole data from 102 customers, with most in the cryptocurrency and finance sectors.When installed, this Trezor Suite would prompt the user to enter their recovery seed, which was then transmitted back to the threat actors.While the current phishing campaign is not using fake software, the threat actors are still attempting to steal your recovery seed. Therefore, as we said earlier, and it warrants repeating, never share your recovery seed with anyone or on any site."
   },
   {
      "time": "2023-03-02",
      "title": "Canadian book giant says employee data was stolen during ransomware attack",
      "text": " Indigo said current and former employees would be contacted through email about the incident by identity theft management company Cyberscout. Those without email addresses on file will be sent letters in the mail. “Through our investigation we learned there is no reason to believe customer data has been improperly accessed, but that some employee data was. We have notified and are cooperating with law enforcement,” the company said. Employees will be provided with two years of free myTrueIdentity credit monitoring and identity theft protection services. Several current and former employees criticized a statement Indigo posted February 17 on Twitter. It makes no mention of the employee information accessed during the attack. Some said their personal email and address is no longer the same as when they worked at Indigo, meaning they did not get the breach notification letters. Also a former employee. Also didn't hear anything from Indigo. Created this Twitter account specifically to try to get info from them. I did find a hotline for Transunion (through Reddit) - they confirmed I'm on the list of those compromised. Talk about poor communication.While the initial investigation indicated customer data was not compromised, Indigo noted that “if at any point in the future we determine that personal data has been compromised, we commit to contacting those impacted directly.”“We are also working hard to return our seamless online experience to you,” the company said. “As part of this work, we are thrilled to share a new temporary online home for you to explore at indigo.ca. This browsable-only experience will include a selection of bestselling books and a curated edit of lifestyle products.”The FAQ also explains that online ordering is still limited and the Indigo app is still unusable. Order status and delivery estimate systems are also still down. The company said it is also unable to cancel orders made before February 8.LockBit has given Indigo until Thursday to pay a ransom before the information is leaked. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-02",
      "title": "Russia bans foreign messaging apps in government organizations",
      "text": " Russia’s internet watchdog agency Roskomnadzor warns that laws banning the use of many foreign private messaging applications in Russian government and state agencies came into force today.The banned services mentioned by Roskomnadzor include the following:Interestingly, the California-based \"Zoom,\" one of the world's most widely used video conferencing, instant messaging, and voice calls platforms, isn't on Roskomnadzor's list. Likewise, the encrypted messaging service \"Signal\" is not mentioned in the list.However, the current ban does not appear to be an effort to curb the influx of foreign information that could shape the opinion of the local population, but rather a precaution to prevent leaks of sensitive information to foreign entities.Russia is very cautious and actively limiting the deployment of foreign software in critical sectors to minimize the chances of sensitive information reaching foreign intelligence.Update 3/1/23: Incorrectly stated it was all Russian orgs."
   },
   {
      "time": "2023-03-02",
      "title": "Iron Tiger hackers create Linux version of their custom malware",
      "text": " The APT27 hacking group, aka \"Iron Tiger,\" has prepared a new Linux version of its SysUpdate custom remote access malware, allowing the Chinese cyberespionage group to target more services used in the enterprise.The new malware variant is written in C++ using the Asio library, and its functionality is very similar to Iron Tiger's Windows version of SysUpdate.The observed SysUpdate campaign analyzed by Trend Micro deployed both Windows and Linux samples against valid targets.One of the victims of this campaign was a gambling company in the Philippines, whose attack utilized a command and control server registered with a domain similar to the victim's brand.The infection vector is unknown, but Trend Micro's analysts hypothesize that chat apps were used as lures to trick employees into downloading initial infection payloads.One item that has evolved compared to past campaigns relying on SysUpdate is the loading process, which now uses a legitimate and digitally-signed \"Microsoft Resource Compiler\" executable (rc.exe) to perform DLL side-loading with rc.dll to load shellcode.The shellcode loads the first stage of SysUpdate in memory, so it's difficult for AVs to detect. Then, it moves the required files to a hardcoded folder and establishes persistence with Registry modifications or by creating a service, depending on the process permissions.The second stage will launch after the next system reboot to decompress and load the primary SysUpdate payload.SysUpdate is a feature-rich remote access tool allowing a threat actor to perform a variety of malicious behavior as listed below:Trend Micro comments that Iron Tiger used a Wazuh-signed executable in later sideloading stages to blend with the victim's environment, as the target organization used the legitimate Wazuh platform.The Linux variant of SysUpdate is an ELF executable and shares common network encryption keys and file-handling functions with its Windows counterpart.The binary supports five parameters that determine what the malware should do next: setting persistence, daemonizing the process, setting a GUID (Globally Unique Identifier) for the infected system, etc.The malware establishes persistence by copying a script to the \"/usr/lib/systemd/system/\" directory, an action that requires root user privileges.Upon its launch, it sends the following information to the C2 server:One new feature in the Linux SysUpdate variant is DNS tunneling, seen only on one Windows sample of the malware.SysUpdate obtains DNS information from \"/etc/resolv.conf\" file to retrieve the default system DNS IP address which can be used for sending and receiving DNS queries. If that fails, it uses Google's DNS server at 8.8.8.8.The idea of this system is to bypass firewalls or network security tools that might be configured to block all traffic beyond a specific IP address allowlist.Trend Micro says the choice of the Asio library for developing the Linux version of SysUpdate might be due to its multi-platform portability and predicts that a macOS version of the malware might appear in the wild soon."
   },
   {
      "time": "2023-03-02",
      "title": "Microsoft Exchange Online outage blocks access to mailboxes worldwide",
      "text": " Microsoft is investigating an ongoing outage blocking Exchange Online customers worldwide from accessing their mailboxes or sending/receiving emails.Affected users see \"550 5.4.1 Recipient address rejected: Access denied\" errors when trying to send or when receiving messages, starting today at 1:11 PM UTC.\"We've identified a potential Directory Based Edge Blocking (DBEB) issue that may be contributing to impact,\" Microsoft said in a service health alert issued today at 5:22 PM UTC.\"We're investigating this alongside our existing diagnostic data to determine our next steps. Impact is specific to users who are served through the affected infrastructure in North America, Europe, and the United Kingdom.\"While Redmond said 30 minutes ago that telemetry data indicated that the service was starting to recover, a subsequent update says that additional monitoring revealed that the outage is still ongoing.The list of services affected by last month's outage included Microsoft Teams, Exchange Online, Outlook, SharePoint Online, OneDrive, the Microsoft 365 Admin Center, Microsoft Graph, Microsoft Intune, and several Microsoft Defender products."
   },
   {
      "time": "2023-03-02",
      "title": "CISOs Share Their 3 Top Challenges for Cybersecurity Management",
      "text": " Cybersecurity In-DepthManaging risk on a global scale has always been challenging, but in light of the COVID-19 pandemic, CISOs have had to become even more agile. The shift to hybrid work, the rapid deployment of cloud applications, and the move to continuous integration and continuous development (CI/CD) have emboldened threat actors with new and broader targets.Meanwhile, the number of devices and endpoints on organizations' networks has increased exponentially. Two veteran CISOs lamented the challenges that these changes have imposed during a webinar last week organized by Sepio, an asset detection and risk management startup. Sepio CISO Ilan Kaplan moderated an hour-long discussion with HSBC CISO Monique Shivanandan and Carl Froggett, who was CISO at Citi for 17 years before joining startup Deep Instinct last summer as CIO.Shivanandan and Froggett shared with Kaplan what they see as three of the most significant challenges the rapidly changing cybersecurity and risk landscape presents.But overshadowing that benefit is the sheer scale of all the components associated with modern applications. \"An asset used to survive five, six, seven years, or longer if you include the underlying operating systems, whereas now the lifetime of the container can be measured in seconds or maybe minutes,\" Froggett said. That creates \"a whole new set of [visibility] challenges from that perspective.\"\"One of the biggest challenges that every CIO and every CISO faces is having that visibility and making sure that visibility is up to date,\" Shivanandan said.\"Unfortunately, with the number of parties we have, we cannot do it for everyone,\" she added. \"We do it for a select few.\" The problem is \"every software change and every new release can knowingly or unknowingly introduce something new. It's a constant battle that we're facing.\"Froggett said that Citi has strict processes around onboarding new technology, including pen testing and red teaming, but with the current release cadences, enforcement has become challenging. \"Ultimately, you can't usually do source code reviews\" of everything that comes in, he said.The shortage of experienced cybersecurity specialists is nothing new, but Shivanandan said it remains one of her top challenges. \"All the technology in the world is only as good as the people there to make sure that we install [everything] correctly and keep it up to date,\" she said.Despite considerable progress, Shivanandan said it remains difficult for women to break the glass ceiling. She said she believes that men have an outsized presence in senior cybersecurity roles compared with the entire IT industry.\"When you start out at the lower levels, there's [an] equal [proportion of] men and women, 50-50, sometimes even 60-40 women,\" she said. \"Then, as you go through the progression, the women drop out and the men continue to progress from a seniority level.\"Nevertheless, women face fewer barriers today compared with when she started out, Shivanandan said. \"When I was starting out, they wanted to pat you on the head and say, 'Dear, don't worry your pretty little head. I'll take care of technical things.' But not anymore,\" she said. \"There's no ceiling for a woman to get into any position now. It's a matter of just perseverance.\"Shivanandan considers herself fortunate at HSBC, where 40% of her leadership team is women. \"The women and the men are both fantastic, and that's the thing that you really want to look for,\" she said.During Froggett's nearly 25 years at Citi, most of his bosses were women, he said. \"The job's not done for sure, but there is definitely more of a balance [than what] I saw five or 10 years ago.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-03-02",
      "title": "Washington state public bus system confirms ransomware attack",
      "text": " A public transportation system serving parts of Washington state has confirmed that a ransomware attack two weeks ago disrupted some of its systems. The transit system serves about 18,000 people each day. “Third party forensic experts were engaged to conduct a thorough investigation into the nature and scope of the incident, and law enforcement has been notified. Importantly, our transit operations and rider safety were not impacted as a result of this incident,” a spokesperson told The Record. “All transportation services are operating as normal. However, temporary workarounds were put in place for certain affected administrative systems in the initial hours and days following the incident. The majority of operations have now been fully restored,” the spokesperson said.The agency is still investigating the incident and attempting to understand what sensitive data was accessed.The organization plans to notify customers if their information was stolen and leaked by LockBit. The ransomware group claimed it stole correspondence, non-disclosure agreements, customer data, contracts and more.Pierce Transit said it intends to put in place more security measures and additional cybersecurity monitoring tools to “reduce the likelihood of a similar issue reoccurring.”“As our investigation continues, we are committed to keeping our community informed, as appropriate,” the spokesperson said. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-02",
      "title": "Cisco patches critical Web UI RCE flaw in multiple IP phones",
      "text": " Cisco has addressed a critical security vulnerability found in the Web UI of multiple IP Phone models that unauthenticated and remote attackers can exploit in remote code execution (RCE) attacks.The RCE flaw (CVE-2023-20078) allows attackers to inject arbitrary commands that will be executed with root privileges following successful exploitation.The company also disclosed today a second high-severity vulnerability (CVE-2023-20079) that can be abused to trigger denial-of-service (DoS) conditions.Both bugs are due to insufficient validation of user-supplied input and can be exploited using maliciously crafted requests sent to the targeted device's web-based management interface.The security vulnerabilities were discovered by Zack Sanchez of the Cisco Advanced Security Initiatives Group (ASIG) during internal security testing.The list of affected devices includes Cisco IP Phone 6800, 7800, and 8800 series devices with Multiplatform Firmware (vulnerable to both RCE and DoS attacks), and the Unified IP Conference Phone 8831, Unified IP Conference Phone 8831 with Multiplatform Firmware, and Unified IP Phone 7900 Series (only vulnerable to DoS attacks).The company's Product Security Incident Response Team (PSIRT) added that it hadn't seen evidence of attempts to exploit this security flaw in attacks.While Cisco released security updates to address the CVE-2023-20078 RCE vulnerability, the company said it would not release patches to fix the CVE-2023-20079 DoS flaw.\"Cisco Unified IP Phone 7900 Series and Cisco Unified IP Conference Phone 8831 have entered the end-of-life process,\" the company explained.While a security update for CVE-2022-20968 is not yet available, admins are advised to disable CDP on affected IP Phone devices supporting Link Layer Discovery Protocol (LLDP) to remove the attack vector."
   },
   {
      "time": "2023-03-02",
      "title": "Lazarus's Latest Weapons: Wslink Loader and WinorDLL64 Backdoor - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " ESET researchers have found one of the payloads of the Wslink downloader that experts previously discovered in 2021. The payload is called WinorDLL64 based on its filename. Wslink, a loader for Windows binaries, is different from other loaders, it runs as a server and executes retrieved modules in memory. As the name suggests, a loader would serve as a tool to launch the payload or the malware into the infected system. Experts haven't identified the initial Wslink compromise vector yet. The WinorDLL64 is delivered by the Wslink malware downloader. These tools may be linked with the infamous North Korea-based APT group Lazarus. WinorDLL64 is a backdoor that was first found by cybersecurity experts in 2019. It is a 64-bit variant of the original Winor backdoor, which the Lazarus group used in its previous attacks. WinorDLL64 is built to be highly deceptive, which makes it difficult for experts to identify.WinorDLL64 is usually distributed via spear-phishing emails or malicious downloads. Once it compromises a system, it makes a backdoor that lets threat actors remotely gain entry and control the attacked system. It is built to avoid detection by using a number of techniques, this includes encrypting the communication process and concealing its sight on the system.WeLiveSecurity by ESET reports \"active since at least 2009, this infamous North-Korea aligned group is responsible for high-profile incidents such as both the Sony Pictures Entertainment hack and tens-of-millions-of-dollar cyberheists in 2016, the WannaCryptor (aka WannaCry) outbreak in 2017, and a long history of disruptive attacks against South Korean public and critical infrastructure since at least 2011. US-CERT and the FBI call this group HIDDEN COBRA.\"WinorDLL64 is a highly advanced backdoor that allows threat actors full control over the compromised system. Threat actors can steal important info, add malware, and do various malicious activities while evading detection. The dangers associated with WinorDLL64 are consequential, especially for companies that depend on sensitive data or critical systems.In the case of malware, safety is fundamental when it comes to defending against WinorDLL64. Companies can take various measures to decrease the chance of compromise. This includes:Familiarizing employees with the dangers of phishing emails and inspiring them to be careful while opening attachments or suspicious links.Maintaining software and security systems up-to-date to make sure all vulnerabilities are patched. Enforcing two-factor authentication and other login controls to reduce the damage from cyberattacks. Daily monitoring of network activity and system logs for any hints of malicious behavior.Using a trusted anti-malware solution that can find and stop WinorDLL64 and various kinds of malware.In summary, we can say that WinorDLL64 is a highly effective backdoor that is a significant threat to companies. It is believed to be the work of the North Korean hacking group, Lazarus, and is designed to evade detection and provide attackers with complete control over an infected system. Organizations can take various measures to defend against WinorDLL64, this includes educating the workplace, having the latest software, enforcing access controls, checking network activity, and using anti-malware software. With a proactive approach to cybersecurity, companies can lower the threat of a successful cyber attack and safeguard their precious systems and data. your nameYour Emailyour message"
   },
   {
      "time": "2023-03-01",
      "title": "Blind Eagle Deploys Fake UUE Files and Fsociety to Target Colombia's Judiciary, Financial, Public, and Law Enforcement Entities",
      "text": " APT-C-36, also known as Blind Eagle, has been actively targeting organizations in Colombia and Ecuador since at least 2019. It relies on spear-phishing emails sent to specific and strategic companies to conduct its campaigns. On Feb. 20, the BlackBerry Research and Intelligence team witnessed a new campaign where the threat actor impersonated a Colombian government tax agency to target key industries in Colombia, including health, financial, law enforcement, immigration, and an agency in charge of peace negotiation in the country.Based on the infector vector and payload deployment mechanism, we also uncovered campaigns targeting Ecuador, Chile, and Spain.TacticTechniqueInitial AccessT1566.001ExecutionT1204.001, T1204.002, T1059.005, T1059.001, T1059.003PersistenceT1053.005, T1547.001Defense EvasionT1218.009WeaponsPDF for lures, Visual Basic Scripts, .NET Assemblies injected in memory, Malicious DLLs, PowerShellAttack VectorSpear-phishing attachment with PDFNetwork InfrastructureDDNS DuckDNS, Discord, Web ApplicationsTargetsEntities in ColombiaContextThe main targets of this group for the last few years have been those related to financial and governmental entities.The initial vector for infection is typically a PDF attachment sent by email. In the case we’ll be examining in this report, the sender of the phishing email opted to use the Blind Carbon Copy (BCC) field instead of the To: field, most likely in an attempt to evade spam filters. They orchestrated their scam to correspondencia@ccb.org.co, which is the official email address listed on the Contact Us page of the Bogota Chamber of Commerce website. Bogotá, of course, is the Capital of Colombia.The email's Subject line reads, \"Obligaciones pendientes - DIAN N.2023-6980070- 39898001\" - in English, this means “outstanding obligations,” a lure craftily designed to catch the attention of unsuspecting law-abiding recipients. DIAN is Colombia’s Directorate of National Taxes and Customs - the Dirección de Impuestos y Aduanas Nacionales.The letter we analyzed states that the recipient is “45 days in arrears” with a tax payment, and tells the target to click a link to view their invoice, which comes in the form of a password-protected PDF. The letter was signed by a (likely fictious) “Roberto Mendoza Ortiz, Department Head.” The phishing email's sender is \"alfredo agudelo moreno agudelomorenoalfredo79[at]gmail[.]com,\" an email address which also appears to have been be made up specifically for this campaign.We also found another email address associated with this campaign – cobrofactura09291[at]gmail[.]com.The PDF attached to the phishing email tries to trick the recipient with logos and messages related to the Directorate of National Taxes and Customs. APT-C-36 has regularly used DIAN in their spear-phishing lures over the years, presumably hoping that their targets’ wish to maintain in good standing with the tax authorities would override any natural caution they may have when opening emails sent from an unfamiliar email address.The PDF contains a URL different from the legitimate hyperlink to DIAN’s website, which is https://www.dian.gov.co/. The URL shown is the real one; however, if the user clicks on it, they are redirected to a different website. Finally, the URL field of this new site contains a URL which downloads a second-stage payload from the public service Discord.Below is the full intrusion attempt shown step-by-step:Figure 1: Attack flow of Blind Eagle’s campaign analyzedHashes (md5, sha-256)e4d2799f3001a531d15939b1898399b4fc85d3da6401b0764a2e8a5f55334a7d683ec20fb8210213feb6148f02a30554File nameFv3608799004720042L900483000P19878099700001537012.pdfFile Size507436 bytesCreated2023:01:25 10:07:03-05:00AuthorDirección De Aduanas Nacionales Calle 23 # 157-25 laLast Modified2023:01:25 10:07:03-05:00DocumentIDuuid:9585FD65-6D08-453D-9E4A-51155AD12748Blind Eagle carefully targets its victims with spear-phishing emails, in a similar fashion to other campaigns by the group. It entices its targets to click links contained in the body of the email, or to download a malicious PDF file, which purports to contain information about overdue taxes.Figure 2: Content of the bait email, masquerading as the Directorate of National Taxes and CustomsIn English, the bait document reads:Dear taxpayer,At DIAN we maintain our commitment to provide you with the necessary assistance and services so that you can comply in a timely and correct manner with your tax obligations.For this reason, we remind you that you are in arrears with your obligations. for an amount owed of THREE MILLION TWO HUNDRED FIFTY-TWO THOUSAND ONE HUNDRED FORTY PESOS, with 45 days in arrears due to the lack of commitment in your financial obligations regulated in law 0248 of the year 2005 numeral 12.Next, we put at your disposal the Virtual PDF with all the details of your obligations generated to date.Submit a foreclosure process and pay on time.In the following link you will find the invoice in PDF format.To view the document, enter the password: A2023Cordially,ROBERTO MENDOZA ORTIZ\r\nDepartment Head\r\n When the victim clicks on the masked link in the email, they are redirected to dian.server[.]tl. The threat actor carefully crafted this webpage to deceive the victim into believing they are interacting with the real DIAN.Figure 3: Content presented to the user on the fake webpage dian.server[.]tlLooking at the code of the webpage, the content presented to the users is loaded from website[.]org/s8Xwt2 or website[.]org/render/s8Xwt2, and not from dian.server[.]tl. This is accomplished by using an iframe resized to the 100% of the screen.Figure 4: The content the victim sees is shown on the left, which is loaded from the resource shown on the rightThe fake DIAN website page contains a button that encourages the victim to download a PDF to view what the site claims to be pending tax invoices. Clicking the blue button initiates the download of a malicious file from the Discord content delivery network (CDN), which the attackers are abusing in this phishing scam.The downloaded file tries to trick the user into manually adding the word “pdf” at the end of the filename. However, the real extension is actually “uue.” This is a file extension WinRAR opens by default. Behind the extension there is a .RAR archive.\nFigure 5: Default installation of WinRAR with uue extension  Hashes (md5, sha-256)B432202CF7F00B4A4CBE377C284F3F286D9D0EB5E8E69FFE9914C63676D293DA1B7D3B7B9F3D2C8035ABE0A3DE8B9FCAFile NameAsuntos_DIAN_N6440005403992837L2088970004-01-02-2023-pdf.uueFile Size1941 (bytes)\r\nIt’s necessary to decompress the contents of the .uue file to continue with the infection chain. The compressed .uue file contains yet another file inside it. The inner file uses the same naming convention as the parent, but in this case, the new file is a Visual Basic Script (VBS).Figure 6: Content of the malicious .uue file  Hashes (md5, sha-256)6BEF68F58AFCFDD93943AFCC894F8740430BE2A37BAC2173CF47CA1376126A3E78A94904DBC5F304576D87F5A17ED366File nameAsuntos_DIAN_N°6440005403992837L2088970004-01-02-2023-pdf.vbsFile Size227378 (bytes)Last Modified2023:01:31 23:01:04\r\nThe file-extracted VBS script is executed via wscript.exe once the user double-clicks the file, so an element of user-interaction is involved in executing the attack. Upon execution, the infection chain starts automatically and carries out various actions within the system without any further user input, as seen below in figure 7.Figure 7: Process tree once the VBS script is manually executed by the userThe VBS script's content is encoded but easy for a researcher to understand and decode.Figure 8: Content of the VBS scriptThe VBS script contains a significant amount of junk code, but has several replace functions to construct the PowerShell execution.Figure 9: Replace functions to replace junk code by the original behaviorThe content was built under the variable “OXVTEUOWQPEFWQ”, as shown in figure 9 above. After creating that content, figure 8 shows the variable “YISMXXAPAUXCGFI”, which is set as a WScript object.After decoding the code, to better understand its behavior, we can see that a part of the logic - the URL shown in the above image - is actually reversed.Figure 11: A closer look at part of the VBS code, decodedThe final payload executed is powershell.exe, with the following command line parameters:First, PowerShell downloads and executes the decoded base64 content of hxxp://172.174.176[.]153/dll/Dll.ppam, which is a .NET DLL encoded, as shown in figure 12.\nFigure 12: Base64 content from the server, called using powershell.exeNext, it uses GetType(‘Fiber.home’).GetMethod(‘VAI’), to load the VAI method from the DLL downloaded previously. The logic of this method is as follows:To better understand the PowerShell execution, the following image demonstrates the sequence of loading DLLs dynamically in memory until the final goal, which is to load AsyncRAT into memory. AsyncRAT is one of the most popular open-source remote access Trojans (RATs) on the threat landscape today.Figure 13: Sequence of loaded DLLs after PowerShell executionThe following image is part of all the behavior described above, related to the first DLL loaded using the PowerShell command spawned by the VBS Script and calling the ‘VAI’ method.Figure 14: Part of the method VAI previously called by PowerShellAs mentioned, Fsociety.dll is used to load the final payload of AsyncRAT, which is downloaded from Discord.Figure 15: Fsociety.dll is used to load AsyncRAT in memoryThe “Ande” function called in the Fsociety.dll contains the following code:Figure 16: Fsociety DLL code\r\n Hashes (md5, sha-256)C75F9D3DA98E57B973077FDE8EC3780F5399BF1F18AFCC125007D127493082005421C5DDEBC34697313D62D8BC88DAECFile NameFiber.dll (Dll.ppam)File Size10240 bytesCompiledThu Feb 02 21:43:24 2023 | UTC Hashes (md5, sha-256)07AF8778DE9F2BC53899AAC7AD671A7203B7D19202F596FE4DC556B7DA818F0F76195912E29D728B14863DDA7B91D9B5File NameFsociety.dll (Rump.xls)File Size25600 bytesCompiledSat May 18 00:13:09 2086 | UTC  Hashes (md5, sha-256)5E518B80C701E17259F3E7323EFFC83F64A08714BD5D04DA6E2476A46EA620E3F7D2C8A438EDA8110C3F1917D63DFCFCFile NameStub.exe (AsyncRAT payload)File Size26080 bytesCompiledSun May 10 05:24:51 2020 | UTC\r\nAsyncRAT contains a configuration method with information that is used during the intrusion attempt. This information is encrypted using Base64 and AES256.Figure 17: AsyncRAT configuration encryptedOnce the configuration is decrypted, it contains information about the Command-and-Control (C2) to transfer commands and files between client and server.Figure 18: AsyncRAT configuration decryptedAlso, between the configuration, it was possible to obtain the X.509 certificates used for communication with the C2.Figure 19: Certificate extracted from the AsyncRAT configAsyncRAT can establish persistence in two different ways, depending on whether a user loaded it with admin privileges or not. A copy of itself is first created under C:\\Users\\<user>\\AppData\\Roaming\\MRR.exe.Figure 20: Creation of MRR in AppData folder1.      If the user who executed it was an admin, then AsyncRAT can create a scheduled task using the process schtasks.exe, with the following command line:a.      \"C:\\Windows\\System32\\cmd.exe\" /c schtasks /create /f /sc onlogon /rl highest /tn \"MRR\" /tr '\"C:\\Users\\<user>\\AppData\\Roaming\\MRR.exe\"' & exit'Figure 22: Command line executed to create scheduled task and run AsyncRAT2.      If the user is not an admin, then AsyncRAT can create a registry key to execute the binary every time the system is started:a.      Key: KCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\MRR\r\nb.      Value: C:\\Users\\<user>\\AppData\\Roaming\\MRR.exeFigure 23: Registry key created to execute the AsyncRAT PayloadAn interesting part that always happens, regardless of whether the user is admin or not, is the creation of a .bat file in the user’s Temp directory to perform the following actions:a.      Timeout.exe execution for three seconds\r\nb.      Run the AsyncRAT payload from AppData folder\r\nc.       Delete the .bat fileFigure 25: Execution of cmd.exe to load the .bat file from tmp folderWe could determine that the .bat filename is randomly generated using the regular expression after several executions of this sample. The structure is like the next one: .*tmp[a-zA-Z1-9]{4}.tmp.bat.Figure 26: Persistence methods used by AsyncRATIn this case, the victim’s machine starts communicating with the DuckDNS server to receive and execute commands, exfiltrate information, and perform any other action desired by the threat actor. As seen in figure 18 above, the server used is asy1543.duckdns[.]org:1543.Figure 27: Communication started between victim’s machine and the threat actor’s C2During our investigation, the resolution of the DuckDNS domain was changed to different IP addresses. Initially, the IP that resolves the domain was a VPN/Proxy service 46.246.86[.]3. While conducting the investigation, we discovered another IP with the same purpose, 46.246.12[.]6.EntityValueDescriptionDomainasy1543.duckdns[.]org:1543Final AsyncRAT payload communication domainIP46.246.86[.]3Resolution of the DuckDNS domainIP46.246.12[.]6Resolution of the DuckDNS domainURLhxxp://172.174.176[.]153/Web application hosting payloads used during the infectionIP172.174.176[.]153IP of the web application hosting payloads used during the infection\r\nBlind Eagle/ APT-C-36 uses Dynamic DNS (DDNS) services, such as DuckDNS, for most campaigns to connect its implemented RATs to the infrastructure they control to send and receive commands. DuckDNS additionally allows for high IP resolution rotation and the launch of new subdomains under this well-known DDNSThe application web hosted under hxxp://172.174.176[.]153/ had two main directories where it stored information to be used during the intrusion as the user downloads and executes files.The first directory was hxxp://172.174.176[.]153/dll/, storing several DLLs used during the intrusion.Figure 28: Index of APT-C-36's /dll directoryAnother directory is found at hxxp://172.174.176[.]153/rump/ and stores another DLL, in this case, related to Fsociety:Figure 29: index of /rump directoryBlind Eagle/ APT-C-36's targets include health, public, financial, judiciary, and law enforcement entities in Colombia.Among the countries where we have seen Blind Eagle activity in the last few months, specifically distributing the UUE file types with different themes, include:This is consistent with the use of the Spanish language in the group’s spear-phishing emails. Most countries in South America use Spanish (apart from Brazil), which matches the threat actor’s locale and the names in the bait document.APT-C-36 is a South American-based threat actor active since at least 2019. The group continues to concentrate its operations within a Hispanic geographic region, with its main targets being government institutions and other organizations primarily based in Colombia.The use of specific tools and artifacts, along with the type and configuration of the network infrastructure documented in this report, combined with the tactics, techniques & procedures (TTPs) used to deploy them, all closely align with previously attributed campaigns by this group.That, coupled with the geolocation and nature of the targets seen in this campaign, leads us to ascertain, at the very least, a moderate level of confidence that this campaign was conducted by APT-C-36.This campaign continues to operate for the purposes of information theft and espionage. The modus operandi used has mostly stayed the same as the group’s previous efforts – it is very simple, which may mean that this group is comfortable with its way of launching campaigns via phishing emails, and feels confident in using them because they continue to work.Over the next few months, we will likely continue to see new targets for this group, using new ways to deceive their victims.Yara Rulesrule targeted_BlindEagle_Loader : Fsociety\r\n{\r\n    meta:\r\n        description = \"Rule to detect BlindEagle malicious Loader\"\r\n        author = \"The BlackBerry Research & Intelligence team\"\r\n        date = \"2023-02-07\"\r\n        last_modified = \"2023-02-22\"\r\n        distribution = \"TLP:White\"\r\n        version = \"1.0\"        strings:                                $h0 = {6449640053697A655F00526573657276656431004465736B746F70005469746C65006477580064775900647758536\r\n97A650064775953697A6500647758436F756E74436861727300647759436F756E74436861727300647746696C6C41747472}\r\n                        $h1 = {000004200101022901002434353136453045312D354330452D344234452D394133322D39453337453233453734323600000C01000731\r\n2E302E302E3000004901001A2E4E45544672616D65776F726B2C5665}               condition:\r\n        uint16(0) == 0x5A4D and filesize < 100KB and 1 of ($h*)}\r\nDisclaimer: The private version of this report is available upon request. It includes but is not limited to the complete and contextual MITRE ATT&CK® mapping, MITRE D3FEND™ countermeasures, and other threat detection content for tooling, network traffic, complete IOCs list, and system behavior. Please email us at cti@blackberry.com for more information.\r\n  The BlackBerry Research & Intelligence team examines emerging and persistent threats, providing intelligence analysis for the benefit of defenders and the organizations they serve.\r\n                        © 2023 BlackBerry Limited. All rights reserved.\r\n                    "
   },
   {
      "time": "2023-03-01",
      "title": "Hackers sat on News Corp network for two years   | SC Media",
      "text": "  People walk past the headquarters for News Corp on Feb. 4, 2022, in New York City. (Photo by Spencer Platt/Getty Images)Publishing giant News Corp revealed that attackers behind a breach disclosed in January 2022 had persistent access to part of its internal system for over two years.   The attack affected the media giant's multiple publications and business units, including The Wall Street Journal, the New York Post and its U.K. news operations.   According to the letter, the affected employees' information may have included names, dates of birth, Social Security numbers, passport numbers, driver's license numbers, financial account information, medical information and health insurance information.    A News Corp spokesperson did not tell SC Media how many employees were impacted but said it is \"a limited number.\"  While News Corp admission that hackers were on its network for two years is uncommon, Connie Stack, data protection advisor and CEO of data loss protection firm Next DLP, said many organizations face challenges identifying breaches in a timely manner.   \"The number one reason cyber-intrusions get missed is alert fatigue. Alert fatigue happens when security and risk professionals are exposed to a large and frequent number of alerts and ultimately become desensitized to them. This desensitization can lead to longer dwell times or worse, missing important alerts altogether,\" Stack said.   Javvad Malik, lead awareness advocate at KnowBe4, echoed Stack, adding that businesses need a layered approach to enhance detection, including locking down workstations, limiting traffic to sensitive areas, and using honeypots or honey tokens.   \"Fewer alerts will be generated in this way, but they will be of much greater value in identifying an attacker,\" Malik said.   The News Corp spokesperson added that based on last year's investigation, the company believes the breach was an intelligence collection effort and was not focused on exploiting personal data.SC Media followed up with Mandiant on the latest investigation progress today. Mandiant said it confirms the validity of the previous statement that the attack connected to Chinese threat actors and has nothing further to add. Menghan Xiao is a cybersecurity reporter at SC Media, covering software supply chain security, workforce/business, and threat intelligence. Before SC Media, Xiao studied journalism at Northwestern University, where she received a merit-based scholarship from Medill and Jack Modzelewski Scholarship Fund.Okta had 4,961 current and former employees' data, including names, health insurance plan numbers, and Social Security numbers, compromised following a breach at its third-party vendor Rightway Healthcare, reports The Register.Threat actors using private keys and passphrases from LastPass databases stolen in cyberattacks last August and December were reported by ZachXBT and MetaMask developer Taylor Monahan to have been able to exfiltrate $4.4 million worth of cryptocurrency on Oct. 25, BleepingComputer reports.The three companies claim no sensitive customer data was lost despite being targeted after the breach of the identity and access management firm.On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-03-01",
      "title": "Thales and Qualcomm join forces to launch GSMA certified iSIM - Help Net Security",
      "text": " Such GSMA’s security certification2 confirms the iSIM supports the same high standards of cyber-protection and flexible ‘anytime anywhere’ connectivity offered by the latest generation of embedded SIMs (eSIMs).The new iSIM can now offer device makers further opportunities to save space, reduce build and supply chain costs while maintaining best-in-class security level.Just like Thales’ eSIM, the new iSIM is fully compliant with the GSMA Remote SIM Provisioning standard; meaning its subscriptions are remotely manageable through any standard platforms.The emerging iSIM form factor complements existing SIM and eSIM designs, and research suggests the market share to grow to 300 million by 2027, representing 19% of all eSIM shipments, according to Kaleido Intelligence."
   },
   {
      "time": "2023-03-01",
      "title": "Danish hospitals latest target of DDoS attacks on NATO-backed countries | SC Media",
      "text": "  A relatively new hacking group known as Anonymous Sudan targeted nine Region H hospitals in Denmark with DDoS attacks late on Feb. 26, bringing down their website for several hours.On Twitter, officials alerted patients to the outage and shared an emergency page with relevant hospital contact information in case of emergency, as the IT team worked to recover the impacted sites. The apparent DDoS attack did not affect the rest of the digital infrastructure.The Anonymous Sudan Telegram channel warned it would attack Denmark healthcare infrastructure after an alleged far-right activist burned a Koran in front of the embassy of Turkey in Stockholm on Saturday. The hackers warned the targeting would continue in retaliation for what they view as anti-Islamic behavior.However, the attack on Denmark’s hospital had limited impact, as The Capital Region and the hospital websites were back to full operation after a few hours of downtime. It’s the latest nation-backed cyberattack against a country with NATO ties, a growing risk facing the critical infrastructure of countries actively supporting Ukraine amid the Russian conflict. Since the start of the year, Russian-backed threat groups have pummeled the critical infrastructure of NATO members with DDoS attacks that appear highly coordinated.But unlike hacktivist groups like Killnet, Anonymous Sudan doesn’t use an illegal botnet to generate the needed traffic volume for a successful DDoS attack. TrueSec and Baffin Bay Networks research found the group uses a paid cluster of 61 servers hosted in Germany.The attacks are then “routed through open proxies to disguise the real origin of the attacks,” according to the research. The finding suggests that Anonymous Sudan is funded by paid infrastructure. “Additional evidence” shows the operation is being carefully funded by a willing donor and not “a spontaneous action by activists.”On Feb. 23, the known servers used by the group were taken down by IBM — just after it warned it would attack Denmark.His comments were followed by a supplement resource on the DDoS attacks against healthcare, warning of needed remediations in light of the patient-safety risks.As for Anonymous Sudan, its latest Telegram post explains the group is not selling its DDoS attack module or “anything.” The group will, however, “search for the best botnet for you with great power,” which includes a list of three that they’re willing to test on behalf of interested parties. The post, when combined with its Killnet affiliation, suggests there’s more to come.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Ukraine had experienced a less than a day-long power outage in October 2022 following an attack by Russian state-sponsored hacking operation Sandworm targeted at an electrical substation amid the ongoing Russia-Ukraine war, marking the first cyberattack-related power interruption in the country since 2017, CyberScoop reports.Attacks deployed by Iranian state-backed threat operation MuddyWater against Israel saw the utilization of the new MuddyC2Go command-and-control framework, which replaced the PhonyC2 custom platform following the exposure of its source code, reports The Hacker News.Israel had its technology, logistics, and transportation industries targeted by Iranian advanced persistent threat operation Charming Kitten, also known as APT35 and Imperial Kitten, last month amid its ongoing war with Palestinian militant group Hamas, according to The Record, a news site by cybersecurity firm Recorded Future.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-03-01",
      "title": "Blackfly: Espionage Group Targets Materials Technology | Symantec Enterprise Blogs",
      "text": " The Blackfly espionage group (aka APT41, Winnti Group, Bronze Atlas) has continued to mount attacks against targets in Asia and recently targeted two subsidiaries of an Asian conglomerate, both of which operate in the materials and composites sector, suggesting that the group may be attempting to steal intellectual property.The following tools were used in attacks during late 2022 and early 2023:Blackfly is one of the longest known Chinese advanced persistent threat (APT) groups, active since at least 2010. Early attacks were distinguished by the use of the PlugX/Fast (Backdoor.Korplug), Winnti/Pasteboy (Backdoor.Winnti), and Shadowpad (Backdoor.Shadowpad) malware families. The group initially made a name for itself through attacks on the computer gaming industry. It subsequently branched out into targeting a more diverse range of targets, including organizations in the semiconductor, telecoms, materials manufacturing, pharmaceutical, media and advertising, hospitality, natural resources, fintech, and food sectors.Despite being the subject of a U.S. indictment, Blackfly has continued to mount attacks, seemingly undeterred by the publicity afforded to the group. Although it originally made a name for itself by attacking the gaming sector, the group appears focused on targeting intellectual property in a variety of sectors at present.If an IOC is malicious and the file available to us, Symantec Endpoint products will detect and block that file.cf6bcd3a62720f0e26e1880fe7ac9ca6c62f7f05f1f68b8fe59a4eb47377880a – Backdoor.Winnkite1e0b887b68307ed192d393e886d8b982e4a2fd232ee13c2f20cd05f91358596 – Backdoor.Winnkita3078d0c4c564f5efb1460e7d341981282f637d38048501221125756bc740aac – Backdoor.Winnkit714cef77c92b1d909972580ec7602b0914f30e32c09a5e8cb9cb4d32aa2a2196 – Backdoor.Winnkit192ef0dee8df73eec9ee617abe4b0104799f9543a22a41e28d4d44c3ad713284 – Backdoor.Winnkitcaba1085791d13172b1bb5aca25616010349ecce17564a00cb1d89c7158d6459 – Backdoor.Winnkit452d08d420a8d564ff5df6f6a91521887f8b9141d96c77a423ac7fc9c28e07e4 – Screenshotting tool1cc838896fbaf7c1996198309fbf273c058b796cd2ac1ba7a46bee6df606900e – Process-hollowing tool4ae2cb9454077300151e701e6ac4e4d26dc72227135651e02437902ac05aa80d – SQL tool560ea79a96dc4f459e96df379b00b59828639b02bd7a7a9964b06d04cb43a35a – DCSyncb28456a0252f4cd308dfb84eeaa14b713d86ba30c4b9ca8d87ba3e592fd27f1c – Mimikatza3acb9f79647f813671c1a21097a51836b0b95397ebc9cd178bc806e1773c864 – ForkPlayground5e51bdf067e5781d2868d97e7608187d2fec423856dbc883c6f81a9746e99b9f – Proxy configuration toold4e1f09cb7b9b03b4779c87f2a10d379f1dd010a9686d221c3a9f45bda5655ee – Proxy configuration toolf138d785d494b8ff12d4a57db94958131f61c76d5d2c4d387b343a213b29d18f – Proxy configuration tool88113bebc49d40c0aa1f1f0b10a7e6e71e4ed3ae595362451bd9dcebcf7f8bf4 – Proxy configuration tool498e8d231f97c037909662764397e02f67d0ee16b4f6744cf923f4de3b522bc1 – Proxy configuration tool100cad54c1f54126b9d37eb8c9e426cb609fc0eda0e9a241c2c9fd5a3a01ad6c – Credential-dumping tool The Threat Hunter Team is a group of security experts within Symantec whose mission is to investigate targeted attacks, drive enhanced protection in Symantec products, and offer analysis that helps customers respond to attacks.We encourage you to share your thoughts on your favorite social platform."
   },
   {
      "time": "2023-03-01",
      "title": "US Marshals Service becomes latest law enforcement agency hit by hackers",
      "text": " The U.S. Marshals Service said it was struck by ransomware last week in an attack that affected systems holding sensitive law enforcement data and personally identifiable information related to several suspects.No ransomware group has taken credit for the attack but the hackers stole employee information, legal documents, administrative data and more. The Justice Department – where the U.S. Marshals Service is housed – and the Cybersecurity and Infrastructure Security Agency declined to comment but Wade said and investigation started last Wednesday after the attack was discovered on February 17. The U.S. Marshals Service is in charge of the witness protection program, protecting judges and transporting prisoners. Sources told NBC News that the breach did not involve data from the witness protection program. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-01",
      "title": "26.6 million login credentials obtained by cybercriminals since 2018 | Security Magazine",
      "text": " Image via PixabayThe average price for a person’s digital information on the bot markets is $6. Moreover, because the malware steals logins together with cookies and device configuration information, cybersecurity experts say that the rise of this malware will help hackers to bypass multi-factor authentication (MFA). After logging in to a user's account, a cybercriminal can try contacting people on a victim’s friends list and send malicious links or ask for a money transfer. They can also post fake information on the victim’s social media feed. Researchers analyzed three major bot markets: the Genesis Market, the Russian Market and 2Easy. All of the markets were active and accessible on the surface web at the time of analysis. The data on bot markets was compiled in partnership with independent third-party researchers specializing in cybersecurity incident research. You must have JavaScript enabled to enjoy a limited number of articles over the next 30 days.ON DEMAND: Business-impacting events such as severe weather, man-made disasters, and supply chain disruption are increasing in frequency and making impacts around the globe. \nIn today's rapidly evolving security landscape, organizations face an ever-growing array of disruptive events, security threats and risks. Traditional reactive approaches to security intelligence often leave businesses vulnerable and ill-prepared to anticipate and mitigate emerging threats that could impact the safety of their people, facilities or operations.\n\n Effective Security Management, 5e, teaches practicing security professionals how to build their careers by mastering the fundamentals of good management. Charles Sennewald brings a time-tested blend of common sense, wisdom, and humor to this bestselling introduction to workplace dynamics. Copyright ©2023. All Rights Reserved BNP Media."
   },
   {
      "time": "2023-03-01",
      "title": "DISH tells SEC that ransomware attack caused outages; personal info may have been stolen",
      "text": " They added that law enforcement was contacted after it was determined that “the outage was due to a cybersecurity incident.”“It is possible the investigation will reveal that the extracted data includes personal information,” the company said. “The forensic investigation and assessment of the impact of this incident is ongoing. DISH, Sling and our wireless and data networks remain operational; however the Corporation’s internal communications, customer call centers and internet sites have been affected. The Corporation is actively engaged in restoring the affected systems and is making steady progress.”An incident response firm has been hired and they are still investigating the attack, the company said. They reportedly informed investors of the outage on an earnings call on February 23. A DISH spokesperson told The Record that the attack affected their internal communications, customer call centers, and websites.They added that they will contact customers if it is revealed that customer data was stolen during the attack. “As a result of this incident, many of our customers are having trouble reaching our service desks, accessing their accounts, and making payments,” the spokesperson said. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-01",
      "title": "Senior DOJ official warns lapse of surveillance law would harm cyber investigations",
      "text": " A leading official at the Justice Department joined the White House in urging Congress to renew a controversial internet surveillance program for non-U.S. citizens on Tuesday, highlighting its critical use in cybersecurity investigations.“We've relied on 702 to mitigate and prevent foreign ransomware and other cyberattacks on us and on our critical infrastructure,” he said, noting that the law was particularly useful for cyber investigations because of how quickly it could be deployed.Through Section 702, the National Security Agency and FBI can take data like emails and text messages from U.S.-based providers, such as Google and Apple, without the need for a warrant. The information collected is put into a large database that is overseen by the Justice Department, the Office of the Director of National Intelligence, federal courts and Congress. The scope of the surveillance powers has drawn criticism from politicians on both sides of the aisle as well as rights groups fearful of overreach. Olsen said on Tuesday that a return to the status quo before 2008, when law enforcement had to obtain court warrants for such surveillance actions, would be unfeasible for the level of hacking and espionage aimed at the U.S. “Even in cases where we could get enough information, the process of obtaining individual court orders each time took too long, often requiring months of effort — it’s simply not something we can do at operational speed, let alone at the speed required to disrupt a cyberattack,” he said. Olsen especially singled out the usefulness of Section 702 in the context of cyberattacks, including to identify \"U.S. person victims of foreign hacking or spying.\" \"That’s what lets us warn and protect them. If we are to keep protecting Americans from escalating cyber and espionage threats, we need to maintain the capacity to conduct U.S. person queries,\" he said.As an example, Olsen said a typical scenario would involve the FBI learning of a nation-state hack related an American energy company. The FBI would query 702 data to figure out what was stolen, what happened to the data, and whether there were other victims. Olsen added that U.S. agencies have no fallback authority to make up for the loss of Section 702 when it lapses in December.He noted that Attorney General Merrick Garland and the Director of National Intelligence Avril Haines had sent a letter to Congress reiterating that there is “simply no way to replicate Section 702.”In January, NSA Director Gen. Paul Nakasone said that Section 702 has played an “irreplaceable” role in helping the agency fend off ransomware attacks. The law continues to face a barrage of attacks from across the political spectrum. Civil rights groups have long decried the law because it often involves the collection of information from U.S. residents who are in communication with the foreign targets of investigations. Congress last extended the life of the surveillance powers in early 2018 but lawmakers made modest tweaks to the law, including a new mandate that the FBI account for every database query it makes for a U.S. person’s data.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-03-01",
      "title": "New MortalKombat ransomware decryptor recovers your files for free",
      "text": " Cybersecurity company Bitdefender has released a free MortalKombat ransomware decryptor that victims can use to restore their files without paying a ransom.MortalKombat distributors target random users with emails containing malicious ZIP attachments containing BAT loader scripts. When the script is launched, it will download the ransomware binary and the Laplas Clipper and execute them on the system.The MortalKombat decryptor is a standalone executable that needs no installation on infected devices. It offers to scan the entire filesystem to locate files infected by MortalKombat, but the user may also define a specific location holding backed-up encrypted data.The software also allows users to create a backup of encrypted files so they don't end up with corrupted and irrecoverable data if something goes wrong with the decryption process.Moreover, there’s an option to replace previously decrypted files, products of partially successful decryption attempts, with new, clean versions.A standard command-line example for the decryptor would be “BDMortalKombatDecryptTool.exe start -full-scan -replace-existing”, which causes the decryptor to scan the entire filesystem and overwrite existing files with clean versions.Bitdefender's decryptor cannot locate and uproot Laplas files, as this is a separate malware infection that can be detected using general-purpose antivirus software.To minimize the risk of ransomware and malware infections, avoid downloading files from obscure sources or attachments from unsolicited emails."
   },
   {
      "time": "2023-03-01",
      "title": "Hackers Claim They Breached T-Mobile More Than 100 Times in 2022 – Krebs on Security",
      "text": " Image: Shutterstock.comThree different cybercriminal groups claimed access to internal networks at communications giant T-Mobile in more than 100 separate incidents throughout 2022, new data suggests. In each case, the goal of the attackers was the same: Phish T-Mobile employees for access to internal company tools, and then convert that access into a cybercrime service that could be hired to divert any T-Mobile user’s text messages and phone calls to another device.The conclusions above are based on an extensive analysis of Telegram chat logs from three distinct cybercrime groups or actors that have been identified by security researchers as particularly active in and effective at “SIM-swapping,” which involves temporarily seizing control over a target’s mobile phone number.Countless websites and online services use SMS text messages for both password resets and multi-factor authentication. This means that stealing someone’s phone number often can let cybercriminals hijack the target’s entire digital life in short order — including access to any financial, email and social media accounts tied to that phone number.All three SIM-swapping entities that were tracked for this story remain active in 2023, and they all conduct business in open channels on the instant messaging platform Telegram. KrebsOnSecurity is not naming those channels or groups here because they will simply migrate to more private servers if exposed publicly, and for now those servers remain a useful source of intelligence about their activities.Each advertises their claimed access to T-Mobile systems in a similar way. At a minimum, every SIM-swapping opportunity is announced with a brief “Tmobile up!” or “Tmo up!” message to channel participants. Other information in the announcements includes the price for a single SIM-swap request, and the handle of the person who takes the payment and information about the targeted subscriber.Initially, the goal of this project was to count how many times each entity claimed access to T-Mobile throughout 2022, by cataloging the various “Tmo up!” posts from each day and working backwards from Dec. 31, 2022.But by the time we got to claims made in the middle of May 2022, completing the rest of the year’s timeline seemed unnecessary. The tally shows that in the last seven-and-a-half months of 2022, these groups collectively made SIM-swapping claims against T-Mobile on 104 separate days — often with multiple groups claiming access on the same days.The 104 days in the latter half of 2022 in which different known SIM-swapping groups claimed access to T-Mobile employee tools.KrebsOnSecurity shared a large amount of data gathered for this story with T-Mobile. The company declined to confirm or deny any of these claimed intrusions. But in a written statement, T-Mobile said this type of activity affects the entire wireless industry.“And we are constantly working to fight against it,” the statement reads. “We have continued to drive enhancements that further protect against unauthorized access, including enhancing multi-factor authentication controls, hardening environments, limiting access to data, apps or services, and more. We are also focused on gathering threat intelligence data, like what you have shared, to help further strengthen these ongoing efforts.”While it is true that each of these cybercriminal actors periodically offer SIM-swapping services for other mobile phone providers — including AT&T, Verizon and smaller carriers — those solicitations appear far less frequently in these group chats than T-Mobile swap offers. And when those offers do materialize, they are considerably more expensive.The prices advertised for a SIM-swap against T-Mobile customers in the latter half of 2022 ranged between USD $1,000 and $1,500, while SIM-swaps offered against AT&T and Verizon customers often cost well more than twice that amount.To be clear, KrebsOnSecurity is not aware of specific SIM-swapping incidents tied to any of these breach claims. However, the vast majority of advertisements for SIM-swapping claims against T-Mobile tracked in this story had two things in common that set them apart from random SIM-swapping ads on Telegram.First, they included an offer to use a mutually trusted “middleman” or escrow provider for the transaction (to protect either party from getting scammed). More importantly, the cybercriminal handles that were posting ads for SIM-swapping opportunities from these groups generally did so on a daily or near-daily basis — often teasing their upcoming swap events in the hours before posting a “Tmo up!” message announcement.In other words, if the crooks offering these SIM-swapping services were ripping off their customers or claiming to have access that they didn’t, this would be almost immediately obvious from the responses of the more seasoned and serious cybercriminals in the same chat channel.One of the groups that reliably posted “Tmo up!” messages to announce SIM-swap availability against T-Mobile customers also reliably posted “Tmo down!” follow-up messages announcing exactly when their claimed access to T-Mobile employee tools was discovered and revoked by the mobile giant.A review of the timestamps associated with this group’s incessant “Tmo up” and “Tmo down” posts indicates that while their claimed access to employee tools usually lasted less than an hour, in some cases that access apparently went undiscovered for several hours or even days.How could these SIM-swapping groups be gaining access to T-Mobile’s network as frequently as they claim? Peppered throughout the daily chit-chat on their Telegram channels are solicitations for people urgently needed to serve as “callers,” or those who can be hired to social engineer employees over the phone into navigating to a phishing website and entering their employee credentials.Nixon argues that many people in the security community tend to discount the threat from voice phishing attacks as somehow “low tech” and “low probability” threats.“I see it as not low-tech at all, because there are a lot of moving parts to phishing these days,” Nixon said. “You have the caller who has the employee on the line, and the person operating the phish kit who needs to spin it up and down fast enough so that it doesn’t get flagged by security companies. Then they have to get the employee on that phishing site and steal their credentials.”In addition, she said, often there will be yet another co-conspirator whose job it is to use the stolen credentials and log into employee tools. That person may also need to figure out how to make their device pass “posture checks,” a form of device authentication that some companies use to verify that each login is coming only from employer-issued phones or laptops.For aspiring criminals with little experience in scam calling, there are plenty of sample call transcripts available on these Telegram chat channels that walk one through how to impersonate an IT technician at the targeted company — and how to respond to pushback or skepticism from the employee. Here’s a snippet from one such tutorial that appeared recently in one of the SIM-swapping channels:“Hello this is James calling from Metro IT department, how’s your day today?”(yea im doing good, how r u)i’m doing great, thank you for askingi’m calling in regards to a ticket we got last week from you guys, saying you guys were having issues with the network connectivity which also interfered with [Microsoft] Edge, not letting you sign in or disconnecting you randomly. We haven’t received any updates to this ticket ever since it was created so that’s why I’m calling in just to see if there’s still an issue or not….”The TMO UP data referenced above, combined with comments from the SIM-swappers themselves, indicate that while many of their claimed accesses to T-Mobile tools in the middle of 2022 lasted hours on end, both the frequency and duration of these events began to steadily decrease as the year wore on.T-Mobile declined to discuss what it may have done to combat these apparent intrusions last year. However, one of the groups began to complain loudly in late October 2022 that T-Mobile must have been doing something that was causing their phished access to employee tools to die very soon after they obtained it.One group even remarked that they suspected T-Mobile’s security team had begun monitoring their chats.Indeed, the timestamps associated with one group’s TMO UP/TMO DOWN notices show that their claimed access was often limited to less than 15 minutes throughout November and December of 2022.Whatever the reason, the calendar graphic above clearly shows that the frequency of claimed access to T-Mobile decreased significantly across all three SIM-swapping groups in the waning weeks of 2022.T-Mobile US reported revenues of nearly $80 billion last year. It currently employs more than 71,000 people in the United States, any one of whom can be a target for these phishers.A U2F device made by Yubikey.“These breaches should not happen,” Weaver said. “Because T-Mobile should have long ago issued all employees security keys and switched to security keys for the second factor. And because security keys provably block this style of attack.”The most commonly used security keys are inexpensive USB-based devices. A security key implements a form of multi-factor authentication known as Universal 2nd Factor (U2F), which allows the user to complete the login process simply by inserting the USB key and pressing a button on the device. The key works without the need for any special software drivers.The allure of U2F devices for multi-factor authentication is that even if an employee who has enrolled a security key for authentication tries to log in at an impostor site, the company’s systems simply refuse to request the security key if the user isn’t on their employer’s legitimate website, and the login attempt fails. Thus, the second factor cannot be phished, either over the phone or Internet.Nixon said one confounding aspect of SIM-swapping is that these criminal groups tend to recruit teenagers to do their dirty work.“A huge reason this problem has been allowed to spiral out of control is because children play such a prominent role in this form of breach,” Nixon said.Nixon said SIM-swapping groups often advertise low-level jobs on places like Roblox and Minecraft, online games that are extremely popular with young adolescent males.“Statistically speaking, that kind of recruiting is going to produce a lot of people who are underage,” she said. “They recruit children because they’re naive, you can get more out of them, and they have legal protections that other people over 18 don’t have.”For example, she said, even when underage SIM-swappers are arrested, the offenders tend to go right back to committing the same crimes as soon as they’re released.In the shadow of such mega-breaches, any damage from the continuous attacks by these SIM-swapping groups can seem insignificant by comparison. But Nixon says it’s a mistake to dismiss SIM-swapping as a low volume problem.“Logistically, you may only be able to get a few dozen or a hundred SIM-swaps in a day, but you can pick any customer you want across their entire customer base,” she said. “Just because a targeted account takeover is low volume doesn’t mean it’s low risk. These guys have crews that go and identify people who are high net worth individuals and who have a lot to lose.”Nixon said another aspect of SIM-swapping that causes cybersecurity defenders to dismiss the threat from these groups is the perception that they are full of low-skilled “script kiddies,” a derisive term used to describe novice hackers who rely mainly on point-and-click hacking tools.“They underestimate these actors and say this person isn’t technically sophisticated,” she said. “But if you’re rolling around in millions worth of stolen crypto currency, you can buy that sophistication. I know for a fact some of these compromises were at the hands of these ‘script kiddies,’ but they’re not ripping off other people’s scripts so much as hiring people to make scripts for them. And they don’t care what gets the job done, as long as they get to steal the money.”\r\n         This entry was posted on Tuesday 28th of February 2023 11:14 AM \r\n         I’ve been a T-Mobile customer for years.  It took me about 10 minutes way back when to figure out they were under the magic spell of social engineers.  Germans who know about Max Planck know he played a dangerous game and paid dearly, nothing new there.  I was eventually “forced” into a Smart Phone by the demise of 3G but get weekly nags to fully install my OS.  That’s not what Max Planck would do.Sounds more like your phone needs security updates, which otherwise leaves your device vulnerable to various malware & hacks“A new scientific truth does not triumph by convincing its opponents and making them see the light, but rather because its opponents eventually die and a new generation grows up that is familiar with it” – Max PlanckBrian, didn’t you say once that there is somewhere we can register to essentially freeze our SIM card, so to speak, like you put a freeze on your credit reports with the big 3 (4) credit bureaus.  I vaguely remember the report and you saying that putting a freeze on your credit reports doesn’t likewise protect the SIM card/mobile number, so you had to put a separate freeze with a different company.  What is that company, and do all mobile carriers honor that freeze?Or am I totally misremembering that article and there’s no comparable freeze mechanism to prevent SIM swaps?It’s called a NOPORT.  You must call T-Mobile and ask them to enable NO PORT on your number.  If the agent doesn’t know what you’re talking about, end the call and call again to get an agent that does.Verizon calls it Number Lock, you can enable it in the phone app and I believe on the website.  You don’t need to talk to a person to turn it on.No need to call in, you can do this from t-mobile account settings > privacy > sim lock.Can you please give more detail on how to do this? I can’t find it in the settings.Select Account then Privacy & Notifications, then SIM Protection, then enable it.Just checked my T-Mo accounts & discovered that the SIM protection feature had somehow been turned OFF, who knows when, but definitely by T-Mo. I know that I turned it on as soon as that option was available to customers so beware & double check if you have previously used this security feature.Very important not to confuse with another setting in the general phone settings called “SIM card lock”. This particular setting does NOT prevent a SIM swap.@Brian\n> employee-issued phones or laptopsThat should be *employer-issued*You can and probably should take advantage of whatever protections are offered by the phone companies. But it’s important to point out that if an employee can put these restrictions in place, a phished (or collusive) employee can undo that in a second.You  forgot to mention   another  vector   for  SIM swapping,   rouge  cell service  employees  trying to make a  quick buck by trying  to take  advantage   of the company they   work for . Another  real good read  !Thank you for the NOPORT term. good to know the specific ask. Hope this would prevent t-mobile insiders from sim-swapping but given t-mobiles security stance, I have no such hope and left t-mobile in disgust some time ago since they really don’t care about breaches or such, 80 BILLION revenue allows for many settlements and still walk away fat. Brian has done a great job illustrating the ramification of sim swaps. ouch!T-Mobile account login has a serious flaw when it comes to MFA. You can set up your account to use TOTP.  But you are still presented with the option to use SMS for 2FA at every login. There is no way to disable the SMS option.This is a shortcoming of a lot of 2FA systems.  Seemingly they provide little protection because you can’t limit it to just one system, and eventually it will even lead into security questions to allow a log in.Not everywhere.\nAzure AD does not have fallback.\nFallbacks has to be designed into the solutionUnfortunately I just discovered this. I thought I was helping to secure my T-Mobile account by implementing Google Authenticator. Then I discover that there’s no way to disable the SMS option. What the heck! Isn’t there a single Cyber Security engineer at T-Mobile who says “Wait, this is moronic.”This is exactly what you get with dumbo CISOs with MBA and other unrelated disciplines.\nLike going to have a surgery with an attorney.\nMost US companies are like this. It’s not going to change because there is no skilled labor with needed skills in Cybersecurity in the US.honestly at this point they should just change their name to t-morrowwellgethackedagainU2F can provide a fairly high level of security to the authentication process. But proper implementation is critical. Implementation of some backup factor is a very good idea, but frequently leads to the weak link. As “vaadu” noted in their comment above, T-mobile has implemented SMS as a backup to TOTP and has introduced a weaker link though SMS. That essentially makes TOTP of no use since the weaker SMS is always available. They could do the same to a U2F implementation.I have a primary and backup U2F keys which are both USB and NFC interfaced. There are precious few location where I can use U2F though. I use gmail, google voice, and have a family domain with google workspace where I use them. AT&T wireless uses SMS, so no go there. Outlook.com and Yahoo.com and a handful of others. Curiously, few financial institutions have implemented U2F, even worse most use SMS for 2FA.Does TMO not use MFA and phishing just needs a username and password to get into their internal systems? Or how was MFA phished too?“to social engineer employees over the phone into navigating to a phishing website and entering their employee credentials.”It’s time to complain to your bank about not supporting FIDO2 (or at least TOTP).Is there a list of banks that do?  Complain with your feet/wallet.\nOr complain to your bank, that could work.  In some definition of work.\n“Oh yes sir I agree sir, we’ll get right on that sir.  Is there anything else?\nHave you seen our new rewards gimmick account?  Oh you have?”Brian,How does the new ESIM equate into this?  Is it more likely to be breached or less likely?Depends. All you need is QR code. 😉 Often no need to leave your house, no need to call anywhere. in Europe all you need is the victim’s account. They store passwords in plaintext. It’s bad bad.I just now called Tmo 611 tech Patricia and found you need both NOPORT and SimProtect.  NOPORT keeps anyone from porting your number to a carrier outside of TMo, but you also need SimProtect which keeps anyone from changing your Sim card serial number to a different Sim card serial to be used on a new phone remotely, which is how simswap scammers work.  SimProtect at TMo requires in-person visit and ID presentation at TMo to get your phone number assigned to a new Sim card serial  number provided there.please delete my last name from my previous post I just madeThanks for that my dear friends!I just now called Tmo 611 tech Patricia and found you need both NOPORT and SimProtect. NOPORT keeps anyone from porting your number to a carrier outside of TMo, but you also need SimProtect which keeps anyone from changing your Sim card serial number to a different Sim card serial to be used on a new phone remotely, which is how simswap scammers work.Can somebody tell me if in europe sim swapping is going on also or is this a specific US problem?So T-Mobile is dropping auto-pay by credit card as of May 2023. To continue receiving the auto-pay discount on billing you have to replace the credit card with a debit card or a bank account.How safe are these options in the next T-Mobile security breach?Thank you for the NOPORT term. good to know the specific ask. Hope this would prevent t-mobile insiders from sim-swapping but given t-mobiles security stance, I have no such hope and left t-mobile in disgust some time ago since they really don’t care about breaches or such, 80 BILLION revenue allows for many settlements and still walk away fat. Brian has done a great job illustrating the ramification of sim swaps. ouch!It is no fault, really, to know important information from selected targeted devices, attaining all variety communication access. Call logs, messages of both texts and social applications textlings, this is a possible method to providing essential answers for questions and doubts of spouse, tracking child safely,  what so sever, there is many much more to view and control.Comments are closed.Mailing ListSearch KrebsOnSecurityRecent PostsStory CategoriesWhy So Many Top Hackers Hail from Russia"
   },
   {
      "time": "2023-02-28",
      "title": "'New Class of Bugs' in Apple Devices Opens the Door to Complete Takeover",
      "text": " A new class of bugs in Apple's iOS, iPadOS, and macOS has been uncovered, researchers say, that could allow an attacker to escalate privileges and make off with everything on a targeted device.Were an attacker to exploit these vulnerabilities, they could potentially gain access to a victim's photos, messages, call history, location data, and all kinds of other sensitive data, even the device's microphone and camera. They could also use their access to wipe a device altogether.In other words, through NSPredicate, \"the ability to dynamically generate and run code on iOS had been an official feature this whole time,\" he explained.In one proof-of-concept, Trellix found that an attacker could use NSPredicate to execute code in \"coreduetd\" or \"contextstored,\" root-level processes that allows entryway into parts of the machine such as the calendar, address book, and photos.\"Individuals should continue to stay vigilant against social engineering and phishing attacks,\" McKee says, \"while also ensuring they only install applications from a known trusted source. Businesses are encouraged to ensure they are doing the proper product security testing on any third-party applications they use in their infrastructure and are monitoring device logs for any suspicious or unusual activity.\"If they haven't already, Apple users should update their system software, as the newest versions include fixes for the vulnerabilities so described. That doesn't mean, however, that vulnerabilities of this kind won't pop up again.\"Elimination of a bug class is often extremely difficult to accomplish as it often requires not only code changes but education of developers,\" explains Doug McKee, director of vulnerability research for Trellix. \"Like all bug classes, unless a mitigation is put into place which would eliminate the entire class, it would be expected that more similar vulnerabilities would be found in the future.\"The findings are another puncture wound in the perception that Apple devices are somehow inherently more secure than PCs or Android devices.The devices do this with code signing. Functioning somewhat like a bouncer at a club, iPhone only allows an application to run if it has been cryptographically signed by a trusted developer. If any entity — a developer, hacker, etc. — wishes to run code on the machine, but they're not \"on the list,\" they'll be shut out. And \"as macOS has continually adopted more features of iOS,\" Emmitt noted, \"it has also come to enforce code signing more strictly.\"As a result of its strict policies, Apple has earned a reputation in some corners for being particularly cyber secure. Yet that extra stringency can only extend so far.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-28",
      "title": "As MedusaLocker ransomware targets RDP, HHS urges brute force defense | SC Media",
      "text": "  (Image credit: Vladimir Ishmiakov via Getty Images)Backed by Russia, the MedusaLocker ransomware group has bolstered its arsenal with brute force tactics that exploit weak access controls on remote desktop protocol services to force their way into a network, according to the U.S. Department of Health and Human Services.The latest alert published by HHS' Cybersecurity Coordination Center (HC3) urges healthcare entities to “holistically require” multiple levels of access and authentication controls to better defend against a MedusaLocker campaign that is currently using known software vulnerabilities to target unsecured RDP servers and desktops.The warning adds to a host of ransomware-related alerts directed at healthcare entities over growing concerns about the current threat landscape. The threat from “lesser-known but potent ransomware variants” like MedusaLocker, should “be a source of concern and attention by healthcare security decision makers.”MedusaLocker has been active for over three years, exploiting networks across a range of sectors. However, healthcare has remained its primary target, largely driven by the industry's COVID-19 response and that seek to exploit the disorder and confusion of the pandemic for profit. The group operates as a Ransomware-as-a-Service (RaaS) model, sharing its variant with other threat actors for a share of the ransom payment. As of June 2022, affiliates receive about 55% to 60% of ransoms and the developer takes the rest.Its early tactics relied heavily on phishing and email spam campaigns, but lately have shifted in preference to exploiting RDP flaws over the last year. However, the group continues to leverage phishing attacks with malware-laced attachments to gain a foothold onto the network.Known access techniques also include brute-force password guessing against RDP services and exploiting vulnerable RDP services. The alert warns that “if the guessed password belongs to the domain administrator, they can execute commands with elevated privileges.”Upon exploitation, MedusaLocker spreads across the network from a batch file that deploys a PowerShell script, before disabling security and forensic software and restarting the infected device to evade detection. The ransomware payload is initiated after restart, encrypting files with an AES-256 encryption algorithm.The actors persist on the network by “deleting local backups and disabling start-up recovery to ultimately place a ransom note into every folder containing a file with compromised host’s encrypted data,” according to HC3.Researchers have also observed MedusaLocker creating a scheduled task called \"svhost\" that runs the ransomware automatically every 15 minutes.The threat analysis details each tactic in depth for security leaders to review and make recommended changes. Specifically, RDP should never be open to the internet and IT leaders should ensure the default port of all RDP instances have been changed from 3389 to another.Further, entities should use multiple levels of access and authentication controls, monitor RDP utilization and flag first-time-seen and anomalous behavior with a keen focus on failed login attempts. Account lockout policies can be crucial to defending against brute force attacks, while prioritizing patching of known RDP vulnerabilities.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.After admitting responsibility for compromising Sony, a Colonial Pipeline supplier, and a Hawai'i government site, the RansomedVC group has claimed that it will be ending operations due to the arrests of six of its affiliates, reports The Record, a news site by cybersecurity firm Recorded Future.U.S. advanced electronic components manufacturer Kyocera AVX Components Corporation has disclosed that 39,111 individuals around the world had their data compromised following a ransomware attack earlier this year, which has been claimed by the LockBit ransomware operation, reports BleepingComputer.Attack on the U.S. subsidiary of the Industrial & Commercial Bank of China disrupted Treasury trading in New York earlier this week.  Tue Jun 25Thu Dec 14Thu Nov 16   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-28",
      "title": "Cyberattack on Boston Union Results in $6.4M Loss - SecurityWeek",
      "text": " Hi, what are you looking for?A cyberattack on the Boston-based Pipefitters Local 537 union’s health fund resulted in the loss of $6.4 million.ByFlipboardRedditWhatsappWhatsappEmailA cyberattack on a Boston-based labor union’s health fund resulted in the loss of $6.4 million, but it does not appear that the personal information of members was stolen or compromised, union officials said.\nFederal and local law enforcement agencies were notified of the attack at Pipefitters Local 537 that was discovered Feb. 7 and the union retained a cyber security forensic investigator, union business manager/financial secretary-treasurer Daniel O’Brien said in a message to members.\n“This is very unfortunate news; but please be assured that nothing about your benefits with Local 537 has changed and our health fund remains well-funded,” O’Brien wrote.\nLaw enforcement is “optimistic” that they will be able to return the vast majority of the stolen funds, he said. The fund is also insured.\nThe FBI in Boston declined to comment.\nO’Brien described the breach as a social engineering cyberattack and said private investigators and a cybersecurity company have completed a review of the fund office’s email server and concluded that there was no breach or hack.\nEmployees are receiving advanced cybersecurity training and changes have been made to the health fund’s wiring policy.\n“In closing, it has been reiterated throughout the investigation to remind our membership to be mindful of what we put out online and on social media, as these are easy places for cybercriminals to gain information and locate potential targets,” O’Brien said.Advertisement. Scroll to continue reading.\n\n\nThe union has about 3,000 members and represents pipefitters, welders and HVAC-refrigeration workers.\nGovernment agencies, businesses, health care organizations, and school systems around the world have been the targets of cyberattacks recently. In September, the Justice Department charged three Iranian citizens with ransomware attacks that targeted power companies, local governments and small businesses and nonprofits.\nFederal and local law enforcement agencies were notified of the attack at Pipefitters Local 537 that was discovered Feb. 7 and the union retained a cyber security forensic investigator, union business manager/financial secretary-treasurer Daniel O’Brien said in a message to members.\n“This is very unfortunate news; but please be assured that nothing about your benefits with Local 537 has changed and our health fund remains well-funded,” O’Brien wrote.\nLaw enforcement is “optimistic” that they will be able to return the vast majority of the stolen funds, he said. The fund is also insured.\nThe FBI in Boston declined to comment.\nO’Brien described the breach as a social engineering cyberattack and said private investigators and a cybersecurity company have completed a review of the fund office’s email server and concluded that there was no breach or hack.\nEmployees are receiving advanced cybersecurity training and changes have been made to the health fund’s wiring policy.\n“In closing, it has been reiterated throughout the investigation to remind our membership to be mindful of what we put out online and on social media, as these are easy places for cybercriminals to gain information and locate potential targets,” O’Brien said.Advertisement. Scroll to continue reading.\n\n\nThe union has about 3,000 members and represents pipefitters, welders and HVAC-refrigeration workers.\nGovernment agencies, businesses, health care organizations, and school systems around the world have been the targets of cyberattacks recently. In September, the Justice Department charged three Iranian citizens with ransomware attacks that targeted power companies, local governments and small businesses and nonprofits.\n“This is very unfortunate news; but please be assured that nothing about your benefits with Local 537 has changed and our health fund remains well-funded,” O’Brien wrote.\nLaw enforcement is “optimistic” that they will be able to return the vast majority of the stolen funds, he said. The fund is also insured.\nThe FBI in Boston declined to comment.\nO’Brien described the breach as a social engineering cyberattack and said private investigators and a cybersecurity company have completed a review of the fund office’s email server and concluded that there was no breach or hack.\nEmployees are receiving advanced cybersecurity training and changes have been made to the health fund’s wiring policy.\n“In closing, it has been reiterated throughout the investigation to remind our membership to be mindful of what we put out online and on social media, as these are easy places for cybercriminals to gain information and locate potential targets,” O’Brien said.Advertisement. Scroll to continue reading.\n\n\nThe union has about 3,000 members and represents pipefitters, welders and HVAC-refrigeration workers.\nGovernment agencies, businesses, health care organizations, and school systems around the world have been the targets of cyberattacks recently. In September, the Justice Department charged three Iranian citizens with ransomware attacks that targeted power companies, local governments and small businesses and nonprofits.\nLaw enforcement is “optimistic” that they will be able to return the vast majority of the stolen funds, he said. The fund is also insured.\nThe FBI in Boston declined to comment.\nO’Brien described the breach as a social engineering cyberattack and said private investigators and a cybersecurity company have completed a review of the fund office’s email server and concluded that there was no breach or hack.\nEmployees are receiving advanced cybersecurity training and changes have been made to the health fund’s wiring policy.\n“In closing, it has been reiterated throughout the investigation to remind our membership to be mindful of what we put out online and on social media, as these are easy places for cybercriminals to gain information and locate potential targets,” O’Brien said.Advertisement. Scroll to continue reading.\n\n\nThe union has about 3,000 members and represents pipefitters, welders and HVAC-refrigeration workers.\nGovernment agencies, businesses, health care organizations, and school systems around the world have been the targets of cyberattacks recently. In September, the Justice Department charged three Iranian citizens with ransomware attacks that targeted power companies, local governments and small businesses and nonprofits.\nThe FBI in Boston declined to comment.\nO’Brien described the breach as a social engineering cyberattack and said private investigators and a cybersecurity company have completed a review of the fund office’s email server and concluded that there was no breach or hack.\nEmployees are receiving advanced cybersecurity training and changes have been made to the health fund’s wiring policy.\n“In closing, it has been reiterated throughout the investigation to remind our membership to be mindful of what we put out online and on social media, as these are easy places for cybercriminals to gain information and locate potential targets,” O’Brien said.Advertisement. Scroll to continue reading.\n\n\nThe union has about 3,000 members and represents pipefitters, welders and HVAC-refrigeration workers.\nGovernment agencies, businesses, health care organizations, and school systems around the world have been the targets of cyberattacks recently. In September, the Justice Department charged three Iranian citizens with ransomware attacks that targeted power companies, local governments and small businesses and nonprofits.\nO’Brien described the breach as a social engineering cyberattack and said private investigators and a cybersecurity company have completed a review of the fund office’s email server and concluded that there was no breach or hack.\nEmployees are receiving advanced cybersecurity training and changes have been made to the health fund’s wiring policy.\n“In closing, it has been reiterated throughout the investigation to remind our membership to be mindful of what we put out online and on social media, as these are easy places for cybercriminals to gain information and locate potential targets,” O’Brien said.Advertisement. Scroll to continue reading.\n\n\nThe union has about 3,000 members and represents pipefitters, welders and HVAC-refrigeration workers.\nGovernment agencies, businesses, health care organizations, and school systems around the world have been the targets of cyberattacks recently. In September, the Justice Department charged three Iranian citizens with ransomware attacks that targeted power companies, local governments and small businesses and nonprofits.\nEmployees are receiving advanced cybersecurity training and changes have been made to the health fund’s wiring policy.\n“In closing, it has been reiterated throughout the investigation to remind our membership to be mindful of what we put out online and on social media, as these are easy places for cybercriminals to gain information and locate potential targets,” O’Brien said.Advertisement. Scroll to continue reading.\n\n\nThe union has about 3,000 members and represents pipefitters, welders and HVAC-refrigeration workers.\nGovernment agencies, businesses, health care organizations, and school systems around the world have been the targets of cyberattacks recently. In September, the Justice Department charged three Iranian citizens with ransomware attacks that targeted power companies, local governments and small businesses and nonprofits.\n“In closing, it has been reiterated throughout the investigation to remind our membership to be mindful of what we put out online and on social media, as these are easy places for cybercriminals to gain information and locate potential targets,” O’Brien said.Advertisement. Scroll to continue reading.\n\n\nThe union has about 3,000 members and represents pipefitters, welders and HVAC-refrigeration workers.\nGovernment agencies, businesses, health care organizations, and school systems around the world have been the targets of cyberattacks recently. In September, the Justice Department charged three Iranian citizens with ransomware attacks that targeted power companies, local governments and small businesses and nonprofits.\nThe union has about 3,000 members and represents pipefitters, welders and HVAC-refrigeration workers.\nGovernment agencies, businesses, health care organizations, and school systems around the world have been the targets of cyberattacks recently. In September, the Justice Department charged three Iranian citizens with ransomware attacks that targeted power companies, local governments and small businesses and nonprofits.\nGovernment agencies, businesses, health care organizations, and school systems around the world have been the targets of cyberattacks recently. In September, the Justice Department charged three Iranian citizens with ransomware attacks that targeted power companies, local governments and small businesses and nonprofits.\nSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2023-02-28",
      "title": "New Exfiltrator-22 post-exploitation kit linked to LockBit ransomware",
      "text": " Threat actors are promoting a new 'Exfiltrator-22' post-exploitation framework designed to spread ransomware in corporate networks while evading detection.Threat analysts at CYFIRMA claim that this new framework was created by former Lockbit 3.0 affiliates who are experts in anti-analysis and defense evasion, offering a robust solution in exchange for a subscription fee.The prices for Exfiltrator-22 range between $1,000 per month and $5,000 for lifetime access, offering continuous updates and support.Buyers of the framework are given an admin panel hosted on a bulletproof VPS (virtual private server) from where they can control the framework's malware and issue commands to compromised systems.The first version of the Exfiltrator-22 (EX-22) appeared in the wild on November 27, 2022, and roughly ten days later, its authors set up a Telegram channel to advertise the framework to other cybercriminals.By the end of the year, the threat actors announced new features that helped conceal traffic on compromised devices, indicating that the framework was under active development.In January 2023, EX-22 was deemed 87% ready by its authors, and subscription prices were announced, inviting interested users to purchase access to the tool.On February 10, 2023, the threat actors posted two demonstration videos on YouTube to showcase EX-22’s lateral movement and ransomware-spreading capabilities.EX-22 includes features commonly found in other post-exploitation toolkits but also additional features geared towards deploying ransomware and data theft.The highlight features included in the framework are:The above commands are sent to compromised devices through the  Windows 'EX22 Command & Control' console program.These commands' outputs are then returned to the command and control server and displayed directly in the console application, as shown below.Through the service's web panel, cybercriminals can also set scheduled tasks, update agents to a new version, change a campaign's configuration, or create new campaigns.The CYFIRMA team has found evidence that LockBit 3.0 affiliates or members of the ransomware operation's development team are behind EX-22.First, they noticed that the framework uses the same \"domain fronting\" technique associated with the LockBit and the TOR obfuscation plugin Meek, which helps hide malicious traffic inside legitimate HTTPS connections to reputable platforms.Unfortunately, Exfiltrator-22 appears to have been created by knowledgeable malware authors who possess the skills to develop an evasive framework.Hence, it is expected to generate much interest in the cybercrime community despite its high price, naturally resulting in further code development and feature improvements."
   },
   {
      "time": "2023-02-28",
      "title": "Critical flaws in WordPress Houzez theme exploited to hijack websites",
      "text": " Hackers are actively exploiting two critical-severity vulnerabilities in the Houzez theme and plugin for WordPress, two premium add-ons used primarily in real estate websites.The Houzez theme is a premium plugin that costs $69, offering easy listing management and a smooth customer experience. The vendor's site claims it is serving over 35,000 customers in the real estate industry.The two vulnerabilities were discovered by Patchstack's threat researcher Dave Jong and reported to the theme's vendor, 'ThemeForest,' with one flaw fixed in version 2.6.4 (August 2022) and the other in version 2.7.2 (November 2022).However, a new Patchstack report warns that some websites have not applied the security update, and threat actors actively exploit these older flaws in ongoing attacks.It's a security misconfiguration impacting the Houzez Theme plugin version 2.7.1 and older and can be exploited remotely without requiring authentication to perform privilege escalation.The version that fixes the problem is Houzez theme 2.7.2 or later.It impacts versions 2.6.3 and older, allowing unauthenticated attackers to perform privilege escalation on sites using the plugin.The version that addresses the security threat is Houzez Login Register 2.6.4 or later.Dave Jong told BleepingComputer that threat actors exploit these vulnerabilities by sending a request to the endpoint that listens for account creation requests.Due to a validation check bug on the server side, the request can be crafted to create an administrator user on the site, allowing the attackers to take complete control over the WordPress site.In the attacks observed by Patchstack, the threat actors uploaded a backdoor capable of executing commands, injecting ads on the website, or redirecting traffic to other malicious sites.\"Since the desired user role can be provided by the user, but is not validated properly on the server side, it can be set to the \"administrator\" value in order to create a new account that has the administrator user role,\" PatchStack researcher D. Jong told BleepingComputer.\"After this, they could do anything with the site they want though what we usually see is that a malicious plugin will be uploaded which contains a backdoor. Unfortunately, Patchstack reports that the flaws are being abused when writing this, so applying the available patches should be treated with the utmost priority by website owners and administrators."
   },
   {
      "time": "2023-02-28",
      "title": "Ransomware Attack Compromises Indigo Employees' Data - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2023-02-28",
      "title": "Critical vulnerabilities hidden in hundreds of popular open source containers | SC Media",
      "text": "  Researchers found numerous critical- and high-severity vulnerabilities hidden in hundreds of popular container images, downloaded billions of times collectively and not detected by most vulnerability scanners and software composition analysis (SCA) tools.  Most standard vulnerability scanners and SCA tools heavily rely on package managers to know which packages exist and performing analysis accordingly. However, Docker containers are one of the places where software installation bypasses package managers, making it difficult for many scanners and tools to detect vulnerable packages, said Yotam Perkal, director of vulnerability research at Rezilion.Perkal did not list all the specific tools that fail at this task, but told SC Media that almost every leading commercial vulnerability scanner and SCA tool — including DockerHub's own vulnerability scans — deals with the same challenge.   Docker spokesperson David Oro told SC Media that the company is aware of the risk and continues working to address it.  “Malicious actors taking advantage of public resources for the developer community is a big problem that software developers need to be aware of. It happens in GitHub repositories, npm packages, and even in Chrome extensions. Docker Hub, an industry standard of container images that gets billions of pulls each week, is no exception,” said Oro in an email. “We hate seeing bad actors taking advantage of it and have been working to address it directly.” Although the research is focused on Docker containers, Perkal highlighted that the hidden vulnerability phenomenon can apply to any type of compute with the deployment method bypassing the relevant package manager.  \"As long as vulnerability scanners and SCA tools fail to accommodate these situations, any container image that deploys packages or executables in this manner may eventually contain hidden vulnerabilities if any of these components become vulnerable,\" Perkal said.  To mitigate the security risk, Perkal said developers should be aware of the issue and try not to circumvent the relevant package manager when installing the required software components.  He also urged security vendors and open source projects to invest time and resources to close the detection gaps and minimize the risk, saying such gaps “exist across all examined tools.” Menghan Xiao is a cybersecurity reporter at SC Media, covering software supply chain security, workforce/business, and threat intelligence. Before SC Media, Xiao studied journalism at Northwestern University, where she received a merit-based scholarship from Medill and Jack Modzelewski Scholarship Fund.In a bid to strengthen authentication and security measures against relay attacks and unauthorized network access, Microsoft has confirmed that it will be using Kerberos in place of the NT LAN Manager in Windows 11, The Hacker News reports.Newly developed cybersecurity guidelines from the U.S. Department of Treasury, Cybersecurity and Infrastructure Security Agency, National Security Agency, and the FBI tackling open source software usage in industrial control systems and operational technology environments have recommended not only up-to-date patches and security updates for all OT and IT systems but also the application of \"secure-by-design\" and \"secure-by-default\" philosophies in software development, reports SecurityWeek.Here’s a quick look at the pros and cons of ChatGPT and how developers can get started.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-28",
      "title": "RIG Exploit Kit still infects enterprise users via Internet Explorer",
      "text": " The RIG Exploit Kit is undergoing its most successful period, attempting roughly 2,000 intrusions daily and succeeding in about 30% of cases, the highest ratio in the service's long operational history.By exploiting relatively old Internet Explorer vulnerabilities, RIG EK has been seen distributing various malware families, including Dridex, SmokeLoader, and RaccoonStealer.According to a detailed report by Prodaft, whose researchers gained access to the service's backend web panel, the exploit kit remains a significant large-scale threat to individuals and organizations.RIG EK was first released eight years ago, in 2014, and promoted as an \"exploit-as-a-service\" rented to other malware operators to spread their malware on vulnerable devices.The RIG exploit kit is a set of malicious JavaScript scripts embedded in compromised or malicious websites by the threat actors, which are then promoted through malvertising.When a user visits these sites, the malicious scripts will be executed and attempt to exploit various vulnerabilities in the browser to install malware on the device automatically.In 2015, the kit's authors released the second major version of the kit, laying the ground for more extensive and successful operations.In 2021, RIG's owner announced the service would shut down; however, RIG 2.0 returned in 2022 with two new exploits (CVE-2020-0674 and CVE-2021-26411 in Internet Explorer), reaching an all-time high successful breach ratio.While many of the exploits targeted by RIG EK are for Internet Explorer, which Microsoft Edge has long replaced, the browser is still used by millions of Enterprise devices, which are a primary target.Prodaft says RIG EK currently targets 207 countries, launching an average of 2,000 attacks per day and having a current success rate of 30%. This rate was 22% before the exploit kit resurfaced with two new exploits, says Prodaft.As the heatmap published in the report shows, the most impacted countries are Germany, Italy, France, Russia, Turkey, Saudi Arabia, Egypt, Algeria, Mexico, and Brazil. However, there are victims worldwide.The highest success rate is brought by CVE-2021-26411, achieving a 45% successful exploitation ratio, followed by CVE-2016-0189 with 29% and CVE-2019-0752 with 10%.The CVE-2016-0189 and CVE-2019-0752 vulnerabilities are also in Internet Explorer, allowing remote code execution in the browser.Currently, RIG EK primarily pushes information-stealing and initial access malware, with Dridex being the most common (34%), followed by SmokeLoader (26%), RaccoonStealer (20%), Zloader (2.5%), Truebot (1.8%), and IcedID (1.4%).Of course, the types of malware spread by RIG EK constantly change depending on which cybercriminals choose to use the service.Prodaft has previously also observed the distribution of Redline, RecordBreaker, PureCrypter, Gozi, Royal Ransomware, and UrSnif.Distributing the Dridex banking trojan is particularly interesting because there are signs that the RIG operators have taken action to ensure its distribution is problem-free.\"Considering all these facts, we assess with high confidence that the developer of Dridex malware has a close relationship with the RIG's admins.\"The RIG EK remains a significant threat to individuals and organizations using outdated software, threatening to infect their systems with stealthy information stealers that can siphon highly-sensitive data."
   },
   {
      "time": "2023-02-28",
      "title": "PlugX Trojan Disguised as Legitimate Windows Debugger Tool in Latest Attacks",
      "text": " The PlugX remote access trojan has been observed masquerading as an open source Windows debugger tool called x64dbg in an attempt to circumvent security protections and gain control of a target system.\"Being a legitimate application, x32dbg.exe's valid digital signature can confuse some security tools, enabling threat actors to fly under the radar, maintain persistence, escalate privileges, and bypass file execution restrictions,\" the researchers said.Persistence is achieved via Windows Registry modifications and the creation of scheduled tasks to ensure continued access even after system restarts.Trend Micro's analysis of the attack chain also revealed the use of x32dbg.exe to deploy a backdoor, a UDP shell client that collects system information and awaits additional instructions from a remote server.\"Despite advances in security technology, attackers continue to use [DLL side-loading] since it exploits a fundamental trust in legitimate applications,\" the researchers said.\"This technique will remain viable for attackers to deliver malware and gain access to sensitive information as long as systems and applications continue to trust and load dynamic libraries.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-02-28",
      "title": "Danish hospitals hit by cyberattack from ‘Anonymous Sudan’",
      "text": " The websites of nine hospitals in Denmark went offline on Sunday evening following distributed-denial-of-service (DDoS) attacks from a group calling itself Anonymous Sudan.In its threat intelligence report, Truesec noted the “Anonymous Sudan” account on Telegram has its user location listed as Russia. Unusually for a hacktivist group, the group’s DDoS traffic was not generated by an illegal botnet but from “a cluster of 61 paid servers hosted at IBM/Softlayer in Germany,” said the report, with the traffic “routed through open proxies to disguise the real origin of the attacks.”While the use of paid infrastructure suggests the group receives some kind of financing, it is not evidence that the attacks are government-sponsored. However, Truesec said it reveals “that the operation has been carefully organized by someone willing to pay for it, not a spontaneous action by activists.”The servers were taken down following the Truesec report, prompting the Anonymous Sudan account on Telegram to rail against the company’s founder Marcus Murray as a “Swedish idiot.” The group later posted that it had started using botnets and would begin to recommend them to its followers.While the grammatically incorrect use of the phrase \"you are idiot\" might suggest the author is not a native English speaker, neither Arabic nor Russian use the indefinite article “an,” so the error does not contribute to the assessment that the group is based in Russia.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-28",
      "title": "Chromium bug allowed SameSite cookie bypass on Android devices | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondProtections against cross-site request forgery could be bypassedA recently patched bug in the Chromium project could allow malicious actors to bypass a security feature that protects sensitive cookies on Android browsers.Intent URLs should be considered external sources and be subject to SameSite restrictions. But a proof-of-concept Chong created in Python shows that cookies with SameSite=strict settings carry over when the web server initiates a redirection with an intent URL.The same scheme also bypasses the Sec-Fetch-Site header, which determines where the request originated from and enables websites to control access to their resources from external origins.Further investigation showed that SameSite cookies are also carried over through simple redirect requests without the intent protocol.While this was fixed in an earlier version of Chrome, it was later disabled because it caused breaking changes.The experimental cookie feature flag (chrome://flags/#enable-experimental-cookie-features) would restore the secure behavior and prevent SameSite cookies from being sent across normal redirect requests.This flag did not affect the insecure behavior of intent redirects. Chong also said that the flag did not affect the Sec-Fetch-Site behavior and needed to be fixed separately.Fixing the bug was not trivial because the developers had to account for how to determine trusted applications, including browsers.The lesson here is that given the complicated ways apps and browsers can communicate, developers should use multiple layers of security for their applications.“These sort of browser security mechanisms (i.e., SameSite cookies, Fetch metadata) are meant to be defense-in-depth only. You should use them but do not rely on them as the only form of defense,” Chong advised.Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2023-02-27",
      "title": "Dish Network goes offline after likely cyberattack, employees cut off",
      "text": " American TV giant and satellite broadcast provider, Dish Network has mysteriously gone offline with its websites and apps ceasing to function over the past 24 hours.The widespread outage affects Dish.com, Dish Anywhere app as well as several websites and networks owned by the corporation. Customers also suggest the company's call center phone numbers are unreachable.Additionally, customers are facing authentication issues when signing into TV channel apps such as MTV & Starz via their Dish credentials.Dish Network's remote employees have been cut off from accessing their work systems.Dish Network websites and apps including Dish.com, DishWireless.com, and Dish Anywhere are facing a prolonged outage with customers unable to get to their accounts or stream TV online:BleepingComputer also observed the Dish Anywhere Android app experiencing connection issues:An internal systems issue is impacting some of our customer service operations. We're sorry for the inconvenience. We'll be able to help you out as soon as our systems are back up. Thank you for your patience.\n-Joe S.Two sources told the media outlet that they were being asked to \"stand by\" for information from management but have been left in the dark.\"They say it hasn't even been made clear whether they'll be paid,\" states the report. \"Employees have also been told that they won't be able to connect to their VPN, keeping remote workers from logging in to work.\"A source in touch with a Dish Network employee told BleepingComputer that the network \"has been hit\" (by a cyber attack) with employees seeing \"blank icons\" on their Desktop—something that typically occurs after a ransomware infection encrypts the victim's files.Hours after publication of this piece, another Dish Network employee contacted us stating that Dish has indeed been \"cyber attacked.\"The employee reports receiving a written message from their manager that the incident \"was caused by an outside bad actor, a known threat agent\" and that the company is unsure how they gained access.The email goes on to say that the company is working with an external vendor to resolve the issue.BleepingComputer emailed Dish Network's press team in advance of publishing but it is not clear if they have access to their emails during this incident. Prior to that, we attempted to reach Dish via telephone but did not get an answer.An automated response sent to us from the 'Dish Answers' Twitter account reiterated the \"internal system issue\" the company was facing.BleepingComputer is continuing to investigate the matter and will provide you with updates as more information becomes available.Update Feb 25th, 6:50 AM ET: Added statement from another Dish Network employee who is confirming this to be a cyber attack. Removed link to another outlet's report citing \"a person familiar with the matter\" dispelling it as one."
   },
   {
      "time": "2023-02-27",
      "title": "Security of voice verification ID systems put into question, again | SC Media",
      "text": "  How secure are voice verification systems that are widely used by financial institutions, healthcare and dozens of other consumer accounts? Can they be trusted when it comes to protecting sensitive data? Those questions were posed recently when one real-world test showed how artificial intelligence was used to synthesize a voice and bypass security protections and access sensitive bank information.Called synthetic voice fraud, a Vice reporter Joseph Cox, was able to bypass UK-based Lloyds Bank’s Voice ID programs to access his own bank balance, a list of recent transactions and transfers. Cox used an AI-powered replica of his own voice to perpetrate the fraud. “Voice ID is an optional security measure, however we are confident that it provides higher levels of security than traditional knowledge-based authentication methods, and that our layered approach to security and fraud prevention continues to provide the right level of protection for customers’ accounts, while still making them easy to access when needed.”Cited in Cox’s report was use of voice authentication systems in use by TD Bank, Wells Fargo and Chase. To what extent those firms rely or allow voice to be used to access sensitive data is unclear.  Cox posted a video of his test on Twitter:“Voice ID is likely even less secure than face ID at this point. In general biometrics are never a good idea”The new PCI DSS standard puts more focus on application security, with more tools, testing and documentation required of developers.After admitting responsibility for compromising Sony, a Colonial Pipeline supplier, and a Hawai'i government site, the RansomedVC group has claimed that it will be ending operations due to the arrests of six of its affiliates, reports The Record, a news site by cybersecurity firm Recorded Future.Ukraine had experienced a less than a day-long power outage in October 2022 following an attack by Russian state-sponsored hacking operation Sandworm targeted at an electrical substation amid the ongoing Russia-Ukraine war, marking the first cyberattack-related power interruption in the country since 2017, CyberScoop reports.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-27",
      "title": "ChromeLoader campaign lures with malicious VHDs for popular games",
      "text": " Security researchers have noticed that the operators of the ChromeLoader browser hijacking and adware campaign are now using VHD files named after popular games. Previously, such campaigns relied on ISO-based distribution.Among the game titles abused for adware distribution purposes are Elden Ring, ROBLOX, Dark Souls 3, Red Dead Redemption 2, Need for Speed, Call of Duty, Portal 2, Minecraft, Legend of Zelda, Pokemon, Mario Kart, Animal Crossing, and more.A network of malvertising sites distributes the malicious files, which appear as legitimate game-related packages, that install the ChromeLoader extension.ChromeLoader hijacks the browser searches to show advertisements. Itt also modifies the browser settings, and collects credentials and browser data.In all cases seen throughout 2022, ChromeLoader arrived on the target system as an ISO file. Lately, the operators appear to prefer the VHD packaging.VHD files can be easily mounted on on a Windows system and are supported by multiple virtualization software.The images include several files but only one of them, a shortcut called \"Install.lnk,\" is visible. Deploying the shortcut triggers the execution of a batch script that decompresses the content of a ZIP archive.In the next step, the batch file executes \"data.ini,\" a VBScript, and a JavaScript that fetches the final payload from a remote resource.According to ASEC, ChromeLoader will start redirecting to advertisement sites, thus generating revenue for its operators.The researchers say that the addresses hosting the payload are not longe accessible. They note that the malicious Chrome extension that ChromeLoader creates and executes can also collect credential data stored in the browser.ASEC's report provides a short set of indicators of compromise that can help detect the ChromeLoader threat.Users are advised to avoid downloading games from unofficial sources, and keep away from cracks for popular products as they typically have a high security risk."
   },
   {
      "time": "2023-02-27",
      "title": "Hydrochasma: Previously Unknown Group Targets Medical and Shipping Organizations in Asia | Symantec Enterprise Blogs",
      "text": " Shipping companies and medical laboratories in Asia are being targeted in a likely intelligence-gathering campaign that relies exclusively on publicly available and living-off-the-land tools.Hydrochasma, the threat actor behind this campaign, has not been linked to any previously identified group, but appears to have a possible interest in industries that may be involved in COVID-19-related treatments or vaccines.The infection vector used by Hydrochasma was most likely a phishing email. The first suspicious activity seen on machines is a lure document with a file name in the victim organization’s native language that appears to indicate it was an email attachment:[TRANSLATED FROM THE ORIGINAL] Product Specification-Freight-Company Qualification Information wps-pdf Export.pdf.exe Another lure document appears to be mimicking a resume:[TRANSLATED FROM THE ORIGINAL] [REDACTED] University-Development Engineer.exeFollowing initial access on one machine, the attackers were seen dropping Fast Reverse Proxy (FRP), a tool that can expose a local server that is sitting behind an NAT or firewall to the internet. This drops a legitimate Microsoft Edge update file:                        %TEMP%\\MicrosoftEdgeUpdate.exeAnother file, %TEMP%\\msedgeupdate.dll, is then seen on victim machines. But this file is actually Meterpreter, a tool that is part of the Metasploit framework and which can be used for remote access.Other tools that were subsequently seen on this victim’s network included:A shellcode loader and a corrupted portable executable (PE) file were also deployed on this victim’s network.Other tactics, techniques, and procedures (TTPs) observed being used in this campaign included:The tools deployed by Hydrochasma indicate a desire to achieve persistent and stealthy access to victim machines, as well as an effort to escalate privileges and spread laterally across victim networks.While Symantec researchers didn’t observe data being exfiltrated from victim machines, some of the tools deployed by Hydrochasma do allow for remote access and could potentially be used to exfiltrate data. The sectors targeted also point towards the motivation behind this attack being intelligence gathering.The lack of custom malware used in this attack is also notable. Relying exclusively on living-off-the-land and publicly available tools can help make an attack stealthier, while also making attribution more difficult. Symantec did not see evidence to link this activity to a known actor, prompting us to create the new actor identity of Hydrochasma for those behind this activity.    If an IOC is malicious and the file available to us, Symantec Endpoint products will detect and block that file. File IndicatorsSHA256409f89f4a00e649ccd8ce1a4a08afe03cb5d1c623ab54a80874aebf09a9840e5 – Fast Reverse Proxy47d328c308c710a7e84bbfb71aa09593e7a82b707fde0fb9356fb7124118dc88 – GoGo Scanning Tool6698a81e993363fab0550855c339d9a20a25d159aaa9c4b91f60bb4a68627132 – Dropper7229bd06cb2a4bbe157d72a3734ba25bc7c08d6644c3747cdc4bcc5776f4b5b9 – Process Dumper (lsass.exe)72885373e3e8404f1889e479b3d46dd8111280379c4065bfc1e62df093e42aba – Fast Reverse Proxy72bc8b30df3cdde6c58ef1e8a3eae9e7882d1abe0b7d4810270b5a0cc077bb1a – Cobalt Strike Beacon7b410fa2a93ed04a4155df30ffde7d43131c724cdf60815ee354988b31e826f8 – Fast Reverse Proxy7f0807d40e9417141bf274ef8467a240e20109a489524e62b090bccdb4998bc6 – Process Dumper (lsass.exe)8c0f0d1acb04693a6bdd456a6fcd37243e502b21d17c8d9256940fc7943b1e9a – Cobalt Strike Beacon8e32ea45e1139b459742e676b7b2499810c3716216ba2ec55b77c79495901043 – Fast Reverse Proxy981e5f7219a2f92a908459529c42747ac5f5a820995f66234716c538b19993eb – GoGo Scanning Tool9ebd789e8ca8b96ed55fc8e95c98a45a61baea3805fd440f50f2bde5ffd7a372 – Fast Reverse Proxy9f5f7ba7d276f162cc32791bfbaa0199013290a8ac250eb95fd90bc004c3fd36 – Cobalt Strike Beacona0f5966fcc64ce2d10f24e02ae96cdc91590452b9a96b3b1d4a2f66c722eec34 – AllIn Scanning Toolcb03b5d517090b20749905a330c55df9eb4d1c6b37b1b31fae1982e32fd10009 – Fscand1c4968e7690fd40809491acc8787389de0b7cbc672c235639ae7b4d07d04dd4 – Shellcode Loaderde01492b44372f2e4e38354845e7f86e0be5fb8f5051baafd004ec5c1567039f – Cobalt Strike Beacone378d8b5a35d4ec75cae7524e64c1d605f1511f9630c671321ee46aa7c4d378b – PE Fileeba22f50eedfec960fac408d9e6add4b0bd91dd5294bee8cff730db53b822841 – Dropperfc4b5f2ee9da1fe105bb1b7768754d48f798bf181cbc53583387578a5ebc7b56 – Dogz Proxy Tool02fe00ffd1b076983f3866c04ca95c56cef88c2564fabb586e11e54986e87ba7084d1fc4236011d442801e423485c8e58f68dc14ec0a8b716fa0fd210de43dda1744fac628262aa0cf3810bd5168375959be41764c8ca2fa41950a7b1f8f2fad1d087f6a17227769bcebc799a2cdf1bb2a8fdf6ba560d21a88bb71f1c213a42c327fc116f8f48f97292184bb50cb3db418f368b3e2a0fb41267ba40254a35a893516f94b0fb57e93c6659d813cbf5fb3617dea7a667c78cb70a191430632790641b6d26926706bb68530ddff234f69757e3bbef91c47eb0255313ed86cb3f80644223e5abd106c077908f03c93b8c8baee7d630f1718f9750f16b786cf88fd06553e0763cf3a938b5754c9d89939a118abe0b235e4be6920c34f562bd758e5865a62abc0a2208679e414cc71d1f36ffa14b48df2b73ac520e45d557ad77dd0046770f815480d7cfa0a6fc8599c08ca6013f608d257a2121233e77374e21c53f86cb815863088a0ad367b2a525a572323600596f6875a79536aee57202ef24fd56f017ad84d0d06f50b6213a0742838b5ec510f3d06f96e0300048f2da6a35c417394ab0ed6d1f62e83fc5f8f1eb720ddd07cbd2bcdf6a00b9b63ef6018fa5f907800a4fb0cbdf29815c521ea8b00a23e28d7eb365653f2afcfb55726227272187f6a1d6950a9464f27d8651a267563d4630d223bf7ac66851917a57f8fac655084502fbe3e5172c39e9a97734e6caac79255abffcb55c22752620d908ff33940916b63b88de2549c4a5c8e13d51df4cf6996067ae30f24c8bb35c66db7c061df968b28f7d6abb845f2cc7efa93cdcf7660585e22d589267695726de13afea2609e8b5a84ad108a761619ca040788dcbf07996a9101cecc5c30ba61f9a06945c1b53d0a43ea91b3c80bc6c87c0c6946816c38876b2cb2f6f772afe94c54d3ad30b5c4f420067499522b748a34161ad6e140a7f30ab0b8fa63feef760c5e631679d0ae66022929c17f31ddf98d88817f0aa70a56ce2ff2df9595b8889c2d3d7e31d92c50a91bd5b2f06f41a9a5f9937e50b78658d46e3cd04bc3a85f270ce288c2dc3b714fd6f93c0c0cd2685b6b8cd551896855474bdd09593b8c6b4b7ab6bac2e7684a4984d9d82115c5cc1b43b9f63a11e7ed333a4e2d92dc15b6e931634bf4ebc3dabf0a2dafb0790be6dbb4d3509b5ce1259b955172910618a32627b3b668ee9aefde33ed48d16ecb1c41256fc7d93ddfa8bedfa59b95e8810282ac164d0df35b206fe10ad3f57d9c4ecf71a2d2cc06d7c7fe905e567b989f72f147da99dcf73738e6e33286657cda81f618a74b74745590915a8f4451e7c00473cbe89e1dfc8a67b80b0b0ecd10dfd90820ffc64923b94c32b04dbb6929a79b9ce027563cffdcf74968805e9cc897ca932e4da0f22ea7b3e9b96fcc9082c0c5300ae4cb0d Network IndicatorsIPs39.101.194[.]61 – Cobalt Strike Beacon C&C47.92.138[.]241 – Cobalt Strike Beacon C&C106.14.184[.]148180.119.234[.]147Domainsalidocs.dingtalk[.]com.wswebpic[.]com – Cobalt Strike Beacon C&Ccsc.zte[.]com.cn.wswebpic[.]com – Cobalt Strike Beacon C&Ctaoche[.]cn.wswebpic[.]com – Cobalt Strike Beacon C&CURLshxxp://47.92.138[.]241:8090/update.exehxxp://47.92.138[.]241:8000/agent.exehxxp://47.92.138[.]241:8000/update.exehxxp://47.92.138[.]241:8000/ff.exehxxp://47.92.138[.]241:8000/aa.exehxxp://47.92.138[.]241:8000/runas.exehxxp://47.92.138[.]241:8090/a.exehxxp://47.92.138[.]241:8000/t.exehxxp://47.92.138[.]241:8000/po.exehxxp://47.92.138[.]241:8080/t.exehxxp://47.92.138[.]241:8899/t.exehxxp://47.92.138[.]241:8000/logo.pnghxxp://47.92.138[.]241:8080/t.pnghxxp://47.92.138[.]241:8000/frp.exeThe Threat Hunter Team is a group of security experts within Symantec whose mission is to investigate targeted attacks, drive enhanced protection in Symantec products, and offer analysis that helps customers respond to attacks.We encourage you to share your thoughts on your favorite social platform."
   },
   {
      "time": "2023-02-27",
      "title": "After GoAnywhere MFT hack, HHS again warns of Clop ransomware threat | SC Media",
      "text": "  After the Clop ransomware group claimed responsibility for the massive targeted cyberattacks that exploited a zero-day vulnerability in the Fortra GoAnywhere MFT, the Department of Health and Human Services is again urging entities to bolster its defenses against Clop’s newest tactics.It didn’t take long for Clop to claim responsibility for the attacks and alleged data exfiltration launched over the course of 10 days. The group also claimed it could “encrypt affected healthcare systems by deploying ransomware payloads.” The group has refused to validate these claims.Fortra warned clients of the remote code execution vulnerability in early February and provided a workaround while it works on a patch. While initially it appeared as if an actor would need access to the admin console from within a private company network, a virtual private network (VPN), or allow-listed IPs, an active exploit was released soon after the disclosure. Notably, prior to an emergency patch, users were required to create an account to access the vulnerability report, which was heavily criticized by cybersecurity experts. As noted earlier, Ben Krebs was the first to find details on the zero-day vulnerability and post the full alert text.Cybersecurity & Infrastructure Security Agency recently added the GoAnywhere vulnerability, CVE-2023-0669, to its public catalog of Known Exploited Vulnerabilities. On Feb. 15, CISA ordered all federal civilian executive branch agencies to apply the patch before March 3.Although “these claims are uncorroborated, Clop continues to exhibit a history of employing trend-setting TTPs across multiple operations,” according to the alert. “Clop’s alleged attack this year only further exacerbates an ever-growing trend to target the healthcare industry and highlights its vulnerabilities to future attacks.”The research prompted the earlier HHS alert, and an added note that Clop was designed to target Windows systems. That same month, SentinelLabs discovered the first Linux-based Clop variant “using the same encryption method and similar process logic.”While the variant is currently flawed, the latest HHS alert warned that “the prevalent use of Linux in servers and cloud workloads makes it easy to suggest that Clop could employ this new ransomware campaign to target additional industries, including healthcare.”What’s more, Clop doesn’t adhere to the same rules as other ransomware-as-a-service (RaaS) groups, as it “unabashedly and almost exclusively targets the healthcare sector.” In 2021, 77% of its attacks were against healthcare. That same year, law enforcement arrested six members, which had little impact on the group’s success.“Continued and successful attacks, however, demonstrate that this prolific group is still a viable threat to the healthcare sector,” the alert warns. “The probability of cyber threat actors like Clop targeting the healthcare industry remains high.”Healthcare entities are being urged to review the updated alert on Clop’s threat to the sector, which includes possible new tactics, details on recent attacks, and its techniques for exploiting vulnerabilities, as well as possible defensive measures that could reduce the risk of exploit.Clop has targeted \"healthcare since 2019, evolving its tactics to effectively combine ransomware and data theft in novel ways,” said John Riggi, AHA’s national advisor for cybersecurity and risk, in a statement. “Healthcare organizations should immediately apply the security patches recommended in these alerts and review the scope, security and necessity of secure file transfer systems.”HHS has also added additional remediation recommendations to its previous alert, which include training staff on social-engineering attacks deployed via email or network access, developing a cyber roadmap taught clearly to all workforce members, and assessing all enterprise risks around vulnerabilities and prioritizing the plan against budget and staff.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.After admitting responsibility for compromising Sony, a Colonial Pipeline supplier, and a Hawai'i government site, the RansomedVC group has claimed that it will be ending operations due to the arrests of six of its affiliates, reports The Record, a news site by cybersecurity firm Recorded Future.U.S. advanced electronic components manufacturer Kyocera AVX Components Corporation has disclosed that 39,111 individuals around the world had their data compromised following a ransomware attack earlier this year, which has been claimed by the LockBit ransomware operation, reports BleepingComputer.Attack on the U.S. subsidiary of the Industrial & Commercial Bank of China disrupted Treasury trading in New York earlier this week.  Tue Jun 25Thu Dec 14Thu Nov 16   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-27",
      "title": "Canadian Telecom Provider Telus is Reportedly Breached - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2023-02-27",
      "title": "This ransomware group wants you to double-cross your insurer | SC Media",
      "text": "  Another ransomware group has emerged to threaten organizations, and they're very interested in your insurance plan.In an image posted by Varonis threat researchers to their blog, the ransom note makes an appeal to the victim to stick it to the insurance company “since the sneaky insurance agent purposefully negotiates so as not to pay for the insurance claim, only the insurance company wins in this situation.\"“To avoid all this and get the money on the insurance, be sure to inform us anonymously about the availability and terms of insurance coverage, it benefits both you and us, but it does not benefit the insurance company.” First observed in October, an updated version of HardBit ransomware was discovered by Varonis in late November. The group does not currently have a leak site. One cybersecurity expert contacted by SC Media said it was fascinating to see ransomware gangs evolve their business models. As insurers have adapted to price out the costs of paying a ransom versus recovery, cybercriminals are adapting their demands to ensure they get paid and don't go over that limit.“Ransomware gangs are businesses,” said Mike Parkin, senior technical engineer at Vulcan Cyber. “They are illegal and unethical, but they are businesses nonetheless.”  Melissa Bischoping, director of endpoint security at Tanium, cautioned victims not to share details of their insurance with threat actors since it may result in a denied claim. “As threat actors begin to view insured victims as a guaranteed payment source, I’d expect and hope to see regulation and/or legislation to prevent abuse of the system such as HardBit’s tactics,” said Bischoping.Stephen Weigand is managing editor and production manager for SC Media. He has worked for news media in Washington, D.C., covering military and defense issues, as well as federal IT. He is based in the Seattle area.After admitting responsibility for compromising Sony, a Colonial Pipeline supplier, and a Hawai'i government site, the RansomedVC group has claimed that it will be ending operations due to the arrests of six of its affiliates, reports The Record, a news site by cybersecurity firm Recorded Future.U.S. advanced electronic components manufacturer Kyocera AVX Components Corporation has disclosed that 39,111 individuals around the world had their data compromised following a ransomware attack earlier this year, which has been claimed by the LockBit ransomware operation, reports BleepingComputer.Attack on the U.S. subsidiary of the Industrial & Commercial Bank of China disrupted Treasury trading in New York earlier this week.  Tue Jun 25Thu Dec 14Thu Nov 16   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-27",
      "title": "Two data centers used by major tech firms hacked | SC Media",
      "text": "  Two Asia-based data centers used by major global corporations were targeted in a series of cyberattack first identified in 2021 and as recently as January 2023. Data exfiltrated over the past three years included the credentials of those managing the data centers and login information used by customers to access cloud services hosted with the two data-center operators.Exfiltrated from the data centers was data tied to corporate helpdesk systems (customer service, ticket management and support portals), remote management services and datacenter employee and customer email account credentials. Researchers said adversaries used the data to dig deeper into systems and attempted to gain access to embedded server management services (Remote Hands Services) such as OpenBMC, FreeIPMI and iDRAC.It’s unclear to what extent nearly a dozen of the Fortune 100 companies cited by Resecurity were impacted. The Bloomberg report indicated that most of the identified firms either said no damage was caused to customers, declined to comment or said additional safeguards were put in place after being made aware of the incidents. Resecurity first notified data center operators in September 2021 when it discovered 2,000 data center customer records for sale on underground hacker forums. In one cited instance, threat actors were selling a “compromised Office 365 account related to the Institute of Nuclear Energy Research based in Taiwan.”In 2022, researchers found evidence that showed threat actors were able exfiltrate 1,210 additional records, acquiring them via illicit access to customer service portals, helpdesk and ticket management systems. Last month, an additional 10 organizations continued to be targeted, researchers said.“It is not clear if such access [tied to the 2023 incident] was possible simply because multiple customers didn't change their passwords after the incident in 2021, lack of awareness or response, or the episode may have been interpreted as ‘new’,” wrote researchers.Who the attackers are is also unclear, with researchers stating that based on internet postings on underground crime forums that the adversaries are potentially located somewhere in Asia.“The majority of forum sections have Chinese translation, and it is there where we could identify multiple actors originating from China and countries based in South-East Asia,” researchers wrote.Data culled from victims ended up on a variety of underground marketplaces that catered to ransomware cybercriminals.“Malicious cyber activity targeting data center organizations creates a significant precedent in the context of supply chain cybersecurity,” Resecurity wrote. They urged security professionals to step up evaluation and speed mitigation efforts tied to both OT and IT supply chains.“It’s also crucial to have a transparent communication with suppliers regarding possible cybersecurity incidents which may involve client accounts and related data,” they wrote.Tom Spring is Editorial Director for SC Media and is based in Boston, MA. For two decades he has worked at national publications in the leadership roles of publisher at Threatpost, executive news editor PCWorld/Macworld and technical editor at CRN. He is a seasoned cybersecurity reporter, editor and storyteller that aims always for truth and clarity.U.S. cloud data analytics and log analysis firm Sumo Logic has confirmed discovering a potential security incident after its Amazon Web Services account was accessed using stolen credentials, reports TechCrunch.Transitioning to cloud-native environments has brought along security risks for companies, according to TechRadar.Vulnerabilities in API authorization have been named by Wallarm as the second greatest security risk facing APIs, emphasizing the ease of leveraging authorizations as backdoors as well as the urgent need to ensure authorization maintenance, reports SiliconAngle.Tue Apr 23Wed Dec 6On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-27",
      "title": "How hackers can cause physical damage to bridges - Help Net Security",
      "text": " This lateral movement lets attackers access industrial control systems and cross often-overlooked security perimeters to cause physical damage. From sensors that measure and detect pressure, temperature, flow and levels of liquids, air, and gases, to analyzers that determine chemical compositions and actuators that enable machines to move. Moving through these devices at the lowest levels, attackers can circumvent built-in functional and safety limitations to cause significant damage or disruption to services, or worse, pose a potential threat to life.To demonstrate the potential implications, Forescout has built an industry-first proof-of-concept (PoC) which shows how attackers can move laterally on the controller level (Purdue level 1) to cause cyber and physical impact, as illustrated through the scenario of damaging a movable bridge during a closing sequence.As part of the research, two new vulnerabilities are also being disclosed for the first time – CVE-2022-45788 and CVE-2022-45789 – which allows for remote code execution and authentication bypass, respectively, on Schneider Electric Modicon Unity Programmable Logic Controllers (PLCs).Modicon PLCs are used in a wide range of industrial processes and critical infrastructure, including in industries such as water and wastewater, mining, manufacturing, and energy. Whilst these devices should not be accessible online, Forescout has found that close to a thousand PLCs have been exposed, with France (33%), Spain (17%), Italy (15%), and the United States (6%) revealed as the countries with the most exposed devices.The number of devices visible is just a small indication of the popularity of these PLCs, but these devices also highlight some of the critical facilities that rely on them. For example, several devices were connected to hydro power plants, solar parks and airports."
   },
   {
      "time": "2023-02-27",
      "title": "PureCrypter malware hits govt orgs with ransomware, info-stealers",
      "text": " A threat actor has been targeting government entities with PureCrypter malware downloader that has been seen delivering multiple information stealers and ransomware strains.Researchers at Menlo Security discovered that the threat actor used Discord to host the initial payload and compromised a non-profit organization to store additional hosts used in the campaign.According to the researchers, the observed PureCrypter campaign targeted multiple government organization in the Asia-Pacific (APAC) and North America regions.The attack begins with an email that has a Discord app URL pointing to a PureCrypter sample in a password-protected ZIP archive.PureCrypter is a .NET-based malware downloader first seen in the wild in March 2021. Its operator rents it to other cybercriminals to distribute various types of malware.When executed, it delivers the next-stage payload from a command and control server, which is the compromised server of a non-profit organization in this case.The sample that the researchers at Menlo Security analyzed was AgentTesla. When launched, it establishes a connection to a Pakistan-based FTP server that is used to receive the stolen data.The researchers found that the threat actors used leaked credentials to take control of the particular FTP server rather than setting it up their own, to reduce identification risks and minimize their trace.AgentTesla is a .NET malware family that has been used by cybercriminals for the last eight years. Its usage peaking in late 2020 and early 2021.AgentTesla’s keylogging activity accounted for roughly one-third of all keylogger reports Cofense Intelligence recorded in 2022.The malware’s capabilities include the following:In the attacks examined by Menlo Labs, it was discovered that the threat actors used process hollowing to inject the AgentTesla payload into a legitimate process (“cvtres.exe”) to evade detection from antivirus tools.Furthermore, AgentTesla uses XOR encryption to protect its communications with the C2 server, like its configuration files, from network traffic monitoring tools.Menlo Security believes that the threat actor behind the PureCrypter campaign is not a major one but it is worth monitoring its activity due to targeting government entities.It is likely that the attacker will keep using compromised infrastructure for as long as possible before being forced to find new one."
   },
   {
      "time": "2023-02-27",
      "title": "WinorDLL64: A backdoor from the vast Lazarus arsenal?",
      "text": " \n      Award-winning news, views, and insight from the ESET security community\n    \n        Award-winning news, views, and insight from the ESET security community\n      ESET ResearchThe targeted region, and overlap in behavior and code, suggest the tool is used by the infamous North Korea-aligned APT group\n23 Feb 2023\n • \n, \n10 min. read\nThe initially unknown Wslink payload was uploaded to VirusTotal from South Korea shortly after the publication of our blogpost, and hit one of our YARA rules based on Wslink’s unique name WinorDLL64. Regarding Wslink, ESET telemetry has seen only a few detections - in Central Europe, North America, and the Middle East.The WinorDLL64 payload serves as a backdoor that most notably acquires extensive system information, provides means for file manipulation, such as exfiltrating, overwriting, and removing files, and executes additional commands. Interestingly, it communicates over a connection that was already established by the Wslink loader.In 2021, we did not find any data that would suggest Wslink is a tool from a known threat actor. However, after an extensive analysis of the payload, we have attributed WinorDLL64 to the Lazarus APT group with low confidence based on the targeted region and an overlap in both behavior and code with known Lazarus samples.This blogpost explains the attribution of WinorDLL64 to Lazarus and provides an analysis of the payload.The following details summarize the supporting facts for our low confidence attribution to Lazarus:Figure 1. Reported South Korean victim, where mstoned7 is the researcher from Ahnlabrich_signature.length == 80 and\npe.rich_signature.toolid(175, 30319) == 7 and\npe.rich_signature.toolid(155, 30319) == 1 and\npe.rich_signature.toolid(158, 30319) == 10 and\npe.rich_signature.toolid(170, 30319) >= 90 and\npe.rich_signature.toolid(170, 30319) <= 108  This rule can be translated to the following notation that is more readable and used by VirusTotal, where one can see the product version and build ID (VS2010 build 30319), number and type of source/object files used ([LTCG C++] where LTCG stands for Link Time Code Generation, [ASM], [ C ]), and number of exports ([EXP]) in the rule:[LTCG C++] VS2010 build 30319 count=7\n[EXP] VS2010 build 30319 count=1\n[ASM] VS2010 build 30319 count=10\n[ C ] VS2010 build 30319 count in [ 90 .. 108 ] Table 1. Similarities between WinorDLL64 and GhostSecret and their significance in attributing both to the same threat actor\n\n\nOther similarities between WinorDLL64 and GhostSecret\nImpact\n\n\n\n\nCode overlap in code responsible to get processor architecture \nLow\n\n\nCode overlap in current directory manipulation \nLow\n\n\nCode overlap in getting the process list \nLow\n\n\nCode overlap in file sending \nLow\n\n\nBehavior overlap in listing processes\nLow\n\n\nBehavior overlap in current directory manipulation\nLow\n\n\nBehavior overlap in file and directory listing\nLow\n\n\nBehavior overlap in listing volumes\nLow\n\n\nBehavior overlap in reading/writing files\nLow\n\n\nBehavior overlap in creating processes\nLow\n\n\nConsiderable behavior overlap in secure removal of files\nLow\n\n\nConsiderable behavior overlap in termination of processes\nLow\n\n\nConsiderable behavior overlap in collecting system information\nLow\n\n\nCode overlap in the file sending functionality is highlighted in Figure 2 and Figure 3.Figure 2. GhostSecret sending a fileFigure 3. Wslink sending a fileWinorDLL64 serves as a backdoor that most notably acquires extensive system information, provides means for file manipulation, and executes additional commands. Interestingly, it communicates over a TCP connection that was already established by its loader and uses some of the loader’s functions.Figure 4. Visualization of Wslink's communicationThe following facts lead us to believe with high confidence that the library is indeed part of Wslink:WinorDLL64 accepts several commands. Figure 5 displays the loop that receives and handles commands. Each command is bound to a unique ID and accepts a configuration that contains additional parameters.Figure 5. The main part of the backdoor’s command-receiving loopThe command list, with our labels, is in Figure 6.Figure 6. The command listTable 2 contains a summary of the WinorDLL64 commands, where modified, and old categories refer to the relationship to the previously documented GhostSecret functionality. We highlight only significant changes in the modified category.Table 2. Overview of backdoor commands\n\n\nCategory\nCommand ID\nFunctionality\nDescription\n\n\n\n\nNew\n0x03\nExecute a PowerShell command\nWinorDLL64 instructs the PowerShell interpreter to run unrestricted and to read commands from standard input. Afterwards, the backdoor passes the specified command to the interpreter and sends the output to the operator.\n\n\n0x09\nCompress and download a directory\nWinorDLL64 recursively iterates over a specified directory. The content of each file and directory is compressed separately and written to a temporary file that is afterwards sent to the operator and then removed securely.\n\n\n0x0D\nDisconnect a session\nDisconnects a specified logged-on user from the user’s Remote Desktop Services session. The command can also perform different functionality based on the parameter.\n\n\n0x0D\nList sessions\nAcquires various details about all sessions on the victim’s device and sends them to the operator. The command can also perform different functionality based on the parameter.\n\n\n0x0E\nMeasure connection time\nUses the Windows API GetTickCount to measure the time required to connect to a specified host.\n\n\nModified\n0x01\nGet system info\nAcquires comprehensive details about the victim’s system and sends them to the operator.\n\n\n0x0A\nRemove files securely\nOverwrites specified files with a block of random data, renames each file to a random name, and finally securely removes them one by one.\n\n\n0x0C\nKill processes\nTerminates all processes whose names match a supplied pattern and/or with a specific PID.\n\n\nOld\n0x02/0x0B\nCreate a process\nCreates a process either as the current or specified user and optionally sends its output to the operator.\n\n\n0x05\nSet/Get current directory\nAttempts to set and subsequently acquire the path of the current working directory.\n\n\n0x06\nList volumes\nIterates over drives from C: to Z: and acquires the drive type and volume name. The command can also perform different functionality based on the parameter.\n\n\n0x06\nList files in a directory\nIterates over files in specified directory and acquires information such as names, attributes, etc. The command can also perform different functionality based on the parameter.\n\n\n0x07\nWrite to a file\nDownloads and appends the stated amount of data to specified file.\n\n\n0x08\nRead from a file\nThe specified file is read and sent to the operator.\n\n\n0x0C\nList processes\nAcquires details about all running processes on the victim’s device and additionally sends ID of the current process.\n\n\nWslink’s payload is dedicated to providing means for file manipulation, execution of further code, and obtaining extensive information about the underlying system that possibly can be leveraged later for lateral movement, due to specific interest in network sessions. The Wslink loader listens on a port specified in the configuration and can serve additional connecting clients, and even load various payloads.WinorDLL64 contains an overlap in the development environment, behavior, and code with several Lazarus samples, which indicates that it might be a tool from the vast arsenal of this North-Korea aligned APT group.\n\n\nSHA-1\nESET detection name\nDescription\n\n\n\n\n1BA443FDE984CEE85EBD4D4FA7EB1263A6F1257F\nWin64/Wslink.A\nMemory dump of discovered Wslink payload WinorDll64.\n\n\n\n      Sign up for our newsletters\n    ESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-BaltistanESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-Baltistan • ESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its graveESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its grave • ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023 • \n            Award-winning news, views, and insight from the ESET security community\n          "
   }
]