[
   {
      "time": "2022-11-07",
      "title": "- Hackread - Latest Cybersecurity News, Press Releases & Technology Today",
      "text": " \n\tHackread.com is among the registered trademarks of Gray Dot Media Group Ltd. Company registration number 12903776 in regulation with the United Kingdom Companies House. The registered address is 85 Great Portland Street, London, England, W1W 7LT The display of third-party trademarks and trade names on the site do not necessarily indicate any affiliation or endorsement of Hackread.com. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n\t\t\t\t"
   },
   {
      "time": "2022-11-07",
      "title": "Researchers Uncover 29 Malicious PyPI Packages Targeted Developers with W4SP Stealer",
      "text": " Cybersecurity researchers have uncovered 29 packages in Python Package Index (PyPI), the official third-party software repository for the Python programming language, that aim to infect developers' machines with a malware called W4SP Stealer.The list of offending packages is as follows: typesutil, typestring, sutiltype, duonet, fatnoob, strinfer, pydprotect, incrivelsim, twyne, pyptext, installpy, faq, colorwin, requests-httpx, colorsama, shaasigma, stringe, felpesviadinho, cypress, pystyte, pyslyte, pystyle, pyurllib, algorithmic, oiu, iao, curlapi, type-color, and pyhints.Collectively, the packages have been downloaded more than 5,700 times, with some of the libraries (e.g., twyne and colorsama) relying on typosquatting to trick unsuspecting users into downloading them.\"As this is an ongoing attack with constantly changing tactics from a determined attacker, we suspect to see more malware like this popping up in the near future,\" Phylum noted.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-07",
      "title": "Homeland Security Cops to Manufacturing Terrorists for Trump",
      "text": " The Department of Homeland Security launched a failed operation that ensnared hundreds, if not thousands, of U.S. protesters in what new documents show was as a sweeping, power-hungry effort before the 2020 election to bolster President Donald Trump’s spurious claims about a “terrorist organization” he accused his Democratic rivals of supporting.The report describes  attempts by top officials to link protesters to an imaginary terrorist plot in an apparent effort to boost Trump’s reelection odds, raising concerns now about the ability of a sitting president to co-opt billions of dollars’ worth of domestic intelligence assets for their own political gain. DHS analysts recounted orders to generate evidence of financial ties between protesters in custody; an effort that, had they not failed, would have seemingly served to legitimize President Trump’s false claims about “Antifa,” an “organization” that even his most loyal intelligence officers failed to drum up proof ever existed. The DHS report offers a full accounting of the intelligence activities happening behind the scenes of officers’ protest containment; “twisted efforts,” Wyden said, of Trump administration officials promoting “baseless conspiracy theories” to manufacture of a domestic terrorist threat for the president’s “political gain.” The report describes the dossiers generated by DHS as having detailed the past whereabouts and the “friends and followers of the subjects, as well as their interests” — up to and including “First Amendment speech activity.” Intelligence analysts had internally raised concerns about the decision to accuse anyone caught in the streets by default of being an “anarchist extremist” specifically because “sufficient facts” were never found “to support such a characterization.”One field operations analyst told interviewers that the charts were hastily “thrown together,” adding they “didn’t even know why some of the people were arrested.” In some cases, it was unclear whether the arrests were made by police or by one of the several federal agencies on the ground. The analysts were never provided arrest affidavits or paperwork, a witness told investigators, adding that they “just worked off the assumption that everyone on the list was arrested.” Lawyers who reviewed 43 of the dossiers found it “concerning,” the report says, that 13 of them stemmed from “nonviolent crimes.” These included trespassing, though it was unclear to analysts and investigators whether the cases had “any relationship to federal property,” the report says.A footnote in the report states that “at least one witness” told investigators that dossiers had been requested on people who were “not arrested” but merely accused of threats. Another, citing emails exchanged between top intelligence officials, states dossiers were created “on persons arrested having nothing to do with homeland security or threats to officers.”Questioned by investigators, the agency’s chief intelligence officer acknowledged fielding requests by Wolf and his acting deputy, Ken Cuccinelli, to create dossiers “against everyone participating in the Portland protest,” regardless of whether they’d been accused of any crime, the report says. That officer, Brian Murphy, then head of the agency’s Office of Intelligence and Analysis (I&A), told interviewers that he’d rejected the idea, informing his bosses that he could only “look at people who were arrested,” and adding that it was something his office had done “thousands” of times before.The DHS report, finalized more than a year ago, includes descriptions of orders handed down to “senior leadership” instructing them to broadly apply the label “violent antifa anarchists inspired” to Portland protesters unless they had intel showing “something different.”Once the dossiers were received by the agency’s emerging threat center, it became clear that DHS had no real way to tie the protesters to any terrorist activities, neither at home nor abroad. Efforts to drum up evidence to support the administration’s claim that a “larger network was directing or financing” the protesters — a task assigned to another unit, known as the Homeland Identities, Targeting and Exploitation Center, diverted away from its usual work of analyzing national security threats — “did not find any evidence that assertion was true,” the report says.Fears of political toadies occupying key intelligence roles had been aired publicly by former intelligence community members during the Trump administration’s early years, but their concerns were all but ignored by Senate Republicans during confirmation hearings that would ultimately inflict serious reputational damage on a number of agencies that, for their own survival, had long avoided partisan leanings. The report is based on interviews with approximately 80 employees conducted by attorneys drawn from various agency components, including U.S. Customs and Border Protection and the U.S. Coast Guard. The investigation began in response to  leaks of internal DHS emails in July 2020 that prompted questions from lawmakers about potential intelligence abuses, including the monitoring of journalists’ activities online and the liberal application of terrorism-related language to describe Americans engaged in protest.I&A is one of the nation’s 17 intelligence community members overseen by the nation’s “top spy,” the director of national intelligence, whose office drafts daily top-secret briefings for the president. The directorship was held throughout the protests by John Ratcliffe, a Republican of Texas and renowned Trump loyalist, whose nomination to the post was withdrawn initially in 2019 over qualifications concerns  raised by lawmakers and career intelligence officials.The dossiers, known as Operational Background Reports, or OBRs, are known colloquially within the agency as “baseball cards,” the report says. The task of creating them was handed, “with little to no guidance on execution,”  to the agency’s Current and Emerging Threats Center, an analysis unit whose “actionable intelligence” is distributed widely throughout the government. According to the report, the dossiers would’ve been shared with, among others, the agency’s Field Operations Division, which works closely with House and Senate committee staffers, and the Federal Protection Service, whose core mission is securing some 9,000 federal facilities across the country. The extent to which entities outside the federal government were meant to be involved is unclear; however, the report indicates that DHS state and local partners, which would naturally include law enforcement, but also potentially organizations like National Governors Association, could have also been in the loop.Floyd’s death at the hands of Minneapolis police officer Derek Chauvin, convicted of murder and sentenced to 22 and a half years in prison in 2021, sparked more than 100 days of continuous marches in Portland. Sporadic protests continued well into the next spring, frequently marked by nightly standoffs between protesters toting bottles, fruit, and fireworks and riot-control squads armed with nightsticks, pepperspray, and “kinetic impact munitions” designed to irritate, disorient, and compel compliance through pain. Police would eventually rack up an unprecedented 6,000 documented use-of-force cases against the demonstrators, who in turn reportedly inflicted more than $2.3 million in damage to federal buildings alone. Police ran off legal observers and physically beat journalist who suffered injuries at the hands of federal agents armed with crowd control weapons as well. In response to the bad press, Justice Department lawyers filed a successful motion in court giving police the power to force reporters off the streets. One tweet, published on July 26 — a week after Lawfare published the guidance document — included a leaked email by DHS’s acting chief intelligence officer, relaying orders to begin referring to all violence in Portland as the work of “Antifa.”  As the summer nights grew longer and the 2020 elections near, the media spent less time focused on the cause of the demonstrations — the suffocation of a Black father of five by a white Minneapolis police officer who was outwardly unmoved by Floyd’s desperate pleas for air, or the heartrending cries for his mother. Headlines shifted instead, as if on cue, to focus on the narrative crafted by the president’s flailing reelection campaign; a pre-packed delusion designed to strike fear in voters’ imaginations and tether Democrats to a fictitious terrorist threat.Shocking and alarming career intelligence officials, Graham posted a letter online ahead of the election’s final debate. It contained a batch of Russian disinformation that a Republican-led committee had disregarded as bogus four years earlier. Apparently, it focused on the only Democratic left on whom they could find any material with which to smear: Hillary Clinton, who had no election to lose."
   },
   {
      "time": "2022-11-07",
      "title": "German Police Arrests Student Operator of Dark Web, Likely to Face 10 Years - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-11-07",
      "title": "Data of UK and EU Users is Accessible to TikTok Staff in China - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-11-07",
      "title": "Ukraine suffered a comms outage when 1,300 SpaceX satellite units went offline over funding issues | CNN Politics",
      "text": " \n      Ukraine’s fears that its troops  may lose access to Elon Musk’s crucial Starlink internet service deepened in the past week after 1,300 of the military’s satellite units went offline, according to  two sources familiar with the outage.  \n  \n      But concerns have risen recently over the dependability of SpaceX after discussions about funding were revealed and outages were reported near the frontlines.  \n  \n      Days after the CNN report, Musk appeared to reverse course, claiming that SpaceX had withdrawn the request.  \n  \n      Negotiations between SpaceX and the Defense Department continue despite Musk’s claim that SpaceX withdrepw its request, according to a senior defense official. \n  \n      “Negotiations are very much underway. Everyone in our building knows we’re going to pay them,” the senior Pentagon official told CNN, adding that the department is eager to have commitments in writing “because we worry he’ll change his mind.” \n  \n      Neither Musk nor SpaceX responded to a request for comment. The Ukrainian government, including the Ministry of Defense, did not immediately respond. \n  \n      The recent outage started on October 24 and was described by one person briefed on the situation as a “huge problem” for Ukraine’s military. The terminals had been disconnected, this person said, due to a lack of funding.   \n  \n      The outage affected a block of 1,300 terminals that Ukraine purchased from a British company in March and were used for combat-related operations.  \n  \n      SpaceX was charging Ukraine’s military $2,500 a month to keep each of the 1,300 units connected, pushing the total cost to almost $20 million by September, the person briefed on the matter said. Eventually, they could no longer afford to pay, the person said.   \n  \n      Before the terminals went completely dark, Ukraine’s Ministry of Defense made a request in early October to their British counterparts to pick up the $3.25 million monthly bill. The batch of terminals were also rotated out as concerns grew that service could be turned off, in order to minimize the impact, the source said. \n  \n      A British official said after discussions between the ministries “it was agreed there were higher priority military capabilities.” Among many other channels of support, the UK has been flying thousands of Ukrainian troops to Britain for training before they head back to the frontlines. \n  \n      “We support a number of terminals that have a direct tactical utility for Ukraine’s military in repelling Russia’s invasion,” the British official told CNN.  “We consider and prioritize all new requests in terms of the impact contributions would have in supporting Ukraine to defend its people against Putin’s deplorable invasion.” \n  \n      A senior Ukrainian official confirmed the outage, calling the Starlink units “very important” for Ukraine’s fight against Russia.   \n  \n      The terminals, which include small satellite dishes, connect to SpaceX’s constellation of satellites orbiting the earth and not only keep troops and civilians online but have been used with lethal effect, proving critical for Ukraine’s use of drones and artillery targeting. \n  \n      It’s unclear exactly how many terminals Ukraine’s military is operating but the 1,300 that recently shut off represent a significant portion. In July the country’s commander-in-chief wrote Musk directly asking for more, in a letter seen by CNN, saying approximately 4,000 had been deployed by the military. \n  \n      Earlier this month, Musk said that of the more than 25,000 terminals now in Ukraine, fewer than 11,000 were paying for the service, which can run as high as $4,500 per month. \n  \n      On Monday a Pentagon spokesman declined to comment on potential contracts or agreements but said talks are ongoing. \n  \n      “We continue to discuss Ukraine’s satellite communication needs with Ukraine and companies like SpaceX and others,” Brigadier General Patrick Ryder told reporters. \n  \n      Whether greater cooperation with SpaceX would give the US government stronger control over the Starlink signal in Ukraine has not been answered. Currently SpaceX controls where Ukraine Starlink terminals can be used and outages have previously been reported by Ukrainian units near the front, as they advanced and liberated Russian-held areas. \n  \n      As a result, Musk’s control of the signal gives him significant sway over the battlefield at a time when he has come under heavy criticism for arguing that Ukraine should sue for peace and give up some of its territory. \n  © 2023 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network."
   },
   {
      "time": "2022-11-07",
      "title": "FBI: Hacktivist DDoS attacks had minor impact on critical orgs",
      "text": " The Federal Bureau of Investigation (FBI) said on Friday that distributed denial-of-service (DDoS) attacks coordinated by hacktivist groups have a minor impact on the services they target.As the law enforcement agency explained in a private industry notification issued today, this happens because they target public-facing infrastructure like websites instead of the actual services, leading to limited disruption.\"These attacks are generally opportunistic in nature and, with DDoS mitigation steps, have minimal operational impact on victims; however, hacktivists will often publicize and exaggerate the severity of the attacks on social media. \"As a result, the psychological impact of DDoS attacks is often greater than the disruption of service.\"Such groups commonly target high-profile or critical infrastructure organizations like financial institutions, emergency services, airports, and government, health, and medical facilities.By taking down their websites, the hacktivists aim to increase their credibility and \"falsely assert greater impact or disruption than what occurred.\"The DDoS attacks overwhelmed the servers hosting these sites, making it impossible for travelers to book airport services or get updates about their scheduled flights.Notable examples of airport websites inaccessible during the incident included:While these DDoS attacks had no impact on flights, they still had an adverse effect on a crucial economic sector, delaying associated services."
   },
   {
      "time": "2022-11-07",
      "title": "ACE seizes 42 soccer and live TV piracy web domains with millions of visitors",
      "text": " The Alliance for Creativity and Entertainment (ACE) has shut down 42 websites for the pirated streaming of televised soccer games and live TV, seizing their domains and taking down the illegal streaming services.The now-defunct websites accumulated over 308 million visits in the past six months. Due to the upcoming 2022 FIFA World Cup in Qatar, set to begin on November 20, 2022, interest was growing steadily.Two notable pirate platforms, \"futbollibre.net\" and \"televisionlibre.net,\" had 42.9 million and 7.9 million monthly visitors, respectively.All 42 websites were operated by an Argentinian man and drew the majority of their traffic from the Latin American country, offering unauthorized streams of live matches of the Argentine Professional Soccer League, LaLiga, UEFA Champions League, and more.The sites had links to live feeds from channels that had secured a license to legally broadcast the sports events, causing substantial financial damage to those media groups.Customers of those illegal platforms secured their access to live match feeds by paying a monthly or yearly subscription fee, which they have lost now due to the seizure.\"With the World Cup just a few weeks away, the coalition is sharply focused on live piracy, which poses a serious threat to sports leagues and fans around the world.\"ACE has also taken control over the website's Twitter and Instagram accounts, where they have made posts about the takeover.The Alliance for Creativity and Entertainment is a subsidiary of the Motion Picture Association and the most powerful private anti-piracy coalition in the world.Its board members are Amazon, Apple, NBCUniversal, Netflix, Sony Pictures Entertainment, Paramount, Walt Disney Studios, and Warner Bros."
   },
   {
      "time": "2022-11-07",
      "title": "British govt is scanning all Internet devices hosted in UK",
      "text": " The United Kingdom's National Cyber Security Centre (NCSC), the government agency that leads the country's cyber security mission, is now scanning all Internet-exposed devices hosted in the UK for vulnerabilities.The goal is to assess UK's vulnerability to cyber-attacks and to help the owners of Internet-connected systems understand their security posture.\"The NCSC uses the data we have collected to create an overview of the UK's exposure to vulnerabilities following their disclosure, and track their remediation over time.\"NCSC's scans are performed using tools hosted in a dedicated cloud-hosted environment from scanner.scanning.service.ncsc.gov.uk and two IP addresses (18.171.7.246 and 35.177.10.231).The agency says that all vulnerability probes are tested within its own environment to detect any issues before scanning the UK Internet.\"We're beginning with simple scans, and will slowly increase the complexity of the scans, explaining what we're doing (and why we're doing it).\"Data collected from these scans includes any data sent back when connecting to services and web servers, such as the full HTTP responses (including headers).Requests are designed to harvest the minimum amount of info required to check if the scanned asset is affected by a vulnerability.If any sensitive or personal data is inadvertently collected, the NCSC says it will \"take steps to remove the data and prevent it from being captured again in the future.\"British organizations can also opt out of having their servers scanned by the government by emailing a list of IP addresses they want to be excluded at scanning@ncsc.gov.uk.The NCSC plans to release new Nmap scripts only for critical security vulnerabilities it believes to be at the top of threat actors' targeting lists."
   },
   {
      "time": "2022-11-07",
      "title": "Oreo Giant Mondelez Settles NotPetya 'Act of War' Insurance Suit",
      "text": " Mondelez International, maker of Oreos and Ritz Crackers, has settled a lawsuit against its cyber insurer after the provider refused to cover a multimillion-dollar clean-up bill stemming from the sprawling NotPetya ransomware attack in 2017.The lawsuit hinged on the contract terms in the cyber insurance policy — specifically, an exclusion carve-out for damages caused by acts of war.In the case of Mondelez, the malware locked up 1,700 of its servers and a staggering 24,000 laptops, leaving the corporation incapacitated and reeling from more than $100 million in damages, downtime, lost profits, and remediation costs.As if that weren't tough enough to swallow, the food kahuna soon found itself choking on the response from Zurich American when it filed a cyber insurance claim: The underwriter had no intention of covering the costs, citing the aforementioned exclusion clause that included the language \"hostile or warlike action in time of peace or war\" by a \"government or sovereign power.\"Thanks to world governments' attribution of NotPetya to the Russian state, and the original mission of the attack to strike a known kinetic adversary of Moscow, Zurich American had a case — despite the fact that the Mondelez attack was certainly unintended collateral damage.However, Mondelez argued that Zurich American's contract left some disputed crumbs on the table, as it were, given the lack of clarity in what could and could not be covered in an attack. Specifically, the insurance policy clearly stated that it would cover \"all risks of physical loss or damage\" — emphasis on \"all\" — \"to electronic data, programs, or software, including loss or damage caused by the malicious introduction of a machine code or instruction.\" It's a situation that NotPetya perfectly embodies.Caroline Thompson, head of underwriting at Cowbell Cyber, a cyber insurance provider for small and midsize businesses (SMBs), notes that the lack of clear cyber insurance policy-wording left the door open for Mondelez's appeal — and should act as a cautionary message to others negotiating coverage.\"The scope of coverage, and the application of war exclusions, remains one of the most challenging areas for insurers as cyber threats continue to evolve, businesses increase their dependencies on digital operations, and geopolitical tensions continue to have widespread impact,\" she tells Dark Reading. \"It is paramount for insurers to be familiar with the terms of their policy and seek clarification where needed, but also opt for modern cyber-policies that can evolve and adapt at the pace their risk and exposures do.\"There's one glaring issue in making war exclusions stick for cyber insurance: the difficulty in proving that attacks are indeed \"acts of war\" — a burden that generally requires determining on whose behalf they're carried out.In the best of cases, attribution is more of an art than a science, with a shifting set of criteria underpinning any confident finger-pointing. Rationales for advanced persistent threat (APT) attribution often rely on far more than quantifiable technology artifacts, or overlaps in infrastructure and tooling with known threats.\"What is shocking to me is the idea of verifying that these attacks can be reasonably attributed to a state — how?\" says Philippe Humeau, CEO and co-founder of CrowdSec. \"It is well known that you can hardly track a decently skilled cybercriminal's base of operations, since air-gapping their operations is the first line of their playbook. Two, governments are not willing to actually admit they do provide cover for the cybercriminals in their countries. Three, cybercriminals in many parts of the world are usually some mix of corsairs and mercenaries, faithful to whatever entity/nation-state may be funding them, but totally expandable and deniable if there are ever questions about their affiliation.\"That's why, absent a government taking responsibility for an attack a la terrorism groups, most threat-intelligence firms will caveat state-sponsored attribution with phrases like, \"we determine with low/moderate/high confidence that XYZ is behind the attack,\" and, to boot, different firms may determine different sources for any given attack. If it's that difficult for professional cyber-threat-hunters to pin down the culprits, imagine how difficult it is for cyber-insurance adjusters operating with a fraction of the skills.If the standard for proof of an act of war is wide governmental consensus, this also poses issues, Humeau says.\"Accurately attributing attacks to nation-states would require cross-country legal cooperation, which has historically proven to be both difficult and slow,\" says Humeau. \"So the idea of attributing these attacks to nation-states who will never 'fess up to it leaves too much room for doubt, legally speaking.\"To Thompson's point, one of the realities in today's environment is the sheer volume of state-sponsored cyber activity in circulation. Bryan Cunningham, attorney and advisory council member at data security company Theon Technology, notes that if more and more insurers simply deny all claims stemming from such activity, there could be very few payouts indeed. And, ultimately, companies may not see cyber-insurance premiums as worth it anymore.\"If a significant number of judges actually begin allowing carriers to exclude coverage for cyberattacks just upon a claim that a nation-state was involved, this will be as devastating to the cyber insurance ecosystem as 9/11 was (temporarily) to commercial real estate,\" he says. \"As a result, I do not think many judges will buy this, and proof, in any event, will almost always be difficult.\"In a different vein, Ilia Kolochenko, chief architect and CEO of ImmuniWeb, notes that the cybercriminals will find a way to use the exclusions to their advantage — undercutting the value of having a policy even further.\"The problem stems from a possible impersonation of well-known cyber-threat actors,\" he says. \"For instance, if cybercriminals — unrelated to any state — wish to amplify the damage caused to their victims by excluding the eventual insurance coverage, they may simply try to impersonate a famous state-backed hacking group during their intrusion. This will undermine trust in the cyber-insurance market, as any insurance may become futile in the most serious cases that actually require the coverage and justify the premiums paid.\"Even though the Mondelez-Zurich American settlement would seem to indicate that the insurer succeeded in at least partially making its point (or perhaps neither side had the stomach for incurring further legal costs), there is conflicting legal precedent.Even so, success for such policies remains to be seen.\"Lloyd's, and other carriers, are working on making such exclusions stronger and absolute, but I think this, too, ultimately will fail because the cyber-insurance industry likely could not survive such changes for long,\" Theon's Cunningham says.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   }
]