[
   {
      "time": "2022-11-25",
      "title": "Black Basta Ransomware Gang Actively Infiltrating U.S. Companies with Qakbot Malware",
      "text": " Companies based in the U.S. have been at the receiving end of an \"aggressive\" Qakbot malware campaign that leads to Black Basta ransomware infections on compromised networks.Black Basta, which emerged in April 2022, follows the tried-and-tested approach of double extortion to steal sensitive data from targeted companies and use it as a leverage to extort cryptocurrency payments by threatening to release the stolen information.The intrusion activity observed by Cybereason cuts out Brute Ratel C4 from the equation, instead using Qakbot to directly distribute Cobalt Strike on several machines in the infected environment.The attack chain commences with a spear-phishing email bearing a malicious disk image file that, when opened, kickstarts the execution of Qbot, which, for its part, connects to a remote server to retrieve the Cobalt Strike payload.At this stage, credential harvesting and lateral movement activities are carried out to place the red team framework on several servers, before breaching as many endpoints as possible using the collected passwords and launching the Black Basta ransomware.\"The threat actor obtained domain administrator privileges in less than two hours and moved to ransomware deployment in less than 12 hours,\" the researchers noted, adding over 10 different customers were impacted by the fresh set of attacks in the past two weeks.In two instances spotted by the Israeli cybersecurity company, the intrusions not only deployed the ransomware but also locked the victims out of their networks by disabling the DNS service in a bid to make recovery more challenging.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-25",
      "title": "Millions of Android Devices Still Don't Have Patches for Mali GPU Flaws",
      "text": " A set of five medium-severity security flaws in Arm's Mali GPU driver has continued to remain unpatched on Android devices for months, despite fixes released by the chipmaker.Google Project Zero, which discovered and reported the bugs, said Arm addressed the shortcomings in July and August 2022.CVE-2022-33917CVE-2022-36449A successful exploitation of the flaws could permit an attacker with permissions to execute native code in an app context to seize control of the system and bypass Android's permissions model to gain broad access to user data.The findings once again highlight how patch gaps can render millions of devices vulnerable at once and put them at risk of heightened exploitation by threat actors.\"Just as users are recommended to patch as quickly as they can once a release containing security updates is available, so the same applies to vendors and companies,\" Beer said.\"Companies need to remain vigilant, follow upstream sources closely, and do their best to provide complete patches to users as soon as possible.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-25",
      "title": "Docker Hub repositories hide over 1,650 malicious containers",
      "text": " Over 1,600 publicly available Docker Hub images hide malicious behavior, including cryptocurrency miners, embedded secrets that can be used as backdoors, DNS hijackers, and website redirectors.Docker Hub is a cloud-based container library allowing people to freely search and download Docker images or upload their creations to the public library or personal repositories.Docker images are templates for the quick and easy creation of containers that contain ready-to-use code and applications. Therefore, those looking to set up new instances often turn to Docker Hub to quickly find an easily deployable application.Unfortunately, due to abuse of the service by threat actors, over a thousand malicious uploads introduce severe risks to unsuspecting users deploying malware-laden images on locally hosted or cloud-based containers.Many malicious images use names that disguise them as popular and trustworthy projects, so threat actors clearly uploaded them to trick users into downloading them.Researchers at Sysdig looked into the issue, trying to evaluate the scale of the problem, and reported on the found images that feature some form of malicious code or mechanism.Apart from images reviewed by the Docker Library Project, which are verified to be trustworthy, hundreds of thousands of images with an unknown status are on the service.Sysdig used its automated scanners to scrutinize 250,000 unverified Linux images and identified 1,652 of them as malicious.The largest category was that of crypto-miners, found in 608 container images, targeting server resources to mine cryptocurrency for the threat actors.The second most-common occurrence were images hiding embedded secrets, measuring 281 cases. The secrets embedded in these images are SSH keys, AWS credentials, GitHub tokens, NPM tokens, and others.Sysdig comments that these secrets may have been left on public images by mistake or intentionally injected by the threat actor who created and uploaded them.“For instance, uploading a public key to a remote server allows the owners of the corresponding private key to open a shell and run commands via SSH, similar to implanting a backdoor.”Many malicious images discovered by Sysdig used typosquatting to impersonate legitimate and trusted images, only to infect users with crypto-miners.This tactic lays the ground for some highly successful cases, like the two examples shown below, that have been downloaded almost 17,000 times.Typosquatting also ensures that users mistyping the name of a popular project will download a malicious image, so while this doesn’t produce large victim counts, it still ensures a steady stream of infections.Sysdig says that in 2022, 61% of all images pulled from Docker Hub come from public repositories, a 15% rise from 2021 stats, so the risk for users is on the rise.Unfortunately, the size of the Docker Hub public library does not allow its operators to scrutinize all uploads daily; hence many malicious images go unreported.Sysdig also noticed that most threat actors only upload a couple of malicious images, so even if a risky image is removed and the uploader is banned, it doesn’t significantly impact the platform’s threat landscape."
   },
   {
      "time": "2022-11-25",
      "title": "Rise of Luna Moth’s Malware-Free Extortion Campaign - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-11-25",
      "title": "Interpol seized $130 million from cybercriminals worldwide",
      "text": " INTERPOL has announced the seizure of $130,000,000 million worth of money and virtual assets linked to various cybercrimes and money laundering operations.The law enforcement operation is codenamed \"HAECHI III\" and lasted between June 28 and November 23, 2022, allowing INTERPOL to arrest almost a thousand suspects.\"In addition, almost 2,800 bank and virtual-asset accounts linked to the illicit proceeds of online financial crime were blocked.\"The types of cybercrimes that generated the said amount include romance scams, voice phishing, sextortion, investment fraud, and money laundering associated with illegal online gambling.As a result of the action, INTERPOL also generated 95 notices and diffusions while also detecting sixteen new crime trends that will help law enforcement around the globe take more targeted action against cybercriminals.The new trends involve variations of romance scams and investment frauds that malicious actors constantly evolve to maintain an element of novelty.Moreover, INTERPOL observed a rise in encrypted messaging apps used by scammers for exchanging information with victims in investment schemes.Two highlights of operation HAECHI III are:Thanks to ARRP, an Irish company that fell victim to business email compromise (BEC) scammers had $1,250,000 million returned to them. This was the total amount the company lost to the BEC scammers, which ARRP helped trace and seize.Since January 2022, when the pilot testing phase of ARRP started, the tool has helped recover $120,000,000 in cybercriminal proceeds."
   },
   {
      "time": "2022-11-25",
      "title": "European Parliament faces cyberattack from pro-Russia group after terrorism declaration",
      "text": " The website for the European Parliament was down for about an hour after a pro-Russian hacking group targeted it with a distributed denial-of-service (DDoS) attack.Roberta Metsola, president of the European Parliament, and several other officials confirmed the cyberattacks.“The European Parliament is under a sophisticated cyberattack. A pro-Kremlin group has claimed responsibility. Our IT experts are pushing back against it & protecting our systems. This, after we proclaimed Russia as a State-sponsor of terrorism. My response: #SlavaUkraini,” she said. “This traffic is related to a DDOS attack (Distributed Denial of Service) event. EP teams are working to resolve this issue as quickly as possible,” he explained. In a Telegram group, the pro-Russian hacking group Killnet touted their attack on the website and said it was explicitly launched because of the terrorism declaration. “Strap-on shelling of the server part of the official website of the European Parliament!” the group said among several other insults directed toward the EU. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-25",
      "title": "U.S. govt seizes domains used in 'pig butchering' scams",
      "text": " For the first time, the U.S. Department of Justice seized seven domains that hosted websites linked to \"pig butchering\" scams, where fraudsters trick victims of romance scams into investing in cryptocurrency via fake investment platforms.The list of domains seized includes simexcbr.com, simexlua.com, simexwim.com, simexarts.com, simexrue.com, simexvtn.com, and simexbiz.com, all of them spoofing the one used by the Singapore International Monetary Exchange (SIMEX).While originating from Asia, pig butchering scams have spread globally after cryptocurrency scammers realized that users of dating apps and social media sites (the \"pigs\") make for easy targets after building trust using various social engineering tactics.Once \"hooked,\" the victims are handled by other members of the cybercrime ring who also run fraudulent cryptocurrency investment platforms.After being asked to invest and transfer the funds via prepaid cards, wire transfers, and cryptocurrency payments to attacker-controlled wallets or via ATMs, the scammers shut down their fake crypto investment portal and vanish with the victims' money.As the U.S. Justice Department revealed in a press release this week, the fraud ring that used the seven seized domains tricked five victims into transferring more than $10 million to cryptocurrency deposit addresses immediately emptied by the scammers.For instance, in August 2022, one of the victims told the investigators that one of the fraudsters—who reached out via LINE and WeChat mobile messengers—promoted a cryptocurrency investment platform using the simexlua.com domain.After being tricked in May 2022 into installing a fake investment app and initially making a small $400 investment, the victims transferred roughly $9.6 million worth of USD Coin (USDC) to a deposit address provided by the scammers.When the victim tried to withdraw some of the fake profits, totaling over $7 million per the fake in-app alerts, the scammers asked for additional payments of \"taxes,\" \"fees,\" and \"security deposits\" to prove they were \"not involved in any illegal behavior.\"\"After the victims transferred investments into the deposit addresses that the scammers provided through the seven seized domain names, the victims' funds were immediately transferred through numerous private wallets and swapping services in an effort to conceal the source of the funds. In total, the victims lost over $10 million.\"The FBI also recently warned about pig butchering scams highlighting its emergence as a highly profitable scheme worldwide where cybercriminals steal ever-increasing amounts of cryptocurrency from unsuspecting investors.\"The use of cryptocurrency and cryptocurrency ATMs is also an emerging method of payment. Individual losses related to these schemes ranged from tens of thousands to millions of dollars.\"The FBI also shared a list of some red flags that should let wannabe investors know they're the target of a \"pig butchering\" scam:"
   },
   {
      "time": "2022-11-25",
      "title": "'iSpoof' service dismantled, main operator and 145 users arrested",
      "text": " The 'iSpoof' online spoofing service has been dismantled following an international law enforcement investigation that also led to the arrest of 146 people, including the suspected mastermind of the operation.Over a hundred of these arrests, including that of the platform's leader, were made by London's Metropolitan Police.iSpoof offered cybercriminals so-called \"spoofing\" servers which allowed them to mask their phone numbers with one belonging to a trusted organization, making it appear to the victims as if their bank called them.This call number spoofing made it possible for the crooks to conduct social engineering, phishing, and carry out \"bank helpdesk\" scams, stealing money, banking account credentials, and one-time codes.\"The users were able to impersonate an infinite number of entities (such as banks, retail companies, and government institutions) for financial gain and substantial losses to victims.\"According to the announcement of the Metropolitan Police, between June 2021 and July 2022, iSpoof was used to make 10 million fraudulent calls worldwide.Europol reports that iSpoof caused approximately $120,000,000 in losses, with the service's operators raking in estimated profits of $3,850,000 in the last 16 months.This led to a new investigation focusing on the service, which led to the discovery of the iSpoof operator's location in London. They then informed Scotland Yard, which started its own in-depth investigation into the suspect.Next, the police in the Netherlands placed a \"tap\" on the servers in Almere and gathered insight into how the service worked and who used it.The UK police say the covert operation of tracking iSpoof closely started in June 2021, helping the law enforcement authorities map the criminal network.Europol got involved in August 2021 to help the UK police collect evidence and intelligence from global law enforcement partners.In the framework of its analytical work, Europol was able to identify additional users of the iSpoof service, a number of which were already known for their involvement in other high-profile cybercrime investigations at the European level. — EuropolThe owner of iSpoof was arrested on Sunday, November 6, 2022, in East London, and known iSpoof websites like \"ispoof.cc\" and \"ispoof.me\" were seized.The administrators of the servers in Almere, two men, aged 19 and 22, were also arrested. The Dutch police underline they're now deanonymizing more service users based on evidence collected from the seized servers.Following iSpoof's takedown, the service's users from dark web forums have been advised to \"throw everything away.\""
   },
   {
      "time": "2022-11-25",
      "title": "34 Russian Cybercrime Groups Stole Over 50 Million Passwords with Stealer Malware",
      "text": " As many as 34 Russian-speaking gangs distributing information-stealing malware under the stealer-as-a-service model stole no fewer than 50 million passwords in the first seven months of 2022.Aside from looting passwords, the stealers also harvested 2.11 billion cookie files, 113,204 crypto wallets, and 103,150 payment cards.A majority of the victims were located in the U.S., followed by Brazil, India, Germany, Indonesia, the Philippines, France, Turkey, Vietnam, and Italy. In total, over 890,000 devices in 111 countries were infected during the time frame.These groups, which are active on Telegram and have around 200 members on average, are hierarchical, consisting of administrators and workers (or traffers), the latter of whom are responsible for driving unsuspecting users to info-stealers like RedLine and Raccoon.This is achieved by setting up bait websites that impersonate well-known companies and luring victims into downloading malicious files. Links to such websites are, in turn, embedded into YouTube video reviews for popular games and lotteries on social media, or shared directly with NFT artists.\"Administrators usually give workers both RedLine and Racoon in exchange for a share of the stolen data or money,\" the company said. \"Some groups use three stealers at the same time, while others have only one stealer in their arsenal.\"Following a successful compromise, the cyber criminals peddle the stolen information on the dark web for monetary gain.The development highlights the crucial role played by Telegram in facilitating a range of criminal activities, including functioning as a hub for announcing product updates, offering customer support, and exfiltrating data from compromised devices.\"The popularity of schemes involving stealers can be explained by the low entry barrier,\" Group-IB explained. \"Beginners do not need to have advanced technical knowledge as the process is fully automated and the worker's only task is to create a file with a stealer in the Telegram bot and drive traffic to it.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-25",
      "title": "Hackers Exploiting Abandoned Boa Web Servers to Target Critical Industries",
      "text": " Microsoft on Tuesday disclosed the intrusion activity aimed at Indian power grid entities earlier this year likely involved the exploitation of security flaws in a now-discontinued web server called Boa.The cybersecurity firm attributed the attacks to a previously undocumented threat cluster called Threat Activity Group 38. While the Indian government described the attacks as unsuccessful \"probing attempts,\" China denied it was behind the campaign.Although the exact initial infection vector used to breach the networks remains unknown, the ShadowPad implant was controlled by using a network of compromised internet-facing DVR/IP camera devices.Microsoft said its own investigation into the attack activity uncovered Boa as a common link, assessing that the intrusions were directed against exposed IoT devices running the web server.\"Despite being discontinued in 2005, the Boa web server continues to be implemented by different vendors across a variety of IoT devices and popular software development kits (SDKs),\" the company said.\"Without developers managing the Boa web server, its known vulnerabilities could allow attackers to silently gain access to networks by collecting information from files.\"The latest findings once again underscore the supply chain risk arising out of flaws in widely-used network components, which could expose critical infrastructure to breaches via publicly-accessible devices running the vulnerable web server.Microsoft further said it detected more than one million internet-exposed Boa server components worldwide in a single week, with significant concentrations in India.The pervasive nature of Boa servers is attributed to the fact that they are integrated into widely-used SDKs, such as those from RealTek, which are then bundled with devices like routers, access points, and repeaters.Weaponizing these unpatched shortcomings could further enable threat actors to glean more information about the targeted IT environments, effectively making way for disruptive attacks.\"The popularity of the Boa web server displays the potential exposure risk of an insecure supply chain, even when security best practices are applied to devices in the network,\" Microsoft said.\"As attackers seek new footholds into increasingly secure devices and networks, identifying and preventing distributed security risks through software and hardware supply chains, like outdated components, should be prioritized by organizations.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-25",
      "title": "Bahamut cybermercenary group targets Android users with fake VPN apps",
      "text": " \n      Award-winning news, views, and insight from the ESET security community\n    \n        Award-winning news, views, and insight from the ESET security community\n      ESET ResearchMalicious apps used in this active campaign exfiltrate contacts, SMS messages, recorded phone calls, and even chat messages from apps such as Signal, Viber, and Telegram\n23 Nov 2022\n • \n, \n11 min. read\nESET researchers have identified an active campaign targeting Android users, conducted by the Bahamut APT group. This campaign has been active since January 2022 and malicious apps are distributed through a fake SecureVPN website that provides only Android apps to download. Note that although the malware employed throughout this campaign uses the name SecureVPN, it has no association whatsoever with the legitimate, multiplatform SecureVPN software and service.\nKey points of this blogpost:\n\nThe app used has at different times been a trojanized version of one of two legitimate VPN apps, SoftVPN or OpenVPN, which have been repackaged with Bahamut spyware code that the Bahamut group has used in the past.\nWe were able to identify at least eight versions of these maliciously patched apps with code changes and updates being made available through the distribution website, which might mean that the campaign is well maintained.\nThe main purpose of the app modifications is to extract sensitive user data and actively spy on victims’ messaging apps.\nWe believe that targets are carefully chosen, since once the Bahamut spyware is launched, it requests an activation key before the VPN and spyware functionality can be enabled. Both the activation key and website link are likely sent to targeted users.\nWe do not know the initial distribution vector (email, social media, messaging apps, SMS, etc.).\n\nThe malware is able to exfiltrate sensitive data such as contacts, SMS messages, call logs, device location, and recorded phone calls. It can also actively spy on chat messages exchanged through very popular messaging apps including Signal, Viber, WhatsApp, Telegram, and Facebook Messenger; the data exfiltration is done via the keylogging functionality of the malware, which misuses accessibility services. The campaign appears to be highly targeted, as we see no instances in our telemetry data.The Bahamut APT group typically targets entities and individuals in the Middle East and South Asia with spearphishing messages and fake applications as the initial attack vector. Bahamut specializes in cyberespionage, and we believe that its goal is to steal sensitive information from its victims. Bahamut is also referred to as a mercenary group offering hack-for-hire services to a wide range of clients. The name was given to this threat actor, which appears to be a master in phishing, by the Bellingcat investigative journalism group. Bellingcat named the group after the enormous fish floating in the vast Arabian Sea mentioned in the Book of Imaginary Beings written by Jorge Luis Borges. Bahamut is frequently described in Arabic mythology as an unimaginably enormous fish.The group has been the subject of several publications in recent years, including:The initial fake SecureVPN app we analyzed was uploaded to VirusTotal on 2022-03-17, from an IP address that geolocates to Singapore, along with a link to a fake website that triggered one of our YARA rules.The malicious Android application used in this campaign was delivered via the website thesecurevpn[.]com (see Figure 1), which uses the name – but none of the content or styling – of the legitimate SecureVPN service (at the domain securevpn.com).Figure 1. Fake SecureVPN website provides a trojanized app to download Figure 2. Free website template used to create the distribution website for the fake VPN appthesecurevpn[.]com was registered on 2022-01-27; however, the time of initial distribution of the fake SecureVPN app is unknown. The malicious app is provided directly from the website and has never been available at the Google Play store.Figure 3. Class name comparison between the earlier malicious SecureChat package (left) and fake SecureVPN package (right)Comparing Figure 4 and Figure 5, you can see the similarities in SQL queries in the earlier SecureChat malware, attributed to Bahamut, and the fake SecureVPN malware.Figure 4. The SQL queries used in malicious code from the earlier SecureChat campaignFigure 5. The SQL queries used in malicious code in the fake SecureVPN campaignAs such, we believe that the fake SecureVPN application is linked to the Bahamut group.Since the distribution website has been online, there have been at least eight versions of the Bahamut spyware available for download. These versions were created by the threat actor, where the fake application name was followed by the version number. We were able to pull the following versions from the server, where we believe the version with the lowest version suffix was provided to potential victims in the past, while more recently higher version numbers (secureVPN_104.apk, SecureVPN_105.apk, SecureVPN_106.apk, SecureVPN_107.apk, SecureVPN_108.apk, SecureVPN_109.apk, SecureVPN_1010.apk, secureVPN_1010b.apk) have been used.We divide these versions into two branches, since Bahamut’s malicious code was placed into two different legitimate VPN apps.Figure 6. Fake SecureVPN v1.0.4 with malicious code included into SoftVPN as parent applicationFigure 7. Fake SecureVPN v1.0.9 (SecureVPN_109) with malicious code included into OpenVPN as its parent application even though the hardcoded VERSION_NAME (1.0.0) wasn’t changed between versionsBesides the split in these two branches, where the same malicious code is implanted into two different VPN apps, other fake SecureVPN version updates contained only minor code changes or fixes, with nothing significant considering its overall functionality.The reason why the threat actor switched from patching SoftVPN to OpenVPN as its parent app is not clear; however, we suspect that the reason might be that the legitimate SoftVPN app stopped working or being maintained and was no longer able to create VPN connections – as confirmed by our testing of the latest SoftVPN app from Google Play. This could be a reason for Bahamut to switch to using OpenVPN, since potential victims might uninstall a non-working VPN app from their devices. Changing one parent app to another likely required more time, resources, and effort to successfully implement by the threat actor.Malicious code packaged with the OpenVPN app was implemented a layer above the VPN code. That malicious code implements spyware functionality that requests an activation key and then checks the supplied key against the attacker’s C&C server. If the key is successfully entered, the server will return a token that is necessary for successful communication between the Bahamut spyware and its C&C server. If the key is not correct, neither Bahamut spyware nor VPN functionality will be enabled. Unfortunately, without the activation key, dynamic malware analysis sandboxes might not flag it as a malicious app.In Figure 8 you can see an initial activation key request and in Figure 9 the network traffic behind such a request and the response from the C&C server.Figure 8. Fake SecureVPN requests activation key before enabling VPN and spyware functionsFigure 9. Fake SecureVPN activation request and its C&C server’s responseThe campaigns using the fake SecureVPN app try to keep a low profile, since the website URL is most likely delivered to potential victims with an activation key, which is not provided on the website. Unfortunately, we were not able to obtain a working key.The activation key layer does not belong to the original OpenVPN functionality, and we do not recognize it as code from any other legitimate app. We believe it was developed by Bahamut, since it also communicates with their C&C server.If the Bahamut spyware is enabled, then it can be remotely controlled by Bahamut operators and can exfiltrate various sensitive device data such as:Figure 10. Fake SecureVPN request to manually enable Accessibility servicesAll exfiltrated data is stored in a local database and then sent to the C&C server. The Bahamut spyware functionality includes the ability to update the app by receiving a link to a new version from the C&C server.The mobile campaign operated by the Bahamut APT group is still active; it uses the same method of distributing its Android spyware apps via websites that impersonate or masquerade as legitimate services, as has been seen in the past. Further, the spyware code, and hence its functionality, is the same as in previous campaigns, including collecting data to be exfiltrated in a local database before sending it to the operators’ server, a tactic rarely seen in mobile cyberespionage apps.It appears that this campaign has maintained a low profile, as we see no instances in our telemetry data. This is probably achieved through highly targeted distribution, where along with a link to the Bahamut spyware, the potential victim is supplied an activation key, which is required to enable the malware’s spying functionality.\n\n\nSHA-1\nPackage name\nESET detection name\nDescription\n\n\n\n\n3144B187EDF4309263FF0BCFD02C6542704145B1\ncom.openvpn.secure\nAndroid/Spy.Bahamut.M\nOpenVPN app repackaged with Bahamut spyware code.\n\n\n2FBDC11613A065AFBBF36A66E8F17C0D802F8347\ncom.openvpn.secure\nAndroid/Spy.Bahamut.M\nOpenVPN app repackaged with Bahamut spyware code.\n\n\n2E40F7FD49FA8538879F90A85300247FBF2F8F67\ncom.secure.vpn\nAndroid/Spy.Bahamut.M\nSoftVPN app repackaged with Bahamut spyware code.\n\n\n1A9371B8AEAD5BA7D309AEBE4BFFB86B23E38229\ncom.secure.vpn\nAndroid/Spy.Bahamut.M\nSoftVPN app repackaged with Bahamut spyware code.\n\n\n976CC12B71805F4E8E49DCA232E95E00432C1778\ncom.secure.vpn\nAndroid/Spy.Bahamut.M\nSoftVPN app repackaged with Bahamut spyware code.\n\n\nB54FFF5A7F0A279040A4499D5AABCE41EA1840FB\ncom.secure.vpn\nAndroid/Spy.Bahamut.M\nSoftVPN app repackaged with Bahamut spyware code.\n\n\nC74B006BADBB3844843609DD5811AB2CEF16D63B\ncom.secure.vpn\nAndroid/Spy.Bahamut.M\nSoftVPN app repackaged with Bahamut spyware code.\n\n\n4F05482E93825E6A40AF3DFE45F6226A044D8635\ncom.openvpn.secure\nAndroid/Spy.Bahamut.M\nOpenVPN app repackaged with Bahamut spyware code.\n\n\n79BD0BDFDC3645531C6285C3EB7C24CD0D6B0FAF\ncom.openvpn.secure\nAndroid/Spy.Bahamut.M\nOpenVPN app repackaged with Bahamut spyware code.\n\n\n7C49C8A34D1D032606A5E9CDDEBB33AAC86CE4A6\ncom.openvpn.secure\nAndroid/Spy.Bahamut.M\nOpenVPN app repackaged with Bahamut spyware code.\n\n\n\n\n\nIP\nDomain\nFirst seen\nDetails\n\n\n\n\n104.21.10[.]79\nft8hua063okwfdcu21pw[.]de\n2022-03-20\nC&C server\n\n\n172.67.185[.]54\nthesecurevpn[.]com\n2022-02-23\nDistribution website\n\n\n\n      Sign up for our newsletters\n    ESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-BaltistanESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-Baltistan • ESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its graveESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its grave • ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023 • \n            Award-winning news, views, and insight from the ESET security community\n          "
   }
]