[
   {
      "time": "2023-11-16",
      "title": "TA402 Uses Complex IronWind Infection Chains to Target Middle East-Based Government Entities  | Proofpoint US",
      "text": " Disarm BEC, phishing, ransomware, supply chain threats and more.Defend your data from careless, compromised and malicious users.Prevent identity risks, detect lateral movement and remediate identity threats in real time.Reduce risk, control costs and improve data visibility to ensure compliance.Leverage proactive expertise, operational continuity and deeper insights from our skilled experts.  AI-powered protection against BEC, ransomware, phishing, supplier risk and more with inline+API or MX-based deploymentProtect your people from email and cloud threats with an intelligent and holistic approach.Help your employees identify, resist and report attacks before the damage is done.Prevent data loss via negligent, compromised and malicious insiders by correlating content, behavior and threats.Manage risk and data retention needs with a modern compliance and archiving solution.Keep your people and their cloud apps secure by eliminating threats, avoiding data loss and mitigating compliance risk.Learn about this growing threat and stop attacks by securing today’s top ransomware vector: email.Implement the very best security and compliance solution for your Microsoft 365 collaboration suite.Secure access to corporate resources and ensure business continuity for your remote workers.Today’s cyber attacks target people. Learn about our unique people-centric approach to protection.Become a channel partner. Deliver Proofpoint solutions to your customers and grow your business.Learn about the benefits of becoming a Proofpoint Extraction Partner.Learn about our global consulting and services partners that deliver fully managed and integrated solutions.Learn about our relationships with industry-leading firms to help protect your people, data and brand.Learn about the technology and alliance partners in our Social Media Protection Partner program.Small Business Solutions for channel partners and MSPs.Find the information you're looking for in our library of videos, data sheets, white papers and more.Keep up with the latest news and happenings in the ever‑evolving cybersecurity landscape.Learn about the human side of cybersecurity. Episodes feature insights from experts and executives.Get the latest cybersecurity insights in your hands – featuring valuable knowledge from our own industry experts.Learn about the latest security threats and how to protect your people, data, and brand.Connect with us at events to learn how to protect your people and data from ever‑evolving threats.Read how Proofpoint customers around the globe solve their most pressing cybersecurity challenges.Browse our webinar library to learn about the latest threats, trends and issues in cybersecurity.Get free research and resources to help you protect against threats, build a security culture, and stop ransomware in its tracks.Proofpoint is a leading cybersecurity company that protects organizations' greatest assets and biggest risks: their people.Today’s cyber attacks target people. Learn about our unique people-centric approach to protection.Stand out and make a difference at one of the world's leading cybersecurity companies.Read the latest press releases, news stories and media highlights about Proofpoint.Learn about how we handle data and make commitments to privacy and other regulations.Learn about our people-centric principles and how we implement them to positively impact our global community.Access the full range of Proofpoint support services.In mid-2023, Proofpoint researchers first identified TA402 (Molerats, Gaza Cybergang, Frankenstein, WIRTE) activity using a labyrinthine infection chain to target Middle Eastern governments with a new initial access downloader Proofpoint has dubbed IronWind. From July through October 2023, TA402 utilized three variations of this infection chain—Dropbox links, XLL file attachments, and RAR file attachments—with each variant consistently leading to the download of a DLL containing the multifunctional malware. In these campaigns, TA402 also pivoted away from its use of cloud services like Dropbox API, which Proofpoint researchers observed in activity from 2021 and 2022, to using actor-controlled infrastructure for C2 communication.  As of late October 2023, Proofpoint researchers had not observed any changes in targeting by   TA402, an APT group that historically has operated in the interests of the Palestinian Territories, nor identified any indications of an altered mandate despite the current conflict in the region. It remains possible that this threat actor will redirect its resources as events continue to unfold.   Figure 1. TA402 infection chain used from November 2021 to January 2022.  Figure 2. TA402 infection chain used in July 2023 campaign. The .NET executable continued to use HTTPS POSTs and GETs to theconomics[.]net for C2 and received JSON responses. It passed authentication via a custom UserAgent string, \"Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:<tag>) Gecko/<auth> Firefox/3.15\" and almost certainly would have downloaded additional shellcode payloads. Based on Proofpoint analysis, this UserAgent is unique enough to be used for detection purposes. Proofpoint researchers did not observe the fifth stage at the time of analysis but took note that the last stage payload contained unused code, suggesting TA402 may be making further updates and adjustments to the malware.  August 2023 activity: In August 2023, TA402 shifted to sending an attached XLL file to load IronWind using “قائمة الأشخاص والكيانات (المصنفة إرهابية) من قبل هيئة مكافحة غسيل الأموال وتمويل الإرهاب” as a lure instead of using a malicious PPAM file delivered via Drobox. The machine translation of the lure is as follows: “List of persons and entities (designated as terrorists) by the Anti-Money Laundering and Terrorist Financing Authority.” TA402 used the same compromised Ministry of Foreign Affairs email account observed in the July activity. As part of the initial infection process, TA402 sent a base64 encoded check in to Request Inspector—a third-party service for creating endpoints for HTTP requests—to exfiltrate some system information. October 2023 activity: In October 2023, TA402 shifted a portion of its infection chain yet again. This time the threat actor sent a RAR file attachment that contained a renamed version of tabcal.exe for sideloading IronWind and propsys.dll (IronWind) instead of using a malicious PPAM file delivered via Dropbox or an attached XLL file to load the malware. The delivered malware again used Request Inspector for initial check in and a new TA402 C2 domain, inclusive-economy[.]com.  TA402 also continued to leverage a compromised Ministry of Foreign Affairs email account to send phishing emails with the lure \"تقريــر وتوصيــات الـدورة (110) بخصوص الحرب على غزة,” which translates to “Report and Recommendations of the 110th Session on the War on Gaza.” Currently, TA402 only appears to be using the conflict for lure purposes. Additionally, TA402 continues to phish, indicating the conflict has not significantly disrupted the group’s operations. During malware analysis, Proofpoint researchers identified TA402 had failed to sanitize the group’s PDB paths during malware development for multiple stages. A YARA rule for hunting purposes is attached at the end of this blog.  Based on the following PDB paths, Proofpoint researchers assess with moderate confidence that the IronWind malware project name is \\tornado\\ and malware development is broken out by function, including IA (the IronWind dropper), stager (the stager DLL), and payloads.  TA402 regularly employs geofencing techniques to make detection of its malicious activity more difficult. This aspect of the threat actor’s tactics, techniques, and procedures has remained consistent since at least 2020. Even with the more elaborate infection chains observed in 2023, TA402 continues to include URLs that will at times redirect to decoy documents hosted on legitimate document hosting platforms if the geofencing is not bypassed.   Proofpoint researchers attributed the campaigns to TA402 based on tactics, techniques, and victimology. The 2023 campaigns share similarly themed lures as historical TA402 activity and retain a focus on Arabic-speaking targets located in the Middle East. Over the years, TA402 has consistently targeted government entities based in the Middle East and North Africa, at times going after the same targets repeatedly. TA402’s use of compromised Ministry of Foreign Affairs email accounts, geofencing, and decoy documents additionally contributed to the attribution. Based on Proofpoint’s tracking of this threat actor since 2020, TA402 remains a persistent and innovative threat actor that routinely retools its attack methods and malware in support of its cyber espionage mandate. Its ongoing use of geofencing and decoy documents continues to serve its detection evasion efforts. While TA402 is an intelligence collection focused threat actor with a specific interest in Middle Eastern and North African government entities, the group could find itself under direction to adjust its targeting or social engineering lures in reaction to the ongoing Israel-Hamas conflict.  INDICATOR TYPE 9b2a16cbe5af12b486d31b68ef397d6bc48b2736e6b388ad8895b588f1831f47   5d773e734290b93649a41ccda63772560b4fa25ba715b17df7b9f18883679160   19f452239dadcd7544f055d26199cb482c1f6ae5486309bde1526174e926146a   A4bf96aee6284effb4c4fe0ccfee7b32d497e45408e253fb8e1199454e5c65a3   26cb6055be1ee503f87d040c84c0a7cacb245b4182445e3eee47ed6e073eca47   cbb89aac5a2c93a02305846f9353b013e6703813d4b6baff8eb89ee938647af3   c98dc0b930ea67992921d9f0848713deaa5bba8b4ba21effd0b00595dd9ed28c   ac227dd5c97a36f54e4fa02df4e4c0339b513e4f8049616e2a815a108e34552f   6ab5a0b7080e783bba9b3ec53889e82ca4f2d304e67bd139aa267c22c281a368   e2ba2d3d2c1f0b5143d1cd291f6a09abe1c53e570800d8ae43622426c1c4343c   d8cde28cf2a5884daddf6e3bc26c80f66bc3737e426b4ba747d49d154999fbc1   81fc4a5b1d22efba961baa695aa53201397505e2a6024743ed58da7bf0b4a97f   3b2a6c7a39f49e790286185f2d078e17844df1349b713f278ecef1defb4d6b04   7bddde9708118f709b063da526640a4132718d3d638505aafce5a20d404b2761  883e035f893483b9921d054b3fa014cef90d90b10dcba7d342def8be2e98ce3c  4b0a48d698240504c4ff6275dc735c8162e57f92224fb1d2d6393890b82a4206  4018b462f2fcf1b0452ecd88ab64ddc5647d1857481f50fa915070f5f1858115  3d80ea70b0c00d12f2ba2c7b1541f7d0f80005a38a173e6962b24f01d4a2a1de SHA256 theconomics[.]net |191.101.78[.]189 Domain | IP (C2) inclusive-economy[.]com healthcaption[.]com Domains YARA Rule rule TA402_PDB { meta:     author = \"Proofpoint inc.\"     description = \"Finds TA402 related PDB paths\"     date = “2023-09-27”   strings: $pdb1 = \"C:\\\\Users\\\\Win\\\\Desktop\\\\Reno\\\\NewTor\" ascii wide  $pdb2 = \"C:\\\\Users\\\\User\\\\Desktop\\\\tornado\\\\\" ascii wide  $pdb3 = \"K:\\\\prj\\\\WIP\\\\C# - Payload\\\\Client-Side\\\\https\\\\client-Divided\\\\KALV\\\\obj\\\\Release\\\\KALV.pdb\" ascii wide  $pdb4 = \"K:\\\\prj\\\\WIP\\\\C# - Payload\\\\Client-Side\" ascii wide    condition: any of them } Subscribe to the Proofpoint Blog "
   },
   {
      "time": "2023-11-16",
      "title": "\r\n\tUS Government Unveils First AI Roadmap For Cybersecurity - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe US Department of Homeland Security’s (DHS) Cybersecurity and Infrastructure Security Agency (CISA) has unveiled its inaugural roadmap for artificial intelligence (AI).The initiative aligns with President Biden’s recent Executive Order, which directed DHS to globally promote AI safety standards, safeguard US networks and critical infrastructure, and address the potential weaponization of AI.The roadmap comprises five strategic lines of effort aimed at steering concrete initiatives and articulating CISA’s responsible approach to AI in cybersecurity. “DHS has a broad leadership role in advancing the responsible use of AI and this cybersecurity roadmap is one important element of our work,” commented secretary of homeland security, Alejandro N. Mayorkas. “CISA’s roadmap lays out the steps that the agency will take as part of our Department’s broader efforts to both leverage AI and mitigate its risks to our critical infrastructure and cyber defenses.”The lines of effort outlined in the roadmap include:Using AI responsibly to support CISA’s missionAssessing and assuring AI systemsProtecting critical infrastructure from malicious AI useCollaborating and communicating on key AI effortsExpanding AI expertise in the workforceThe roadmap emphasizes responsible, ethical and safe AI use, aligning with constitutional principles and relevant laws and policies.“Artificial intelligence holds immense promise in enhancing our nation’s cybersecurity, but as the most powerful technology of our lifetimes, it also presents enormous risks,” said CISA Director, Jen Easterly. “Our Roadmap for AI, focused at the nexus of AI, cyber defense and critical infrastructure, sets forth an agency-wide plan to promote the beneficial uses of AI to enhance cybersecurity capabilities.”"
   },
   {
      "time": "2023-11-16",
      "title": "FBI and CISA warn of opportunistic Rhysida ransomware attacks",
      "text": " The FBI and CISA warned today of Rhysida ransomware gang's opportunistic attacks targeting organizations across multiple industry sectors.Today's joint cybersecurity advisory provides defenders with indicators of compromise (IOCs), detection info, and Rhysida tactics, techniques, and procedures (TTPs) discovered during investigations as of September 2023.\"Observed as a ransomware-as-a-service (RaaS) model, Rhysida actors have compromised organizations in education, manufacturing, information technology, and government sectors and any ransom paid is split between the group and affiliates.\"Rhysida attackers have also been detected hacking into external-facing remote services (like VPNs that allow enterprise users to access company assets from external locations) using stolen credentials to establish initial access and maintain a presence within victims' networks.This was possible when targeting organizations that didn't have Multi-Factor Authentication (MFA) enabled by default across their environment.Furthermore, Rhysida malicious actors are known for phishing attacks and exploiting Zerologon (CVE-2020-1472), a critical vulnerability enabling Windows privilege escalation within Microsoft's Netlogon Remote Protocol.Network defenders are advised to apply mitigations outlined in today's joint advisory to minimize the likelihood and severity of ransomware incidents like Rhysida.At the very least, it is crucial to prioritize patching vulnerabilities under active exploitation, enabling MFA across all services (particularly for webmail, VPN, and critical system accounts), and using network segmentation to block lateral movement attempts."
   },
   {
      "time": "2023-11-16",
      "title": "Toronto Public Library confirms data stolen in ransomware attack",
      "text": " The Toronto Public Library (TPL) confirmed that the personal information of employees, customers, volunteers, and donors was stolen from a compromised file server during an October ransomware attack.According to TPL, the attackers stole \"a large number of files from a file server\" containing data of Toronto Public Library (TPL) and the Toronto Public Library Foundation (TPLF) employees, going back to 1998.\"Information related to these individuals was likely taken, including their name, social insurance number, date of birth and home address. Copies of government-issued identification documents provided to TPL by staff were also likely taken,\" the library said in an update to its incident report.\"Our cardholder and donor databases are not affected. However, some customer, volunteer and donor data that resided on the compromised file server may have been exposed.\"The library has yet to disclose what customer data was stolen and how many customers were affected by the data breach.TPL says it hasn't paid a ransom after the attack, and it's working with external cybersecurity experts to investigate the incident. It also reported the breach to Ontario's Information and Privacy Commissioner and filed a report with the Toronto Police.As Canada's largest public library system, TPL operates on a budget exceeding $200 million, has a membership base of 1,200,000 registered individuals, and provides access to 12 million books across 100 branch libraries throughout the city.As a TPL employee told BleepingComputer, the attack occurred overnight on October 27, disrupting numerous services by Saturday morning.We were also told that the attack had minimal impact on TPL's email services and didn't affect the library's phone system. While employees logged into their Office 365 accounts could still access their emails, those who were logged out couldn't access their email accounts.The organization's primary servers (housing sensitive data) were also not encrypted, hinting at the possibility that the Black Basta operators didn't have full access to the library's networks and data.As a precautionary measure to prevent the spread of the malware, TPL shut down all other internal systems after the attack was detected.\"The level of sophistication by its proficient ransomware operators, and reluctance to recruit or advertise on Dark Web forums, supports why many suspect the nascent Black Basta may even be a rebrand of the Russian-speaking RaaS threat group Conti, or also linked to other Russian-speaking cyber threat groups.\""
   },
   {
      "time": "2023-11-16",
      "title": "New Samsung data breach impacts UK store customers",
      "text": " Samsung Electronics is notifying some of its customers of a data breach that exposed their personal information to an unauthorized individual.The company says that the cyberattack impacted only customers who made purchases from the Samsung UK online store between July 1, 2019, and June 30, 2020.Samsung discovered the data breach two days ago, on November 13, and determined that it was the result of a hacker exploiting a vulnerability in a third-party application the company used.No details have been provided about the security issue leveraged in the attack or the vulnerable application that enabled the attacker to access Samsung customer's personal information.The notification to customers says that exposed data may include names, phone numbers, postal and email addresses. The company underlines that credentials or financial information remains unaffected by the incident.A Samsung spokesperson told BleepingComputer that the company was recently alerted of a cybersecurity incident that is limited to the UK region and does not affect data belonging to customers in the U.S., employees, or retailers.“We were recently alerted to a cybersecurity incident, which resulted in certain contact information of some Samsung UK e-store customers being unlawfully obtained. No financial data, such as bank or credit card details, or customer passwords, were impacted. The incident is limited to the UK and does not affect U.S. customers, employees or retailer data” - SamsungThe company has taken all necessary steps to address the security issue, the representative told BleepingComputer, adding that the incident has also been reported to the UK’s Information Commissioner’s Office."
   },
   {
      "time": "2023-11-16",
      "title": "\r\n\tUS Dismantles IPStorm Botnet Proxy Service - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineThe US authorities have shut down a major botnet comprising tens of thousands of infected endpoints, which cyber-criminals hired to launch various attacks anonymously.The IPStorm botnet and its infrastructure were dismantled earlier this year, according to the Department of Justice (DoJ).Its alleged administrator, Russian and Moldovan national Sergei Makinin, pleaded guilty back in September to three counts of fraud and related activity in connection with computers. Each count carries a maximum sentence of 10 years.The botnet operated from June 2019 to December 2022, turning compromised Windows, Linux, Mac and Android devices from around the world into proxies. These could then be rented out by cyber-criminals through two of Makinin’s websites: proxx.io and proxx.net.The proxies enabled threat actors to bypass security filters and anonymize their traffic as they launched various cyber-attacks on victims. According to the DoJ, a single customer could pay hundreds of dollars a month to route their traffic through the botnet.Makinin is said to have run around 23,000 such proxies as part of the botnet and admitted making at least $550,000 from the scheme.“The FBI’s cyber mission has been to impose risk and consequences on our adversaries, ensuring cyberspace is no safe space for criminal activity. This case is one example of how we are doing just that.”The FBI urged device owners to keep up to date with the latest security and software patches to mitigate the risk of their machines becoming compromised and conscripted into such a botnet."
   },
   {
      "time": "2023-11-16",
      "title": "PJ&A says cyberattack exposed data of nearly 9 million patients",
      "text": " PJ&A (Perry Johnson & Associates) is warning that a cyberattack in March 2023 exposed the personal information of almost nine million patients.PJ&A provides medical transcription services to healthcare organizations in the United States.The company said the threat actors breached their network and had access between March 27 and May 2, 2023. Its investigation revealed that the following information had been exposed to the threat actors:PJ&A began sending notices of a data breach on October 31, 2023, to alert impacted individuals that their sensitive healthcare information had been compromised.The data exposed for each person varies depending on what information they provided to the healthcare services and the type of treatment they received.The information accessed by the unauthorized party does not include financial information or account credentials.The number of impacted individuals who received care in Northwell Health's clinics and had their sensitive information exposed in this incident surpasses 3.8 million.This means another four million people whose medical data was exposed through other healthcare providers have not been notified yet.Bleeping Computer has contacted PJ&A with further questions about the attack, but a comment was not immediately available."
   },
   {
      "time": "2023-11-16",
      "title": "New PoC Exploit for Apache ActiveMQ Flaw Could Let Attackers Fly Under the Radar",
      "text": " Cybersecurity researchers have demonstrated a new technique that exploits a critical security flaw in Apache ActiveMQ to achieve arbitrary code execution in memory.It was patched by Apache in ActiveMQ versions 5.15.16, 5.16.7, 5.17.6, or 5.18.3 released late last month.\"That means the threat actors could have avoided dropping their tools to disk,\" VulnCheck said. \"They could have just written their encryptor in Nashorn (or loaded a class/JAR into memory) and remained memory resident.\"However, it's worth noting that doing so triggers an exception message in the activemq.log file, necessitating that the attackers also take steps to clean up the forensic trail.\"Now that we know attackers can execute stealthy attacks using CVE-2023-46604, it's become even more important to patch your ActiveMQ servers and, ideally, remove them from the internet entirely,\" Jacob Baines, chief technology officer at VulnCheck, said.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-16",
      "title": "Citrix Hypervisor gets hotfix for new Reptar Intel CPU flaw",
      "text": " Citrix has released hotfixes for two vulnerabilities impacting Citrix Hypervisor, one of them being the \"Reptar\" high-severity flaw that affects Intel CPUs for desktop and server systems.The Citrix Hypervisor (formerly XenServer) is an enterprise-level virtualization platform for deploying and managing virtualized environments.Known as a 'Redundant Prefix Issue', the vulnerability involves the execution of a specific instruction (REP MOVSB) with a redundant REX prefix, potentially leading to system instability, crashes, or, in rare cases, privilege escalation.Intel released microcode that corrects the problem and recommends a prompt update to mitigate this issue. However, the hardware maker also notes that the probability of real-world exploitation for CVE-2023-23583 is low.The second vulnerability Citrix fixed is CVE-2023-46835, which impacts Citrix Hypervisor 8.2 CU1 LTSR. It could be exploited to allow malicious privileged code in a guest virtual machine  (VM) to compromise an AMD-based host through a passed-through PCI device.This problem only impacts VM hosts that use an AMD CPU and which also use a PCI device passthrough."
   },
   {
      "time": "2023-11-16",
      "title": "Urgent: VMware Warns of Unpatched Critical Cloud Director Vulnerability",
      "text": " VMware is warning of a critical and unpatched security flaw in Cloud Director that could be exploited by a malicious actor to get around authentication protections.Tracked as CVE-2023-34060 (CVSS score: 9.8), the vulnerability impacts instances that have been upgraded to version 10.5 from an older version.\"This bypass is not present on port 443 (VCD provider and tenant login). On a new installation of VMware Cloud Director Appliance 10.5, the bypass is not present.\"Dustin Hartle from IT solutions provider Ideal Integrations has been credited with discovering and reporting the shortcomings.It also emphasized implementing the temporary mitigation will neither require downtime nor have a side-effect on the functionality of Cloud Director installations.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-16",
      "title": "Oil Giant Aramco Drills Down on Saudi ICS Security",
      "text": " Aramco, the national oil company of Saudi Arabia, says that it's exploring ways of strengthening cyber protections for Aramco's industrial assets and infrastructure, as well as those critical to Saudi Arabia more broadly. \"Our work with Dragos serves to accelerate our country's Vision 2030 objectives to foster economic relations with global partners and advance our digital economy,\" said Ahmad Al-Khowaiter, executive vice president of technology and innovation at Aramco, in signing the deal. The training partnership with Dragos showcases the benefits of industry collaboration, according to ESET global cybersecurity advisor Jake Moore.\"Industrial systems have long been at risk from cyberattacks, so this impressive move highlights how industries are able to future-proof their businesses by protecting themselves with collaboration,\" he says.\"OT/ICS organizations struggle to communicate effectively across different parts of the business, do not always have adequate training for internal stakeholders, and, of course, are troubled by the skills gap — which is even more prevalent in an area where OT professionals and engineers (which are also difficult to come by) are often responsible for cybersecurity,\" she says.She adds, \"ICS/OT cybersecurity is also often less mature than in the IT world, and so organizations need varying support at different stages of their journey and often cybersecurity services to help manage, assess, and develop.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   }
]