[
   {
      "time": "2022-08-12",
      "title": "VileRAT: DeathStalker’s continuous strike at foreign and cryptocurrency exchanges | Securelist",
      "text": " Solutions for:ThreatsCategories10 Aug 2022\n  minute read\t\t\t\t\t\t\t\tTable of ContentsAuthorsDeathStalker has indeed continuously leveraged and updated its VileRAT toolchain against the same type of targets since we first identified it in June 2020. While we comprehensively documented the evolution to our threat intelligence customers recently, and despite existing public indicators of compromise, we regret to note that the campaign is not only ongoing at the time of writing, but also that DeathStalker likely increased its efforts to compromise targets using this toolchain recently. We have indeed been able to identify more samples of VileRAT-associated malicious files and new infrastructure since March 2022, which may be a symptom of an increase in compromise attempts. We deemed it may be helpful to publicly expose some of our knowledge about VileRAT, to help potential targets better detect and stop such malicious activities.Back in the summer of 2020, DeathStalker’s VileRAT initial infection consisted in spear-phishing emails sent to foreign exchange companies, from fake personas (a fake diamonds trading company for instance) who shared investment interests. Should the target reply and continue with the conversation, the fake persona would at some point and upon request provide a link to a malicious file hosted on Google Drive (a Windows shortcut file masquerading as a PDF or in a ZIP archive), as identification documents. The malicious link would then trigger the execution of arbitrary system commands, to drop a harmless decoy document, as well as a malicious and quite sophisticated binary loader that we dubbed VileLoader.More recently, since at least late 2021, the infection technique has changed slightly, but the initial infection vector is still a malicious message: a Word document (DOCX, see Figure 1) is sent to targets via email (either as an attachment or embedded in the email body whenever possible). In July 2022, we also noticed that the attackers leveraged chatbots that are embedded in targeted companies’ public websites to send malicious DOCX to their targets.Figure 1. Malicious DOCX social engineering messageThe DOCX documents are frequently named using the “compliance” or “complaint” keywords (as well as the name of the targeted company), suggesting the attacker is answering an identification request or expressing an issue as a reason to send them.The initial infection and toolset deployment, as we observed them starting in at least late 2021, are schematized below (see Figure 2).Figure 2. VileRAT infection and toolset overviewThe initial DOCX infection document itself is innocuous, but it contains a link to another malicious and macro-enabled DOTM document as a “remote template” (see Figure 3). These DOTM files are automatically downloaded by Word when the DOCX is opened, and its embedded macro is triggered if the recipient enabled execution (as requested by the social engineering message, see Figure 1).Figure 3. Malicious remote template inclusion in infection DOCXThis technique comes with a drastic limitation: the hidden macro (i.e., internal p-code) can only be executed if the macro-enabled document is opened with the same Office version from which it was generated. Otherwise, the hidden macro cannot run, and the visible one will be executed instead. In this last case, DeathStalker ensured it would result in a popup message to the user (see Figure 4). But most of all, DeathStalker ensured that it distributed several variants of infection documents to their targets, each one being prepared for a specific Office version.Figure 4. VBA stomping failure in a malicious DOTM remote templateIn any case, the visible and hidden macros download a picture to replace the social engineering message in the infection document (see Figure 5) and trick the readers into believing something failed.Figure 5. Example of a downloaded image upon macro executionThe DOTM-embedded macro itself already reveals some interesting and specific techniques. It is lightly obfuscated, as most text strings are XOR-encoded (see Figure 6) with a password that is derived from a sentence (e.g., “Operates Catholic small towns pueblos Two of“).Figure 6. XOR decoding function (renamed for clarity) in DOTM-embedded macroFigure 7. XOR decoding function in a PowerPepper VBS loader (MD5 DB6D1F6AB887383782E4E3D6E4AACDD0)Figure 8. TextBox form used as a data store within malicious DOTM documents, as shown by Microsoft’s VBA editorFigure 9. DOTM-embedded macro leverages “AddPicture” as a Web clientIn any case, the DOTM-embedded macro finally triggers VileDropper’s execution, using a renamed copy of the “WScript” interpreter (“msdcat.exe” or “msgmft.exe” in the “%APPDATA%” folder), with a command such as:\n“changelog.txt” is VileDropper, while “91” is part of password used by VileDropper to decode XORed data, and “pattern.txt” is an encoded package that contains VileLoader.Next in DeathStalker’s intricate VileRAT infection chain comes VileDropper. It is an obfuscated JavaScript file that mainly drops and schedules the execution of the next stage: VileLoader.Figure 10. VileDropper code excerpt in its original formVileDropper needs at least two arguments to run for the first time (a third may be used as a flag to trigger environment-specific execution variations, depending on security products that are installed on targeted computers):VileDropper also checks its interpreter and file name, to immediately stop execution if it is not called as planned (this is probably done to evade sandboxes), as can be seen in the following deobfuscated code excerpt:Figure 11. Deobfuscated execution check in VileDropperVileDropper’s exact execution flow depends on the security products that are installed on the targeted computer, but most of the time, it copies itself to another file, relaunches itself, and deletes its original copy. During execution VileDropper:VileDropper sends data to a C2 server using an HTTP GET request to a fixed URL (e.g., “hxxp://hubflash[.]co/admin/auth.php”), using a preset User-Agent (both the C2 URL and the User-Agent change depending on VileDropper samples). The useful information is stored as a JSON document, which is then XOR-encoded, base64-encoded, URL-encoded, and set as a cookie value in the HTTP request:\nThe characters between square brackets (such as [u]) in the command line designate the content of the corresponding JSON key (i.e., [u] is the encoded target identifier).Before moving on to VileLoader, a note on the XOR encoding scheme that is leveraged by VileDropper to protect data sent to the C2 server, as similar schemes will be used further on. The algorithm generates data blobs that are laid out as follows (then sometimes further base64-encoded and URL-encoded):Type A:\nThe resulting blobs are self-sufficient and can be decoded by the recipient (as well as any third party…) without any access to the pre-shared key. In VileDropper, strings that are encoded as part of the JavaScript obfuscation benefit from an additional XORing step: the XOR key that is embedded in data blobs is additionally XORed with a script-specific fixed password (a part of this fixed password is passed to VileDropper on its execution command line by the previous DOTM macro in the infection chain, the other part is hard-coded in VileDropper itself).Later, VileLoader and VileRAT use other variants of this algorithm, which produces data blobs that are laid out as one of the following options:Type B:\nType C:\nType D:Recent VileLoader samples are composed of a binary executable (stage 1) and an encoded companion shellcode file (stage 2). Previous samples of VileLoader usually embedded the shellcode within the binary executable directly, and presented themselves as a single monolithic file.VileLoader is initially presented as a binary executable, which ensures the first stage of the execution. This binary is always a legitimate one, which is meticulously doctored by the attackers to integrate a malicious unpacker-type payload. As such, the binary may appear legitimate from a quick automated static code analysis perspective: it includes all the code of a legitimate application (but will not work as expected). This “unpacker” stage is aimed at decoding, loading, and executing the second stage in memory.VileLoader’s workflow starts by waiting 17 seconds. Then it parses the command line arguments. The command line must include five arguments at least, or VileLoader terminates the execution. In practice, VileDropper usually gives seven arguments to VileLoader, as we have previously described. VileLoader then opens its encoded companion shellcode file (whose name is passed as a second argument to VileLoader, e.g., “devENX1C6SS.tmp”), reads and decodes it (using the Type B XOR algorithm), maps the deobfuscated data in a region with read, write and execute (RWX) permissions, and runs the next stage (stage 2) by starting a new thread.VileLoader’s first stage contains very unique “signature” techniques that have been stable since the first sample we analyzed in Q2 2020:Figure 12. VileLoader’s stage 1 custom-made system callThe second stage content is extracted from VileLoader’s encoded companion shellcode file, and run by VileLoader’s first stage in-memory, in a new thread. From a data perspective, the second stage shellcode (once unpacked by the first stage) is a PE binary that is stripped of its headers and embeds additional encoded data.Finally, VileLoader’s second stage builds an HTTP GET request that is used to download an implant package. In older VileLoader samples, the downloader used a static URL that looked as follows:\nThe only evasion attempt consisted in randomly choosing an HTTP User-Agent header value amongst a fixed list of four. VileLoader used the targeted system’s uptime as a source of “randomness”. In recent samples, developers tried to improve these evasion techniques, and the HTTP request now looks like this:\nAll values that are colored in red are now chosen at random from a hard-coded list that is decoded from the stage 2 content (using the Type C XOR algorithm). The encrypted blob (cookie value) is initially a JSON dictionary, encrypted with the RC4 algorithm (using the key “BD DE 96 D2 9C 68 EE 06 49 64 D1 E5 8A 86 05 12 B0 9A 50 00 4E F2 E4 92 5C 76 AB FC 90 23 DF C6”, decoded from stage 2 content), XORed (using the Type B XOR algorithm), base64-encoded and URL-encoded. The actual JSON content is very similar to the one that is sent by VileDropper to the C2 server:The C2 server then answers in the HTTP response body, with one of the following instructions:In older variants, VileLoader’s second stage did not embed the screenshot capability, which was, however, implemented in VileRAT.If the C2 server requests a screenshot, then VileLoader stage 2 sends an HTTP POST request with a cookie whose value is a XORed (Type B algorithm) JSON dictionary containing the following fields:The associated HTTP POST body data is an encoded (using the Type B XOR algorithm) JPEG screenshot.Long story short: the first stage of VileRAT has been obfuscated at the Python bytecode-level, with the intention of breaking existing decompilers (see Figure 13). The bytecode is obfuscated by:Figure 13. VileRAT’s first stage Python bytecode, in its original form (left) and deobfuscated form (right). The only useful instructions of this excerpt are highlighted in red.Once cleaned at bytecode-level, the first stage of VileRAT unpacking can be properly decompiled as Python code:The last unpacking step finally extracts the VileRAT Python code and a whole bundle of its dependencies in memory – all this content causes py2exe-bundled VileRAT samples to weigh around 12MB. The unpacking leverages decoding (using the Type B XOR algorithm) and BZIP2 decompression. The final VileRAT Python package notably contains a conf.pyc module which includes a version number, as well as default C2 domain names:\nVileRAT versions and functionalities\nWe analyzed and compared various VileRAT samples, containing version numbers ranging from 2.4 to 8. VileRAT functionalities have not changed much over time, and some functionalities from the earliest sample we analyzed have actually been dropped (such as leveraging SSH as a C2 channel, or screenshotting, the latter now being implemented in VileLoader instead). The remaining functionalities include:\n\nArbitrary remote command execution, using an existing or downloaded binary;\nEstablishing SSH connections to remote servers, possibly leveraging them to forward ports of the targeted computer to the remote server;\nKeylogging;\nSetting up persistence using scheduled tasks;\nListing security solutions that are installed on the target computer;\nSelf-updating from a C2 server.\n\nVileRAT has five distinct and exclusive execution modes, enabled from the command line, which can all be further altered with additional command switches, parameters and/or data from the C2:\n\n\n\nCommand line option\nInternal name(s)\nExecution mode description\n\n\n-a\nenc_cmd_dataWe analyzed and compared various VileRAT samples, containing version numbers ranging from 2.4 to 8. VileRAT functionalities have not changed much over time, and some functionalities from the earliest sample we analyzed have actually been dropped (such as leveraging SSH as a C2 channel, or screenshotting, the latter now being implemented in VileLoader instead). The remaining functionalities include:VileRAT has five distinct and exclusive execution modes, enabled from the command line, which can all be further altered with additional command switches, parameters and/or data from the C2:RUN_CMD_AS_USER_ARG\nArbitrary command executionRUN_R_SSH_SHELL_ARG\nSSH connection testVileRAT starts a new process of itself, which connects to a remote SSH server (using a private key), then… closes the connection. This SSH connection used to serve as a C2 channel in previous samples, but the C2 logic has been removed in recent samples. In order to specify the SSH connection settings, a JSON dictionary is passed as an optional parameter. VileRAT exits after this execution.\n\n\n-r\nenc_cmd_data_rdsRUN_R_DYN_SSH_ARG\nSSH-tunneled local port forwardVileRAT starts a new process of itself, which connects to a remote SSH server (using a password). This connection is leveraged as a tunnel to forward ports from the target computer to the remote server. In order to specify the SSH connection settings, a JSON dictionary is passed as an optional parameter. VileRAT quits once the remote end has connected to the forwarded port at least once, and subsequently closed the connection.\n\n\n-c\ncp_exe_path\nArbitrary file deletionVileRAT attempts to delete a file, whose path is given as a clear text command parameter. VileRAT quits when the file is deleted or when the maximum number of attempts (10) is reached.\n\n\n-t\nrtsIS_TASK_SCHED_ARG\nMain C2 client modeIn a typical first execution for VileRAT, as we identified in 2022, the implant is started with the following arguments:\nNote than in this case, the target identifier that is passed as the first argument is not actually exploited by VileRAT, and may just be used by the attacker to easily identify running VileRAT processes later. Older VileRAT variants were usually launched with explicit “-f” and “-t” command line switches: those are now implicit and enabled by default.Here is the list of some notable VileRAT changes we spotted as the versions evolved, apart from regular updates to fix code bugs or handle uncaught exceptions, refactor code, update dependencies, and change configuration:VileRAT’s main C2 communication loop, as executed during Main C2 client mode (as described in VileRAT functionalities above), is quite straightforward and runs in a separate thread:Figure 14. VileRAT C2 request preparation functionJust as in VileLoader, the User-Agent value in HTTP requests is randomly selected from a fixed list of possible values. The JSON that is passed to the C2 server can be broken down as follows:The C2 answer is expected as an encoded and encrypted JSON list (leveraging the same coding and cryptographic methods as for the JSON in the HTTP request). Each item in the list must be a JSON dictionary that contains at least a “cmd” key. Its value can be one of: update_svc, ssh_rshell, r_cmd, ssh_rdyn or update_conf. Additional JSON key/value pairs can exist in the dictionary and are passed to internal commands as parameters.We looked for specificities in the C2 domains we could retrieve from the samples gathered (either malicious DOCX files, DOTM files and their macros, VileDropper, VileLoader or VileRAT) and that are described in this report. We ignored domains registered before mid-October 2021 because most of them were already disclosed in public sources (all known malicious domains and IPs are listed in full in the indicators of compromise section below). It should be noted that to date, we have identified hundreds of domains associated with VileRAT’s infection chain.This allowed us to identify some likely VileRAT-specific infrastructure creation preferences:From August 2021 to the present day, using only data that we could check with our own telemetry, we identified 10 compromised or targeted organizations in Bulgaria, Cyprus, Germany, the Grenadines, Kuwait, Malta, the United Arab Emirates and the Russian Federation (see Figure 15).Figure 15. Map of organizations targeted by DeathStalker’s VileRAT campaign (darker color indicates a higher concentration)We could not profile all the identified organizations, but half of them were foreign currency (FOREX) and cryptocurrency exchange brokers. Some identified malicious documents and infrastructure domains contain (parts of) the targeted organizations’ names, and confirm this targeting.It should be noted that the identified organizations range from recent startups to established industry leaders, including dubious cryptocurrency exchange platforms. Locating such organizations is extremely difficult from the limited data we have at hand, because a small FOREX company might, for instance, host its infrastructure in various foreign countries, employ several remote workers from different countries, and be legally based in a tax haven.We still believe with high confidence that the described updated implants and associated infection chain are developed and operated by DeathStalker:VileRAT, its loader and associated infection chain were continuously and frequently updated for more than two years, and are still leveraged to persistently target foreign currency and cryptocurrency exchange brokers, with a clear intent to escape detection.Escaping detection has always been a goal for DeathStalker, for as long as we’ve tracked the threat actor. But the VileRAT campaign took this desire to another level: it is undoubtedly the most intricate, obfuscated and tentatively evasive campaign we have ever identified from this actor. From state-of-the-art obfuscation with VBA and JS, to multi-layered and low-level packing with Python, a robust multi-stage in-memory PE loader, and security vendor-specific heuristic bypasses, nothing has been left to chance.Considering the vast and quickly changing associated infrastructure as well, there is no doubt DeathStalker is making a tremendous effort to develop and maintain accesses. Yet, there are some glitches and inconsistencies: a final payload weighing more than 10MB (VileRAT), simple infection vectors, lots of suspicious communication patterns, noisy and easily identified process executions or file deployments, as well as sketchy development practices leaving bugs and requiring frequent implant updates. As a result, an efficient and properly setup endpoint protection solution will still be able to detect and block most of VileRAT’s related malicious activities.Putting these facts into perspective, we believe DeathStalker’s tactics and practices are nonetheless sufficient (and have proven to be) to act on soft targets who may not be experienced enough to withstand such a level of determination, who may not have made security one of their organization’s top priorities, or who frequently interact with third parties that did not do so. We still, however, cannot determine what DeathStalker’s principal intention against such targets is: it could range from due diligence, asset recovery, information gathering in the context of litigation or arbitration cases, aiding its customers in working around sanctions and/or spying on the targets’ customers, but it still does not appear to be direct financial gain.09FB41E909A0BCA1AB4E08CB15180E7C\n0B4F0EAD0482582F7A98362DBF18C219\n0CB7936975F74EA2C4FA476A6E3D5A05\n15C62D22495CA5AA4BB996B2CB5FEB7F\n1AAFBE60E4D00A3BFFDB76FA43C2ADBB\n237831757F629BA61C202B51E0026C9B\n238CD8435ADFFDAEBBF9D7489764648A\n241AD2BB7E703343F477960B39A8B300\n257754E9CD6EEC6DB5323E282FB16A74\n2BAADB95EF832CF5EB550121FA0292D0\n2C6314821C64F235E862B38DADEE535E\n2F8817B75D81C2F029FA70DE69B4A94B\n3C4F409A7926731254B44CA6526DCED1\n3C9A5A69CC928A39519178DA2A8EFFB6\n5BE87EC5A2F48483317A57CE120ACC0E\n609F595053D481C047D9C9B8C0F6B39C\n63090A9D67CE9534126CFA70716D735F\n77612466654702C7ED7C6B1C21CFAEFE\n77B4AF2734782DC7FC10A6FD7978AE80\n79157A3117B8D64571F60FE62C19BF17\n7C7D4DFAC6A2628B9921405F25188FE3\n8746077795FF9C33A591C7E261B7C7B8\n9352DBA6CC8AC67F22E62D7A1B5E51B6\n9895D0C19AC482F62C53AD8399F98B66\nA4B79DA85C6EE26D0EBEA444A60DB900\nA7FB4779F2A1C4A27DA2E74616DB7C31\nB09A35B75700D11A251BDFC51B1D08E9\nC212AF0C8A880697374E06B59376F991\nC59EB65B0B237E39AFED796C5B3DB417\nC75FC659F257291C9CCC94C3FF4B5A83\nC818E4BCA286C690156EFF37DAA2E209\nC86F8642560A6353ED2FE44F0C6B07E8\nD72B649DF88D78441D5629AF99FA1D40\nE0D474AF77E89BF1C2DBB7D7A5F8ACE9\nE28F2F0546EF07BC3425528D813EC954\nE375B63A76DADDFF5741B340AE7BD6A8\nE51CBCF89A26686C62350BAE371F8601\nE726520B3AD875B516DF6C3D25476444\nF0D3CFF26B419AFF4ACFEDE637F6D3A2\nFB75DDE8F9E473D019A6CBDBB0D2283A\nFF2558571EE99ED4AEC63A398071903402C1EC61C4E740AF85B818A89E77E2C2\n75A3F8D143CF96C163106E21272FF170\n7FCC03D062AC8AA2BE8D7600B68FC53A\n82D841D7712AB0EE9F1BBB6B3D22821A\n93CE42F23B0800F257D355C0B10C8D79\nE6F9D538FCDF46493DF8ECB648F98D133C8052862B194F205AC5138BF07ADFBE\n43A2B45D25BB898DBBCB2EE36C909D64\n6E201A9BB9945BDC816A7A9C2DCF73B9\n7822FF3D5008E0B870BB03EF8D2032DC\n99F762D23451B9ABABA95BCE3F544FDB\nC97B0753A263E042EB6E3C72B2F6565F\nCABAF29E9763D18B0D0DFFBC576FDF3E0456FA74B8CC6866C5D1CE9E15136723\n0BD06D2C17987C7B0C167F99BB4DC0B4\n0F3685A6ACA7991C209D41D0E2279861\n107A084A1C8A6E9E5B3BEF826C3443DC\n15A192BB683BD47956CC91B2CFCE3052\n161FE654DDED7AE74EE40F1854B9F81E\n174CF10F0F320B281B3FFBF782771AD7\n22DDB087EF3310B3F724544F74E28966\n237BAB121E846DCFA492E7CC5966EAD9\n2503B8AABEEB2649915126573307B648\n29EF001568851845B84F3CD163BFD439\n2A5ECA9B83A999E86054E53330F68F5B\n2DBEA08AFE245F246B500727B7D27761\n2FC7211C94B7C89968ACFAD8C084EE3B\n2FDDDA0DC33D3F8BAB906C43982AA4A2\n30CA78A99F49782942835B1C10E2834A\n33F1303842BDDC98205984E6ACF782F7\n344A41ECF89B5642B6FE0A695852AA1B\n36E60C00A64BAA014CF7A44CB9C9F410\n3C960DCC782A4D9552F0CC96451633C8\n3D127901AFD64EACE4C7B939FDBA90BB\n3E0A49646B9D5D0C63036692BA1C7315\n3FC5AB8A3EAB1D8CFF8530BBE2BAE608\n524909CB66848B1EE2987FDC0B69B451\n52B208E86C0DDE252200953A4EB71EA3\n52C1E4537424E151469E8E67DF07EFE6\n577497F9E9D4EA6070AA250B355DCFB1\n578E16856061F6CB760B06B1735F9143\n5BA950833DC55FE30F1E24CBCF1DEA3C\n5D9DB5350E1CA2D9DACBA75F4AA80AE0\n6677B435A7455579BC063BD9F7CBE65E\n6A1672401FFD7FB64DFE09A7A464067C\n6AED3D8D53CB4B90FF0EDA8803C7F1F5\n6E056456B2F40D2C47219C6DB24D9541\n700B71690C7902DEC10275A6AE320ADF\n77AC6332A5A4DE5712B66949AC8BF582\n7B478EDC2B74D7ECDC6B1D9532C9E7F8\n80A84624126B6D72FF5D1B25B80204C2\n82118066CF5EE34E7956F8D288B725E6\n85C09C35F85EDD1428208CD240A72BD8\n8B4905B5D0142EBD67B103E2CDD047E3\n8C377D184D88991388B7D0ED6CFB4A98\n8C4975EDB8C6BE37C416D9B6483E9BD5\n942D540F7608752233800AEB66BC8DC7\n977D5BABF7112F1B6072EAA1F3F896B8\n991CA8ECD3F4A70892CFF4FB774AF22B\nA82C6772F984A9B49A1512B913DA4332\nAB4B8D26D389C76B3D4A85E2CCB9E153\nB68915810F6DE276A706E7F4C37645EA\nB6EE9DAEA4B2D849793E651603A1512D\nBC162B6742AA1EA86A3B391D549EF969\nC21025561A3151F9EB2C728AAB5A7A90\nC3828CE2ED1453EFAAD442D150B79F6E\nC89D5BB8A36C0F2891B5A75834A7AD64\nCF8988662588C8FE943ECF42FC35E0B4\nD3E95C81D038CBF6EFC5AF3208313922\nDB1A697955F1140AED36864617F41425\nDB2179161FA0FC1694BD7425D1E80A5D\nDB6800CF6288BA0B7492F533F519CA24\nDC6F128A5316FB9AF66EA01190C63895\nE18078DCA1A1F452B06EC0D9C30982B6\nE3F106AF3E45C480BF9E45EB21617083\nE833910AB506B08DB2A0E7E1313C6556\nEA71FCC615025214B2893610CFAB19E9\nF02B13F9634604BE5388B3C13C7CEC8D\nF18D216B070744097846F96877865D1C\nF5884141B04503EE6AFB2A17FD7761FC\nF93FEE328737CB97D83701A4A50EAEFD\nFC5F0CC23280547E1D727534649B3DFA\nFFE01DCCC1AA70C80EBB1B9F8FCADF1F348C99A209616FC674FCABCAFDDBA4A0\n99B54991FCE2C6D17CDEF7BBD60FDA27\nB0353610172416A9FFCD3E7FB7BAE648\nEC04E0D3EADF043A1219942051A2A147\nBB2113989478DB0AE1DFBF6450079252\n15BAF177FC6230CE2FCB483B052EB539\nBAB0B5BB50C349CEFD9DEDF869EB0013\nD3947C239A07090DEB7D4A9D21D68813\nB4183E52FB807689140ED5AA20808700\nA7B300D6CB0488358A80C512A64FF570\n8F20155F0D9541F7CB5C3BBDC402498B\n6D0B710057C82E7CCD59A125599C8753\n14D9D03CBB892BBBF9939EE8FFFDD2B5\nA62850FD3D7DEC757043AB33417E7A13\n03205E90135FD84D74AF8B38D1960994\nACCC6633AF50AEA83024AB5A0861375B\nE1956B827EF36A0DDE5C42F2C26AC8B6\nDBD9CBAEB27326EF2AEAD32292D70632\n8F9D01DC7D1EB9AB388BF94F0B926E3B\n6E79535F38248C7769365881C577DF29Note: the C2 domain names have been identified in our own telemetry or extracted from malicious files that are described in this article and that we analyzed. The domains may still have previously (or later) been used for legitimate purposes as domains may get reused over time. Even if we could not notice such a conflict up to now, the resolution of a hostname that belongs to such domain must better be checked to match previously listed C2 IP addresses, before concluding it is indicative of a compromise.rowfus[.]com\nshopadvs[.]com\nsvclouds[.]com\ncorstand[.]com\ngetappcloud[.]com\nhostboxapp[.]com\nweareukrainepeople[.]com\neroeurovc[.]com\nflightpassist[.]com\nihotel-deals[.]com\nmevcsft[.]com\nmsfsvctassist[.]com\npinktwinlers[.]com\nplantgrn[.]com\nwazalpne[.]com\naffijay[.]com\nupservicemc[.]com\nmsfbckupsc[.]com\nestimefm[.]org\nvisitaustriaislands[.]com\nbookaustriavisit[.]com\nhubflash[.]co\nbookingitnow[.]org\nplanetjib[.]com\nenigmadah[.]com\nqeliabhat[.]com\nqnmarry[.]com\npngdoma[.]com\nrobmkg[.]com\ntextmaticz[.]com\ngoalrom[.]com\ndeltacldll[.]com\nnortonalytics[.]com\nudporm[.]com\ndellscanhw[.]com\nmailcloudservices[.]org\nhpcloudlive[.]com\nwindowslive-detect[.]com\nzummaride[.]com\ncashcores[.]org\nthesailormaid[.]com\nmultizoom[.]org\npoccodom[.]com\nmsftmnvm[.]com\nplancetron[.]com\ncovidsrc[.]com\ncovidsvcrc[.]com\nmsftcd[.]com\nrombaic[.]com\ncargoargs[.]com\namazoncld[.]com\nprintauthors[.]com\namznapis[.]com\nthismads[.]com\nammaze[.]org\neroclasp[.]com\nmullticon[.]com\naudio-azure[.]com\nazure-affiliate[.]com\nservice-azure[.]com\nscan-eset[.]com\ncheck-avg[.]com\nadsmachineio[.]com\napi-pixtools[.]com\napi-printer-spool[.]com\ndriver-wds[.]com\nflowerads[.]cloud\nglobaladdressbook[.]cloud\nmsft-cdn[.]cloud\nwindows-accs[.]live\nwindows-ddnl[.]com\nfreepbxs[.]com\ntrvol[.]com\ntrvolume[.]net\ncorpxtech[.]com\nveritechx[.]com\nvvxtech[.]net\nextrasectr[.]com\ntrquotesys[.]com\nquotingtrx[.]com\nbooknerfix[.]com\nbgamifieder[.]com\nbook-advp[.]com\nnetwebsoc[.]com\nrefinance-ltd[.]com\nwindnetap[.]com\nn90app[.]com\nappdllsvc[.]com\nmeetomoves[.]com\nmoretraveladv[.]com\nhostedl[.]com\nagagian[.]com\ninformaxima[.]org\npolanicia[.]com\nam-reader[.]com\nliongracem[.]com\njmarrycs[.]com\nworldchangeos[.]com\ngvgnci[.]com\nananoka[.]com\nnetpixelds[.]com\nallmyad[.]com\nwicommerece[.]com\nshowsvc[.]com\nborisjns[.]com\ngovdefi[.]com\ndogeofcoin[.]com\nrealshbe[.]com\nquestofma[.]com\ncovidgov[.]org\ngovtoffice[.]org\ncovidaff[.]org\ncovsafezone[.]com\nmsftinfo[.]com\ninvgov[.]org\nanypicsave[.]com\nnavyedu[.]org\nanyfoodappz[.]com\ncloudazureservices[.]com\ndnserviceapp[.]com\npicodehub[.]com\nmusthavethisapp[.]com\nrefsurface[.]com\namazoncontent[.]org\nwizdomofdo[.]com\ntomandos[.]com\namazonappservice[.]com\namzncldn[.]com\nazurecontents[.]com\nphilipfin[.]com\ncloudhckpoint[.]com\ncheckpoint-ds[.]com\niteamates[.]com\nglobal-imsec[.]com\nprintfiledn[.]com\nmsftprintsvc[.]com\nworldsiclock[.]com\ndeuoffice[.]org\namazonpmnt[.]com\nalipayglobal[.]org\ncloudamazonft[.]com\napple-sdk[.]com\nazurecfd[.]com\napiygate[.]com\nmsftcrs[.]com\nsysconfwmi[.]com\ndnstotal[.]org\nnamereslv[.]org\nmailservicenow[.]com\ncloudreg-email[.]com\napidevops[.]org\nzerobitfan[.]com\nedwardpof[.]com\nmainsingular[.]com\ntotaledgency[.]com\nadmex[.]org\noutlookfnd[.]com\nbookfinder-ltd[.]com\nearthviehuge[.]com\nestoniaforall[.]com\njarviservice[.]org\nmoreofestonia[.]com\ntraveladvnow[.]com\ntripadvit[.]com\nadvideoc[.]org\nauzebook[.]com\nmslogger[.]org\nnetmsvc[.]com\nntlmsvc[.]com\nprodeload[.]com\nrealmacblog[.]com\nroblexmeet[.]com\nweatherlocate[.]com\ncrm-domain[.]net\nleads-management[.]net\nvoipasst[.]com\nvoipreq12[.]com\nvoipssupport[.]com\ntelefx[.]netNote: the suspected C2 domain names have been identified because they were both registered in a similar way than known C2 domain names, AND because associated hostnames pointed to known C2 IP addresses during a timeframe of known malicious activity. While we believe with medium to high confidence the vast majority of these domains have been or could be leveraged by DeathStalker, it is still possible that a few of them never support malicious activities.adsoftpic[.]com\nazcloudazure[.]com\nazureservicesapi[.]com\ndiamondncenter[.]biz\nforceground[.]co\nmultitrolli[.]com\nsearchvpics[.]com\nsuperimarkets[.]com\nsymantecq[.]com\nyorkccity[.]com\ncosmoscld[.]com\noglmart[.]com\nshopamzn[.]org\naidobe-update[.]com\namzn-services[.]com\napplecloudnz[.]com\nesetupdater[.]com\nfastnetbrowsing[.]com\nfindmypcs[.]com\nflyingpackagetrack[.]com\nmcafee-secd[.]com\nmsfastbrowse[.]com\nmurfyslaws[.]com\nnetworkcanner[.]com\nnvidiaupdater[.]com\noauth-azure[.]com\noautho[.]com\norbiz[.]me\noutlooksyn[.]com\npdfscan-now[.]com\nsoundstuner[.]com\ntimetwork[.]com\nwingsnsun[.]com\nazuredllservices[.]com\nmailgunltd[.]com\nofficelivecloud[.]com\nkgcharles[.]com\nmstreamvc[.]com\nstreamsrvc[.]com\nwalltoncse[.]org\nwldbooks[.]com\ntravelbooknow[.]org\namzbooks[.]org\natomarket[.]org\nelitefocuc[.]com\nfutureggs[.]com\nnewedgeso[.]com\ntopotato[.]org\nwwcsport[.]org\nfiredomez[.]com\ngratedomofrome[.]com\nservicebu[.]org\nservicejap[.]com\nappcellor[.]com\ncloud-appint[.]com\ncoreadvc[.]com\nsellcoread[.]com\nallrivercenter[.]com\nmissft[.]com\nonesportinc[.]com\ntophubbyriver[.]com\nyourprintllc[.]com\nazuredcloud[.]com\nbingapianalytics[.]com\nmscloudin[.]com\nmsdllopt[.]com\nnetrcmapi[.]com\npcamanalytics[.]com\ndbcallog[.]com\nmsft-dev[.]com\nmsftapp[.]com\nmsftprint[.]com\nmsintsvc[.]com\npraxpay[.]org\nprint-hpcloud[.]com\nsvcscom[.]com\nunitedubai[.]org\nunitepixel[.]org\nadvflat[.]com\ncloudappcer[.]com\ncloudpdom[.]com\ndustforms[.]com\neconfuss[.]com\nezteching[.]com\ninfntio[.]com\nluccares[.]com\norklaus[.]com\nroboecloud[.]com\nwdigitalecloud[.]com\nadvertbart[.]com\nbunflun[.]com\ncovdd[.]org\ninetp-service[.]com\ninfcloudnet[.]com\nkhnga[.]com\nmailservice-ns[.]com\nwebinfors[.]com\nyomangaw[.]com\nazueracademy[.]com\ncyphschool[.]com\nimagegyne[.]com\nimageztun[.]com\nnetoode[.]com\nolymacademy[.]com\npivotnet[.]org\nfxmt4x[.]com\ntelecomwl[.]com\nxlmfx[.]comAuthorsVileRAT: DeathStalker’s continuous strike at foreign and cryptocurrency exchangesYour email address will not be published. Required fields are marked *Name * Email * ΔTable of ContentsKSB webinarsFrom the same authorsThe hottest research right in your inboxΔIn the same categoryAsian APT groups target various organizations from a multitude of regions and industries. We created this report to provide the cybersecurity community with the best-prepared intelligence data to effectively counteract Asian APT groups.We unveil a Lazarus campaign exploiting security company products and examine its intricate connections with other campaignsHow Kaspersky researchers obtained all stages of the Operation Triangulation campaign targeting iPhones and iPads, including zero-day exploits, validators, TriangleDB implant and additional modules.Nobody would even suspect the mining malware was merely a mask, masquerading behind an intricate modular framework that supports both Linux and Windows.  The amount of effort that went into creating the framework is truly remarkable, and its disclosure was quite astonishing.The hottest research right in your inboxΔThreatsCategories© 2023 AO Kaspersky Lab. All Rights Reserved.\nRegistered trademarks and service marks are the property of their respective owners.The hottest research right in your inboxΔ"
   },
   {
      "time": "2022-08-12",
      "title": "US govt will pay you $10 million for info on Conti ransomware members",
      "text": " The U.S. State Department announced a $10 million reward today for information on five high-ranking Conti ransomware members, including showing the face of one of the members for the first time.The Rewards of Justice program is a U.S. Department of State program where monetary rewards are offered for information related to threat actors affecting the national security of the USA.The Conti Ransomware is a notorious ransomware operation believed to be responsible for over 1,000 attacks worldwide and receiving ransom payments of over $150 million.Some Conti members stood out as those who played a significant role in the operation and are now being targeted by the Rewards of Justice program.While the Conti ransomware brand has shut down, the members are still fully active and operating in other ransomware operations and extortion groups.Due to this, the Rewards for Justice program hopes to prevent future attacks by enticing people, including Russians who may recognize Target's picture, to submit tips for a million-dollar reward.While Russia was not known to help the USA in their cyber investigations in the past, they are even less likely to do so now.However, many of these threat actors might leave Russia to go on vacations, visit family, or for other reasons, where US allies can arrest them at the border."
   },
   {
      "time": "2022-08-12",
      "title": "Russia's digital attacks are haphazard, chaotic, says top Ukrainian cyber official | CyberScoop",
      "text": " \n\nAugust 11, 2022\n\nThe overall Russian approach to incorporating cyberattacks into its ongoing assault on Ukraine is “chaotic,” and reflects an “absence of strategy,” Victor Zhora, one of Ukraine’s top cybersecurity officials, told CyberScoop Wednesday.“Most of the attacks are [distributed denial-of-service attacks] together with volunteers they continue gathering in groups through Telegram channels, or easy hacks of web resources, defacements or exploiting vulnerabilities in networks, getting access and trying to exfiltrate data and trying to interfere in media,” said Zhora, the deputy head of Ukraine’s State Service of Special Communications and Information Protection.There’s a “huge crowd of people” continuously attacking a range of Ukrainian targets, he said, but they differ in skill and have primarily not been, so far at least, consequential. “We understand what they have on their minds, and that’s perhaps the absence of strategy,” he said. “It’s a key factor of this war.”Cyberattacks on Ukraine generally are not “organized well on the country scale,” he said, “a good sign for all of us.” The Russians will continue searching for vulnerabilities and ways to attack, “but I don’t believe they have the opportunity to grow their potential rapidly.”“We continue to see this constant kind of attempt to gain access or maintain access,” Nick Biasini, the head of outreach at Cisco Talos, which has been intimately involved in helping to protect Ukrainian networks for years, told CyberScoop Wednesday. “A lot of these larger range projects take time, you have to build and plan and get that set into place. And I feel like planned things have already passed at this point.” Zhora told CyberScoop Wednesday that Industroyer2 “indicated targeting on completely civilian infrastructure” and was part of a broader approach by the Russian government to target civilians in military attacks.ESET researchers Robert Lipovsky and Anton Cherepanov gave a detailed presentation of their analysis of Industroyer2 at Black Hat, and Zhora suprised the crowd of hundreds by joining them on stage:Zhora said he came to Black Hat to continue to rally support and share knowledge with the range of experts, policy makers and others who come to the convention from all over the world. “Everybody’s very interested and attentive of what’s happening in Ukraine and the full room of people for our presentation with ESET is a good indication of this interest,” he said.He added that he wanted to use his time at the convention to rally ongoing support for Ukraine’s defense.“Cybersecurity is a global task, and the threats are global as well,” Zhora said. “Everybody should be aware, should be informed, should have tools, should have the knowledge base to counter these threats. That’s the reason why black hat audience is ideal for sharing these ideas.”After a long day, Zhora reflected on one of his biggest worries as he makes his way back to Kyiv later this week.“My biggest concern is that time goes by, and the pressure continues, one of the biggest challenges is to keep the motivation of people,” he said. “We cannot give up and the work cannot give up.” He added that he understands that people are tired of the war, and that the war’s impact on the prices of gasoline and fuel in some places “can influence the overall atmosphere of support.”But “nevertheless, we should keep fighting to prove that all war crimes are punished, the aggression is punished and there is no place for such actions in modern society.”"
   },
   {
      "time": "2022-08-12",
      "title": "NHS working with U.K. cyber authorities to assess ransomware attack on IT vendor",
      "text": " The United Kingdom’s National Health Service said it is working with the country’s National Cyber Security Centre to investigate a recent ransomware attack on an IT vendor.The company did not respond to requests for comment but said in a statement that it isolated all of its health and care environments where the attack was discovered. Advanced explained that customers using Adastra, Caresys, Odyssey, Carenotes, Crosscare, Staffplan and eFinancials have been affected by the ransomware attack. An NHS England spokesperson told The Record that the NHS has “tried and tested contingency plans in place” including defense systems protecting their own network. They are now working with the National Cyber Security Centre to “fully understand the impact.” “The public should continue to use NHS services as normal including NHS 111 for those who are unwell, although some people will face longer waits than usual, as ever if it is an emergency, please call 999,” the spokesperson said.The NHS 111 service uses Adastra while other NHS arms use Caresys and Carenotes for things like note-taking and tracking visitors. Adastra could be down for about two weeks while Carenotes will be impacted for more than three weeks, according Broughton. Advanced later said it may take a month for systems to be fully restored. There is a significant ransomware attack on the HSE IT systems. We have taken the precaution of shutting down all our our IT systems in order to protect them from this attack and to allow us fully assess the situation with our own security partners.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-12",
      "title": "FTC moves to create data security and privacy rules",
      "text": " The Federal Trade Commission (FTC) took the first steps towards codifying rules on commercial surveillance and data security Thursday, potentially expanding its longstanding role as the country’s de facto privacy watchdog. “Firms now collect personal data on individuals at a massive scale and in a stunning array of contexts,” said FTC Chair Lina M. Khan in a press release. “The growing digitization of our economy—coupled with business models that can incentivize endless hoovering up of sensitive user data and a vast expansion of how this data is used—means that potentially unlawful practices may be prevalent.” With the announcement, the agency is not yet proposing specific rules, but test driving a complex regulatory process — and how it might be used to protect consumers from the harmful use of their data. However, that rulemaking authority is complex.“Section 18 of the FTC Act is not like ordinary rulemaking under the Administrative Procedure Act,” Georgetown Law professor and former FTC Bureau of Consumer Protection chief David Vladeck explained, comparing it to the standard process most agencies use to develop regulations. It requires public comment and for the agency to determine how prevalent harmful practices are before it can determine if it will ultimately propose specific regulations.   Nonetheless, Vladeck said, making any rule changes “will be a multi-year process that will require a substantial resource commitment by the Commission.” It will also inevitably undergo judicial review, he added.In his statement, Phillips said he was heartened to see Congress at work on the issue and hopes the ANPR does not prevent its further consideration. In a press conference, FTC Bureau of Consumer Protection Director Sam Levine said Congress was in the best position to move quickly to protect consumers, and the agency’s exploration of rules in this sector didn’t preclude their action. All commissioners who voted in favor of the ANPR also expressed support for the bill. “I prefer Congressional action to strengthen our authority. But I know from personal experience that the road for a bill to become a law is not a straight or easy one,” said Slaughter. Bedoya  committed to not voting for specific rules that overlapped with the bill, were it passed by Congress. Should Congress take action, the length of the FTC’s rulemaking process means that the agency will “have an opportunity to readdress” if pursuing the rule making still makes sense, Khan said. Regardless, the rulemaking process would allow for the creation of a “robust public record” on commercial surveillance that could help inform policy-making, she added.Andrea Peterson (they/them) is a longtime cybersecurity journalist who cut their teeth covering technology policy at ThinkProgress (RIP) and The Washington Post before doing deep-dive public records investigations at the Project on Government Oversight and American Oversight.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-12",
      "title": "Report: Ransomware gangs, fraudsters laundered $540 million through RenBridge platform",
      "text": " Hackers and cryptocurrency thieves are turning to so-called cross-chain platforms to launder money and avoid attempts by law enforcement to trace and freeze their illicit proceeds. One such platform called RenBridge has been used to launder at least $540 million in cryptocurrency over the last three years, according to new research published this week. RenBridge is part of a relatively new crop of services that allows people to move assets seamlessly between different blockchain networks — for example, converting Bitcoin to the Ethereum blockchain. Some cross-chain bridges are used legitimately to help newer cryptocurrencies compete with more popular digital assets. But the platforms have also become an attractive tool for cybercriminals, who have moved away from more centralized and regulated cryptocurrency exchanges that are increasingly being asked to identify customers and provide information to law enforcement.It has also been used to launder at least $267 million in cryptocurrency assets stolen from exchanges and decentralized finance services over the last two years, Elliptic said. That includes $33.8 million stolen from Japanese crypto exchange Liquid, which lost a total of $97 million in an attack last August that has been linked to North Korea.RenBridge did not respond to a request for comment.And although cryptocurrencies offer some anonymity to cybercriminals, they’re not untraceable. Hackers have had to make use of a variety of tools to hide the source of stolen digital assets.Elliptic’s research highlights the less-discussed threat posed by cross-chain networks enabling users to hide the source of stolen funds by moving them easily across blockchain networks.“Blockchain bridges such as RenBridge pose a challenge to regulators, since there is no central service provider that facilitates these cross-chain transactions,” researchers wrote. “The Financial Action Task Force (FATF) recently called-out money laundering through “chain hopping” in its latest report on virtual asset risks, but it remains to be seen how this type of activity could be regulated.”Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-12",
      "title": "Zimbra auth bypass bug exploited to breach over 1,000 servers",
      "text": " An authentication bypass Zimbra security vulnerability is actively exploited to compromise Zimbra Collaboration Suite (ZCS) email servers worldwide.Zimbra is an email and collaboration platform used by more than 200,000 businesses from over 140 countries, including over 1,000 government and financial organizations.\"Initially it was exploited by espionage-oriented threat actors, but was later picked up by other threat actors and used in mass-exploitation attempts.\"Successful exploitation allows the attackers to deploy web shells on specific locations on the compromised servers to gain persistent access.\"If you are running a Zimbra version that is older than Zimbra 8.8.15 patch 33 or Zimbra 9.0.0 patch 26 you should update to the latest patch as soon as possible,\" the alert published on Wednesday reads.A Zimbra spokesperson was not available for comment when BleepingComputer reached out earlier today. After discovering evidence during multiple incident responses that Zimbra email servers were being breached using the CVE-2022-27925 RCE with the help of the CVE-2022-37042 auth bypass bug, Volexity scanned for instances of hacked servers exposed to Internet access.To do this, the company's security experts used their knowledge of where the threat actors were installing web shells on the servers.\"Through these scans, Volexity identified over 1,000 ZCS instances around the world that were backdoored and compromised,\" Volexity added.\"These ZCS instances belong to a variety of global organizations, including government departments and ministries, military branches, and worldwide businesses with billions of dollars of revenue.\"Bearing in mind that this scan only used shell paths known to Volexity, it is likely that the true number of compromised servers is higher.\"Volexity says that all its findings were reported to Zimbra and that they also local Computer Emergency Response Team (CERTs) that could be contacted of compromised Zimbra instances. Since the latest Zimbra versions (8.8.15 patch 33 and 9.0.0 patch 26) are patched against the actively exploited RCE and auth bypass bugs, admins should patch their servers immediately to block attacks.However, as Volexity warns, if vulnerable servers haven't been patched against the RCE bug (CVE-2022-27925) before the end of May 2022, \"you should consider your ZCS instance may be compromised (and thus all data on it, including email content, may be stolen) and perform a full analysis of the server.\"Volexity advises organizations who believe their ZCS email servers were compromised to investigate a possible incident or rebuild their ZCS instance using the latest patch and import emails from the old server."
   },
   {
      "time": "2022-08-12",
      "title": "\r\n\tCISA Unveils Cybersecurity Toolkit to Shield U.S. Elections From Hackers - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe CISA released the toolkit through the Joint Cyber Defense Collaborative (JCDC) with the goal of helping state entities and companies step up their cybersecurity efforts and improve the cyber resilience of US election infrastructure.The toolkit resources JCDC focus on involve assessing risk and protecting election infrastructure assets commonly targeted by four different types of attacks. These are phishing, ransomware, and distributed denial-of-service (DDoS) attacks, respectively.“First, use the Election Security Risk Profile Tool to assess your risk. The tool, developed by CISA and the US Election Assistance Commission, can help state and local election officials understand the range of risks they face and how to prioritize their mitigation efforts.”The guide also contains a list of election infrastructure assets most commonly targeted by the aforementioned attacks, which includes electronic poll books and voter registration databases, state and local websites and email systems and networks that election offices rely on for regular business functions.“Protect enables outlines safeguards to ensure the delivery of critical services and Detect defines activities to identify the occurrence of a cybersecurity event.”However, the Agency also warned that the toolkit is not comprehensive: “CISA applies neutral principles and criteria to add items and maintains sole and unreviewable discretion over the determination of items included.”"
   },
   {
      "time": "2022-08-12",
      "title": "OT Security Firm Warns of Safety Risks Posed by Alerton Building System Vulnerabilities - SecurityWeek",
      "text": " Hi, what are you looking for?OT and IoT cybersecurity company SCADAfence has discovered potentially serious vulnerabilities in a widely used building management system made by Alerton, a brand of industrial giant Honeywell.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-08-12",
      "title": "Pro-Kremlin hackers target Latvia’s parliament after declaring Russia a sponsor of terrorism",
      "text": " The pro-Russian hacker gang known as Killnet took down the website of Latvia’s parliament on Thursday after lawmakers there designated Russia as a “state sponsor of terrorism.”Earlier in May, Killnet declared “war” against nations that allied with Ukraine during its war with Russia. The list includes the U.S., the U.K., Germany, Italy, Latvia, Romania, Lithuania, Estonia and Poland. “These countries are attacked almost every time they declare support for Ukraine,” said Yuriy Shchyhol, the head of Ukraine’s State Special Communications Service, in an interview with The Record in July.Latvia and Lithuania have been the most common targets. The Baltic countries, including Estonia, Latvia, and Lithuania, were formerly part of the Soviet Union and still have a large Russian-speaking minority.However, since the start of Russia’s full-scale invasion, they helped Ukraine with military aid, sheltered its refugees and created scholarships for Ukrainian students.In July, Killnet hit Latvia with one of the biggest waves of cyberattacks in the country’s history, including a 12-hour onslaught on its public broadcasting center, after Latvia announced the demolition of nearly 300 Soviet monuments.According to Kaskina, Latvia is attacked by hackers almost on a daily basis, with around 1,000 targets being hit on some days.Earlier in June, Lithuanian government websites were bombarded by DDoS attacks for more than 10 days after the country blocked coal and metal exports to Russia. More than 130 websites were affected by the attack. Finland — another ally of Ukraine — was attacked on Wednesday by pro-Russian hacker group NoName057(16). The website of the Finnish parliament went down for several hours after it suffered a DDoS attack. Hackers said they “punished” Finland for its aspiration to join NATO. Russia considers NATO a “threat” to its national security and is trying to prevent its expansion, according to. The cyberattack on the Finnish parliament occurred the same day U.S. President Joe Biden announced his support for Finland and Sweden to join NATO.Representatives for Finland and Latvia’s parliaments did not immediately respond to requests for comment on Thursday.According to cybersecurity experts, NoName057(16) and Killnet have worked together in the past. In late June they carried out several DDoS attacks against government websites in Italy, Romania, Germany, Norway, Lithuania, the Czech Republic and Latvia.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-12",
      "title": "FBI: Zeppelin ransomware may encrypt devices multiple times in attacks",
      "text": " The Cybersecurity and Infrastructure Security Agency (CISA) and the Federal Bureau of Investigation (FBI) warned US organizations today that attackers deploying Zeppelin ransomware might encrypt their files multiple times.The two federal agencies also shared tactics, techniques, and procedures (TTPs) and indicators of compromise (IOCs) to help security professionals detect and block attacks using this ransomware strain.They are also known for stealing data for double extortion and making ransom requests in Bitcoin, with the initial demands ranging from several thousand dollars to more than a million dollars.Valuable data that can help identify the attackers behind this ransomware gang includes \"boundary logs showing communication to and from foreign IP addresses, a sample ransom note, communications with Zeppelin actors, Bitcoin wallet information, decryptor files, and/or a benign sample of an encrypted file.\"The FBI added that it does not encourage paying Zeppelin ransom demands and advised victims against it since they'll have no guarantee that paying the ransom will prevent data leaks or future attacks. Instead, giving into their demands will likely motivate the attackers to target more victims and incentivize other cybercrime groups to join them in ransomware attacks.CISA and the FBI also advised organizations to take measures to defend against Zeppelin ransomware attacks, such as:"
   }
]