[
   {
      "time": "2022-08-09",
      "title": "deBridge Finance crypto platform targeted by Lazarus hackers",
      "text": " Hackers suspected to be from the North Korean Lazarus group tried their luck at stealing cryptocurrency from deBridge Finance, a cross-chain protocol that enables the decentralized transfer of assets between various blockchains.The threat actor used a phishing email to trick company employees into launching malware that collected various information from Windows systems and allowed the delivery of additional malicious code for subsequent stages of the attack.The hackers targeted deBridge Finance employees on Thursday with an email purporting to be from the company co-founder, Alex Smirnov, allegedly sharing new information about salary changes.The email reached multiple employees and included an HTML file named ‘New Salary Adjustments’ that pretended to be a PDF file along with a Windows shortcut file (.LNK) that poses as a plain text file containing a password.Clicking the fake PDF opened a cloud storage location claiming to provide a password-protected archive containing the PDF, thus bringing the target to launching the fake text file to obtain the password.In a thread on Twitter, Smirnov explains that the LNK file executes the Command Prompt with the following command that retrieves a payload from a remote location:The script was created to show a Notepad with the “pdf password: salary2022” and to check if the compromised system is protected by a security solution from ESET, Tencent, or Bitdefender.Smirnov says that if the processes for the abovementioned security products are not present, the generated malicious file was saved in the startup folder, to ensure persistence.This allowed the malware to achieve persistence and send out requests to the attacker’s command and control server for further instructions.At this stage, the threat actor collected details about the infected system like username, operating system, CPU, network adapters, and running processes.Smirnov says that the malware used in the attack was flagged by a small number of antivirus solutions.The email was sent to multiple deBridge employees but most of them reported it as suspicious. However, one of them took the bait and downloaded and opened the document, which allowed Smirnov to analyze the attack.The connection to the North Korean hackers in the Lazarus group was possible due the overlap in file names and infrastructure used in a previous attack attributed to the threat actor.While the file names are different, the attacker used the same fake PDF trick mask the malicious file and to get the victim to execute it.In both attacks on deBridge and Woo Network, the hackers used malware for Windows systems. If a macOS system was detected, the victim would get a ZIP archive with a real PDF file.North Korea's Lazarus group has been focusing on hitting companies that rely in their business on blockchain technology and dececentralization concepts.The threat actor uses social engineering tricks to establish a foothold on the victim computer and then tries to find a way to syphon cryptocurrency funds and assets."
   },
   {
      "time": "2022-08-09",
      "title": "Windows devices with newest CPUs are susceptible to data damage",
      "text": " Microsoft has warned today that Windows devices with the newest supported processors are susceptible to \"data damage\" on Windows 11 and Windows Server 2022.\"Windows devices that support the newest Vector Advanced Encryption Standard (AES) (VAES) instruction set might be susceptible to data damage,\" the company revealed today.Devices affected by this newly acknowledged known issue use AES-XTS (AES XEX-based tweaked-codebook mode with ciphertext stealing) or AES-GCM (AES with Galois/Counter Mode) block cipher modes on new hardware.While Microsoft mentions the data loss risks on affected systems, the company does not elaborate on what customers should expect if they're hit by this issue.Microsoft says the issue was addressed to prevent further data damage in preview and security releases issued on May 24 and June 14, respectively.However, these Windows updates also come with a performance hit since AES-based operations might be two times (2x) slower after installing them on affected systems running Windows Server 2022 and Windows 11 (original release).Scenarios impacted by the performance hit might include BitLocker, Transport Layer Security (TLS) (specifically load balancers), and disk throughput (especially for enterprise customers).\"We added new code paths to the Windows 11 (original release) and Windows Server 2022 versions of SymCrypt to take advantage of VAES (vectorized AES) instructions,\" Microsoft said when describing the cause of the issue.\"SymCrypt is the core cryptographic library in Windows. These instructions act on Advanced Vector Extensions (AVX) registers for hardware with the newest supported processors.\"Microsoft says these Windows updates will restore initial performance metrics once installed on affected devices.\"Performance will be restored after you install the June 23, 2022 preview release or the July 12, 2022 security release.\""
   },
   {
      "time": "2022-08-09",
      "title": "Twilio, a texting platform popular with political campaigns, reports breach | CyberScoop",
      "text": " \n\nAugust 8, 2022\n\nTwilio says it became aware of the hack on Aug. 4 and has reached out to its customers and is working with the ones affected by the incident. The company has more than 150,000 customers, including political campaigns and government agencies. The company’s platform is used to automate phone calls, text messages and other communications to customers or voters in the case of political organizations. Twilio’s government customers include the Department of Veterans Affairs and Government Services Administration, among others.In an email to CyberScoop, Twilio declined to provide additional information about the scope of the breach, including what customer data may have been accessed.According to a blog post from the company, attackers were unable to gain unauthorized access to Twilio customer accounts after successfully tricking several employees into providing their credentials. The hackers sent employees texts posing as Twilio’s IT department, warning the employees their passwords had expired and directing them to a link that impersonated the company’s login page. Twilio says it’s worked with U.S. phone carriers and hosting providers to shut down the infrastructure used by the attackers. “We have heard from other companies that they, too, were subject to similar attacks, and have coordinated our response to the threat actors – including collaborating with carriers to stop the malicious messages, as well as their registrars and hosting providers to shut down the malicious URLs,” Twilio wrote in a blog. “Despite this response, the threat actors have continued to rotate through carriers and hosting providers to resume their attacks.”“The threat actors seemed to have sophisticated abilities to match employee names from sources with their phone numbers,” the company said in a blog."
   },
   {
      "time": "2022-08-09",
      "title": "Treasury Department sanctions cryptocurrency 'mixer' Tornado Cash | CyberScoop",
      "text": " \n\nAugust 8, 2022\n\nThe mixer, which combines various types of crypto assets to mask their origin, has gained notoriety as the money laundering tool of choice for the Lazarus Group, a group of state-sponsored North Korean hackers responsible for a series of massive cryptocurrency heists.The mixer has been used to launder more than $7 billion worth of virtual currency since 2019, including more than $455 million stolen by the Lazarus Group, according to a Treasury press release. That includes funds from a $600 million theft from Ronin Bridge, a technology used by the Axie Infinity video game to connect with the Ethereum blockchain. “Despite public assurances otherwise, Tornado Cash has repeatedly failed to impose effective controls designed to stop it from laundering funds for malicious cyber actors on a regular basis and without basic measures to address its risks,” said Under Secretary of the Treasury for Terrorism and Financial Intelligence Brian E. Nelson. “Treasury will continue to aggressively pursue actions against mixers that launder virtual currency for criminals and those who assist them.”CyberScoop has reached out to Tornado Cash for comment, but has not yet received a response. "
   },
   {
      "time": "2022-08-09",
      "title": "\r\n\tMeta Takes Action Against Cyber Espionage Operations Targeting Facebook in South Asia - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe company made the announcement in its Quarterly Adversarial Threat Report, Second Quarter 2022, which it published last Thursday.In the report, Ben Nimmo, global threat intelligence lead, and David Agranovich, director of threat disruption, provided insight into the risks Meta saw worldwide and across multiple policy violations, particularly those perpetrated by those two hacking groups.\"We took action against a group of hackers — known in the security industry as Bitter APT — that operated out of South Asia, and targeted people in New Zealand, India, Pakistan and the United Kingdom,” read the report.In regard to this operation, Meta said that while the group was relatively low in sophistication and operational security, it was persistent and well-resourced.The group would have used various link-shortening services, malicious domains, compromised websites and third-party hosting providers to distribute their malware.In terms of tactics, techniques, and procedures (TTPs), Bitter would have used a mix of social engineering, an iOS application, an Android malware Meta called Dracarys, and adversarial adaptation.“[The group] targeted people in Afghanistan, India, Pakistan, UAE and Saudi Arabia, including military personnel, government officials, employees of human rights and other non-profit organizations and students.”Just like Bitter APT, Meta said APT36’s TTP were relatively low in sophistication. However, the group was persistent and targeted several services across the internet, including email providers, file-hosting services and social media.“As such, APT36 is known for using a range of different malware  families, and we found that in this recent operation it had also trojanized (non-official) versions of WhatsApp, WeChat and YouTube with another commodity malware family known as Mobzsar or CapraSpy.”According to Meta, these low-cost tools require less technical expertise to deploy, yet yield results for the attackers nonetheless. “It democratizes access to hacking and surveillance capabilities as the barrier to entry becomes lower. It also allows these groups to hide in the ‘noise’ and gain plausible deniability when being scrutinized by security researchers.\""
   },
   {
      "time": "2022-08-09",
      "title": "7-Eleven stores in Denmark closed due to a cyberattack",
      "text": " 7-Eleven stores in Denmark shut down today after a cyberattack disrupted stores’ payment and checkout systems throughout the country.The attack occurred early this morning, August 8th, with the company posting on Facebook that they were likely \"exposed to a hacker attack\".The translated statement says that the company has closed all the stores in the country while investigating the security incident.\"Unfortunately, we suspect that we have been exposed to a hacker attack today, Monday 8 August 2022. This means that we cannot use checkouts and/or receive payment. We are therefore keeping the stores closed until we know the extent. We naturally hope that we can open the stores again soon.\" - 7-Eleven DK.In a now-deleted Reddit post, an alleged 7-Eleven employee in Denmark also confirmed the cyberattack, saying they were forced to close the store after checkout systems stopped working.\"Working at the 7-eleven at Strøget and our checkout system does not work, all the country's 7-eleven run with the same system, so all 7-eleven in Denmark are \"closed\" right now,\" said the 7-Eleven employee on Reddit.\"We ourselves have closed our doors to customers and have put up a sign.\"At this time, there are no further details about the attack, including whether ransomware was involved, which has become the most common cyberattack causing wide-scale outages.BleepingComputer reached out to 7-Eleven to learn more about the attack but was told they have nothing further to share outside of their original statement.This is a developing story."
   },
   {
      "time": "2022-08-09",
      "title": "Greek Intelligence Service Accepts Keeping Surveillance on Journalist  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " The committee's hearing recently was called when the leader of the socialist opposition PASOK party filed a complaint to the prosecutor when his phone was bugged with spyware software. Reuter reports \"Predator spyware can extract passwords, files, photos, and contacts and activate a phone's camera and microphone, enabling surveillance of conversations nearby. Last year when the allegation was reported by Greek media, left-wing SYRIZA, Greece's largest opposition party, asked for the parliamentary committee to convene to look into the matter.\"On the 29th July hearing, the chief of the EYP intelligence service told the parliamentary and transparency committee that his service had kept tabs on Thanasis Koukakis, a financial journalist working for CNN Greece. Lawmakers say that he admits to the surveillance. Giannis Oikonomou denies authorities using spyware that was deployed in the hacking of Koukakis and denied doing any business with companies selling it. The government has nothing to hide and has requested the justice system to enquire about the cases properly. He says without crossing to the extreme of technophobia, such malware does pose a threat and must be tackled efficiently.Spy services in democratic countries always face pressure for being transparent, this includes lawmakers trying to prevent exploitation and better performance, public concern regarding spyware by authorities, and in a few countries, agencies are needed to make the work public to increase the chances of recruitment. Reuters says that agencies say they much balance those demands with the need for secrecy, arguing that much of their work to keep their countries safe should remain classified to protect sources. In April, a Greek prosecutor began an investigation into an allegation by Koukakis that his smartphone had been infected by surveillance software. The European Union regards using spyware against journalists as unacceptable. your nameYour Emailyour message"
   },
   {
      "time": "2022-08-09",
      "title": "\r\n\tHackers Exploit Open Redirect Vulnerabilities to Conduct LogoKit Phishing Campaigns - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistIn particular, the TA would have used highly trusted service domains like Snapchat and other online services to create special URLs that then lead to malicious resources with phishing kits.Resecurity said the tools used as part of these attacks were part of LogoKit, which was previously used in attacks against several financial institutions and online services internationally.“The spike of LogoKit has been identified around the beginning of August, when multiple new domain names impersonating popular services had been registered and leveraged together with Open Redirects,” the advisory read.“While LogoKit is known for a while in the underground, at least since 2015, the cybercrime group behind it is constantly leveraging new tactics.”From a technical standpoint, LogoKit is based on the JavaScript programming language and can change logos (of the impersonated service) and text on landing pages in real-time to make interaction with targeted victims more likely.Once the victim navigates to the URL, their email is then auto-filled in the email or username field, tricking them into believing they’ve logged into the service before. Should the victim then enter their password, LogoKit then performs an AJAX request, sending the target's email and password to an external source, then finally redirecting the victim to their “legitimate” corporate website.As of November 2021, Resecurity said there were over 700 identified domain names used in campaigns leveraging LogoKit, but the company believes their number is constantly growing.“These tactics allow cyber-criminals to masquerade their activity behind the notifications of legitimate services to evade detection,” Resecurity explained."
   },
   {
      "time": "2022-08-09",
      "title": "Researchers Uncover Classiscam Scam-as-a-Service Operations in Singapore",
      "text": " The cybersecurity firm called the operators a \"well-coordinated and technologically advanced scammer criminal network.\"Initial targets included users of popular Russian classifieds and marketplaces, before migrating to Europe and the U.S. There are believed to be over 90 active groups using Classiscam's services to target users in Bulgaria, the Czech Republic, France, Kazakhstan, Kirghizia, Poland, Romania, Ukraine, the U.S., and Uzbekistan.The fraudulent operation spans acrosss 64 countries in Europe, the Commonwealth of Independent States (CIS), and the Middle East, with 169 brands used to carry out the attacks. From April 2020 to February 2022, criminals leveraging Classiscam are said to have made at least $29.5 million in illicit profits.What's notable about this campaign is its heavy reliance on Telegram bots and chats to coordinate operations and create phishing and scam pages.Here is the core of how it all works: The scammers post bait ads on popular marketplaces and classified websites, usually offering game consoles, laptops, and smartphones for sale at significant discounts.When a potential victim contacts the seller (i.e., the threat actor) through the online storefront, the Classiscam operator deceives the target into continuing the chat on a third-party messaging service like WhatsApp or Viber before sending a link to a rogue payment page to complete the transaction.The scheme involves a hierarchy of administrators, workers, and callers. While administrators are in charge of recruiting new members, automating the creation of scam pages, and registering new accounts, it's the workers who create accounts on free classifieds websites and place the decoy ads.Workers, who receive 70-80% of the stolen sums, are also responsible for communicating with the victims through the platform's chat systems and sending phishing links designed to make payments for the purchased goods.\"Workers are key participants of the Classiscam scam scheme: their goal is to attract traffic to phishing resources,\" the researchers said.The phishing URLs, for their part, are generated through Telegram bots that mimic the payment pages of the local classified websites but are hosted on lookalike domains. This however necessitates that the workers send the link with the bait product to the bot.\"After initial contact with the legitimate seller, the scammers generate a unique phishing link that confuses the sellers by displaying the information about the seller's offer and imitating the official classified's website and URL,\" the researchers said. \"Scammers claim that payment has been made and lure the victim into either making a payment for delivery or collecting the payment.\"The phishing pages also include an option to check the victim's bank account balance with the goal of identifying the most \"valuable\" cards.What's more, some cases incorporate an attempt to trick the victims a second time by calling them to request for a refund in order to receive their money back. These calls are made by assistant workers who masquerade as tech support specialists for the platform.In this scenario, the targets are taken to a fraudulent payment page to enter their card details and confirm it by providing a password received via SMS. But instead of a refund, the same amount is debited from the victim's card again.While the aforementioned modus operandi is an instance of seller scam, wherein a buyer (i.e., victim) receives a phishing payment link and is defrauded of their money, there also exists buyer scams.This entails a fraudster contacting a legitimate seller under the guise of a customer and sending a bot-generated fake payment form impersonating a marketplace allegedly for verification purposes. But once the seller enters their bank card information, an amount equivalent to the product's cost is deducted from their account.The entire attack infrastructure operated by Classiscammers comprises 200 domains, 18 of which were created to trick the users of an unnamed Singaporean classified website. Other sites in the network pose as Singaporean moving companies, European, Asian, and Middle Eastern classified websites, banks, marketplaces, food and crypto brands, and delivery companies.\"As it sounds, Classiscam is far more complex to tackle than the conventional types of scams,\" Group-IB's Ilia Rozhnov siad. \"Unlike the conventional scams, Classiscam is fully automated and could be widely distributed. Scammers could create an inexhaustible list of links on the fly.\"\"To complicate the detection and takedown, the home page of the rogue domains always redirects to the official website of a local classified platform.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]