[
   {
      "time": "2022-07-06",
      "title": "New RedAlert Ransomware targets Windows, Linux VMware ESXi servers",
      "text": " A new ransomware operation called RedAlert, or N13V, encrypts both Windows and Linux VMWare ESXi servers in attacks on corporate networks.The ransomware has been called 'RedAlert' based on a string used in the ransom note. However, from a Linux encryptor obtained by BleepingComputer, the threat actors call their operation 'N13V' internally, as shown below.The Linux encryptor is created to target VMware ESXi servers, with command-line options that allow the threat actors to shut down any running virtual machines before encrypting files.The full list of command-line options can be seen below.When running the ransomware with the '-w' argument, the Linux encryptor will shut down all running VMware ESXi virtual machines using the following esxcli command:An interesting feature of RedAlert/N13V is the '-x' command-line option that performs 'asymmetric cryptography performance testing' using these different NTRUEncrypt parameter sets. However, it is unclear if there is a way to force a particular parameter set when encrypting and/or if the ransomware will select a more efficient one.When encrypting files, the ransomware will only target files associated with VMware ESXi virtual machines, including log files, swap files, virtual disks, and memory files, as listed below.In the sample analyzed by BleepingComputer, the ransomware would encrypt these file types and append the .crypt[number] extension to the file names of encrypted files.In each folder, the ransomware will also create a custom ransom note named HOW_TO_RESTORE, which contains a description of the stolen data and a link to a unique TOR ransom payment site for the victim.The Tor payment site is similar to other ransomware operation sites as it displays the ransom demand and provides a way to negotiate with the threat actors.However, RedAlert/N13V only accepts the Monero cryptocurrency for payment, which is not commonly sold in USA crypto exchanges because it is a privacy coin.While only a Linux encryptor has been found, the payment site has hidden elements showing that Windows decryptors also exist.Like almost all new enterprise-targeting ransomware operations, RedAlert conducts double-extortion attacks, which is when data is stolen, and then ransomware is deployed to encrypt devices.This tactic provides two extortion methods, allowing the threat actors to not only demand ransom to receive a decryptor but also demand one to prevent the leaking of stolen data.When a victim does not pay a ransom demand, the RedAlert gang publishes stolen data on their data leak site that anyone can download.Currently, the RedAlert data leak site only contains the data for one organization, indicating that the operation is very new.While there has not been a lot of activity with the new N13V/RedAlert ransomware operation, it is one that we will definitely need to keep an eye on due to its advanced functionality and immediate support for both Linux and Windows."
   },
   {
      "time": "2022-07-06",
      "title": "Marriott confirms latest data breach, possibly exposing information on hotel guests, employees | CyberScoop",
      "text": " \n\nJuly 5, 2022\n\nMarriott International confirmed Tuesday that unknown criminal hackers broke into its computer networks and then attempted to extort the company, marking the latest in a string of successful cyberattacks against one of the world’s biggest hotel chains.A Marriott spokesperson told CyberScoop that the company “is aware of a threat actor who used social engineering to trick one associate at a single Marriott hotel into providing access to the associate’s computer.” The access “only occurred for a short amount of time on one day. Marriott identified and was investigating the incident before the threat actor contacted the company in an extortion attempt, which Marriott did not pay.” The company has notified law enforcement, the spokesperson said. The group claiming responsibility for the attack told Databreaches.net — a news site that focuses on data breaches and cyberattacks — that it stole roughly 20 gigabytes of data, which included credit card information and confidential information about guests and workers from an employee at the BWI Airport Marriott in Baltimore. The attackers “emailed numerous employees” at Marriott about the breach, the site reported, and had been in at least limited communications with Marriott.The Marriott spokesperson said the “incident did involve access to approximately 20 GB of files,” and added that the “size of the files involved is not an indication of the content.”The attackers provided Databreaches.net samples of the documents they claimed to have stolen, and screenshots posted to the site purport to show reservation logs for airline crew members from January 2022 and credit card authorization forms. The site reported that the hackers shared another “relatively recent” file, but Databreaches.net chose not to post it.Marriott told CyberScoop that most of the stolen information was “non-sensitive internal business files regarding the operation of the property.” The company told Databreaches.net that the it would be notifying 300-400 people and regulators, as required, a figure the Marriott spokesperson confirmed late Tuesday to CyberScoop.CyberScoop could not independently verify information about the stolen material or about the attackers claiming responsibility. Updated 7/5/22: to include additional details from the Marriott spokesperson."
   },
   {
      "time": "2022-07-06",
      "title": "Hungarian authority fines data controller EUR 7,500 data breach and rules free online services not suitable for high-risk processing - Lexology",
      "text": " Review your content's performance and reach.Become your target audience’s go-to resource for today’s hottest topics.Understand your clients’ strategies and the most pressing issues they are facing.Keep a step ahead of your key competitors and benchmark against them.add to folder:In the latest decision of the National Authority for Data Protection and Freedom of Information (NAIH), a data controller for a political party, responsible for a data breach where six Excel files were made publicly available through a file-sharing site, must pay a fine of HUF 3 million (EUR 7,500) for infringing data-security provisions of the EU's General Data Protection Regulation (GDPR) and failing to cooperate with the Authority. The breached Files contained a list of personal data (e.g. names, telephone numbers, email addresses, addresses, ID card numbers) of political party members and the party’s operational data. In total, the breach affected approximately 2,000 data subjects.In the present case, the Authority found that the personal data of members, supporters and activists associated with the political party constituted high-risk processing, according to recital 75 of the GDPR, which states that processing data inked to political opinion should be considered inherently risky. In this context, the GDPR also considers it a risk if the processing could lead to discrimination or if the processing involves a large number of data subjects. The processing that could give rise to identity theft or misuse is also considered to be a risk under the GDPR.The range of data in the Files made it possible to identify those who are sympathetic to a political party and perform different tasks in its operation. The way the Files were processed resulted in high-risk for the privacy of the data subjects, since membership of a political organisation, even past membership, reflects the political opinions of the individual. Data concerning political opinions fall into a special category of personal data under Article 9(1) of the GDPR and are subject to stricter rules. The data controller in this case gave senior party officials and activists access to the Files through a link. As a result, thousands of data subjects were able to access the Files online at the same time without restrictions. The Authority found in this context that free online services that allow users to create and edit files online while interacting with other users in real time do not meet a level of data security proportionate to the risks posed by high-risk processing since files from these online services can be easily exported and saved to the personal computers of users without any access control.Despite repeated requests for information, the data controller failed to demonstrate to the Authority exactly what measures were taken to ensure that the controller's data processing complied with the relevant provisions of the GDPR for handling a data breach.Aggravating and mitigating circumstancesIn the imposition of fines, the Authority assessed the following as aggravating circumstances:Mitigating circumstances included:The fact that the Authority was made aware of the breach through an incident report was not explicitly taken into account as a mitigating circumstance.What can data controllers do to avoid fines?In terms of precautions to avoid possible fines, data controllers should consider the following measures:The article was co-authored by Daniella Huszár.add to folder:Regulation (EU) 2016/679 - General Data Protection Regulation (GDPR)"
   },
   {
      "time": "2022-07-06",
      "title": "NPM supply-chain attack impacts hundreds of websites and apps",
      "text": " An NPM supply-chain attack dating back to December 2021 used dozens of malicious NPM modules containing obfuscated Javascript code to compromise hundreds of downstream desktop apps and websites.If fooled by the very similar module naming scheme, they would add the malicious packages designed to steal data from embedded forms (including those used for sign-in) to their apps or websites.For instance, one of the malicious NPM packages used in this campaign (icon-package) has over 17,000 downloads and is designed to exfiltrate serialized form data to several attacker-controlled domains.\"Furthermore, similarities between the domains used to exfiltrate data suggest that the various modules in this campaign are in the control of a single actor.\"While the ReversingLabs team reached out to the NPM security team on July 1, 2022, to report its findings, some IconBurst malicious packages are still available on the NPM registry.\"While a few of the named packages have been removed from NPM, most are still available for download at the time of this report,\" Zanki added.\"As very few development organizations have the ability to detect malicious code within open source libraries and modules, the attacks persisted for months before coming to our attention.\"The only metrics available at the time are the number of times each malicious NPM module has been installed, and ReversingLabs' stats are quite startling.\"While the full extent of this attack isn’t yet known, the malicious packages we discovered are likely used by hundreds, if not thousands of downstream mobile and desktop applications as well as websites,\" Zanki said.\"Malicious code bundled within the NPM modules is running within an unknown number of mobile and desktop applications and web pages, harvesting untold amounts of user data.\"The NPM modules our team identified have been collectively downloaded more than 27,000 times.\""
   },
   {
      "time": "2022-07-06",
      "title": "\r\n\tNIST Acknowledges First Four Quantum-Resistant Encryption Tools - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe US Department of Commerce’s National Institute of Standards and Technology (NIST) has selected the first-ever group of encryption tools that could potentially withstand the attack of a quantum computer.More specifically, for general encryption (used for access to secure websites), NIST has selected the CRYSTALS-Kyber algorithm.For digital signatures, on the other hand,  NIST has selected the three algorithms CRYSTALS-Dilithium, FALCON and SPHINCS+.“NIST constantly looks to the future to anticipate the needs of U.S. industry and society as a whole, and when they are built, quantum computers powerful enough to break present-day encryption will pose a serious threat to our information systems,” commented NIST Director Laurie E. Locascio. “Our post-quantum cryptography program has leveraged the top minds in cryptography — worldwide — to produce this first group of quantum-resistant algorithms that will lead to a standard and significantly increase the security of our digital information.”“NIST’s announcement [...] is a key milestone in the development of quantum-resistant security practices,” Edlyn Teske, a senior crypto expert at Cryptomathic, told Infosecurity Magazine.According to Teske, organizations that invest time and money into achieving true crypto-agility as a near-term priority will be ready to deploy NIST-standardized algorithms as they become available.“[They will also] be much better prepared to protect their assets from post-quantum threats than those who wait.”"
   },
   {
      "time": "2022-07-06",
      "title": "Hive ransomware gets upgrades in Rust | Microsoft Security Blog",
      "text": " April 2023 update – Microsoft Threat Intelligence has shifted to a new threat actor naming taxonomy aligned around the theme of weather. DEV-0237 is now tracked as Pistachio Tempest.Microsoft Threat Intelligence Center (MSTIC) discovered the new variant while analyzing detected Hive ransomware techniques for dropping .key files. We know that Hive drops its encryption keys file, which contains encrypted keys used to decrypt encrypted files, and uses a consistent naming pattern:The said .key files were missing the [VICTIM_IDENTIFIER] part of the file name, prompting deeper analysis of the Hive ransomware that dropped them. This analysis led to the discovery of the new Hive variant and its multiple versions, which exhibit slightly different available parameters in the command line and the executed processes.Analyzing these patterns in samples of the new variants, we discovered even more samples, all with a low detection rate and none being correctly identified as Hive. In this blog we will share our in-depth analysis of the new Hive variant, including its main features and upgrades, with the aim of equipping analysts and defenders with information to better identify and protect organizations against malware attacks relying on Hive.The main difference between the new Hive variant and old ones is the programming language used. The old variants were written in Go (also referred to as GoLang), while the new Hive variant is written in Rust.Hive isn’t the first ransomware written in Rust—BlackCat, another prevalent ransomware, was the first. By switching the underlying code to Rust, Hive benefits from the following advantages that Rust has over other programming languages:The new Hive variant uses string encryption that can make it more evasive. Strings reside in the .rdata section and are decrypted during runtime by XORing with constants. The constants that are used to decrypt the same string sometimes differ across samples, making them an unreliable basis for detection.For example, let’s look at the section where part of the string “!error no flag -u <login>:<password> provided” is decrypted. In one sample (SHA-256: f4a39820dbff47fa1b68f83f575bc98ed33858b02341c5c0464a49be4e6c76d3), the constants are 0x9F2E3F1F and 0x95C9:In another sample (SHA-256: 6e5d49f604730ef4c05cfe3f64a7790242e71b4ecf1dc5109d32e811acf0b053), the constants are 0x3ECF7CC4 and 0x198F:        Some samples do share constants when decrypting the same string. For example, let’s look where the parameter string “-da” is decrypted. In one sample (SHA-256: 88b1d8a85bf9101bc336b01b9af4345ed91d3ec761554d167fe59f73af73f037), the constants are 0x71B4 and 2:In another sample (SHA-256: 33744c420884adf582c46a4b74cbd9c145f2e15a036bb1e557e89d6fd428e724), the constants are the same:In old Hive variants, the username and the password used to access the Hive ransom payment website are embedded in the samples. In the new variant, these credentials must be supplied in the command line under the “-u” parameter, which means that they can’t be obtained by analysts from the sample itself.Like most modern ransomware, Hive introduces command-line parameters, which allow attackers flexibility when running the payload by adding or removing functionality. For example, an attacker can choose to encrypt files on remote shares or local files only or select the minimum file size for encryption. In the new Hive variant, we found the following parameters across different samples:Overall, it appears different versions have different parameters that are constantly updated. Unlike in previous variants where there was a ‘help’ menu, in the new variant, the attacker must know the parameters beforehand. Since all strings are encrypted, it makes finding the parameters challenging for security researchers.Like most sophisticated malware, Hive stops services and processes associated with security solutions and other tools that might get in the way of its attack chain. Hive tries to impersonate the process tokens of trustedinstaller.exe and winlogon.exe so it can stop Microsoft Defender Antivirus, among other services.Hive stops the following services:It also stops the following processes:As part of its ransomware activity, Hive typically runs processes that delete backups and prevent recovery. There are differences between versions, and some samples may not execute all these processes, but one sample that starts the most processes is SHA-256: 481dc99903aa270d286f559b17194b1a25deca8a64a5ec4f13a066637900221e:Hive’s ransom note has also changed, with the new version referencing the .key files with their new file name convention and adding a sentence about virtual machines (VMs).The older variants had an embedded username and password (marked as hidden). In the new variant, the username and password are taken from the command line parameter -u and are labeled test_hive_username and test_hive_password.Old ransom note text:New ransom note text:A unique encryption approachThe new Hive variant uses a unique approach to file encryption. Instead of embedding an encrypted key in each file that it encrypts, it generates two sets of keys in memory, uses them to encrypt files, and then encrypts and writes the sets to the root of the drive it encrypts, both with .key extension.To indicate which keys set was used to encrypt a file, the name of the .key file containing the corresponding encryption keys is added to the name of the encrypted file on disk, followed by an underscore and then a Base64 string (also adding underscore and hyphen to the character set). Once it’s Base64-decoded, the string contains two offsets, with each offset pointing to a different location in the corresponding .key file. This way, the attacker can decrypt the file using these offsets.For example, after running Hive, we got the following files dropped to the C:\\ drive:In this example, a file named myphoto.jpg would be renamed to C:\\myphoto.jpg.l0Zn68cb _ -B82BhIaGhI8. As we discuss in the following sections, the new variant’s keys set generation is entirely different from old variants. However, its actual file encryption is very similar.Keys set generationA buffer of size 0xCFFF00 bytes is allocated. Using two custom functions to generate random bytes (labeled “random_num_gen” and “random_num_gen_2” for demonstration purposes) the buffer is filled. The first 0xA00000 bytes of this buffer are filled with random bytes and the remaining 0x2FFF00 bytes are simply copied from the first 0x2FFF00 random bytes that were copied earlier to the buffer.The content of each buffer is a keys set (a collection of symmetric keys). Since two buffers are allocated, there are two keys sets. In the encryption process, the malware randomly selects different keys (byte sequences) for each file from one of the keys set and uses them to encrypt the file by XORing the byte sequence of the keys with the file’s content.A custom 64-byte hash is prepared for each keys set. This hash will be used later.After the hash is computed and several other strings are decrypted, the encryption process takes the following steps:Now that the keys set is finally encrypted, the nonce, victim_public_key, the now-encrypted keys set, and the authentication tag are copied to a new buffer, one after another. This buffer (which we label encrypted_structure_1) is treated as a new keys set, which is again encrypted using the same method described above but with a second hive_public_key. This time, the function outputs new nonce, victim_private_key, and others. Only the associated data is the same.Finally, the new buffer, which contains the second_nonce, second_victim_public_key, and the encryptedencrypted_structure_1, is written to the root of the drive it’s encrypting (for example, C:\\). The create_extension function generates a Base64 string based on the first six bytes of the custom hash that was created earlier. This Base64 string serves as the file name, and the extension of the file is simply “.key”.The diagram below illustrates the encryption scheme described above:As seen in the diagram above, “Keys sets encryption flow” is executed twice. In the first round it is executed with the original keys set as an input. In the second round it is executed with the “encrypted structure 1” as an input. In its second execution, all other input values are different except the AD (associated data) and the Basepoint 9.Hence, the following values are new in the second execution: victim_private_key, victim_public_key, hive_public_key, nonce, shared_secret and derived_key.File encryptionAfter both keys files are written to the disk, the multi-threaded file encryption starts. Before encrypting each file, the malware checks its name and extension against a list of strings. If there is a match, then the file will not be encrypted. For example, a file with .exe extension will not be encrypted if .exe is in the list of strings. It should be noted that this list is encrypted and decrypted during runtime.The same file encryption method seen in old variants is used in the new one: two random numbers are generated and used as offsets to the keys set. Each offset is four bytes:For the encryption, the file’s content is XORed with bytes from the keys set, according to the offsets. The file bytes are XORed twice—once according to the first offset and a second time according to the second offset. Files are encrypted in blocks of 0x100000 bytes, with the maximum number of blocks at 100. There is an interval between the encrypted blocks as defined by block_space. After the encryption is finished in memory, the encrypted data is written to the disk, overwriting the original file.Looking at when create_extension is called once file encryption has started, we recognized a similar structure in the previous variant:Let us look at the value (72 D7 A7 A3 F5 5B FF EF 21 6B 11 7C 2A 18 CD 00) in the address of r9 register just before create_extension is called on a file called EDBtmp.logAnd if we step over create_extension, the result is similar—we get cteno_Vb as the .key file name (note: Since Hive uses a different Base64 character set, “/” was replaced with “_”):Microsoft will continue to monitor the Hive operators’ activity and implement protections for our customers. The current detections, advanced detections, and indicators of compromise (IOCs) in place across our security products are detailed below.The techniques used by the new Hive variant can be mitigated by adopting the security considerations provided below:For Microsoft 365 Defender customers, the following checklist eliminates security blind spots:The below list provides a partial list of the IOCs observed during our investigation and included in this blog. We encourage our customers to investigate these indicators in their environments and implement detections and protections to identify past related activity and prevent future attacks against their systems.NOTE: These indicators shouldn’t be considered exhaustive for this observed activity.Microsoft Defender AntivirusMicrosoft Defender Antivirus provides detection for this threat under the following family names with build version 1.367.405.0 or later.Microsoft Defender for Endpoint detectionMicrosoft Defender for Endpoint customers may see any or a combination of the following alerts as an indication of possible attack. These alerts are not necessarily an indication of a Hive compromise, but should be investigated:To locate possible Hive ransomware activity mentioned in this blog post, Microsoft Sentinel customers can use the queries detailed below:Identify Hive ransomware IOCsThis query identifies a match across various data feeds for IOCs related to Hive ransomware.Identify backup deletionThis hunting query helps detect a ransomware’s attempt to delete backup files.Identify Microsoft Defender Antivirus detection of Hive ransomwareThis query looks for Microsoft Defender Antivirus detections related to the Hive ransomware and joins the alert with other data sources to surface additional information such as device, IP, signed-in users, etc.\n\t\t\tMicrosoft has been tracking activity related to the financially motivated threat actor Octo Tempest, whose evolving campaigns represent a growing concern for many organizations across multiple industries.\t\t\n\t\t\tThe threat actor that Microsoft tracks as Storm-0324 is a financially motivated group known to gain initial access using email-based initial infection vectors and then hand off access to compromised networks to other threat actors. These handoffs frequently lead to ransomware deployment. Beginning in July 2023, Storm-0324 was observed distributing payloads using an open-source tool […]\t\t\n\t\t\tAt CyberWarCon 2022, Microsoft and LinkedIn analysts presented several sessions detailing analysis across multiple sets of actors and related activity.\t\t\n\t\t\tProviding advanced protection against increasingly sophisticated human-operated ransomware, Microsoft Defender for Endpoint’s network protection leverages threat intelligence and machine learning to block command-and-control (C2) communications.\t\tMicrosoft is a leader in cybersecurity, and we embrace our responsibility to make the world a safer place."
   },
   {
      "time": "2022-07-06",
      "title": "Microsoft quietly fixes ShadowCoerce Windows NTLM Relay bug",
      "text": " Microsoft has confirmed it fixed a previously disclosed 'ShadowCoerce' vulnerability as part of the June 2022 updates that enabled attackers to target Windows servers in NTLM relay attacks.As BleepingComputer was told by a Microsoft spokesperson, while there was no public announcement made regarding this issue, the \"MS-FSRVP coercion abuse PoC aka 'ShadowCoerce' was mitigated with CVE-2022-30154, which affected the same component.\"While it is good that Microsoft has fixed this vulnerability, they have not yet provided any details publicly and is yet to assign a CVE ID.It would be nice if MS were more open about this. I find unbelievable that in many ways MS is more secretive about security now than in the \"bad old days\" unless they can throw a marketing spin on it. Material security changes should be clearly documented in security bulletins.Luckily, this attack method can only coerce authentication over the MS-FSRVP (File Server Remote VSS Protocol) on systems where the File Server VSS Agent Service is enabled.Unfortunately, as Gilles demonstrated, this protocol is also vulnerable to NTLM relay attacks that enable threat actors to force (or coerce) a domain controller to authenticate against a malicious NTLM relay under their control.The malicious server then relays (or forward) the authentication request to a domain's Active Directory Certificate Services (AD CS) to get a Kerberos ticket-granting ticket (TGT) which allows the attacker to impersonate any network device, including a Windows domain controller.After impersonating a domain controller, they will gain elevated privileges that can be used to take over the Windows domain.However, these types of attacks require a network to already be compromised by a threat actor and for the associated services to be running and accessible on a targeted server.When asked for more details about DFSCoerce, Microsoft advised admins to enable multi-factor authentication and install all available security updates as soon as possible to block the DFSCoerce attack in their environments."
   },
   {
      "time": "2022-07-06",
      "title": "Brute Ratel C4 Red Teaming Tool Being Abused by Malicious Actors",
      "text": " July 5, 2022 at 6:00 AMUnit 42 continuously hunts for new and unique malware samples that match known advanced persistent threat (APT) patterns and tactics. On May 19, one such sample was uploaded to VirusTotal, where it received a benign verdict from all 56 vendors that evaluated it. Beyond the obvious detection concerns, we believe this sample is also significant in terms of its malicious payload, command and control (C2), and packaging.In terms of C2, we found that the sample called home to an Amazon Web Services (AWS) IP address located in the United States over port 443. Further, the X.509 certificate on the listening port was configured to impersonate Microsoft with an organization name of “Microsoft” and organization unit of “Security.” Additionally, pivoting on the certificate and other artifacts, we identified a total of 41 malicious IP addresses, nine BRc4 samples, and an additional three organizations across North and South America who have been impacted by this tool so far.Overall, we believe this research is significant in that it identifies not only a new red team capability that is largely undetectable by most cybersecurity vendors, but more importantly, a capability with a growing user base that we assess is now leveraging nation-state deployment techniques. This blog provides an overview of BRc4, a detailed analysis of the malicious sample, a comparison between the packaging of this sample and a recent APT29 sample, and a list of indicators of compromise (IoCs) that can be used to hunt for this activity.We encourage all security vendors to create protections to detect activity from this tool and all organizations to be on alert for activity from this tool.Palo Alto Networks customers receive protections from the threats described in this blog through Threat Prevention, Cortex XDR and WildFire malware analysis.However, of greater concern, the release description also specifically noted that “this release was built after reverse engineering several top tier EDR and Antivirus DLLs.”Our analysis highlights the ongoing and relevant debate within the cybersecurity industry surrounding the ethics relating to the development and use of penetration testing tools that can be exploited for offensive purposes.BRc4 currently advertises itself as “A Customized Command and Control Center for Red Team and Adversary Simulation.” On May 16, Nayak announced that the tool had gained 480 users across 350 customers.The latest version, Brute Ratel v1.0 (Sicilian Defense) was released a day later on May 17, and is currently offered for sale at a price of $2,500 per user and $2,250 per renewal. With this price point and customer base, BRc4 is positioned to take in more than $1 million dollars in sales over the next year.Figure 3. BRc4 licensing and cost.In terms of features, BRc4 advertises the following capabilities:The file in VirusTotal named Roshan_CV.iso (SHA256: 1FC7B0E1054D54CE8F1DE0CC95976081C7A85C7926C03172A3DDAA672690042C) appears to be a curriculum vitae (similar to a resume) of an individual named Roshan. It was uploaded to VirusTotal on May 19, 2022, from Sri Lanka. The ISO file extension refers to an optical disc image file, derived from the International Organization for Standardization’s ISO 9960 file system, which is typically used to back up files for CD/DVD. The ISO file is not malicious and requires a user to double-click, which mounts the ISO as a Windows drive. Finally, the archived files of the ISO are displayed to the user. In this case, when the ISO is double-clicked, a user is presented with the following:As depicted in Figure 5, the user would see a file named Roshan-Bandara_CV_Dialog, which has a fake icon image of Microsoft Word, purporting to be an individual's CV, and written in Microsoft Word. From the window dialog box it can be ascertained that the ISO was assembled on May 17, 2022, which coincidentally is the same day the new BRc4 was released.If the user were to double-click on the file, it would then install Brute Ratel C4 on the user's machine.By default, on Windows operating systems, hidden files are not displayed to the user. In Figure 6, there are four hidden files concealed from view. If the display of hidden files is enabled, the user sees the following:The lure file, the one visible to the user, is a Windows shortcut file (LNK) with the following properties:Microsoft shortcut files, those with a .lnk file extension, contain enriched metadata that can be used to provide artifacts about the file. Some key artifacts of this file are:When Roshan-Bandara_CV_Dialog is double-clicked, the following actions occur:Figure 8 below gives an overview of how this process would look.The composition of the ISO file, Roshan_CV.ISO, closely resembles that of other nation-state APT tradecraft. The following table shows a side-by-side comparison of Roshan_CV.ISO and that of a previously identified APT29 sample (Decret.ISO).The following images show how Roshan_CV.ISO and Decret.ISO would look to a user when double-clicked. Figure 9 is a screenshot of the default Windows File Explorer; “show hidden files” is not checked. In both images, the user is presented with a shortcut file (LNK file) that starts the malicious activity when double-clicked.Figure 10 shows how the ISOs would appear when show hidden files” is enabled for viewing.The flow of execution is the following:Roshan_CV.ISO→Roshan-Bandar_CV_Dialog.LNK→cmd.exe→OneDriveUpdater.exe→version.dll→OneDrive.UpdateDecret.ISO→Decret.LNK→cmd.exe→HPScan.exe→version.dll→HPScanApi.dllThe delivery of packaged ISO files is typically sent via spear phishing email campaigns or downloaded to the victim by a second-stage downloader.While we lack insight into how this particular payload was delivered to a target environment, we observed connection attempts to the C2 server originating from three Sri Lankan IP addresses between May 19-20.Version.dll is a modified version of a legitimate Microsoft file written in C++. The implanted code is used to load and decrypt an encrypted payload file. The decrypted payload is that of shellcode (x64 assembly) that is further used to execute Brute Ratel C4 on the host.In order for Version.dll to maintain its code capabilities for OneDriveUpdater.exe, the actors include the legitimate digitally signed Microsoft version.dll and named it vresion.dll. Any time OneDriveUpdater.exe makes a call into the actor’s Version.dll, the call is proxied to vresion.dll. Because of this, the actor’s version.dll will load vresion.dll as a dependency file.The implanted code begins when the DLL is loaded via DLL_PROCESS_ATTACH and performs the following at the DLLMain subroutine:The technique outlined above uses process injection via undocumented Windows NTAPI calls. The decrypted payload is now running within the runtimebroker.exe memory space. The following is a snippet of code from version.dll that starts the execution of the in-memory decrypted payload.The decrypted payload file is x64 shellcode (assembly instructions) that involves a series of executions to unpack itself. The assembly instructions involve multiple push and mov instructions. The purpose of this is to copy the Brute Ratel C4 code (x64 assembly) onto the stack eight bytes at a time and eventually reassemble it into a memory space for execution – a DLL with a stripped MZ header. Using a series of push and mov instructions evades in-memory scanning as the shellcode is assembled in blocks versus the entire code base being exposed for scanning. The entry point of the decrypted payload is the following:The unpacking involves 25,772 push and 25,769 mov instructions. When finished, the code performs the following.The following is a snippet of the code that calls NtCreateThreadEx and starts the execution of the second-stage shellcode.The configuration data is passed as a parameter to the start address of the new thread. This data includes the encrypted configuration settings for Brute Ratel C4. The encrypted contents are the following:The data is base64-encoded and RC4-encrypted. The 16-byte RC4 decryption key is: bYXJm/3#M?:XyMBFThe decrypted configuration file is:Each parameter is delineated with a pipe | character, and one of the values is the IP seen earlier of 174.129.157[.]251 and port of 443.Once the SSL handshake to IP 174.129.157[.]251 is complete, the following data is sent via HTTP POST to the Brute Ratel C4 listener port.To identify the decrypted in-memory payload as being associated with Brute Ratel C4, we conducted hunting based on the unique in-memory assembly instructions, push and mov. These instructions are used to build the second layer of shellcode. Searching across VirusTotal, we found a second sample with the same push and mov instructions:Side-by-side comparison of the entry point of badger_x64.exe and our decrypted OneDrive.Update sample:When badger_x64.exe is finished with the push and mov instructions, it makes the same Windows API calls as OneDrive.Update using API hashing, but does not use direct syscall (a user configuration feature of Brute Ratel C4). Example of badger_x64.exe:Like the OneDrive.Update sample, the parameter passed to the calling thread is the configuration data for Brute Ratel C4. In this sample, the data is not base64-encoded or RC4-encrypted, and is passed in the clear. The following is the configuration used for this sample:In this case, the sample is configured to communicate with IP 159.65.186[.]50 on TCP port 443.Based on the following, we can conclude that OneDrive.Update is indeed associated with Brute Ratel C4.The file badger_x64.exe is a standalone x64 executable that runs Brute Ratel C4 (badger payload) while the decrypted OneDrive.Update file is the in-memory component of Brute Ratel C4 that is executed using the actor's modified DLL, version.dll.After validating that badger_x64.exe and OneDrive.Update were both BRc4 payloads, we set to work analyzing the employment of this second sample.VirusTotal records revealed that the sample was uploaded by a web user in Ukraine on May 20, 2022. Coincidentally, this happens to be one day after the ​​Roshan_CV.ISO file was uploaded.As noted above, the sample was configured to call home to 159.65.186[.]50 on port 443. Palo Alto Networks Cortex Xpanse history shows that this port was open from May 21-June 18, 2022, with the same “Microsoft Security” self-signed SSL certificate seen above. Given this timeline, it's worth noting that the sample was actually uploaded to VirusTotal prior to the C2 infrastructure being configured to listen for the callbacks.Evaluating netflow connections for 159.65.186[.]50 during this time window revealed several connections to ports 22, 443 and 8060 originating from a Ukrainian IP (213.200.56[.]105). We assess this Ukrainian address is likely a residential user IP that was leveraged to administer the C2 infrastructure. A deeper look at connections in and out of 213.200.56[.]105 further revealed several flows over UDP port 33445. This port is commonly used by Tox, a secure peer-to-peer chat and video application that offers end-to-end encryption.Examining additional connections to port 443 on 159.65.186[.]50, we identified several suspected victims including an Argentinian organization, an IP television provider providing North and South American content, and a major textile manufacturer in Mexico. Coincidentally, recent attempts to browse the textile manufacturer’s website result in a 500 internal server error message.Given the geographic dispersion of these victims, the upstream connection to a Ukrainian IP and several other factors, we believe it is highly unlikely that BRc4 was deployed in support of legitimate and sanctioned penetration testing activities.Over the past year, the fake Microsoft Security X.509 certificate has been linked to 41 IP addresses. These addresses follow a global geographic dispersion and are predominantly owned by large virtual private server (VPS) hosting providers. Expanding our research beyond the two samples discussed above, we have also identified an additional seven samples of BRc4 dating back to February 2021.For Palo Alto Networks customers, our products and services provide the following coverage associated with this group:The emergence of a new penetration testing and adversary emulation capability is significant. Yet more alarming is the effectiveness of BRc4 at defeating modern defensive EDR and AV detection capabilities.Over the past 2.5 years this tool has evolved from a part-time hobby to a full-time development project with a growing customer base. As this customer base has expanded into the hundreds, the tool has gained increased attention across the cybersecurity domain from both legitimate penetration testers as well as malicious cyber actors.The analysis of the two samples described in this blog, as well as the advanced tradecraft used to package these payloads, make it clear that malicious cyber actors have begun to adopt this capability. We believe it is imperative that all security vendors create protections to detect BRc4 and that all organizations take proactive measures to defend against this tool.Note that the Microsoft name and logo shown are an attempt to impersonate a legitimate organization and do not represent an actual affiliation with Microsoft. This impersonation does not imply a vulnerability in Microsoft’s products or services.Brute Ratel C4 ISO Samples:1FC7B0E1054D54CE8F1DE0CC95976081C7A85C7926C03172A3DDAA672690042CX64 Brute Ratel C4 Windows Kernel Module:31ACF37D180AB9AFBCF6A4EC5D29C3E19C947641A2D9CE3CE56D71C1F576C069APT29 ISO Samples:F58AE9193802E9BAF17E6B59E3FDBE3E9319C5D27726D60802E3E82D30D14D46X64 Brute Ratel C4 Samples:3ED21A4BFCF9838E06AD3058D13D5C28026C17DC996953A22A00F0609B0DF3B9\n3AD53495851BAFC48CAF6D2227A434CA2E0BEF9AB3BD40ABFE4EA8F318D37BBE\n973F573CAB683636D9A70B8891263F59E2F02201FFB4DD2E9D7ECBB1521DA03E\nDD8652E2DCFE3F1A72631B3A9585736FBE77FFABEE4098F6B3C48E1469BF27AA\nE1A9B35CF1378FDA12310F0920C5C53AD461858B3CB575697EA125DFEE829611\nEF9B60AA0E4179C16A9AC441E0A21DC3A1C3DC04B100EE487EABF5C5B1F571A6\nD71DC7BA8523947E08C6EEC43A726FE75AED248DFD3A7C4F6537224E9ED05F6F\n5887C4646E032E015AA186C5970E8F07D3ED1DE8DBFA298BA4522C89E547419BMalicious DLLs:EA2876E9175410B6F6719F80EE44B9553960758C7D0F7BED73C0FE9A78D8E669Malicious Encrypted Payloads:B5D1D3C1AEC2F2EF06E7D0B7996BC45DF4744934BD66266A6EBB02D70E35236EX.509 Cert SHA1s:55684a30a47476fce5b42cbd59add4b0fbc776a3\n66aab897e33b3e4d940c51eba8d07f5605d5b275Infrastructure linked to X.509 Certs or Samples:104.6.92[.]229\n137.184.199[.]17\n138.68.50[.]218\n138.68.58[.]43\n139.162.195[.]169\n139.180.187[.]179\n147.182.247[.]103\n149.154.100[.]151\n15.206.84[.]52\n159.223.49[.]16\n159.65.186[.]50\n162.216.240[.]61\n172.105.102[.]247\n172.81.62[.]82\n174.129.157[.]251\n178.79.143[.]149\n178.79.168[.]110\n178.79.172[.]35\n18.133.26[.]247\n18.130.233[.]249\n18.217.179[.]8\n18.236.92[.]31\n185.138.164[.]112\n194.29.186[.]67\n194.87.70[.]14\n213.168.249[.]232\n3.110.56[.]219\n3.133.7[.]69\n31.184.198[.]83\n34.195.122[.]225\n34.243.172[.]90\n35.170.243[.]216\n45.144.225[.]3\n45.76.155[.]71\n45.79.36[.]192\n52.48.51[.]67\n52.90.228[.]203\n54.229.102[.]30\n54.90.137[.]213\n89.100.107[.]65\n92.255.85[.]173\n92.255.85[.]44\n94.130.130[.]43\nds.windowsupdate.eu[.]orgUpdated July 6, 2022, at 9:30 a.m. PT. Sign up to receive the latest news, cyber threat intelligence and research from usPlease enter your email address!Please mark, I'm not a robot!© 2023 Palo Alto Networks, Inc. All rights reserved."
   },
   {
      "time": "2022-07-06",
      "title": "\r\n\tUK Councils and Hospitals Vulnerable to Cyber Hackers - Infosecurity Magazine\r\n",
      "text": " Deputy Editor, Infosecurity MagazineAn investigation into cybersecurity at UK public services revealed a large disparity in defense budgets, hundreds of website vulnerabilities and staff email addresses and passwords at one council posted in full online.The ITV News investigation found that one UK council spent only £32,000 a year on cybersecurity. By comparison, another council – with a smaller population – had an annual cybersecurity budget of £1m, over 30 times larger.The investigation also revealed that one hospital had only put aside £10,000 a year towards cybersecurity.The investigation is withholding the names of the public institutions.ITV News found that the cyber-attacks had caused real-life problems, including:The investigation noted that various experts expressed concern to ITV News about a lack of clarity and standards for public services regarding cybersecurity.The local authority with the worst record for human-caused data breaches was Hampshire County Council, with 3759 incidents since 2016. This included 902 breaches in the year 2018/19.Gloucestershire County Council had the next worst record, suffering 2723 breaches in this period. It also experienced the largest increase from 2016/17 (90) to 2020/21 (1004) of any UK council, a rise of 1016%.“The public sector is a potential gold mine for cyber-criminals, with personal and health information being a target for identity fraud and broader financial crime. The ITV investigation into public sector spending revealed a ‘disparity in defense budgets’ and many vulnerabilities, with one hospital spending just £10,000 a year on cybersecurity. “Cyber-attacks pose a real threat to the public sector. According to ICO data analyzed by CybSafe, local government accounted for 10% of all cyber incidents in 2021 and 5% of total cyber-attacks, an almost 50% increase from the number of attacks in 2020. “Realistic funding, along with the right strategies, is vital to safeguard employees and members of the public. Public sector organizations must take steps to not only raise awareness of new and emerging cyber threats but also provide effective security training and support.“By equipping and empowering employees with the knowledge and know-how to spot and avoid attacks, the UK’s local authorities will be able to remain one step ahead. This isn’t just about technical defenses; it’s about supporting people in their day-to-day lives.”"
   }
]