[
   {
      "time": "2022-11-02",
      "title": "OpenSSL project reveals details around pair of vulnerabilities as it downgrades severity  | SC Media",
      "text": "  The OpenSSL Project released Tuesday a patch to fix two high severity security vulnerabilities that could allow attackers to execute code remotely and shut down networks.   “Currently, under 16,000 publicly accessible servers worldwide are running potentially vulnerable versions of OpenSSL 3.X while around 238,000 servers are still vulnerable to Heartbleed, which was disclosed eight years ago,” Perkal noted.  While some researchers have voiced on Twitter that OpenSSL has overhyped the threats, Brian Fox, co-founder, and CTO of Sonatype, said that OpenSSL had made the right decision to pre-announce the vulnerability.  “Some people might be let down that it is not as bad as they hoped. But I think that is evidence of success because the opposite is that everyone is scrambling and woefully unprepared,” Fox told SC Media. “In fact, in our recent report, we have data that clearly indicates the more widely publicized a vulnerability is, the faster people respond.”  Conversely, Claire Tills, senior research engineer at Tenable, expressed concerns over disclosing the vulnerability before the investigation was completed, warning that it might have caused unnecessary strain on defender resources before OpenSSL officially announced the issues. “That being said, this is an opportunity for organizations to evaluate their response processes and understand what can be improved,” Tills told SC Media. “Here are some questions organizations should reflect on — How difficult was it for organizations to determine which version of OpenSSL they had deployed or whether any software they relied on was vulnerable? \"Were their communication channels maturing enough to get the correct information to the people who needed it as soon as it was available?” Menghan Xiao is a cybersecurity reporter at SC Media, covering software supply chain security, workforce/business, and threat intelligence. Before SC Media, Xiao studied journalism at Northwestern University, where she received a merit-based scholarship from Medill and Jack Modzelewski Scholarship Fund.The new PCI DSS standard puts more focus on application security, with more tools, testing and documentation required of developers.GitHub has updated its Advanced Security platform available for Enterprise Cloud and Enterprise Server customers to provide new artificial intelligence-powered features in a bid to \"revolutionize\" secure app development, reports SecurityWeek.Vulnerabilities in API authorization have been named by Wallarm as the second greatest security risk facing APIs, emphasizing the ease of leveraging authorizations as backdoors as well as the urgent need to ensure authorization maintenance, reports SiliconAngle.Tue Aug 27 - Wed Aug 28Tue Dec 5On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-11-02",
      "title": "World leaders make fresh vows to fight global ransomware threat",
      "text": " A coalition of government cybersecurity leaders from nearly 40 countries on Tuesday reaffirmed to work together to stamp out ransomware attacks, launching several new efforts meant to better combat the rising global threat.The group “committed not only to protecting ourselves and each other from ransomware, but also to helping other countries protect and disrupt so that ransomware is unable to gain traction worldwide,” vowing to offer technical and threat information and protection “as broadly as possible.”Members also promised to \"work together to increase political costs on countries that harbor and enable ransomware actors,” a reference to countries like Russia.In addition to leaders from 37 countries, a group of 13 private companies — such as tech giant Microsoft and cybersecurity firms Mandiant and CrowdStirke — participated in the event.The second annual meeting comes as ransomware incidents seem to be accelerating worldwide, with almost daily attacks on the private sector, with the health care and education sectors becoming an increasingly favorite target of digital criminal organizations.\"We've heard repeatedly that our adversaries are not kids and hoodies. They're well-trained, well-funded, professionally organized. They're innovative and they evolve. But so are we,” Nate Fick, the country's first cyber ambassador, said at the coalition’s public closing session.Members will also hold biannual exercises to strengthen resilience and deterrence against malicious actors; issue joint advisories that detail the tactics, techniques, and procedures used by cybercriminals; and create an “investigator’s toolkit” that will feature “lessons learned and strategies for responding to significant ransomware events,” the document stated.It is unclear how much weight the new pledges will be given by Moscow and other countries like China, North Korea and Iran — all of which have either sheltered ransomware gangs or used cyberattacks to finance their governments or other illicit activities.Speaking at the closing session, National Security Advisor Jake Sullivan hailed the initiative as the world’s “largest” cybersecurity coalition and the “most comprehensive.\"“We have a long way to go but we've already come a long way...” he told the attendees. \"Objects in motion can stay in motion if we keep pushing them forward. And that's what I think, collectively, we should all do.”Martin Matishak is a senior cybersecurity reporter for The Record. He spent the last five years at Politico, where he covered Congress, the Pentagon and the U.S. intelligence community and was a driving force behind the publication's cybersecurity newsletter.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-02",
      "title": " Middle District of Florida |  Band Of Cybercriminals Responsible For Computer Intrusions Nationwide Indicted For RICO Conspiracy That Netted Millions | United States Department of Justice",
      "text": " An official website of the United States governmentHere's how you know\nOfficial websites use .gov\n\n              A .gov website belongs to an official government organization in the United States.\n            \nSecure .gov websites use HTTPS\n\n              A lock (   \n\nLock\nA locked padlock\n\n\n\n ) or https:// means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n            According to the indictment and information shared in court, from 2015 through 2019, the defendants and numerous other conspirators—including a now-deceased conspirator who is referenced in the indictment as RICH4EVER4430—banded together to engage in a sophisticated cybercrime and tax fraud scheme. Jenkins, Michel, Propht-Francisque, Cherelus, and RICH4EVER4430 purchased on the dark web server credentials for the computer servers of Certified Public Accounting (CPA) and tax preparation firms across the country. They used those server credentials to remotely and covertly commit computer intrusions and exfiltrate the tax returns of thousands of taxpayers who were clients of those CPA and tax preparation firms. Those tax returns included the clients’ names, dates of birth, Social Security numbers, and financial information.Jenkins, Michel, Propht-Francisque, Cherelus, RICH4EVER4430, and other conspirators then partnered with Jacques, Elan, Poix, Jolteus, and others to form an enterprise through which they filed thousands of false tax returns in the names of more than 9,000 identity theft victims. Members of the enterprise created and operated at least six fraudulent tax preparation businesses in south Florida, and used those businesses to file many of these false tax returns. The conspirators directed the resulting tax refunds to debit cards and bank accounts that they controlled. Also, to make the businesses appear more legitimate, members of the enterprise opened bank accounts in the names of these fraudulent tax businesses to receive fake “tax preparer fees.” Members of the enterprise also registered with the Internal Revenue Service (IRS) preparer tax identification numbers using the names and information of identity theft victims, to make it appear that those victims were the individuals who were filing false returns in bulk. In other iterations of the charged RICO conspiracy, members of the enterprise “hijacked” the IRS-issued identification numbers of CPA and tax preparation firms and used those identification numbers to file scores of additional false tax returns.  Members of the enterprise filed false self-prepared tax returns using stolen identities as well.To obfuscate their cybercriminal conduct, the conspirators routinely used pseudonyms, opened business entities and bank accounts in the names of nominees and identity theft victims, and conducted their illicit business using dozens of different email addresses. Altogether, the enterprise claimed more than $36 million in false tax refunds over the course of approximately four years. The actual loss amount is still being calculated but is at least $4 million.An indictment is merely a formal charge that a defendant has committed one or more violations of federal criminal law, and every defendant is presumed innocent unless, and until, proven guilty.This case was investigated by the Federal Bureau of Investigation and the Internal Revenue Service-Criminal Investigation in Orlando, with assistance from the FBI in Miami and IRS-CI in Minnesota. It will be prosecuted by Assistant United States Attorney Emily C. L. Chang.Tampa, Florida – United States Attorney Roger B. Handberg announces the unsealing of an indictment charging Matthew Frederic Bergwall (21, Coral Gables), also known as “MXB,” with conspiracy to commit...Ocala, Florida – United States Attorney Roger B. Handberg announces the return of an indictment charging Paul Lesslie Thompson (69, Anthony) with one count of receipt of stolen government property...Ocala, Florida – United States Attorney Roger B. Handberg announces the return of an indictment charging Danielle Jane Liles (41, Summerfield) with eight counts of wire fraud. If convicted, Liles...Middle District of Florida\r\nTampa Office - (Headquarters):\r\nU.S. Attorney's Office\r\n400 North Tampa Street\r\nSuite 3200\r\nTampa, FL 33602Phone: 813-274-6000Stay ConnectedHave a question about Government Services?"
   },
   {
      "time": "2022-11-02",
      "title": "Dropbox discloses breach after hacker stole 130 GitHub repositories",
      "text": " Dropbox disclosed a security breach after threat actors stole 130 code repositories after gaining access to one of its GitHub accounts using employee credentials stolen in a phishing attack.The company discovered the attackers breached the account on October 14 when GitHub notified it of suspicious activity that started one day before the alert was sent.\"The code and the data around it also included a few thousand names and email addresses belonging to Dropbox employees, current and past customers, sales leads, and vendors (for context, Dropbox has more than 700 million registered users).\"The successful breach resulted from a phishing attack that targeted multiple Dropbox employees using emails impersonating the CircleCI continuous integration and delivery platform and redirecting them to a phishing landing page where they were asked to enter their GitHub username and password.On the same phishing page, the employees were also asked to \"use their hardware authentication key to pass a One Time Password (OTP).\"After stealing the Dropboxers' credentials, the attackers gained access to one of Dropbox's GitHub organizations and stole 130 of its code repositories.\"These repositories included our own copies of third-party libraries slightly modified for use by Dropbox, internal prototypes, and some tools and configuration files used by the security team,\" the company added.\"Importantly, they did not include code for our core apps or infrastructure. Access to those repositories is even more limited and strictly controlled.\"Dropbox added that the attackers never had access to customers' accounts, passwords, or payment information, and its core apps and infrastructure were not affected as a result of this breach.In response to the incident, Dropbox is working on securing its entire environment using WebAuthn and hardware tokens or biometric factors.\"While GitHub itself was not affected, the campaign has impacted many victim organizations,\" GitHub said in an advisory at the time.GitHub said it detected content exfiltration from private repositories almost immediately after the compromise, with the threat actors using VPN or proxy services to make tracing them more difficult."
   },
   {
      "time": "2022-11-02",
      "title": "Malicious Android apps with 1M+ installs found on Google Play",
      "text": " A set of four malicious applications currently available in Google Play, the official store for the Android system, are directing users sites that steal sensitive information or generate ‘pay-per-click’ revenue for the operators.Some of these sites offer victims to download fake security tools or updates, to trick users into installing the malicious files manually.The four malicious apps uncovered this time are:The apps don’t have favorable reviews on Google Play and many users left comments about intrusive ads that open automatically in new browser tabs.Interestingly, the developer responds to some of these comments, offering to help resolve the ad problems.BleepingComputer has contacted ‘Mobile apps Group’ to request a comment about the Malwarebytes researchers' findings but we have not heard back yet.By monitoring the activity of the software from Mobile apps Group, Malwarebytes found that the apps have a 72-hour delay before showing the first ad or opening a phishing link in the web browser, and then continue to launch more tabs with similar content every two hours.The researchers note that new browser tabs are opened even when the device is locked, so when users return to their phones after a while, they find multiple phishing and ad sites opened.Analysis of the Manifest file revealed that the developer tried to obfuscate logs for the actions performed by using nonsense log descriptor such as \"sdfsdf.\"While this method works against automated code scanners, it helped the researchers spot the actions easier.To keep adware away from your device, avoid installing apps from unofficial Android stores. Reading user reviews, monitoring battery usage, and network data activity, also helps determine if the device is running suspicious software. Keeping Google's Play Protect feature active is also a good way to keep the device safer.If you have one of the above apps present on your Android device, it is recommended to remove them and run a full system scan using Play Protect or a mobile antivirus suite from a reputable vendor.BleepingComputer has also contacted Google for a comment about the developer's history and their current apps, and we will update this story as soon as we hear back.Update 11/10/2022 - A Google spokesperson has provided us the following comment: The apps identified in the report are no longer available on Google Play and the developer has been banned."
   },
   {
      "time": "2022-11-02",
      "title": "UK government confirms its intel agency is helping to defend Ukraine",
      "text": " The British government has publicly confirmed for the first time that experts at its intelligence and security agency GCHQ have been contributing to Ukraine’s defense against Russian cyberattacks.Announced alongside the annual review for the National Cyber Security Centre (NCSC) — a part of GCHQ — the Foreign Office said it had provided a £6.35 million (about $7.3 million) support package known as the Ukraine Cyber Programme in the days following the invasion back in February.“The programme has not been made public until now to protect its operational security,” the government said in a statement on Tuesday.On Tuesday, U.K. Foreign Secretary James Cleverly said “Russia’s attack on Ukraine is not limited to its horrific land invasion. It has also persistently attempted to invade Ukraine’s cyberspace, threatening critical information, services and infrastructure.”He said Britain was drawing on its “world-leading expertise to support Ukraine’s cyber defenses. Together, we will ensure that the Kremlin is defeated in every sphere: on land, in the air and in cyber space.”As part of the launch for the agency’s annual review on Tuesday morning, Lindy Cameron, NCSC’s chief executive, said Russia’s invasion of Ukraine had resulted in “the most profound change in the cyber security landscape over the past 12 months.”“I am proud of the role the NCSC played, in conjunction with the [Foreign Office], in supporting the Ukrainian authorities’ staunch cyber defence in the face of Russian hostility. These efforts were shown to have been highly successful in protecting the Ukrainians against Russian cyber attacks and raising their general cyber resilience,” she added.The launch event for the Annual Review itself was smaller than had been planned, according to multiple members of the NCSC’s team at the event, because of a recent report alleging Liz Truss’s personal phone had been hacked while she was the Foreign Secretary.NCSC’s Cameron said she would not comment on the specifics of the case when asked about it by journalists.“I’m not going to go into the details of that individual case, but what I’m really proud of is the work that we do to help to prepare ministers and the politicians more generally,” she said.Asked whether the advice to ministers had changed at all following the alleged hack of Truss’ phone, Cameron said the agency had “issued pretty consistent advice to MPs [and] politicians” and added: “We’re really proud at NCSC of the way we engage with customers to find out what’s landing and to try and improve the way that that advice is able to be applied.”Ian Levy, the agency’s departing technical director, said: “Nothing fundamental has changed in the advice we’ve given in the last couple of years, because nothing fundamental has changed in either the technology or the threat that that attracts.”Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-02",
      "title": "New SandStrike spyware infects Android devices via malicious VPN app",
      "text": " Threat actors are using newly discovered spyware known as SandStrike and delivered via a malicious VPN application to target Android users.They focus on Persian-speaking practitioners of the Baháʼí Faith, a religion developed in Iran and parts of the Middle East.The attackers are promoting the malicious VPN app as a simple way to circumvent censorship of religious materials in certain regions.To spread it, they use social media accounts to redirect potential victims to a Telegram channel that would provide them with links to download and install the booby-trapped VPN.\"Most of these social media accounts contain a link to a Telegram channel also created by the attacker.\"While the app is fully functional and even uses its own VPN infrastructure, the VPN client also installs the SandStrike spyware, which scours their devices for sensitive data and exfiltrates it to its operators' servers.This malware will steal various types of information like call logs and contact lists and will also monitor compromised Android devices to help its creators keep track of the victims' activity.Security researchers who spotted the malware in the wild are yet to pin its development on a specific threat group.The company highlights a new IIS backdoor known as FramedGolf deployed in attacks targeting Exchange servers not patched against ProxyLogon-type security flaws.\"The malware has been used to compromise at least a dozen organizations, starting in April 2021 at the latest, with most still compromised in late June 2022,\" Kaspersky revealed.Kaspersky says Metatron \"is a modular implant boot-strapped through a Microsoft Console Debugger script\" that comes with \"multiple transport modes and offers forwarding and port knocking features.\""
   },
   {
      "time": "2022-11-02",
      "title": "Microsoft fixes critical RCE flaw affecting Azure Cosmos DB",
      "text": " Analysts at Orca Security have found a critical vulnerability affecting Azure Cosmos DB that allowed unauthenticated read and write access to containers.Named CosMiss, the security issue is in Azure Cosmos DB built-in Jupyter Notebooks that integrate into the Azure portal and Azure Cosmos DB accounts for querying, analyzing, and visualizing NoSQL data and results easier.Azure Cosmos DB is Microsoft’s fully managed NoSQL database that features broad API type support for applications of all sizes. Jupyter Notebooks is a web-based interactive platform that allows users to access Cosmos DB data.The issue that researchers at Orca Security discovered is that Cosmos DB Jupyter Notebooks lacked authentication checks that prevented unauthorized access, and even modify a container, if they had the UUID of the Notebook Workspace.Orca’s researchers reported their findings to Microsoft on October 3, 2022, and the software vendor fixed the critical issues within two days, on October 5, 2022.When a user creates a new Notebook on Azure Cosmos DB, a new endpoint is created along with a unique new session/notebook ID (UUIDv4).The researchers reviewed the traffic of the request from a newly created notebook to the server and noticed the existence of an Authorization Header.When they removed this header and sent a request to list all Notebooks on that server, the analysts noticed that the server responded normally, so the Authorization Header wasn’t required.By trying out other types of otherwise valid PUT requests containing JSON payloads, Orca’s analysts found out they could modify the code in the Notebook, overwrite data, inject new snippets, or delete them.Also, since the previous command discloses all Notebook IDs on the same platform, the attackers would be in a position to access and modify any of them.To take things one step further, an attacker can modify the file that builds the Explorer Dashboard by injecting Python code and then load the Cosmos Data Explorer via the Azure interface.When Data Explorer is loaded, the Python code executed automatically, giving the attacker a reverse shell on the client.Since Azure Cosmos DB is a fully managed, serverless distributed database, the fixes are taking place on the server side, so users don’t need to take any action to mitigate the risk.Update 11/1: Microsoft's Security Response Center has also published a report about this fix, highlighting that only a very small percentage of users were practically impacted by the issue."
   },
   {
      "time": "2022-11-02",
      "title": "GIMP - GNU Image Manipulation Program",
      "text": " \n\t\t\tThis is the official website of the GNU Image Manipulation Program\n\t\t\t(GIMP).\n                    \n                        Whether you are a graphic designer, photographer, illustrator, or\n\t\t\tscientist, GIMP provides you with sophisticated tools to get your job\n\t\t\tdone. You can further enhance your productivity with GIMP thanks to\n\t\t\tmany customization options and 3rd party plugins.\n                    \n                        GIMP provides the tools needed for high quality image manipulation.\n                        From retouching to restoring to creative composites, the only limit is your imagination.\n                    \n                        GIMP gives artists the power and flexibility to transform images into truly unique creations.\n                    \n                        GIMP is used for producing icons,\n                        graphical design elements, and art for user interface components and mockups.\n                    \n                        GIMP is a high quality framework for scripted image manipulation,\n                        with multi-language support such as C, C++, Perl, Python, Scheme, and more!\n                    \n                        GIMP provides extensibility through integration\n                        with many programming languages including Scheme, Python, Perl,\n                        and more.\n                    \n                        The result is a high level of customization as demonstrated\n                        by the large number of scripts and plug-ins created by the community.\n                    "
   }
]