[
   {
      "time": "2022-10-21",
      "title": "Domestic Kitten campaign spying on Iranian citizens with new FurBall malware",
      "text": " \n      Award-winning news, views, and insight from the ESET security community\n    \n        Award-winning news, views, and insight from the ESET security community\n      ESET ResearchAPT-C-50’s Domestic Kitten campaign continues, targeting Iranian citizens with a new version of the FurBall malware masquerading as an Android translation app\n20 Oct 2022\n • \n, \n6 min. read\nESET researchers recently identified a new version of the Android malware FurBall being used in a Domestic Kitten campaign conducted by the APT-C-50 group. The Domestic Kitten campaign is known to conduct mobile surveillance operations against Iranian citizens and this new FurBall version is no different in its targeting. Since June 2021, it has been distributed as a translation app via a copycat of an Iranian website that provides translated articles, journals, and books. The malicious app was uploaded to VirusTotal where it triggered one of our YARA rules (used to classify and identify malware samples), which gave us the opportunity to analyze it.This version of FurBall has the same surveillance functionality as previous versions; however, the threat actors slightly obfuscated class and method names, strings, logs, and server URIs. This update required small changes on the C&C server as well – precisely, names of server-side PHP scripts. Since the functionality of this variant hasn’t changed, the main purpose of this update appears to be to avoid detection by security software. These modifications have had no effect on ESET software, however; ESET products detect this threat as Android/Spy.Agent.BWS.The analyzed sample requests only one intrusive permission – to access contacts. The reason could be its aim to stay under the radar; on the other hand, we also think it might signal it is just the preceding phase, of a spearphishing attack conducted via text messages. If the threat actor expands the app permissions, it would also be capable of exfiltrating other types of data from affected phones, such as SMS messages, device location, recorded phone calls, and much more.\nKey points of this blogpost:\n\nThe Domestic Kitten campaign is ongoing, dating back to at least 2016.\nIt mainly targets Iranian citizens.\nWe discovered a new, obfuscated Android Furball sample used in the campaign.\nIt is distributed using a copycat website.\nThe analyzed sample has only restricted spying functionality enabled, to stay under the radar.\n\nThis malicious Android application is delivered via a fake website mimicking a legitimate site that provides articles and books translated from English to Persian (downloadmaghaleh.com). Based on the contact information from the legitimate website, they provide this service from Iran, which leads us to believe with high confidence that the copycat website targets Iranian citizens. The purpose of the copycat is to offer an Android app for download after clicking on a button that says, in Persian, “Download the application”. The button has the Google Play logo, but this app is not available from the Google Play store; it is downloaded directly from the attacker’s server. The app was uploaded to VirusTotal where it triggered one of our YARA rules.In Figure 1 you can see a comparison of the fake and legitimate websites.Figure 1. Fake website (left) vs the legitimate one (right)Based on the last modified information that is available in the APK download’s open directory on the fake website (see Figure 2), we can infer that this app has been available for download at least since June 21st, 2021.Figure 2. Open directory information for the malicious appThis sample is not fully working malware, even though all spyware functionality is implemented as in its previous versions. Not all of its spyware functionality can be executed, however, because the app is limited by the permissions defined in its AndroidManifest.xml. If the threat actor expands the app permissions, it would also be capable of exfiltrating:It can also receive commands to take photos and record video, with the results being uploaded to the C&C server. The Furball variant downloaded from the copycat website can still receive commands from its C&C; however, it can only perform these functions:Figure 3 shows permission requests that do need to be accepted by the user. These permissions might not create an impression of being a spyware app, especially given that it poses as a translation app.Figure 3. List of requested permissionsAfter installation, Furball makes an HTTP request to its C&C server every 10 seconds, asking for commands to execute, as can be seen in the upper panel of Figure 4. The lower panel depicts a “there’s nothing to do at the moment” response from the C&C server.Figure 4. Communication with C&C serverThese latest samples have no new features implemented, except for the fact that the code has simple obfuscation applied. Obfuscation can be spotted in class names, method names, some strings, logs, and server URI paths (which would also have required small changes on the backend). Figure 5 compares the class names of the older Furball version and the new version, with obfuscation.Figure 5. Comparison of class names of the older version (left) and new version (right)Figure 6 and Figure 7 display the earlier sendPost and new sndPst functions, highlighting the changes that this obfuscation necessitates.Figure 6. Older non-obfuscated version of codeFigure 7. The latest code obfuscationFigure 8. Non-obfuscated version of the malware detected by 28/64 enginesFigure 9. Obfuscated version of the malware detected by 4/63 engines when first uploaded to VirusTotalThe Domestic Kitten campaign is still active, using copycat websites to target Iranian citizens. The operator’s goal has changed slightly from distributing full-featured Android spyware to a lighter variant, as described above. It requests only one intrusive permission – to access contacts – most likely to stay under the radar and not to attract the suspicion of potential victims during the installation process. This also might be the first stage of gathering contacts that could by followed by spearphishing via text messages.Besides reducing its active app functionality, the malware writers tried to decrease the number of detections by implementing a simple code obfuscation scheme to hide their intensions from mobile security software.\n\n\nSHA-1\nPackage Name\nESET detection name\nDescription\n\n\n\n\nBF482E86D512DA46126F0E61733BCA4352620176\ncom.getdoc.freepaaper.dissertation\nAndroid/Spy.Agent.BWS\nMalware impersonating سرای مقاله (translation: Article House) app.\n\n\n\n      Sign up for our newsletters\n    ESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-BaltistanESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-Baltistan • ESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its graveESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its grave • ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023 • \n            Award-winning news, views, and insight from the ESET security community\n          "
   },
   {
      "time": "2022-10-21",
      "title": "Internet connectivity worldwide impacted by severed fiber cables in France",
      "text": " A major Internet cable in the South of France was severed yesterday at 20:30 UTC, impacting subsea cable connectivity to Europe, Asia, and the United States and causing data packet losses and increased website response latency.Cloud security company Zscaler reports that they made routing adjustments to mitigate the impact. However, users still face problems due to app and content providers routing traffic through the impacted paths.\"If you experience slowness with specific applications, especially applications hosted overseas, please contact the application provider and refer them to this trust post.\"The repair crews moved quickly on the scene but had to wait for the police to collect evidence before they were allowed to work on restoring the damage.At 23:00 UTC, it was confirmed that the incident had impacted three links: Marseille-Lyon, Marseille-Milano, and Marseille-Barcelona.At 01:00 UTC today, when Zscaler's repair crews restored one of the links, but the technicians continued observing packet losses and latency for some destinations.At 18:58:01 UTC, Zscaler posted a final update stating the issue has been resolved.\"This incident has been resolved. Please contact Zscaler Support if you have additional questions.\" - Zscaler.Not only that, but it has also reduced the capacity of Shetland's population of 23,000 to call for emergency services, as communication has been impacted in general.This incident comes as technicians were already working on fixing the link between the Faroe Islands and Shetland, which was also severed last week.Faroese Telecom's head of infrastructure Páll Vesturbú told the BBC that the cable cuts are believed to have been done by fishing vessels, though it's unusual to have two incidents simultaneously.\"We expect it will be fishing vessels that damaged the cable but it is very rare that we have two problems at the same time,\" Vesturbú told the BBC.Investigations into these recent incidents are still underway, and there is nothing at this time that indicates these are acts of sabotage.Update 10/20/22: Story and title updated to reflect that it was on-land fiber cable that was cut impacting subsea cables.Update 10/20/22: This article originally contained a section on possible sabotage. As this possibility is speculation at this point, and there is no proof of sabotage, we removed it."
   },
   {
      "time": "2022-10-21",
      "title": "Netflix Might Soon Launch Cloud Gaming Service",
      "text": " Cloud gaming is gaining more traction of late, as it allows users to play AAA games from anywhere in the world and on any device (such as mobile, TV, or PC) without the need to invest in expensive hardware.After venturing into the mobile games market, Netflix is looking to expand its reach by launching a new cloud gaming studio in Southern California.For the unversed, this is the fifth studio of the popular streaming service, following its creation of a new internal Helsinki team and taking over of studios such as Oxenfree developer Night School Studio, Boss Fight Entertainment, and Next Games.The news was confirmed by Mike Verdu, Netflix’s Vice President of game development during the TechCrunch Disrupt event on Tuesday.“We’re very seriously exploring a cloud gaming offering. We’ll approach this the same way as we did with mobile — start small, be humble, be thoughtful — but it is a step we think we should take. The extension into the cloud is really about reaching the other devices where people experience Netflix,” he said.Chacko Sonny, who resigned from his role as an executive producer on Overwatch at Blizzard Entertainment in September last year, will be leading Netflix’s new cloud gaming studio in Southern California.“We are building a team around [Sonny] and looking to him to help reinvent what games can be,” Verdu said.“He could have done anything, but he chose to come here. You don’t get people like that coming to your organization to build the next big thing in gaming unless there’s a sense that we’re really in it for the long haul and in it for the right reasons.”While Verdu did not disclose exact details about the cloud gaming service, he suggested that the company is looking to launch more than just casual games on TVs. He also said that the games would not rely on TV remotes for input.Currently, Netflix Games offers 35 mobile gaming titles, including Oxenfree, Into The Breach, and Desta: The Memories Between, a new title by Monument Valley studio Ustwo Games. It has an additional 55 game titles in the works, of which 14 titles are “in development” across its own studios.The news of Netflix’s venture into cloud gaming follows after search giant Google announced that it is shutting down its cloud gaming platform, Stadia after three years of launch. The company said that it was forced to shut down the service, as it didn’t gain the traction with users that they had expected.Stadia players will however continue to have access to their games library and play through January 18, 2023, so they can complete final play sessions. But, they will lose track of all the advancement made in the game, as a majority of the games on the Google platform does not support cross-progress play.When questioned about Stadia’s failure, Verdu claimed that Google’s service “was a technical success,” adding: “It was fun to play games on Stadia. It had some issues with the business model.”However, Verdu is hopeful of Netflix succeeding in the field of cloud gaming service, as it will be a valuable addition to the company’s business model. He also said that the streaming giant is not asking people to subscribe to it as a console replacement, as it’s built off a different business model.“The hope is over time that it just becomes this very natural way to play games wherever you are,” he added.Currently, it’s unclear what Netflix’s cloud gaming service would look like or what games would be slotted into its cloud infrastructure. Since the development is in the nascent stages, we will have to wait and watch how it shapes up. Keep watching this space for more updates!"
   },
   {
      "time": "2022-10-21",
      "title": "Google Launches GUAC Open Source Project to Secure Software Supply Chain",
      "text": " \"GUAC is meant to democratize the availability of this security information by making it freely accessible and useful for every organization, not just those with enterprise-scale security and IT funding.\"GUAC is the company's latest effort to bolster the health of the supply chain. It achieves this by aggregating software security metadata from a mix of public and private sources into a \"knowledge graph\" that can answer questions about supply chain risks.\"Querying this graph can drive higher-level organizational outcomes such as audit, policy, risk management, and even developer assistance,\" Google said.Put differently, the idea is to connect the different dots between a project and its developer, a vulnerability and the corresponding software version, and the artifact and the source repository it belongs to.The aim, therefore, is to not only enable organizations to determine if they are affected by a specific vulnerability, but also estimate the blast radius should the supply chain be compromised.That said, Google also appears to be cognizant of the potential threats that could undermine GUAC, including scenarios where the system is tricked into ingesting forged information about artifacts and their metadata, which it expects to mitigate through cryptographic verification of data documents.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-10-21",
      "title": "TSA unveils new railroad cybersecurity directive",
      "text": " The Transportation Security Administration (TSA) unveiled new cybersecurity regulations for passenger and freight railroad carriers this week, expanding its list of critical infrastructure industries given specific guidelines for how to protect their systems. The rules take effect on October 24 and will last one year. In the meantime, TSA is beginning a process to “establish regulatory requirements for the rail sector following a public comment period.”Carriers are now mandated to develop network segmentation policies and controls that separate operational technology systems from other IT systems in case of compromise. Organizations in the industry will need to establish TSA-approved cybersecurity implementation plans that describe “specific cybersecurity measures the passenger and freight rail carriers are utilizing to achieve the security outcomes set forth in the security directive.”TSA also wants carriers to create cybersecurity assessment programs that allow officials to “proactively test and regularly audit the effectiveness of cybersecurity measures and identify and resolve vulnerabilities within devices, networks, and systems.”TSA Administrator David Pekoske said the agency worked closely on the new rules with multiple stakeholders in the railroad industry, the Cybersecurity and Infrastructure Security Agency (CISA) and the Federal Railroad Administration. Several operational technology experts focused on the network segmentation aspect of the new regulations as something that may be difficult for the rail industry. GuidePoint Security’s Chris Warner said resources in the railway industry are limited when it comes to cybersecurity, not only in terms of financial budgets but also a shortage of knowledgable employees who can implement mature cybersecurity regulations and modern approaches.“The requirement of network segmentation policies and controls will be quite a lift for railway operators, as many will have to re-design much of their control systems,” he said. “While this is certainly a step in the right direction for transportation, we will see some bumps in the road as the railway industry will have to modernize away from legacy systems and add in new access controls.\"Others, like Shift5 CEO Josh Lospinoso, threw cold water on the effort, calling the idea of “air gapping” systems – or separating them from IT systems – a “myth in the era of converged IT/OT [operational technology] within infrastructure.”“No longer can we consider critical operational technology components like brake controls on locomotives segmented away from IT,” Lospinoso explained. “With such interconnectivity, network segmentation policies should be implemented, but not used as the last-line of defense.\"Cybersecurity professionals have been calling for the other regulatory components of the directive for years, according to Nozomi Networks security research evangelist Roya Gordon. Gordon noted that as the rail industry continues to become more automated, cyber risks have increased – making the potential consequences of a cyber event “damaging and deadly.” “The TSA directive isn't holding the rail industry to some new unattainable and overly complex standard,” Gordon told The Record. “Finally the government is listening. Industry is listening. This is a great win for critical infrastructure security.”While the attack did not cause any damage and no riders were put at risk, city officials raised alarms in a report because the attackers could have reached critical systems and may have left backdoors in the system. Former U.S. Defense Department cybersecurity advisor Padraic O'Reilly said that while the gradual rollout of cybersecurity rules to the sectors that are under voluntary guidance has been criticized, he noted that the inclusion of CISA and others in the development process was the right approach. O'Reilly, now chief product officer for CyberSaint Security, said the particulars of the latest proposed directive seemed to avoid “the conspicuous mistakes that TSA made with the pipeline” industry and are less prescriptive with respect to operational technology. “I am also pleased to see the phrase ‘using a risk-based methodology,’ as I am in risk management and this is really the only way to rationally approach patch management across both IT and OT systems,” he said. “If I had to guess, I would say that many of the passenger carriers have some maturity with respect to the proposed practices, particularly around the creation of ‘access control measures to secure and prevent unauthorized access to critical cyber systems.’” The most difficult part for rail operators will be around continuous monitoring and detection, O'Reilly explained, adding that even “highly mature” companies struggle with this.Doing it properly with an operations and command infrastructure can be capital intensive, he said. “Broadly speaking, none of the requirements are unreasonable for a critical infrastructure concern to implement. The Association of American Railroads (AAR) has indicated that the directive effectively codifies the voluntary guidance that they have been providing for years. I will be very interested to see how this advances to rulemaking through the comments process,” he said.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-21",
      "title": "Google sued over biometric data collection without consent",
      "text": " Texas attorney general Ken Paxton has sued Google for allegedly collecting and using biometric data belonging to millions of Texans without proper consent.The Texas AG says that Google allegedly used products and services like Google Photos, Google Assistant, and Nest Hub Max to collect a vast array of biometric identifiers, including voiceprints and records of face geometry since 2015.\"In blatant defiance of that law, Google has, since at least 2015, collected biometric data from innumerable Texans and used their faces and their voices to serve Google's commercial ends.\"Paxton has filed other lawsuits against Google for invading Texans' privacy while using its products and services."
   },
   {
      "time": "2022-10-21",
      "title": "OldGremlin hackers use Linux ransomware to attack Russian orgs",
      "text": " OldGremlin, one of the few ransomware groups attacking Russian corporate networks, has expanded its toolkit with file-encrypting malware for Linux machines.The gang has Russian-speaking members that have been operating since at least March 2020 using self-made malware, focusing on Russian companies in the logistics, industry, insurance, retail, real estate, software development, and banking sectors.Also known as TinyScouts, due to the names of the functions in the malicious code they use, OldGremlin is characterized by a small number of campaigns per year with million-dollar ransom demands.In 2022, OldGremlin launched just five campaigns but they also demanded the highest ransom in the two and a half years of activity, $16.9 million, say researchers at Group-IB, a Singapore-based cybersecurity company.Group-IB researchers have been tracking OldGremlin and their tactics, techniques, and procedures (TTPS) since the first attacks attributed to the group in March 2020.During an incident response engagement this year, Group-IB found that OldGremlin targeted a Linux machine with a Go variant of the TinyCrypt ransomware the gang uses to encrypt Windows machines.The researchers say that the Linux variant works in the same way as the Windows counterpart, using the AES algorithm with the CBC block cipher mode to encrypt files with a 256-bit key, which is encrypted using the RSA-2048 asymmetric cryptosystem.The malware executable is wrapped using Ultimate Packer (UPX) and appends the .crypt extension to the encrypted files, among them being .RAW, .ZST, .CSV, .IMG, .ISO, SQL, TAR, TGZ, .DAT, .GZ, .DUMP.Breaching the target is done through carefully prepared phishing emails that impersonate well-known organizations - RBC media group, consultant groups, developers of management systems, lobby groups, Minsk Tractor Works, a dental clinic, financial entities, law firms, a company in the metals and mining industry.In campaigns this year, OldGremlin also started with a malicious email but changed the malware delivery method. Instead of distributing the initial stage payload directly through a malicious document, the attacker switched to tricking the victim into downloading the document from a file-sharing service.The first payload is TinyFluff, a NodeJS backdoor that provides remote access to the system and the possibility to download additional payloads.OldGremlin stays on the victim network for more than a month (49 days on average), collecting information that allows the discovery of high-value systems for encryption.The group relies on a self-developed toolkit that includes the following:The toolkit strongly suggests that OldGremlin is a highly skilled actor carefully preparing attacks to leave its victims with no other choice but to pay the ransom.Apart from the custom tools, the attacker also uses open-source and commercial frameworks like PowerSploit and Cobalt Strike.OldGremlin attacks this year come after a period of relative stagnation in 2021 when the group carried out just one phishing campaign and demanded $4.2 million from the victim.The total number of attacks that researchers attribute to OldGremlin has now reached 16, most of them dating from 2020.Although most ransomware gangs avoid targets in Russia and the countries in the Commonwealth of Independent States (CIS) region, Russian companies are still targeted for file-encrypting attacks.Several groups do not align with this rule, which is followed by the letter by Russian cybercriminals, Dharma, Crylock, and Thanos being some of the most active in 2021."
   },
   {
      "time": "2022-10-21",
      "title": "Health system data breach due to Meta Pixel hits 3 million patients",
      "text": " Advocate Aurora Health (AAH), a 26-hospital healthcare system in Wisconsin and Illinois, is notifying its patients of a data breach that exposed the personal data of 3,000,000 patients.The incident was caused by the improper use of Meta Pixel on AAH's websites, where patients log in and enter sensitive personal and medical information.Meta Pixel is a JavaScript tracker that helps website operators understand how visitors interact with the site, helping them make targeted improvements.However, the tracker also sends sensitive data to Meta (Facebook) and is then shared with a massive network of marketers who target patients with advertisements that match their conditions.The 'MyChart' patient portal is also used by AAH, along with another platform named 'LiveWell,' both of which had active Meta Pixel trackers.\"When patients used Advocate Aurora Health patient portals available through MyChart and LiveWell platforms, as well some of our scheduling widgets, certain protected health information (\"PHI\") would be disclosed in certain circumstances, particularly for users concurrently logged into their Facebook or Google accounts.\" - AAH.The healthcare provider has disabled the Pixel tracker on all systems and is implementing safeguards to prevent a similar exposure from happening again.Patients are advised to use their web browsers' tracker-blocking features or use incognito mode when logging in on medical portals. Those with a Facebook or Google account should review their privacy settings."
   }
]