[
   {
      "time": "2022-12-28",
      "title": "Zscaler becomes a member of the Joint Cyber Defense Collaborative | SC Media",
      "text": "  “Today, digital transformation has accelerated organizations’ move to cloud-based SaaS models and the internet is now the new corporate network — rendering 30 years of networking and security principles ineffective,” said Jay Chaudhry, founder, CEO and chairman of Zscaler. “We are honored to be working with JCDC to leverage the threat intelligence in Zscaler’s zero-trust platform to help stop large-scale cyberattacks, prevent data exfiltration, and block debilitating ransomware attempts.” The JCDC’s initial industry partners included the following: Amazon Web Services, AT&T, Crowdstrike, Mandiant, Google Cloud, Lumen, Microsoft, Palo Alto Networks, and Verizon. Government partners include the Department of Defense, U.S. Cyber Command, the National Security Agency, the Department of Justice, the Federal Bureau of Investigation, and the Office of the Director of National Intelligence.The goal of the U.S. federal government is to improve the country’s cybersecurity by applying actionable threat intelligence at scale,” said Davis McCarthy, principal security researcher at Valtix.“Network defense is something state, local, tribal and territorial entities have not traditionally had the opportunity or budget to explore,” said McCarthy. “With CISA establishing the JCDC and partnering with strategic vendors, governmentwide collaboration may actually help mitigate advanced threats in the long-term.”U.S. cloud data analytics and log analysis firm Sumo Logic has confirmed discovering a potential security incident after its Amazon Web Services account was accessed using stolen credentials, reports TechCrunch.Transitioning to cloud-native environments has brought along security risks for companies, according to TechRadar.Vulnerabilities in API authorization have been named by Wallarm as the second greatest security risk facing APIs, emphasizing the ease of leveraging authorizations as backdoors as well as the urgent need to ensure authorization maintenance, reports SiliconAngle.Tue Apr 23Wed Dec 6On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-12-28",
      "title": "LastPass: Hackers Stole Customers’ Password Vaults, Breach Worse  Than Initially Thought - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-12-28",
      "title": "Pop-ups From Google are Now Blocked by DuckDuckGo - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-12-28",
      "title": "FBI: To Install Malware, Hackers are Buying Ad Services - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-12-28",
      "title": "FIN7 Cybercrime Syndicate: Emerges as a Major Player in Ransomware  Ecosystem - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-12-28",
      "title": "Google: Securing multiple cloud environments the top challenge for SOCs in 2023 | SC Media",
      "text": "  Security teams will have to focus in on how they will deal with expanding cloud environments, including various public clouds, multi-cloud, and the proliferation of SaaS. Claude Mandy, chief evangelist, data security at Symmetry Systems, said each cloud's approach to configuration of identity and access management within their environment is slightly differently. Mandy said it’s important to remember that as part of the shared responsibility model, it’s incumbent on the organization, and not the cloud service provider, to configure this at the data and object layer: a complex challenge to lay at the feet of an understaffed and under-tooled security team. “Until organization's take the opportunity to secure at scale what matters most — data — organizations' understaffed security teams will never be able to enforce the same level of control across a multi-cloud environment,” Mandy said.U.S. cloud data analytics and log analysis firm Sumo Logic has confirmed discovering a potential security incident after its Amazon Web Services account was accessed using stolen credentials, reports TechCrunch.Transitioning to cloud-native environments has brought along security risks for companies, according to TechRadar.Vulnerabilities in API authorization have been named by Wallarm as the second greatest security risk facing APIs, emphasizing the ease of leveraging authorizations as backdoors as well as the urgent need to ensure authorization maintenance, reports SiliconAngle.Tue Apr 23Wed Dec 6On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-12-28",
      "title": "Beware of this Android Banking Trojan that Steals Banking Credentials - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-12-28",
      "title": "China's ByteDance Admits Using TikTok Data to Track Journalists - SecurityWeek",
      "text": " Hi, what are you looking for?Employees of Chinese tech giant ByteDance improperly accessed data from social media platform TikTok to track journalists in a bid to identify the source of leaks to the media, the company admitted Friday.ByFlipboardRedditWhatsappWhatsappEmailAFP 2023Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe three primary drivers for cyber regulations are voter privacy, the economy, and national security – with the complication that the first is often...No one combatting cybercrime knows everything, but everyone in the battle has some intelligence to contribute to the larger knowledge base.Two of humanity’s greatest drivers, greed and curiosity, will push AI development forward. Our only hope is that we can control it.Daniel Kelley was just 18 years old when he was arrested and charged on thirty counts – most infamously for the 2015 hack of...The FBI dismantled the network of the prolific Hive ransomware gang and seized infrastructure in Los Angeles that was used for the operation.Los Gatos, Calif-based data protection and privacy firm Titaniam has raised $6 million seed funding from Refinery Ventures, with participation from Fusion Fund, Shasta...The Hive ransomware website has been seized as part of an operation that involved law enforcement in 10 countries.Many in the United States see TikTok, the highly popular video-sharing app owned by Beijing-based ByteDance, as a threat to national security.The following is...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-28",
      "title": "Researchers advise teams to change master passwords and 2FA keys after LastPass disclosure | SC Media",
      "text": "  Password manager company LastPass gave an update of its security incident from August, which prompted security researchers to tell admins that they really need to take steps to protect their environments.Ellis added while attribution to the same or a different threat actor isn't part of the notification, it struck him as noteworthy that LastPass drew attention to the use of information from the August 2022 incident in this one. “Secondary breaches, and the use of harvested credentials purchased through Initial Access Brokers (as in, for example, the recent Uber breach), are on the rise and should be taken into account by defenders,” said Ellis.“While no customer data was accessed during the August 2022 incident, some source code and technical information were stolen from our development environment and used to target another employee, obtaining credentials and keys which were used to access and decrypt some storage volumes within the cloud-based storage service,” LastPass wrote in the blog.  “The latest LastPass breach originated in the cloud — no endpoint or on-prem device could have detected the incident,” Benjamin said. “What’s more is that LastPass reported its most recent breach nearly a month ago, but at the time of the attack, could not tell whether customer data was breached. Visibility into data — what is included, where it is located, if it was impacted, and who accessed it — is critical for swift and effective breach response and to prevent further damage.John Bambenek, principal threat hunter at Netenrich, added that the loss of the source code didn’t concern him. Bambenek said if anything, having the source essentially public let’s their claims of zero knowledge vetted in a similar way that encryption algorithms should be made public for assurance purposes.“Capturing the encrypted databases is more problematic as this means all the attacker needs now is to send targeted phishes to people to get that password,” said Bambenek. “Password managers are essentially the single point of compromise for an individual and an attacker being able to walk with some of the databases, and it not being known and public for months, concerns me greatly.”U.S. cloud data analytics and log analysis firm Sumo Logic has confirmed discovering a potential security incident after its Amazon Web Services account was accessed using stolen credentials, reports TechCrunch.Transitioning to cloud-native environments has brought along security risks for companies, according to TechRadar.Vulnerabilities in API authorization have been named by Wallarm as the second greatest security risk facing APIs, emphasizing the ease of leveraging authorizations as backdoors as well as the urgent need to ensure authorization maintenance, reports SiliconAngle.Tue Apr 23Wed Dec 6On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-12-28",
      "title": "Royal overtakes LockBit as top ransomware in November as attacks increase 41% | SC Media",
      "text": "  November’s sharp increase in reported incidents is backed by uncommon contributions. According to the research, threat groups Royal and Cuba claimed first and second place as most active and accounted for 16% and 15% of all attacks, knocking LockBit from the top spot for the first time since September 2021.   Royal ransomware — a strain that emerged in January — works without affiliates and is therefore different from the traditional ransomware-as-a-service model. The group uses partial encryption and multi-threaded ransomware to accelerate encryption process and evade detection.And when it comes to distribution, Royal has a more human touch than traditional ransomware attackers like LockBit, said Matthew Fulmer, manager of cyber intelligence engineering at Deep Instinct. “They use social engineering as their delivery mechanism, and they will reach out under the guise of callback phishing attacks.”  Microsoft also recognized DEV-0569 as access brokers for ransomware operations — this, alongside concerns that additional ransomware groups are also using Royal strain, may explain the recent increase in Royal ransomware, NCC Group said.  Besides the insurgence of the new group, the report highlighted that the relatively old Cuba ransomware group has made an “alarming” and “uncharacteristic” contribution with its largest number of attacks recorded by the NCC Group in nearly two years.  “Looking back over the last two years, the number of Cuba ransomware attacks had been noticeably quiet,” the report read. “As such, a record number of 40 attacks in November is highly unexpected from the Cuba operation. Whether this is the start of a more active Cuba operation and one which moves the variant to the top three ranking on a more permanent basis will remain to be seen.”  “We certainly anticipate spikes and fluctuations in threat actor behaviors, however, the significant jump observed here may signal a more frequent, higher level of targeting,” NCC Group added.  Matt Hull, global head of threat intelligence at NCC Group, said in a statement that the reduced operation in LockBit 3.0 may suggest the group could be disbanding. Fulmer, however, warned that organizations should not drop their guards.  “[LockBit] will likely continue to be one of the most prolific ransomware strains observed in 2023,” Brad Crompton, intelligence director at Intel 471, added. Menghan Xiao is a cybersecurity reporter at SC Media, covering software supply chain security, workforce/business, and threat intelligence. Before SC Media, Xiao studied journalism at Northwestern University, where she received a merit-based scholarship from Medill and Jack Modzelewski Scholarship Fund.After admitting responsibility for compromising Sony, a Colonial Pipeline supplier, and a Hawai'i government site, the RansomedVC group has claimed that it will be ending operations due to the arrests of six of its affiliates, reports The Record, a news site by cybersecurity firm Recorded Future.U.S. advanced electronic components manufacturer Kyocera AVX Components Corporation has disclosed that 39,111 individuals around the world had their data compromised following a ransomware attack earlier this year, which has been claimed by the LockBit ransomware operation, reports BleepingComputer.Attack on the U.S. subsidiary of the Industrial & Commercial Bank of China disrupted Treasury trading in New York earlier this week.  Tue Jun 25Thu Dec 14Thu Nov 16   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   }
]