[
   {
      "time": "2023-11-21",
      "title": "\r\n\tCISA Unveils Healthcare Cybersecurity Guide - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe US Cybersecurity and Infrastructure Security Agency (CISA) has released a Mitigation Guide specifically tailored for the Healthcare and Public Health (HPH) sector.The new guide outlines defensive mitigation strategies and best practices to counteract prevalent cyber-threats targeting critical infrastructure in the healthcare domain.The paper, published on Friday, emphasizes the importance of vulnerability management, which it defines as the continuous identification, assessment and remediation of cyber vulnerabilities in software and systems. It underscores the need for organizations to conduct regular vulnerability scans, prioritize assets based on criticality and leverage threat intelligence to address actively exploited vulnerabilities. The guide also details a step-by-step vulnerability management lifecycle, guiding entities from identification to improvement.Additionally, the document addresses the significance of configuration and change management (CCM) in tandem with established vulnerability and patch management solutions. HPH entities are encouraged to implement security configuration management to identify and rectify misconfigurations in default system settings.The guide concludes with a focus on HPH sector vulnerability remediation guidance, providing tables outlining prioritized vulnerabilities along with remediation and compensating control recommendations. CISA recommended that HPH entities diligently track and prioritize vulnerabilities based on their internal network architecture and risk posture."
   },
   {
      "time": "2023-11-21",
      "title": "Rhysida ransomware gang claims British Library cyberattack",
      "text": " The Rhysida ransomware gang has claimed responsibility for a cyberattack on the British Library in October, which has caused a major ongoing IT outage.Rhysida is auctioning off the data it reportedly stole from the United Kingdom's national library systems. The gang is accepting bids from interested parties over the next seven days.\"With just 7 days on the clock, seize the opportunity to bid on exclusive, unique, and impressive data,\" the gang says.\"Open your wallets and be ready to buy exclusive data. We sell only to one hand, no reselling, you will be the only owner!\"The ransomware group also leaked a low-resolution screenshot of what looks like ID scans stolen from the library's compromised system.\"Threat actors leveraging Rhysida ransomware are known to impact 'targets of opportunity,' including victims in the education, healthcare, manufacturing, information technology, and government sectors,\" the two agencies said.\"Observed as a ransomware-as-a-service (RaaS) model, Rhysida actors have compromised organizations in education, manufacturing, information technology, and government sectors and any ransom paid is split between the group and affiliates.\"A leak of HR documents stolen from the British Library was also confirmed today by the library's press office, which warned users to reset their passwords as a precautionary measure.However, the UK's national library has yet to find evidence that the attackers have gained access to other information during the incident.\"We have no evidence that wider user data has been compromised. However, we are recommending as a precautionary measure that if users have a password for British Library services that they also use elsewhere, they should change it.\"The library estimates that it will restore many of its services within the next few weeks, but some disruptions might persist for an extended period.The library's website sees an annual influx of over 11 million visitors, while its collections are accessed daily by more than 16,000 individuals onsite and online. The British Library collection spans over 150 million items stored across 625 kilometers of shelves. Approximately 3 million new items are added to its archives yearly as the library receives copies of every publication released in the UK and Ireland."
   },
   {
      "time": "2023-11-21",
      "title": "Gamaredon's LittleDrifter USB malware spreads beyond Ukraine",
      "text": " A recently discovered worm that researchers call LittleDrifter has been spreading over USB drives infecting systems in multiple countries as part of a campaign from the Gamaredon state-sponsored espionage group.Malware researchers saw indications of compromise in the United States, Ukraine, Germany, Vietnam, Poland, Chile, and Hong Kong, which suggests that the threat group lost control of LittleDrifter, which reached unintended targets.Gamaredon, also known as Shuckworm, Iron Tilden, and Primitive Bear is a cyber espionage threat group associated with Russian that for at least a decade has targeted organizations in Ukraine from multiple sectors, including government, defense, and critical infrastructure. LitterDrifter's purpose is to establish communications with the threat group's command and control (C2) server and to spread over USB drives.To achieve its goal, the malware uses two separate modules, which are executed by the heavily obfuscated VBS component trash.dll.LitterDrifter and all its components nest in the user's \"Favorites\" directory and establish persistence by adding scheduled tasks and registry keys.The module responsible for propagation to other systems monitors for newly inserted USB drives and creates deceptive LNK shortcuts along with a hidden copy of the \"trash.dll.\"The malware uses the Windows Management Instrumentation (WMI) management framework to identify target drives and creates shortcuts with random names to execute malicious scripts.Before trying to contact the C2 server, the malware looks in the temporary folder for a configuration file. If such a file does not exist, LittleDrifter pings one of Gamaredon's domains using a WMI query.The reply to the query contains the domain's IP address, which is saved to a new configuration file.Check Point notes that all domains used by the malware are registered under 'REGRU-RU' and use the '.ru' top-level domain, which is consistent with past reports on Gamaredon activity.The typical lifespan of each IP address that acts as a C2 in LitterDrifter operations is about 28 hours, but the addresses may change multiple times per day to evade detection and blocking.The C2 may send additional payloads that LitterDrifter attempts to decode and execute on the compromised system. CheckPoint clarifies that no additional payloads were downloaded in most cases, which may indicate that the attacks are highly targeted.As a backup option, the malware can also retrieve the C2 IP address from a Telegram channel.LitterDrifter is likely part of the first stage of an attack, trying to establish persistence on the compromised system and waiting for the C2 to deliver new payloads that would further the attack.The malware is characterized by simplicity and does not rely on novel techniques but it appears to be effective."
   },
   {
      "time": "2023-11-21",
      "title": "Canadian government discloses data breach after contractor hacks",
      "text": " The Canadian government says two of its contractors have been hacked, exposing sensitive information belonging to an undisclosed number of government employees. These breaches occurred last month and impacted Brookfield Global Relocation Services (BGRS) and SIRVA Worldwide Relocation & Moving Services, both providers of relocation services to Canadian government employees. Government-related information stored on compromised BGRS and SIRVA Canada systems dates back to 1999, and it belongs to a broad spectrum of affected individuals, including members of the Royal Canadian Mounted Police (RCMP), Canadian Armed Forces personnel, and Government of Canada employees.While the Canadian government has yet to attribute the incident, the LockBit ransomware gang has already claimed responsibility for breaching SIRVA's systems and leaked what they claim to be archives containing 1.5TB of stolen documents.LockBit has also made public the contents of failed negotiations with alleged SIRVA representatives.\"Sirva.com says that all their information worth only $1m. We have over 1.5TB of documents leaked + 3 full backups of CRM for branches (eu, na and au),\" the ransomware group says in an entry on its dark web data leak site.After being notified of the contractors' security breaches on October 19th, the government promptly reported the breach to relevant authorities, including the Canadian Centre for Cyber Security and the Office of the Privacy Commissioner.While the analysis of the vast volume of compromised data continues, specific details regarding the impacted individuals, including the number of affected employees, remain undetermined. However, preliminary assessments suggest that those who used relocation services since 1999 may have had their personal and financial information exposed.\"Services such as credit monitoring or reissuing valid passports that may have been compromised will be provided to current and former members of the public service, RCMP, and the Canadian Armed Forces who have relocated with BGRS or SIRVA Canada during the last 24 years. \"Additional details about the services that will be offered, and how to access them will be provided as soon as possible.\"Individuals potentially affected by this data breach are urged to take precautionary measures, including updating login credentials, enabling multi-factor authentication, and monitoring online financial and personal accounts for unusual activity.Those suspecting unauthorized access to their accounts must also contact their financial institution, local law enforcement, and the Canadian Anti-Fraud Centre (CAFC) immediately."
   },
   {
      "time": "2023-11-21",
      "title": "Cybersecurity firm executive pleads guilty to hacking hospitals",
      "text": " The former chief operating officer of a cybersecurity company has pleaded guilty to hacking two hospitals, part of the Gwinnett Medical Center (GMC), in June 2021 to boost his company's business.During his attack on September 27, 2018, he disrupted the health provider's phone and network printer services, and he stole the personal information of more than 200 patients from a Hologic R2 Digitizer digitizing device connected to a mammogram machine on GMC's Lawrenceville hospital.On the same day, Singla used over 200 printers in the GMC hospital in Duluth to print stolen patient information and \"WE OWN YOU\" messages.Singla \"promoted\" the GMC hack on Twitter, tweeting the names, dates of birth, and sexes of 43 patients whose data had been stolen in the breach. Securolytics also reached out potential clients after Singla's attack, highlighting the GMC incident in the emails.\"This cyberattack on a hospital not only could have had disastrous consequences, but patient's personal information was also compromised,\" said Chris Hacker, Special Agent in Charge of FBI Atlanta.\"The FBI and our law enforcement partners are determined to hold accountable, those who allegedly put peoples health and safety at risk while driven by greed.\"He has now agreed to pay over $817,000 plus interest in restitution to the Northside Hospital Gwinnett in Lawrenceville and the Ace American Insurance Company as part of the plea deal.The prosecutors will recommend a sentence of 57 months probation, including home detention, based on Singla being diagnosed with \"a rare and incurable form of cancer\" and \"a potentially dangerous vascular condition,\" which warrant \"home detention as an alternative to incarceration\" so that the defendant can receive appropriate medical care.The judge can impose a maximum term of imprisonment of 10 years during the sentencing hearing scheduled for February 15, 2024."
   },
   {
      "time": "2023-11-21",
      "title": "Kinsing malware exploits Apache ActiveMQ RCE to plant rootkits",
      "text": " The Kinsing malware operator is actively exploiting the CVE-2023-46604 critical vulnerability in the Apache ActiveMQ open-source message broker to compromise Linux systems.The flaw allows remote code execution and was fixed in late October. Apache’s disclosure explains that the issue allows running arbitrary shell commands leveraging serialized class types in the OpenWire protocol.Today, a report from TrendMicro notes that Kinsing adds to the list of threat actors exploiting CVE-2023-46604, their goal being to deploy cryptocurrency miners on vulnerable servers.“Currently, there are existing public exploits that leverage the ProcessBuilder method to execute commands on affected systems,” the researchers explain.The malware uses the ‘ProcessBuilder’ method to execute malicious bash scripts and download additional payloads on the infected device from within newly created system-level processes.The advantage of this method is that it allows the malware to execute complex commands and scripts with a high degree of control and flexibility while also evading detection.Before launching the crypto mining tool, Kinsing checks the machine for competing Monero miners by killing any related processes, crontabs, and active network connections.After that, it establishes persistence via a cronjob that fetches the latest version of its infection script (bootstrap) and also adds a rootkit into ‘/etc/ld.so.preload’.The /etc directory on Linux systems typically hosts system configuration files, executables for booting the system, and some log files, so libraries in this location load before a program's process starts.In this case, adding a rootkit ensures that its code executes with every process that starts on the system while it remains relatively hidden and hard to remove.As the number of threat actors exploiting CVE-2023-46604 increases, organizations in multiple sectors remain at risk if they don't patch the vulnerability or check for signs of compromise.To mitigate the threat, system administrators are recommended to upgrade Apache Active MQ to versions 5.15.16, 5.16.7, 5.17.6, or 5.18.3, which address the security issue."
   },
   {
      "time": "2023-11-21",
      "title": "Lumma Stealer malware now uses trigonometry to evade detection",
      "text": " The Lumma information-stealing malware is now using an interesting tactic to evade detection by security software - the measuring of mouse movements using trigonometry to determine if the malware is running on a real machine or an antivirus sandbox.Lumma (or LummaC2) is a malware-as-a-service information stealer rented to cybercriminals for a subscription between $250 and $1,000. The malware allows the attacks to steal data from web browsers and applications running on Windows 7-11, including passwords, cookies, credit cards, and information from cryptocurrency wallets.These evasion techniques include control flow flattening obfuscation, human-mouse activity detection, XOR encrypted strings, support for dynamic configuration files, and enforcement of crypto use on all builds.The most interesting of the above mechanisms is the use of trigonometry to detect human behavior, indicating that the infected system isn't being simulated in a virtual environment.The malware tracks the mouse cursor's position on the host using the 'GetCursor()' function and records a series of five distinct positions in 50-millisecond intervals.It then applies trigonometry to analyze these positions as Euclidean vectors, calculating the angles and vector magnitudes that form from the detected movement.If the calculated vector angles are below 45 degrees, Lumma assumes that the malware movements aren't emulated by software, allowing the execution to continue.If the angles are 45 degrees and higher, the malware halts all malicious behavior but continues to monitor mouse movement until human-like behavior is detected.The choice of a 45-degree threshold in Lumma's anti-sandbox mechanism is an arbitrary value set by the malware's developer and is likely based on empirical data or research on the operation of automated analysis tools.Another interesting development concerning the Lumma operation is the requirement to use a crypter to protect the malware executable from leaking to non-paying hackers and threat analysts.Lumma now automatically checks for a specific value at a certain offset in the executable file to determine if it is crypted and serves a warning if it isn't.As a last line of defense against scrutiny, Lumma 4.0 incorporates obstacles within its code, like opaque predicates that unnecessarily complicate the program's logic, and blocks of dead code injected within functional code segments to create confusion and analysis errors.The latest version of the Lumma stealer demonstrates a heightened emphasis on evading analysis, introducing multiple layers of protective measures designed to thwart and complicate any attempts at dissecting and understanding its mechanisms."
   },
   {
      "time": "2023-11-21",
      "title": "NetSupport RAT Infections on the Rise - Targeting Government and Business Sectors",
      "text": " Threat actors are targeting the education, government and business services sectors with a remote access trojan called NetSupport RAT.The cybersecurity firm said it detected no less than 15 new infections related to NetSupport RAT in the last few weeks. NetSupport RAT is typically downloaded onto a victim's computer via deceptive websites and fake browser updates.The Javascript payload subsequently invokes PowerShell to connect to a remote server and retrieve a ZIP archive file containing NetSupport RAT that, upon installation, beacons out to a command-and-control (C2) server.\"Once installed on a victim's device, NetSupport is able to monitor behavior, transfer files, manipulate computer settings, and move to other devices within the network,\" the researchers said.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-21",
      "title": "DarkGate and PikaBot Malware Resurrect QakBot's Tactics in New Phishing Attacks",
      "text": " Phishing campaigns delivering malware families such as DarkGate and PikaBot are following the same tactics previously used in attacks leveraging the now-defunct QakBot trojan.\"The malware families used also follow suit to what we would expect QakBot affiliates to use.\"The use of DarkGate and PikaBot in these campaigns is not surprising as they can both act as conduits to deliver additional payloads to compromised hosts, making them both an attractive option for cybercriminals.Cofense's analysis of the high-volume phishing campaign shows that it targets a wide range of sectors, with the attack chains propagating a booby-trapped URL pointing to a ZIP archive in hijacked email threads.The ZIP archive contains a JavaScript dropper that, in turn, contacts a second URL to download and run either the DarkGate or PikaBot malware.\"A successful DarkGate or PikaBot infection could lead to the delivery of advanced crypto mining software, reconnaissance tools, ransomware, or any other malicious file the threat actors wish to install on a victim's machine,\" Cofense said.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-21",
      "title": "Indian Hack-for-Hire Group Targeted U.S., China, and More for Over 10 Years",
      "text": " An Indian hack-for-hire group targeted the U.S., China, Myanmar, Pakistan, Kuwait, and other countries as part of a wide-ranging espionage, surveillance, and disruptive operation for over a decade.The Appin Software Security (aka Appin Security Group), according to an in-depth analysis from SentinelOne, began as an educational startup offering offensive security training programs, while carrying out covert hacking operations since at least 2009.\"Appin's hacking operations and overall organization appear at many times informal, clumsy, and technically crude; however, their operations proved highly successful for their customers, impacting world affairs with significant success.\"\"The current state of the organization significantly differs from its status a decade ago,\" Tom Hegel, principal threat researcher at SentinelLabs, told The Hacker News.“The initial entity, ‘Appin,’ featured in our research, no longer exists but can be regarded as the progenitor from which several present-day hack-for-hire enterprises have emerged. Factors such as rebranding, employee transitions, and the widespread dissemination of skills contribute to Appin being recognized as the pioneering group in India.”One of the core services offered by Appin was a tool named \"MyCommando\" (aka GoldenEye or Commando) that allowed its customers to log in to view and download campaign-specific data and status updates, communicate securely, and choose from various task options that range from open-source research to social engineering to a trojan campaign.The targeting of China and Pakistan is confirmation that an Indian-origin mercenary group has been roped in to conduct state-sponsored attacks. Appin has also been identified as behind the macOS spyware known as KitM in 2013.What's more, SentinelOne said it also identified instances of domestic targeting with the goal of stealing login credentials of email accounts belonging to Sikhs in India and the U.S.“Operation Hangover has been confirmed as the same threat actor, evidenced by shared infrastructure and malware with Appin in the intrusion,” Hegel said. “Regarding ModifiedElephant, there's less clarity due to only a slight overlap in time and some technical similarities.”“Further investigation into Appin is necessary before confidently linking ModifiedElephant to the specific organization, especially considering employee and resource movements during that period. It's crucial for industry researchers to focus on ModifiedElephant, as these activities are of significant importance but are currently not receiving sufficient attention.”In another noteworthy tactic, Appin has been found leveraging a California-based freelancing platform referred to as Elance (now called Upwork) to purchase malware from external software developers, while also using its in-house employees to develop a custom collection of hacking tools.\"The research findings underscore the group's remarkable tenacity and a proven track record of successfully executing attacks on behalf of a diverse clientele,\" Hegel said.The development comes as Aviram Azari, an Israeli private investigator, was sentenced in the U.S. to nearly seven years in federal prison on charges of computer intrusion, wire fraud, and aggravated identity theft in connection with a global hack-for-hire scheme between November 2014 to September 2019. Azari was arrested in September 2019.“The hack-for-hire ecosystem will persist and expand independently of our discoveries,” Hegel said. “Nonetheless, in this exceptional situation, we possess knowledge about the organization and individuals responsible for specific targeted intrusions. Holding these attackers accountable for their actions in this case now falls within the purview of law enforcement and the affected victims.”(The article was updated after publication to include additional comments from SentinelOne.)Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]