[
   {
      "time": "2023-11-10",
      "title": "The largest Russian bank Sberbank hit by a massive DDoS attack",
      "text": " Sberbank , the Russian banking and financial services giant, announced that it was recently hit by a record-breaking distributed denial of service (DDoS) attack that reached 1 million RPS.After the invasion of Ukraine, most Russian organizations and international companies still operating in Russia became the targets of multiple groups of Pro-Ukraine hacktivists.According to the bank, the last took place two weeks ago and it was the most powerful attack in its history.Gref said that Sberbank faces about ten attacks per month, but threat actors have never breached the systems at the bank. However, Gref warns that its experts have noted that the attacks are becoming more sophisticated.The cyber attack took down the website of the National Payment Card System (NSCP, card operator Mir) on October 30. The threat actors also defaced the website and posted a message there that they paid their partners with “customer personal data” from NSPK to do this work.Stanislav Kuznetsov, deputy chairman of the bank’s board, reported that in May 2022 the bank was hit by another massive DDoS attack that peaked at 400 Gbps. The attack was launched through a botnet composed of more than 27000 infected devices, but it was successfully mitigated by the financial organization.One of the most powerful attacks on Sberbank was observed in May last year, reported Stanislav Kuznetsov, deputy chairman of the bank’s board. The attack power reached more than 400 Gbps; malicious traffic was generated by a botnet consisting of more than 27 thousand devices. Then it did not affect the availability of bank services.Google states that the attacks using this zero-day technique started in late August and are still ongoing, targeting major infrastructure providers, including Google services, Google Cloud infrastructure, and its customers. Google pointed out it was able to mitigate the attack.Amazon announced the mitigation of attacks using this technique and that reached 155 million requests per second (Amazon), while Claudflare observed attacks reaching 201 million rps.The attack technique abuses HTTP/2’s stream cancellation feature. The attackers continuously send and cancel requests to the target server causing a DOS condition.In HTTP/2 Rapid Reset attack, the client opens a large number of streams at once, but doesn’t wait for a response to each request stream from the server or proxy and cancels each request immediately.Upon immediately resetting streams each connection can have an indefinite number of requests in flight.Through deliberate request cancellations, the attacker guarantees that the maximum limit of concurrent open streams is never surpassed. As a result, the count of in-flight requests becomes solely contingent on the available network bandwidth, with the round-trip time (RTT) no longer exerting an influence.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-11-10",
      "title": "MuddyC2Go: New C2 Framework Iranian Hackers Using Against Israel",
      "text": " Typical attack sequences observed over the years have involved sending spear-phishing emails bearing malware-laced archives or bogus links that lead to the deployment of legitimate remote administration tools.The installation of the remote administration software paves the way for the delivery of additional payloads, including PhonyC2.MuddyWater's modus operandi has since received a facelift, using password-protected archives to evade email security solutions and distributing an executable instead of a remote administration tool.\"This executable contains an embedded PowerShell script that automatically connects to MuddyWater's C2, eliminating the need for manual execution by the operator,\" Kenin explained.The MuddyC2Go server, in return, sends a PowerShell script, which runs every 10 seconds and waits for further commands from the operator.While the full extent of MuddyC2Go's features are unknown, it's suspected to be a framework that's responsible for generating PowerShell payloads in order to conduct post-exploitation activities.\"We recommend disabling PowerShell if it is not needed,\" Kenin said. \"If it is enabled, we recommend close monitoring of PowerShell activity.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-10",
      "title": "OpenAI confirms DDoS attacks behind ongoing ChatGPT outages",
      "text": " OpenAI has been addressing \"periodic outages\" due to DDoS attacks targeting its API and ChatGPT services within the last 24 hours.While the company didn't immediately provide any details on the root cause of these incidents, OpenAI confirmed earlier today that they're linked to ongoing distributed denial-of-service (DDoS) attacks.Those affected by these issues see \"something seems to have gone wrong\" errors, with ChatGPT adding that \"There was an error generating a response\" to their queries.\"We're experiencing exceptionally high demand. Please hang tight as we work on scaling our systems,\" a banner displayed across ChatGPT's interface warned users during yesterday's incident.In Layer 7 DDoS attacks, threat actors target the application level to overwhelm services with a massive volume of requests, causing the services to hang as they cannot process them all.They are highly effective as they significantly strain the targets' server and network resources, in contrast to reflection-based volumetric DNS amplification network layer attacks focusing on bandwidth consumption.Anonymous Sudan launched in January 2023, announcing that they'll target anyone opposing Sudan. Subsequently, they directed their attacks towards global organizations and government agencies, disrupting web-facing infrastructure.OpenAI has yet to respond to BleepingComputer's requests for comment on ongoing outages and DDoS attacks."
   },
   {
      "time": "2023-11-10",
      "title": "New Malvertising Campaign Uses Fake Windows News Portal to Distribute Malicious Installers",
      "text": " While malvertising campaigns are known to set up replica sites advertising widely-used software, the latest activity marks a deviation in that the website mimics WindowsReport[.]com.The goal is to trick unsuspecting users searching for CPU-Z on search engines like Google by serving malicious ads that, when clicked, redirect them to the fake portal (workspace-app[.]online).At the same time, users who are not the intended victims of the campaign are served an innocuous blog with different articles, a technique known as cloaking.The signed MSI installer that's hosted on the rogue website contains a malicious PowerShell script, a loader known as FakeBat (aka EugenLoader), which serves as a conduit to deploy RedLine Stealer on the compromised host.\"It is possible the threat actor chose to create a decoy site looking like Windows Report because many software utilities are often downloaded from such portals instead of their official web page,\" Segura noted.To top it all, eSentire also called attention to a new method dubbed the Wiki-Slack attack, a user-direction attack that aims to drive victims to an attacker-controlled website by defacing the end of the first para of a Wikipedia article and sharing it on Slack.It's worth pointing out that a key prerequisite to pulling off this attack is that the first word of the second paragraph in the Wikipedia article must be a top-level domain (e.g., in, at, com, or net) and that the two paragraphs should appear within the first 100 words of the article.With these restrictions, a threat could weaponize this behavior such that the way Slack formats the shared page's preview results points to a malicious link that, upon clicking, takes the victim to a booby-trapped site.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-10",
      "title": "\r\n\tNew Kamran Spyware Targets Urdu-Speaking Users in Pakistan - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistSecurity researchers have identified a watering-hole attack on a regional news website, Hunza News, which delivers news about Gilgit-Baltistan, a disputed region administered by Pakistan. According to a new advisory published by ESET malware researcher Lukas Stefanko earlier today, the attack targets Urdu-speaking users in the region and deploys previously unknown spyware dubbed Kamran.The attack primarily affects mobile users who access the Urdu version of the Hunza News website, which offers a seemingly benign Android app for download. However, this app harbors malicious espionage capabilities, gathering sensitive data when granted certain permissions by users. This spyware has compromised at least 20 mobile devices.Stefanko clarified that the malicious app is downloaded directly from the website rather than the Google Play store, requiring users to enable installations from unknown sources.Notably, the Kamran spyware appeared on the website between January 7 and March 21 2023, during a period of protests in Gilgit-Baltistan regarding land rights, taxation issues, power outages and food provisions. This region, situated within the larger Kashmir dispute between India and Pakistan, holds strategic importance. This is due to its location along the Karakoram Highway, facilitating trade between Pakistan and China.The Kamran spyware is characterized by its unique code composition. Upon the user granting permissions, it gathers various forms of sensitive data, including SMS messages, contacts, location information and more. It then uploads this information to a Firebase command-and-control (C2) server.Infosecurity reached out to Hunza News regarding the attack but had not received a response at the time of writing."
   },
   {
      "time": "2023-11-10",
      "title": "Kyocera AVX says ransomware attack impacted 39,000 individuals",
      "text": " Kyocera AVX Components Corporation (KAVX) is sending notices of a data breach exposing personal information of 39,111 individuals following a ransomware attack.KAVX is an American manufacturer of advanced electronic components, a subsidiary of the Japanese semiconductor giant Kyocera. It employs over ten thousand specialists and has an annual revenue of $1.3 billion.In the data breach notification to affected people, KAVX says that it discovered on October 10, 2023 that hackers accessed its systems between February16, and March 30, 2023.“KAVX later discovered that the data contained on the impacted servers included personal information of individuals globally,” the company notes.Following an internal investigation to determine what information was exposed, KAVX confirms that it includes at least full names and Social Security Numbers (SSNs). Possibly, more details were exposed, but the relevant section on the notice sample is censored.KAVX says it has no evidence that the cyber-criminals abused the stolen data but reminds the letter recipients of the associated risk of identity theft and fraud, urging them to be cautious.In response to the situation, the company will also cover the costs for a 12-month dark web monitoring and password leak service for all impacted individuals.The LockBit ransomware gang claimed to have compromised KAVX on May 26, 2023, when it added the firm to its data leak site.The threat actors published several samples of the stolen data on their extortion portal, including passport scans, financial documents, non-disclosure agreements, and more. The deadline that the hackers had set for KAVX to pay the ransom was June 9, 2023.Notably, LockBit also leaked component schematics and technical drawings, meaning that the incident has the potential to expose proprietary designs and patented information to competitors."
   },
   {
      "time": "2023-11-10",
      "title": "Zero-Day Alert: Lace Tempest Exploits SysAid IT Support Software Vulnerability",
      "text": " The threat actor known as Lace Tempest has been linked to the exploitation of a zero-day flaw in SysAid IT support software in limited attacks, according to new findings from Microsoft.The issue, tracked as CVE-2023-47246, concerns a path traversal flaw that could result in code execution within on-premise installations. It has been patched by SysAid in version 23.3.36 of the software.\"This is typically followed by human-operated activity, including lateral movement, data theft, and ransomware deployment.\"The web shell, besides providing the threat actor with backdoor access to the compromised host, is used to deliver a PowerShell script that's designed to execute a loader that, in turn, loads Gracewire.Also deployed by the attackers is a second PowerShell script that's used to erase evidence of the exploitation after the malicious payloads had been deployed. Organizations that use SysAid are highly recommended to apply the patches as soon as possible to thwart potential ransomware attacks as well as scan their environments for signs of exploitation prior to patching.The development comes as the U.S. Federal Bureau of Investigation (FBI) warned that ransomware attackers are targeting third-party vendors and legitimate system tools to compromise businesses.Should a victim fall for the ruse and call the provided phone number, the malicious actors directed them to install a legitimate system management tool via a link provided in a follow-up email.\"The attackers then used the management tool to install other authentic software that can be repurposed for malicious activity, the agency noted, adding the actors compromised local files and network shared drives, exfiltrated victim data, and extorted the companies.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-10",
      "title": "\r\n\tRussian APT Sandworm Disrupted Power in Ukraine Using OT Techniques - Infosecurity Magazine\r\n",
      "text": " Reporter, Infosecurity MagazineGoogle-owned Mandiant has revealed that Sandowrm, a Russia-backed hacking group, conducted a disruptive cyber-attack targeting a Ukrainian critical infrastructure organization in late 2022.Mandiant, which was involved in responding to the attack, shared some of the findings of its post-mortem analysis in a report published on November 9, 2023.The intrusion began on, or before, June 2022. It was a multi-event cyber-attack that leveraged a novel technique for impacting industrial control systems (ICS) and operational technology (OT).The incident culminated in two disruptive events on October 10 and 12, 2022. The first was a power outage and the second a wiper attack designed to limit any investigation.“While we were unable to identify the initial access vector into the IT environment, Sandworm gained access to the OT environment through a hypervisor that hosted a supervisory control and data acquisition (SCADA) management instance for the victim’s substation environment,” wrote Mandiant.Based on evidence of lateral movement, the attacker potentially had access to the SCADA system for up to three months.On October 10, the actor leveraged an optical disc (ISO) image named “a.iso” to execute a native MicroSCADA binary in a likely attempt to execute malicious control commands to switch off substations. The ISO file contained at least the following:The intent of this first attack likely was to trip the victim’s substation circuit breakers, causing an unplanned power outage that coincided with mass missile strikes on critical infrastructure across Ukraine.“While Mandiant does not have enough evidence to conclude the cyber-attack on the power plant was deliberately timed with the missile attacks, they note the timing of the two is very coincidental,” the researchers wrote.These new techniques “suggest a growing maturity of Russia’s offensive OT arsenal, including an ability to recognize novel OT threat vectors, develop new capabilities, and leverage different types of OT infrastructure to execute attacks,” Mandiant wrote.This attack came a few months after Sandworm reportedly intended to deploy Industroyer 2, a destructive malware targeting ICS, against Ukrainian organizations.John Hultquist, Mandiant Chief Analyst, highlighted: “There’s not much evidence that this attack was designed for any practical, military necessity. Civilians are typically the ones who suffer from these attacks and they are probably carried out to exacerbate the psychological toll of the war. It’s important that we not lose sight of the serious threat Ukraine is still facing, especially as winter approaches.”“There has been a misconception that attacks in Ukraine have not lived up to predictions. The fact is that attacks have been limited by the exceptional work of Ukrainian defenders and their partners, who have worked tirelessly to prevent a hundred scenarios just like this. The fact that this incident is isolated is a testament to their exceptional work.”Sandworm (aka Telebots, Voodoo Bear, and Iron Viking) is a hacking group that first appeared in 2009. It is believed to be linked to the Main Center for Special Technologies (also known as GTsST and Military Unit 74455), a cyber warfare unit of the GRU, Russia's military intelligence service.In the past, Sandworm has become a household name in cyber espionage and cyber-influence operations.The group's long-standing focus has been Ukraine, where it has carried out a campaign of disruptive and destructive attacks over the past decade using wiper malware."
   },
   {
      "time": "2023-11-10",
      "title": "CISA Alerts: High-Severity SLP Vulnerability Now Under Active Exploitation",
      "text": " SLP is a protocol that allows systems on a local area network (LAN) to discover each other and establish communications.The exact details surrounding the nature of exploitation of the flaw are currently unknown, but Bitsight previously warned that the shortcoming could be exploited to stage DoS attacks with a high amplification factor.In light of real-world attacks employing the flaw, federal agencies are required to apply the necessary mitigations, including disabling the SLP service on systems running on untrusted networks, by November 29, 2023, to secure their networks against potential threats.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-10",
      "title": "'BlazeStealer' Python Malware Allows Complete Takeover of Developer Machines",
      "text": " Malicious Python packages masquerading as legitimate code obfuscation tools are targeting developers via the PyPI code repository.Focusing on those interested in code obfuscation is a savvy choice that could offer up organizational crown jewels, according to researchers at Checkmarx, who dubbed the malware \"BlazeStealer.\"They warned on Nov. 8 that BlazeStealer is particularly concerning because it can exfiltrate host data, steal passwords, launch keyloggers, encrypt files, and execute host commands. It becomes even more dangerous thanks to the astute choice of targets, according to Checkmarx threat researcher Yehuda Gelb.The BlazeStealer payload can extract a malicious script from an external source, giving attackers complete control over the victim's computer. According to Gelb, the malicious BlazeStealer payload activates once it is installed on the compromised system.For command and control, BlazeStealer runs a bot carried via the Discord messaging service using a unique identifier.\"This bot, once activated, effectively provides the attacker full control of the target's system, allowing them to perform a myriad of harmful actions on the victim's machine,\" Gelb warns. Besides gathering detailed host data, BlazeStealer can download files, deactivate Windows Defender and Task Manager, and lock a computer by overloading the CPU. It does the latter by running a batch script in the startup directory to shut down the computer, or forces a BSO error with a Python script.BlazeStealer can also take control of a PC's webcam using a bot that stealthily downloads a .ZIP file from a remote server and installs the freeware application WebCamImageSave.exe.\"This allows the bot to secretly capture a photo using the webcam. The resulting image is then sent back to the Discord channel without leaving any evidence of its presence after deleting the downloaded files,\" Gelb notes.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-11-10",
      "title": "    The Anatomy of a Sidecopy Attack: From RAR Exploits to AllaKore RAT | ThreatMon\n",
      "text": " Stay informed about emerging risks and potential security breaches on the\n                                                deep/dark web.Learn about mitigation methods for security problems.Track and manage your organization's online reputation to maintain a\n                                                positive image.Read the latest blog post about the threat intelligence world.Stay updated with ThreatMon’s reports prepared by an expert cyber\n                                                security analyst team.Stay updated with ThreatMon’s vulnerabilities prepared by an expert cyber\n                                                security analyst team.Stay updated with ThreatMon’s help center prepared by an expert cyber\n                                                security analyst team.Learn more About ThreatMon.Check out our Terms of Use.Review our Privacy Policy.This report offers a detailed analysis of a recent cyberattack conducted by the APT group known as \"Sidecopy,\" believed to operate from Pakistan. This sophisticated operation utilized an RAR file as the initial vector to deliver a hidden payload—a malicious AllaKore Remote Access Trojan (RAT). Sidecopy's attack demonstrates a high level of sophistication and underscores the importance of ongoing vigilance in the realm of cybersecurity. As a response to this threat, the ThreatMon Malware Research Team conducted a comprehensive technical analysis, aiming to dissect the attack from inception to execution. The report furnishes insights into the attack's techniques, tactics, and procedures, serving as a valuable resource for security professionals and organizations seeking to bolster their defenses against similar threats. Key findings include:ThreatMon has a team of highly\n                    Threatmon's cutting-edge solution combines Threat Intelligence, External Attack Surface Management,\n                    and\n                    Digital Risk Protection to identify vulnerabilities and provide personalized security solutions for\n                    maximum security. ThreatMon identifies the distinctive nature of each business and provides bespoke\n                    solutions that cater to its specific needs.\n                \n                    The 30-day free trial of ThreatMon allows users to explore the product's security benefits. During this trial period, you can test Threat Intelligence data, detect threats to your organization and recommend security measures.\n                "
   }
]