[
   {
      "time": "2022-12-25",
      "title": "W4SP Stealer Discovered in Multiple PyPI Packages Under Various Names",
      "text": " Threat actors have published yet another round of malicious packages to Python Package Index (PyPI) with the goal of delivering information-stealing malware on compromised developer machines.W4SP Stealer primarily functions to siphon user data, including credentials, cryptocurrency wallets, Discord tokens, and other files of interest. It's created and published by an actor who goes by the aliases BillyV3, BillyTheGoat, and billythegoat356.The 16 rogue modules are as follows: modulesecurity, informmodule, chazz, randomtime, proxygeneratorbil, easycordey, easycordeyy, tomproxies, sys-ej, py4sync, infosys, sysuptoer, nowsys, upamonkws, captchaboy, and proxybooster.The latest iteration of the activity, for what it's worth, makes no obvious to hide its nefarious intentions, except in the case of chazz, which leverages the package to download obfuscated Leaf $tealer malware hosted on the klgrth[.]io paste service.It's worth noting that previous versions of the attack chains have also been spotted fetching next-stage Python code directly from a public GitHub repository that then drops the credential stealer.The surge in new copycat variants dovetails with GitHub's takedown of the repository that held the original W4SP Stealer source code, indicating that cybercriminals likely not affiliated with the operation are also weaponizing the malware to attack PyPI users.\"Open-source ecosystems such as PyPI, NPM, and the like are huge easy targets for these kinds of actors to try and deploy this kind of malware on,\" the researchers said. Their attempts will only become more frequent, more persistent, and most sophisticated.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-25",
      "title": "New info-stealer malware infects software pirates via fake cracks sites",
      "text": " A new information-stealing malware named ‘RisePro’ is being distributed through fake cracks sites operated by the PrivateLoader pay-per-install (PPI) malware distribution service.RisePro is designed to help attackers steal victims’ credit cards, passwords, and crypto wallets from infected devices.Flashpoint reports that threat actors have already begun to sell thousands of RisePro logs (packages of data stolen from infected devices) on Russian dark web markets.Additionally, Sekoia discovered extensive code similarities between PrivateLoader and RisePro, indicating that the malware distribution platform is likely now spreading its own information-stealer, either for itself or as a service.Currently, RisePro is available for purchase via Telegram, where users can also interact with the developer and the infected hosts (Telegram bot).RisePro is a C++ malware that, according to Flashpoint, might be based on the Vidar password-stealing malware, as it uses the same system of embedded DLL dependencies.Sekoia further explains that some samples of RisePro embed the DLLs, while in others, the malware fetches them from the C2 server via POST requests.The info-stealer first fingerprints the compromised system by scrutinizing registry keys, writes stolen data to a text file, takes a screenshot, bundles everything in a ZIP archive, and then sends the file to the attacker's server.RisePro attempts to steal a wide variety of data  from applications, browsers, crypto wallets, and browser extensions, as listed below:In addition to the above, RisePro can scan filesystem folders for interesting data like receipts containing credit card information.PrivateLoader is a pay-per-install malware distribution service disguised as software cracks, key generators, and game modifications.Threat actors provide the malware sample they wish to distribute, targeting criteria, and payment to the PrivateLoader team, who then uses their network of fake and hacked websites to distribute malware.Until recently, PrivateLoader distributed almost exclusively either RedLine or Raccoon, two popular information stealers.With the addition of RisePro, Sekoia now reports finding loader capabilities in the new malware, also highlighting that this part of its code has extensive overlaps with that of PrivateLoader.The similarities include the strings obfuscation technique, the HTTP message obfuscation, and the HTTP and port setup.One likely scenario is that the same people behind PrivateLoader developed RisePro.Another hypothesis is that RisePro is the evolution of PrivateLoader or the creation of a rogue former developer who now promotes a similar PPI service.Based on the collected evidence, Sekoia couldn’t determine the exact connection between the two projects."
   },
   {
      "time": "2022-12-25",
      "title": "Zoom Whiteboard patches XSS bug | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondVideo conferencing platform fixes cross-site scripting vulnerabilityZoom Whiteboard allows users to collaborate in real-time on a shared canvas by adding and editing different objects. Whiteboard runs JavaScript code both in the browser and the desktop app.Whiteboard supports several types of objects, including text, shapes, rich text, images, and sticky notes.To store and transfer objects, it uses Protocol Buffer (protobuf), a language- and platform-neutral markup standard for serializing structured data. It uses WebSocket to broadcast protobuf objects across all clients and provide real-time updates on the whiteboard.Once received, the client transforms the protobuf object into its corresponding React component and inserts it into the user interface.React automatically sanitizes all HTML attributes contained in the whiteboard objects. However, a few of the objects allow some HTML tags. For some objects, the developers used custom regex functions to sanitize user input and remove disallowed tags.Exploiting the bug would require a complicated effort by the attacker.“WebSocket messages are sent in the protobuf format. This makes it tricky to write a proof-of-concept that’s easy for triagers to reproduce because they need to intercept the WebSocket request as well as modify the protobuf message correctly before the request is dropped,” Lim told The Daily Swig.To overcome this challenge, he developed an end-to-end proof of concept script that used the clipboard to create and deliver the XSS payload.Lim believes there are two factors that make it difficult to find and plug such bugs. First is the breadth and depth of JavaScript web APIs that support additional features.“From WebRTC (video calling) to WebGL (2D/3D graphics), there’s a lot more you can do in a browser nowadays than simply pop an alert. This increases the attack surface and potential for bypasses,” he said.And second is the growing overlap between web and native/desktop applications.“Developers need to secure their apps across multiple platforms, which increases the complexity as JavaScript in React on Safari might work slightly differently than React Native with Hermes on Android,” Lim said.Finally, Lim warned about flaws in third-party dependencies.“Code scanning tools did not pick up the actual [Zoom] vulnerability because the user input flowed through a third-party dependency,” he said.“The takeaway here is to be very aware of the third-party components you are using and how you are using them,” Lim said. “Additionally, regexes are very tricky to do yourself so it may be better to rely on libraries like DOMPurify.”Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2022-12-25",
      "title": "DEA Tracks Down Drug Cartels with Binance - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-12-25",
      "title": "FrodoPIR: New Privacy-Focused Database Querying System",
      "text": " The developers behind the Brave open-source web browser have revealed a new privacy-preserving data querying and retrieval system called FrodoPIR.In other words, the goal is to be able to query a platform for information (say, cooking videos) without letting the service provider infer from a user's search history to offer personalized recommendations or targeted ads based on the search criteria.But a common problem afflicting such methods is that they are \"expensive in terms of either bandwidth, or in the amount of time taken to process each client query,\" making them prohibitive for real-world deployments.That's where FrodoPIR steps in. It involves two phases, an offline preparatory step and an online step wherein the client transmits encrypted queries to the server.The server subsequently opts to return a positive or negative value depending on whether or not the query is found in the database without learning what the user is actually querying for.The PETs \"will provide the broader developer community (researchers, governments, nonprofits, businesses and more) new ways to deploy and enhance privacy features in their own work,\" Google noted.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-25",
      "title": "BetMGM Confirms Breach as Hackers Offer to Sell Data of 1.5 Million Customers - SecurityWeek",
      "text": " Hi, what are you looking for?MGM Resorts-owned online sports betting company BetMGM confirmed suffering a data breach the same day hackers offered to sell a database containing the information of 1.5 million BetMGM customers.In a statement posted on its website on December 21, BetMGM said “patron records were obtained in an unauthorized manner”.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-25",
      "title": "DDoS Attacks Can Be Mitigated by AI - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-12-25",
      "title": "Companies Announced Billions in US Government Cybersecurity Contracts in 2022 - SecurityWeek",
      "text": " Hi, what are you looking for?Companies have announced securing billions of dollars in cybersecurity-related contracts with the United States government in 2022.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.SecurityWeek spoke with more than 300 cybersecurity experts to see what is bubbling beneath the surface, and examine how those evolving threats will present...Joanna Burkey, CISO at HP, and Kevin Cross, CISO at Dell, discuss how the role of a CISO is different for a multinational corporation...In this issue of CISO Conversations we talk to two CISOs about solving the CISO/CIO conflict by combining the roles under one person.The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...Security professionals understand the need for resilience in their company’s security posture, but often fail to build their own psychological resilience to stress.SecurityWeek examines how a layoff-induced influx of experienced professionals into the job seeker market is affecting or might affect, the skills gap and recruitment...2022 Cybersecurity Year in Review: Top news headlines and trends that impacted the security ecosystemGot a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-25",
      "title": "Scanning assets in the cloud: Challenges and improvements to make | SC Media",
      "text": "  Keeping tabs on all of an organization's assets can be a challenge. Cloud service adoption, remote work and the occasional BYOD have changed (and expanded) what constitutes an organization's attack surface. But how do we secure the new perimeter? You need to scan your organization's cloud and what's left of the on-premises network. Unfortunately, there's no single scanning method that provides perfect clarity. Let's quickly go through the pros and cons of each.The most basic method is an unauthenticated external scan that shows what your network looks like to an outside observer — or an attacker. This is a good way to find internet-facing weak spots, but it only gives you the surface view.Next up is an authenticated scan, one in which the scanning tool is given authorization to enter the company network and probe it from the inside. This is more comprehensive than an unauthenticated scan and can detect flaws and misconfigurations, but it takes longer and may have blind spots if it can't gain access to certain areas.The most comprehensive way to get a good picture of your organization's assets is to combine all these scanning methods and feed the results into an intelligent program that can combine the information and present it coherently.The Qualys Cloud Platform builds such a picture using unauthenticated, authenticated and agent-based scans. Its most basic feature, Qualys Global AssetView, is entirely free.\"Network perimeters were well-defined and IT environments were tightly encapsulated,\" said the Qualys white paper. \"Accounting for and monitoring all the hardware, software and networking elements in these self-contained and sealed IT environments was straightforward.\"The network map, if you can still call it that, is dynamic. Endpoints continually log on and off and change locations. Cloud instances are spun up and wound down, while data is scattered over an array of servers, few of which your organization may control.The old on-prem network-scanning tools don't work well in the cloud, and the perimeter has vanished. So how are you supposed to know about everything that's on your network at any given moment?It's a brave new world. Organizations that are interested in keeping their cloud components secure would do well to consider the employment of newer technologies geared for the modern digital landscape.Paul Wagenseil is custom content strategist for CyberRisk Alliance, leading creation of content developed from CRA research and aligned to the most critical topics of interest for the cybersecurity community. He previously held editor roles focused on the security market at Tom’s Guide, TechNewsDaily.com, SecurityNewsDaily.com, and spent nearly 10 years at FoxNews.com.Tenable was named Best Security Company by offering cybersecurity risk management products that help organizations understand and reduce their cyber risk across the entire attack surface.Aqua Nautilus researchers warn that the installation of a malicious PowerShell module could take down an organization.More than 80% of CISOs say they now participate in product and service pitches to potential customers.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   }
]