[
   {
      "time": "2022-12-09",
      "title": "Internet Explorer 0-day exploited by North Korean actor APT37",
      "text": " Threat Analysis GroupDec 07, 2022min readUpon investigation, TAG observed the attackers abused an 0-day vulnerability in the JScript engine of Internet Explorer.In a typical delivery scenario, the initial document would have the Mark-of-the-Web applied. This means the user has to disable protected view before the remote RTF template is fetched.When delivering the remote RTF, the web server sets a unique cookie in the response, which is sent again when the remote HTML content is requested. This likely detects direct HTML exploit code fetches which are not part of a real infection.The exploit JavaScript also verifies that the cookie is set before launching the exploit. Additionally it reports twice to the C2 server: before launching the exploit and after the exploit succeeds.TAG also identified other documents likely exploiting the same vulnerability and with similar targeting, which may be part of the same campaign. Further details on those documents can be found in the “Indicators” section below.The delivered shellcode uses a custom hashing algorithm to resolve Windows APIs. The shellcode erases all traces of exploitation by clearing the Internet Explorer cache and history before downloading the next stage. The next stage is downloaded using the same cookie that was set when the server delivered the remote RTF.TAG is committed to sharing research to raise awareness on bad actors like APT37 within the security community, and for companies and individuals that may be targeted. By improving understanding of the tactics and techniques of these types of actors, we hope to strengthen protections across the ecosystem. We will also continuously apply these findings to improve the safety and security of our products and continue to effectively combat threats and protect users who rely on our services.We’d be remiss if we did not acknowledge the quick response and patching of this vulnerability by the Microsoft team.Indicators of compromise (IOCs)Initial documents:Remote RTF template:C2:Google's Threat Analysis Group analyzes recent state-sponsored campaigns exploiting the WinRAR vulnerability, CVE-2023-38831.This bulletin includes coordinated influence operation campaigns terminated on our platforms in Q3 2023. It was last updated on November 8, 2023.Last week Google’s Threat Analysis Group (TAG), in partnership with The Citizen Lab, discovered an in-the-wild 0-day exploit chain for iPhones. Developed by the commerci…Threat Analysis Group shares findings on a new campaign by North Korean actors targeting security researchers.Threat Analysis Group shares their Q2 2023 bulletin.The goal of this report is to analyze the exploits from the year as a whole, looking for trends, gaps, lessons learned, and successes."
   },
   {
      "time": "2022-12-09",
      "title": "Microsoft says hackers are using Telegram to connect with, hack VIPs at cryptocurrency companies  | SC Media",
      "text": "  A Bitcoin ATM is seen at the Clark Street subway station on June 13, 2022 in the Brooklyn Heights neighborhood of Brooklyn in New York City. According to a new blog post from Microsoft, a hacking group being tracked under the designation DEV-0139 has been using Telegram groups to facilitate communication between VIP clients and cryptocurrency exchange platforms, drawing their targets from among the members. (Photo by Michael M. Santiago/Getty Images)Threat actors have been directly targeting cryptocurrency investment companies using Telegram chat groups. “The threat actor posed the target to a different chat group and pretended to ask for feedback on the fee structure used by cryptocurrency exchange platforms,” Microsoft explained. “[They] had a broader knowledge of this specific part of the industry, indicating that they were well prepared and aware of the current challenge the targeted companies may have.”  After building connections and winning the trust of the target, DEV-0139 sent out a malware-laced Excel file that included tables about fee structures among cryptocurrency exchange companies.   According to Microsoft, the group provided likely accurate data in the document to further increase their credibility. But once executed, the malicious file would compromise the victim’s machine, ultimately installing a backdoor to remotely access the system.  Microsoft noted that an investigation showed that there may be other related campaigns being run by the same threat actor using the same techniques. “Further investigation through our telemetry led to the discovery of another file that uses the same dynamic link library (DLL) proxying technique. But instead of a malicious Excel file, it is delivered in a Microsoft installer (MSI) package,” the post read.  Menghan Xiao is a cybersecurity reporter at SC Media, covering software supply chain security, workforce/business, and threat intelligence. Before SC Media, Xiao studied journalism at Northwestern University, where she received a merit-based scholarship from Medill and Jack Modzelewski Scholarship Fund.The new PCI DSS standard puts more focus on application security, with more tools, testing and documentation required of developers.After admitting responsibility for compromising Sony, a Colonial Pipeline supplier, and a Hawai'i government site, the RansomedVC group has claimed that it will be ending operations due to the arrests of six of its affiliates, reports The Record, a news site by cybersecurity firm Recorded Future.Ukraine had experienced a less than a day-long power outage in October 2022 following an attack by Russian state-sponsored hacking operation Sandworm targeted at an electrical substation amid the ongoing Russia-Ukraine war, marking the first cyberattack-related power interruption in the country since 2017, CyberScoop reports.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-12-09",
      "title": "US Health Dept warns of Royal Ransomware targeting healthcare",
      "text": " The U.S. Department of Health and Human Services (HHS) issued a new warning today for the country's healthcare organizations regarding ongoing attacks from a relatively new operation, the Royal ransomware gang.The Health Sector Cybersecurity Coordination Center (HC3) —HHS' security team— revealed in a new analyst note published Wednesday that the ransomware group has been behind multiple attacks against U.S. healthcare orgs.\"Due to the historical nature of ransomware victimizing the healthcare community, Royal should be considered a threat to the HPH sector.\"This ransomware group is focused on targeting U.S. healthcare organizations based on past successful attacks.Until now, Royal also claimed following each healthcare compromise that they leaked all data allegedly stolen from the victims' networks online.The Royal Ransomware gang is a private operation without affiliates and made up of experienced threat actors who worked for other groups.Starting in mid-September, the ransomware gang rebranded again to \"Royal\" and uses a new encryptor that generates ransom notes with the same name.After infecting their targets and encrypting systems on their enterprise network, Royal will demand ransom payments ranging from $250,000 to $2 million.Another one of Royal's uncommon tactics is using hacked Twitter accounts to tweet information on compromised targets to journalists to have the attack covered by news outlets and put additional pressure on their victims.These tweets will be tweeted at journalists and the owners of companies, containing a link to the leaked data allegedly stolen from victims' networks before deploying the encryptor.The federal government has also warned about other ransomware operations known for actively targeting healthcare organizations across the U.S.For instance, last month, HHS warned of Venus ransomware impacting the country's healthcare, with at least one entity known to have fallen victim to its attacks.However, the attack could've had a much more significant impact seeing that PFC helps thousands of U.S. healthcare, government, and utility organizations to ensure that customers pay their invoices on time."
   },
   {
      "time": "2022-12-09",
      "title": "CommonSpirit Health ransomware attack exposed data of 623,000 patients",
      "text": " CommonSpirit Health has confirmed that threat actors accessed the personal data for 623,774 patients during an October ransomware attack.This figure was published today on the U.S. Department of Health breach portal, where healthcare organizations are legally obligated to report data breaches impacting over 500 individuals.At the start of October, the Illinois-based non-profit health system first informed the public of a cyberattack that took down its IT systems.CommonSpirit Health is the second largest health system in the United States, operating 140 hospitals and over 1,000 care sites across 21 states, so any disruption in its operation has widespread impact potential.On December 1, 2022, the organization published the latest results of its internal investigation on the security incident, admitting that the ransomware actors had accessed patient data for the first time.\"While our review of these files is ongoing, we identified that some of these files contained personal information for individuals who may have received services in the past, or affiliates of those individuals, from Franciscan Medical Group and/or Franciscan Health in Washington state.\" - CommonSpirit Health.The type of data that was compromised includes:The company clarified that insurance IDs and medical record numbers could not have been exposed to the ransomware actors.The organization promised to contact all impacted individuals with notifications but didn't disclose the number of affected patients at the time.At this time, CommonSpirit Health has not disclosed the ransomware group that conducted the attack, and no criminal operation has claimed responsibility."
   },
   {
      "time": "2022-12-09",
      "title": "Cisco discloses high-severity IP phone zero-day with exploit code",
      "text": " Cisco has disclosed today a high-severity zero-day vulnerability affecting the latest generation of its IP phones and exposing them to remote code execution and denial of service (DoS) attacks.The company warned on Thursday that its Product Security Incident Response Team (PSIRT) is \"aware that proof-of-concept exploit code is available\" and that the \"vulnerability has been publicly discussed.\"However, Cisco's PSIRT added that it is not yet aware of any attempts to exploit this security flaw in attacks.Cisco has not released security updates to address this bug before disclosure and says that a patch will be available in January 2023. CVE-2022-20968, as the security flaw is tracked, is caused by insufficient input validation of received Cisco Discovery Protocol packets, which unauthenticated, adjacent attackers can exploit to trigger a stack overflow.The vulnerability was reported to Cisco by Qian Chen of the Codesafe Team of Legendsec at QI-ANXIN Group.While a security update to address CVE-2022-20968 or a workaround are not yet available, Cisco provides mitigation advice for admins who want to secure vulnerable devices in their environment from potential attacks.This requires disabling the Cisco Discovery Protocol on affected IP Phone 7800 and 8800 Series devices that also support Link Layer Discovery Protocol (LLDP) for neighbor discovery.\"This is not a trivial change and will require diligence on behalf of the enterprise to evaluate any potential impact to devices as well as the best approach to deploy this change in their enterprise.\"Admins who want to deploy this mitigation are advised to test its effectiveness and applicability for their environment.Cisco warned that \"customers should not deploy any workarounds or mitigations before first evaluating the applicability to their own environment and any impact to such environment.\""
   },
   {
      "time": "2022-12-09",
      "title": "Researchers Uncover Darknet Service Allowing Hackers to Trojanize Legit Android Apps",
      "text": " Researchers have shed light on a new hybrid malware campaign targeting both Android and Windows operating systems in a bid to expand its pool of victims.\"This campaign resulted in thousands of victims,\" the Dutch cybersecurity company said, adding, \"Erbium stealer successfully exfiltrated data from more then 1,300 victims.\"The ERMAC infections commence with a fraudulent website that claims to offer Wi-Fi authorization software for Android and Windows that, when installed, comes with features to steal seed phrases from crypto wallets and other sensitive data.ThreatFabric said it also found a number of malicious apps that were trojanized versions of legitimate apps like Instagram, with the operators using them as droppers to deliver the obfuscated malicious payload.The rogue apps, dubbed Zombinder, are said to have been developed using an APK binding service advertised on the dark web by a well-known threat actor since March 2022.Interestingly, the download option for Windows on the booby-trapped website distributing ERMAC is designed to deploy the Erbium and Aurora information stealers on the compromised system.\"The presence of such a wide variety of trojans might also indicate that the malicious landing page is used by multiple actors and provided to them as a part of a third-party distribution service,\" the researchers theorized.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-09",
      "title": "Report: Air-Gapped Networks Vulnerable to DNS Attacks",
      "text": " Attackers can use DNS as a command-and-control (C2) channel to communicate with these networks through DNS servers connected to the Internet, and thus breach them even when an organization believes the network is successfully isolated, the researchers revealed.Air-gapped networks are segregated without access to the Internet from the common user network in a business or enterprise IT environment. They are designed this way to protect an organization's \"crown jewels,\" the researchers wrote, using VPN, SSL VPN, or the users' network via a jump box for someone to gain access to them.However, these networks still require DNS services, , which is used to assign names to systems for network discoverability. This represents a vulnerability if DNS is not configured carefully by network administrators.What this means for the enterprise is that by abusing DNS, hackers have a stable communication line into an air-gapped network, allowing them to exfiltrate sensitive data while their activity appears completely legitimate to an organization's security protocols, Gabay says.The most common mistake companies make when setting up an air-gapped network is to believe they are creating an effective air gap when they chain it to their local DNS servers, Gabay says. In many cases, these servers can be linked to public DNS servers, which means \"they have unintentionally broken their own air gap.\"It's important to understand how DNS works to know how attackers can navigate its complexities to break into an air gap, the researchers explained in their post. Sending information over DNS can be done by requesting a record that the protocol handles — such as TXT, a text record, or NS, a name server record — and putting the information into the first part of the record’s name, the researchers explained. Receiving information over DNS can be done by requesting a TXT record and receiving a text response back for that record.While DNS protocol can run on TCP, it is mostly based on UDP, which does not have a built-in security mechanism — one of two key factors that come into play for an attacker to take advantage of DNS, the researchers said. There also is no control over the flow or sequence of data transmission in UDP.Thanks to this lack of error detection in UDP, attackers can compress a payload prior to sending it and immediately decompress after sending, which can be done with any other type of encoding, such as base64, the researchers explained.That said, there are challenges for threat actors to communicate successfully with DNS to break an air gap. DNS has restrictions on the types of characters it accepts, so not all characters can be sent; those that can't are called \"bad characters,\" the researchers said. There also is a limit on the length of characters that can be sent.To overcome the lack of control over data flow in DNS, threat actors can notify the server which packet should be buffered, as well as what is expected as the last package, the researchers said. A package also should not be sent until an attacker knows that the previous one successfully arrived, they said.To avoid bad characters, attackers should apply base64 on data sent right before sending it, while they can slice data into pieces to be sent one by one to avoid the DNS character length limit, they said.To get around a defender blocking a DNS request by blocking access to the server from which it is being sent, an attacker can generate domain names based on variables that both sides know and expect, the researchers explained.\"While the executable is not necessarily difficult, an attacker or group would need the infrastructure to continue to buy root records,\" they noted. Attackers also can configure malware to generate a domain in DNS based on a date, which will allow them to constantly send new requests over DNS using a new, known root domain, the researchers said. Defending against this type of configuration \"will prove challenging to organizations using static methods or even with basic anomaly detection to detect and prevent,\" they said.One way is to create a dedicated DNS server for the air-gapped network, Gabay tells Dark Reading. However, organizations must take care to ensure that this server is not chained to any other DNS servers that may exist in the organization, as this \"will ultimately chain it to DNS servers on the Internet,\" he says. Companies should also create anomaly-based detection in the network utilizing an IDS/IPS tool to monitor and identify strange DNS activities, Gabay says. Given that all enterprise environments are unique, this type of solution also will be unique to an organization, he says.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-09",
      "title": "Automated dark web markets sell corporate email accounts for $2",
      "text": " Cybercrime marketplaces are increasingly selling stolen corporate email addresses for as low as $2 to fill a growing demand by hackers who use them for business email compromise and phishing attacks or initial access to networks.Analysts at Israeli cyber-intelligence firm KELA have closely followed this trend, reporting at least 225,000 email accounts for sale on underground markets.The largest webmail shops are Xleet and Lufix, claiming to offer access to over 100k breached corporate email accounts, with prices ranging between $2 and $30, if not more, for highly-desirable organizations.Typically, these accounts were stolen via password cracking (brute-forcing) or credential stuffing, had their credentials stolen through phishing, or were bought from other cybercriminals.Hackers use their access to corporate email accounts in targeted attacks like business email compromise (BEC), social engineering, spear-phishing, and deeper network infiltration.Sales of corporate email access have remained steady in the cybercrime space over the past couple of years, with threat actors on all major hacking forums selling email “combo lists” to access various firms.In a recent high-profile case, ransomware actor ‘Everest’ offered alleged access to email accounts of an aerospace manufacturing company for $15,000.Both bulk and curated offers involve the tedious process of negotiating with the seller and taking a risk on the validity of the claims. At the same time, the demand for corporate emails continues to grow.This has created the need for automated webmail shops like Xleet, Odin, Xmina, and Lufix, which allow cybercriminals to easily buy access to the email accounts of their choice.“These proofs include performing a live check on the email to verify the access or showing a screenshot of the compromised account inbox.”The most attractive offers are Office 365 accounts, which account for almost half of all listed webmail, followed by hosting providers like cPanel, GoDaddy, and Ionos. The sellers in these shops aren’t using aliases but hide behind a masking system assigning them numbers. Odin offers more details about the sellers, like the number of items sold, total sales figures, and user ratings.Odin and Xleet also clarify how the webmails were sourced, with the categories including “hacked”, “cracked”, “logs”, or “created.” However, the majority (98%) in Xleet were either “hacked” or “cracked.”“Logs” are email credentials stolen by info-stealing malware, while “created” are new email accounts that network intruders created on the breached firm using compromised administrator accounts.The rise of these markets makes it imperative to enforce periodic password resets for all services and platforms to render compromised credentials useless.Since most of the offered webmails are cracked or hacked, using strong (longer) passwords and training personnel to identify phishing emails would help reduce these threats significantly."
   },
   {
      "time": "2022-12-09",
      "title": "Apple unveils new cybersecurity measure for iMessage, iCloud and more",
      "text": " Apple announced several new security features designed to better protect users from an array of emerging threats. On Wednesday, the tech giant unveiled three new features: iMessage Contact Key Verification, Security Keys for Apple ID and Advanced Data Protection for iCloud.The new features for iMessage will allow users to verify that they are only sending messages to the intended person and the Apple ID tool will give customers the chance to mandate that a physical security key is needed to sign into their Apple ID account.  Advanced Data Protection for iCloud will allow users to deploy end-to-end encryption on iCloud data, including iCloud Backup, Photos, Notes, and more.“Apple is committed to strengthening both device and cloud security, and to adding new protections over time.”Advanced Data Protection for iCloud is available in the U.S. now for members of the Apple Beta Software Program, and will be available to all U.S. based users by the end of the year. The feature will roll out for the rest of the world in early 2023. iMessage Contact Key Verification and Security Keys for Apple ID will both be available globally at some point in 2023. The study notes that the total number of data breaches more than tripled between 2013 and 2021, exposing 1.1 billion personal records across the globe in 2021.Apple said that while the iMessage Contact Key Verification is available to everyone, it is targeted at users who “face extraordinary digital threats — such as journalists, human rights activists, and members of government.”The feature gives a second level of verification that they are messaging only with the people they intend. While Apple noted that the vast majority of people will never be targeted by highly sophisticated cyberattacks, the tool is an extra layer of security for those who may be.“Conversations between users who have enabled iMessage Contact Key Verification receive automatic alerts if an exceptionally advanced adversary, such as a state-sponsored attacker, were ever to succeed breaching cloud servers and inserting their own device to eavesdrop on these encrypted communications,” Apple explained.“And for even higher security, iMessage Contact Key Verification users can compare a Contact Verification Code in person, on FaceTime, or through another secure call.”Security Keys for Apple ID was designed for more high-profile users who face “concerted threats to their online accounts, such as celebrities, journalists, and members of government.”More than 95% of active iCloud accounts already have two-factor authentication but the security keys offer people another layer of protection – requiring a hardware security key as one of the two factors.The feature was built to withstand phishing scams, preventing anyone from obtaining a person’s second factor. Ivan Krstić, Apple’s head of Security Engineering and Architecture, said Advanced Data Protection is Apple’s “highest level of cloud data security” and gives users the choice to protect the vast majority of their most sensitive iCloud data with end-to-end encryption so that it can only be decrypted on their trusted devices.For those who opt in, Advanced Data Protection keeps most iCloud data protected even in the case of a data breach in the cloud, according to Apple. The platform already uses end-to-end encryption by default for 14 data categories like passwords and health data. But the new program expands the feature to 23 data categories including iCloud Backup, Notes, and Photos.The only major iCloud data categories that are not covered are iCloud Mail, Contacts, and Calendar because of the need to interoperate with the global email, contacts, and calendar systems, Apple said. “We constantly identify and mitigate emerging threats to their personal data on device and in the cloud,” said Craig Federighi, Apple’s senior vice president of Software Engineering. “Our security teams work tirelessly to keep users’ data safe, and with iMessage Contact Key Verification, Security Keys, and Advanced Data Protection for iCloud, users will have three powerful new tools to further protect their most sensitive data and communications.”Apple cited the repeated abuse of this tool to breach and spy on innocent victims by oppressive regimes.“Researchers and journalists have publicly documented a history of this spyware being abused to target journalists, activists, dissidents, academics, and government officials,” the company said.Tanium's Melissa Bischoping called the changes a \"step forward in meeting industry best-practices for modern security and privacy\" and explained that keep iMessage and iCloud \"competitive with other privacy-focused messaging solutions.\"\"The Apple userbase is vast, and while these protections are of key interest to those in sensitive positions like activists, journalists, and political/government employees, the benefits are also valuable as regular consumers continue to see their data stolen,\" she said. UPDATE: The FBI told reporters from the Wall Street Journal that it opposed several of the changes announced by Apple.The FBI said it \"continues to be deeply concerned with the threat end-to-end and user-only-access encryption pose.\"\"This hinders our ability to protect the American people from criminal acts ranging from cyber-attacks and violence against children to drug trafficking, organized crime and terrorism,\" the FBI said.\"End-to-end and user-only-access encryption erodes law enforcement's ability to combat these threats and administer justice for the American public.\"The FBI went on to claim that it needs \"lawful access by design\" in order to conduct investigations. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-12-09",
      "title": "Several Security Breaches Exploited by Zerobot Botnet - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   }
]