[
   {
      "time": "2023-04-19",
      "title": "Recycled Core Routers Expose Sensitive Corporate Network Info",
      "text": " Cameron Camp had purchased a Juniper SRX240H router last year on eBay, to use in a honeypot network he was building to study remote desktop protocol (RDP) exploits, and attacks on Microsoft Exchange and industrial control systems (ICS) devices. When the longtime security researcher at Eset booted up the secondhand Juniper router, to his surprise it displayed a hostname.After taking a closer look at the device, Camp contacted Tony Anscombe, Eset's chief security evangelist, to alert him to what he found on the router. \"This thing has a whole treasure trove of Silicon Valley A-list software company information on it,\" Camp recalls telling Anscombe.\"We got very, very concerned,\" Camp says.Camp and Anscombe decided to test their theory that this could be the tip of the iceberg for other decommissioned routers still harboring information from their previous owners' networks. They purchased several more decommissioned core routers — four Cisco Systems ASA 5500, three Fortinet FortiGate, and 11 Juniper Networks SRX Series Services Gateway routers.After dropping a few from the mix after one failed to power up and another two were actually mirrored routers from a former cluster, they found that nine of the remaining 16 held sensitive core networking configuration information, corporate credentials, and data on corporate applications, customers, vendors, and partners. The applications exposed on the routers were from big-name software vendors used in many enterprises: Microsoft Exchange, Lync/Skype, PeopleSoft, Salesforce, Microsoft SharePoint, Spiceworks, SQL, VMWare Horizon View, voice over IP apps, File Transfer Protocol (FTP), and Lightweight Directory Access Protocol (LDAP) applications.The routers contained one or more set of IPSec or VPN credentials, or hashed root passwords, and each had sufficient data for the researchers to identify the actual previous owner/operator of the device. Nearly 90% included router-to-router authentication keys and details on applications connected to the networks, some 44% had network credentials to other networks (such as a supplier or partner), 33% included third-party connections to the network, and 22% harbored customer information.\"I have the entire network topology of their core infrastructure, both internal and external, like cloud assets,\" for example, Camp says.Camp says the discovery was a far cry from the malware he typically studies, and a lot less work for an attacker who happened upon one of these unwiped routers. \"I don't need a zero day, I have your router,\" quips Camp.\"They are the intersection upon everything that happens in your organization,\" Camp says of core routers. \"Everything touches the router,\" including many cloud services, he adds.Among the organizations whose information was exposed were a manufacturing company, a US law firm, managed services providers, an open source software firm, an events company, a telecommunications equipment supplier, a global data company, and a creative services company. Eset did not disclose the names of the organizations, but the researchers confirmed that they contacted all of them.The Silicon Valley software vendor was quick to respond, even awarding Camp a bug bounty that he then donated to the Electronic Freedom Foundation and the Tor Project. But that was the researchers' easiest disclosure.\"Once we stepped outside of the tech [sector], it was incredibly different\" and harder to disclose our findings, Anscombe notes. The other organizations didn't have processes or even people available to handle the disclosure information, he says.Meanwhile, one of the unwiped routers contained what Camp describes as a \"creepy\" remote administration interface.\"I was never sure if it was on purpose, but it was creepy, very low-level access, and from one of the countries with flags that we're [the US] not happy with right now,\" he says. \"It could be totally legit or that could be really bad. It was a little edgy to me.\"So how do you wipe a router that you want to retire? The good news is most routers are fairly easy to securely decommission, and the big three — Cisco, Fortinet, and Juniper — on their websites provide detailed guidelines for restoring devices to their factory default settings.With Juniper routers, for example, wiping the device is simple: \"Going to config setting and type 'delete,' hit 'Y' [to confirm] and now that router doesn't know who it is anymore,\" Camp says. The entire wiping process takes less than five minutes, including the post-deletion reboot.And if your organization already had disposed of routers that weren't properly wiped, Eset recommends rotating cryptographic keys in case an attacker were to get their hands on your old router and attempt to gain trusted access to your network. Zero trust can help here as well, they say.But that's still no guarantee that a malicious actor who buys your old router still couldn't use it to target your organization. \"Even if somebody goes and changes the credentials of the accounts being cached in router, potentially [the attacker has] got the app lists, so [they] can tell what apps are run internally locally or in the cloud,\" Abscombe says.That gives the attacker just enough intel to plan a targeted attack, according to Abscombe. \"If I know they're running [a specific version of] Exchange and that version had a CVE and they had not applied the patch … I suddenly know things about their network that can make them vulnerable,\" he says. If you buy a secondhand core router, and, like the researchers, find that it still contains the previous owner's information, Eset recommends disconnecting the router and moving it to a secured area and contacting your regional CISA office. They also say it's best to document your purchase process as a precaution for insurance or legal purposes.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-19",
      "title": "NSO Group escalates spyware tactics with 3 new iPhone zero-click exploit chains | SC Media",
      "text": "  The notorious NSO Group’s Pegasus spyware continues to pose a threat, despite reports it was winding down its operations. New zero-click exploits found by watchdogs at Citizen Lab targeted two different remote attack surfaces on iPhones running iOS 15 and 16.PWNYOURHOME and FINDMYPWN are the first zero-click exploits to remotely and simultaneously target two Apple attack surfaces, according to Citizen Lab researchers. The use of zero-click exploits against iOS is not new, as past research showed similar tactics against iOS 14 devices with the NSO Group's Pegasus spyware. The latest Citizen Lab research found three more zero-click exploits tied to the NSO Group being used to hack iOS 15 and iOS 16 devices. The tactics were discovered during their long-running investigation into NSO’s campaign against several Mexican human rights groups. Network defenders should take note that these new tactics demonstrate that NSO Group is escalating its attempts to stop researchers from analyzing their tactics by blocking all traces of infection. Even when they’re not successful, the group is certainly undermining these efforts.The first, PWNYOURHOME, is an iOS exploit that could enable an attacker to infiltrate the iMessage app to modify the HomeKit software. The issue was disclosed to Apple, which later fixed the vulnerability in the iOS 16.3.1 update.The attack is deployed in two phases, with each targeting a different iOS process. The first phase uses a daemon crash in the HomeKit app, then moves to download PNG images from the iMessage app, causing BlastDoor to crash. Citizen Lab could not determine how the exploit leaves BlastDoor, but they found the exploit later launches Pegasus through the iOS component called “mediaserverd.”Fortunately, it appears use of Apple’s Lockdown Mode feature can successfully block PWNYOURHOME attacks levied by the notorious spyware vendor, as the function alerted users to the attempted attack visible through the notification display.However, there are no indications NSO has stopped using the exploit, suggesting the group “may have figured out a way to correct the notification issue, such as by fingerprinting Lockdown Mode.”The second exploit, FINDMYPWN, effectively targets the fmfd process on the ‘Find My’ function of iOS 15.5 and iOS 15.6 devices. The exploit enables items to be written and deleted inside of the cache directory. Citizen Lab is limiting the forensic information it releases for the exploit, so as not to inform the NSO Group of possible evasion tactics.A final exploit was observed after the researchers reassessed earlier forensics. LATENTIMAGE first appeared in January 2022 impacting iOS 15 devices. Evidence suggests the exploit also uses the ‘Find My’ function, but it’s initial access point is not confirmed.For Citizen Lab, “the use of multiple attack surfaces should encourage developers to think holistically about device security, and treat the entire surface reachable through a single identifier as a single surface.”What’s more, “modern exploit mitigations like pointer authentication codes significantly reduce attacker freedom to execute arbitrary code on a device,” researchers wrote. But PWNYOURHOME shows that “real-world attackers can, and do, find practical ways around these mitigations, such as by repurposing signed pointers located at known offsets in the iOS shared cache.”As the NSO group continues these evasive tactics, Citizen Lab stressed that it’s “encouraging” that Lockdown Mode successfully notified targets of ongoing attacks. While no tool is a cure-all, the feature could go far in dampening the impact of similar attack methods.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.The new PCI DSS standard puts more focus on application security, with more tools, testing and documentation required of developers.GitHub has updated its Advanced Security platform available for Enterprise Cloud and Enterprise Server customers to provide new artificial intelligence-powered features in a bid to \"revolutionize\" secure app development, reports SecurityWeek.Vulnerabilities in API authorization have been named by Wallarm as the second greatest security risk facing APIs, emphasizing the ease of leveraging authorizations as backdoors as well as the urgent need to ensure authorization maintenance, reports SiliconAngle.Tue Aug 27 - Wed Aug 28Tue Dec 5On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-04-19",
      "title": "'Zaraza' Bot Targets Google Chrome to Extract Login Credentials",
      "text": " Using Telegram as its command-and-control (C2) mechanism, a new strain of malware, a bot dubbed Zaraza, is capable of extracting login credentials from a victim's open browser and saving them to a file, as well as taking screenshots of open windows to be saved in a JPG file.The type of login credentials that it steals range from bank accounts to email accounts to online wallets, as well as other sensitive and valuable website targets. This information can provide attackers with the opportunity to commit severe crimes such as identity theft and financial fraud, as well as grant access to personal identifiable information (PII) and, especially in the era of remote work, business accounts. This variant of malware and what it allows attackers to do potentially opens the floodgates to financial loss and \"reputational damage,\" according to the analysis.\"To protect yourself against this malware,\" the Uptycs researchers wrote, \"you should update your passwords regularly, follow online security best practices such as using strong passwords and multi-factor authentication, and ensure regular software and security system updates.\" Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-19",
      "title": "QBot Expands Initial Access Malware Strategy With PDF-WSF Combo",
      "text": " A recent surge in QBot Trojan attacks has been observed, spreading via malicious emails written in various languages, including English, German, Italian, and French. The emails are crafted using genuine business letters obtained by the attackers and urge the recipient to open an attached PDF file, which contains several layers of obfuscation that make its maliciousness less detectable by security tools.According to an analysis by Kaspersky this week, the campaign also uses the method of using reply-chain emails to make it more difficult for soon-to-be-victims to flag as malicious. As the name suggests, reply chain is the practice of accessing existing email exchanges from a listserv (or any location) and replying to them, making the interloping messages look legit, less suspicious, and believable.The campaign represents a change in tactics for the operators of QBot (aka QakBot or Pinkslipbot), who maintain an access-as-a-service offering that other cybercriminals use to deliver a range of second-stage malware to already-compromised targets. Initially discovered in 2007, QBot has undergone numerous modifications and enhancements over the years, resulting in its widespread distribution as one of the most actively propagated malware strains in 2020. These latest improvements help boost stealth and legitimacy, according to security researchers. For instance, the emails are crafted to change only minimal parts of the stolen documents; they may contain links or attachments that contain links to malicious sites.\"The WSF is obfuscated to evade detection which will download further payloads,\" explains Timothy Morris, chief security adviser at Tanium. \"The attack 'chaining', or using multiple steps, helps get past some protections since the full context of the nefarious behavior can't be observed as a single activity.\"Morris notes that the multiple phases in the attack flow, from the initial emails to payloads being downloaded to data exfiltration and theft requires a range of cybersecurity strategies to defend against.\"It is important to have a defense-in-depth strategy that includes detection, monitoring, and protection technologies at the endpoint, as well as Web, network, and email security that is up to date,\" he says. \"Also, training users to these types of threats is important.\"Darren Guccione, CEO and co-founder at Keeper Security, says potential targets should also be trained to recognize that, unlike phishing attempts that appear to come from random businesses or the government, the malicious file containing malware will appear to come from someone you've had past email conversations with.\"The threat actors hope to piggyback on your relationship and level of trust to get these contacts to download the files,\" he explains. \"Employees should avoid making risky clicks. Suspicious links should not be clicked and untrusted software should not be installed.\"Other email security best practices include verifying the email sender and content before downloading attachments, and hovering over embedded links to see the actual target URL. Also, defenders also should focus on making sure antivirus and anti-malware solutions are deployed and up to date, and secure endpoints, including PCs, servers, routers, and so on, keeping them patched.Guccione says the latest resurgence of QBot, along with new modules and evasion techniques being added, indicates active development of the malware, so companies should be vigilant when it comes to being prepared for the latest changes.\"It’s still a very capable adversary tool that defenders need to protect against,\" Guccione explains.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-19",
      "title": "Researchers Discover First-Ever Major Ransomware Targeting macOS",
      "text": " Ransomware for Mac may raise alarm bells, though a closer examination of the binary reveals that it's not quite ready for prime time.However, he adds, \"I think this should be looked at as a harbinger of things to come. You have a very well funded and motivated, large ransomware group that's saying: 'Hey, we're setting our sights on on macOS.'\"Will Mac users be ready when ransomware finally comes for them?Saturday's discovery may be best characterized as Windows malware with macOS lipstick.In unpacking the code, Wardle discovered multiple strings related to Windows artifacts — like autorun.inf, ntuser.dat.log, and so on. The lone component indicating its OS intentions was a variable called \"apple_config.\"\"This is the only instance (I found) of any macOS specific references/customizations,\" Wardle noted in the analysis, appending that \"(The rest of the malware's binary simply looks like Linux code, compiled for macOS).\"There were other signs, too, that the developers hadn't yet completed their project. For example, the code was signed \"ad-hoc\" — a stand-in for, say, a stolen Apple Developer ID. This could be a placeholder for future RaaS customers, but for now, Wardle explains, \"this means if downloaded to a macOS system (i.e. deployed by the attackers) macOS won't let it run.\"Suffice it to say: LockBit hasn't breached the Apple dam just yet. But that doesn't mean Mac users can relax.\"Look at, traditionally, who the targets are for large ransomware attacks. It's the enterprises: hospitals, packaging facilities, these more traditional companies,\" Wardle points out. \"They are generally Windows-based.\"\"The pandemic and the work from home really spurred that,\" Wardle postulates. \"A lot of people have Mac computers. And as the younger generation enters the workforce — they are more comfortable with the Apple ecosystem.\"Following from that, he adds, \"hackers who are very opportunistic are realizing that a lot of their potential victims are now transitioning, and thus they need to evolve their malicious creations.\"So the question may not be whether ransomware groups will jump into macOS, but how soon. \"This,\" Wardle thinks, \"is really the million-dollar question.\"Luckily for Mac users, Apple has anticipated this ransomware D-Day, and has proactively gotten ahead of it. Wardle points to two primary defenses already built into the operating system.Firstly, he says, \"system files are under read-only conditions. So even if ransomware gets root access on a computer, it's still not going to be able to modify those critical files and lock or render the system inoperable.\"Second is TCC — short for Transparency, Consent, and Control.\"The idea is that certain directories — for example, the user's document directory, desktop, downloads, their browser folders, and cookies — are actually protected by the operating system,\" Wardle explains. If ransomware finds its way onto the system, \"it's going to run into TCC and it's not going to be able to access the files it wants to encrypt, without either another exploit or getting the user to explicitly approve the access.\"There's a caveat to that happy news though. \"Apple has done a great job implementing security mechanisms, but,\" Wardle warns, \"these features haven't been really tried and tested yet. Maybe hackers will start poking and find some flaws. TCC, for example, has been riddled with bypasses basically since day one.\"\"It would be naive to think that the attackers aren't going to improve their techniques and create more effective ransomware,\" he concludes. \"So, I think it's really great to be talking about this now.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-19",
      "title": "Goldoson Android Malware Infects Over 100 Million Google Play Store Downloads",
      "text": " A new Android malware strain named Goldoson has been detected in the official Google Play Store spanning more than 60 legitimate apps that collectively have over 100 million downloads.An additional eight million installations have been tracked through ONE store, a leading third-party app storefront in South Korea.The rogue component is part of a third-party software library used by the apps in question and is capable of gathering information about installed apps, Wi-Fi and Bluetooth-connected devices, and GPS locations.Following responsible disclosure to Google, 36 of the 63 offending apps have been pulled from the Google Play Store. The remaining 27 apps have been updated to remove the malicious library.Some of the prominent apps include -The findings highlight the need for app developers to be transparent about the dependencies used in their software, not to mention take adequate steps to safeguard users' information against such abuse.\"Attackers are becoming more sophisticated in their attempts to infect otherwise legitimate applications across platforms,\" Kern Smith, vice president of sales engineering for the Americas at Zimperium, said.\"The use of third-party SDKs and code, and their potential to introduce malicious code into otherwise legitimate applications is only continuing to grow as attackers start to target the software supply chain to gain the largest footprint possible.\"A Google spokesperson told The Hacker News that it takes necessary action \"when we find apps that violate our policies\" and that it notified developers to implement necessary fixes to bring the apps into compliance.It's also designed to display rogue overlays on top of a specific list of apps, intercept SMS messages, and even comprises an unused functionality that allows it to download and execute another payload.Chameleon, true to its name, has a penchant for evasion by incorporating anti-emulation checks to detect if the device is rooted or it's being executed in a debugging environment, and if so, terminate itself.To mitigate such threats, users are recommended to only download apps from trusted sources, scrutinize app permissions, use strong passwords, enable multi-factor authentication, and exercise caution when receiving SMS or emails from unknown senders.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-04-19",
      "title": "Takedown of GitHub Repositories Disrupts RedLine Malware Operations - SecurityWeek",
      "text": " Hi, what are you looking for?Four GitHub repositories used by RedLine stealer control panels were suspended, disrupting the malware’s operations.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...The NSA and FBI warn that a Chinese state-sponsored APT called BlackTech is hacking into network edge devices and using firmware implants to silently...No one combatting cybercrime knows everything, but everyone in the battle has some intelligence to contribute to the larger knowledge base.Virtualization technology giant VMware on Tuesday shipped urgent updates to fix a trio of security problems in multiple software products, including a virtual machine...Unpatched and unprotected VMware ESXi servers worldwide have been targeted in a ransomware attack exploiting a vulnerability patched in 2021.Threat actors are increasingly abusing Microsoft OneNote documents to deliver malware in both targeted and spray-and-pray campaigns.The recent ransomware attack targeting Rackspace was conducted by a cybercrime group named Play using a new exploitation method, the cloud company revealed this...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2023-04-19",
      "title": "\r\n\tMuddyWater Uses SimpleHelp to Target Critical Infrastructure Firms - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe Iranian government-sponsored threat actor known as MuddyWater has been observed using the legitimate SimpleHelp remote support software tool to achieve persistence on victim devices.“According to our data, MuddyWater used SimpleHelp for the first time on June 30 2022. At the time of writing, the group has at least eight servers on which they have SimpleHelp installed,” explained Group-IB senior threat analyst Nikita Rostovtsev.The SimpleHelp client installed on victim devices can be run constantly as a system service, enabling attackers to access the user’s device at any point, including after a reboot.“In addition to connecting remotely, SimpleHelp operators can execute various commands on the victim’s device, including those that require administrator privileges,” Rostovtsev said. “SimpleHelp operators can also use the command ‘Connect in Terminal Mode’ to take control of the target device covertly.”Group-IB clarified that the initial infection method is currently unknown, but the team suspects it may be phishing. Rostovtsev also explained that, during the latest analysis of MuddyWater, Group-IB discovered previously unknown infrastructure and some publicly known IP addresses used by the attackers.“Information security specialists can use the ETag hashes mentioned in this article and search for malicious servers using search engines such as Censys or Shodan,” the security expert explained."
   },
   {
      "time": "2023-04-19",
      "title": "New 'Domino' Malware Linked to FIN7 Group, Ex-Conti Members - SecurityWeek",
      "text": " Hi, what are you looking for?New Domino backdoor brings together former members of the Conti group and the FIN7 threat actors.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...The NSA and FBI warn that a Chinese state-sponsored APT called BlackTech is hacking into network edge devices and using firmware implants to silently...No one combatting cybercrime knows everything, but everyone in the battle has some intelligence to contribute to the larger knowledge base.Virtualization technology giant VMware on Tuesday shipped urgent updates to fix a trio of security problems in multiple software products, including a virtual machine...Unpatched and unprotected VMware ESXi servers worldwide have been targeted in a ransomware attack exploiting a vulnerability patched in 2021.Threat actors are increasingly abusing Microsoft OneNote documents to deliver malware in both targeted and spray-and-pray campaigns.The recent ransomware attack targeting Rackspace was conducted by a cybercrime group named Play using a new exploitation method, the cloud company revealed this...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2023-04-19",
      "title": "Exposed Web Panel Reveals Gamaredon Group's Automated Spear Phishing Campaigns",
      "text": " Get the most out of your EclecticIQ cybersecurity solutions.Master the art of cyber threat intelligence and intelligence-led cyberdefense.Explore our world-class partners – or learn about our partner program.Power your CTI practice with analyst-centric threat intelligence solutions.Go beyond the IOC to augment your SOC in defense of your organization.Learn how EclecticIQ can help you address your specific challenges – by team and by need – and improve your overall security posture.Provide your CTI team with the automation, performance, flexibility, and integrations needed to supercharge their CTI operations with our range of analyst-centric products and services.Enable your SOC team to better operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.Improve your situational awareness and mitigate risk with our collection of analyst-centric threat intelligence products and services.Operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.An ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with collaborative partner programs delivering world-class joint solutions. Partner with EclecticIQ to bring valuable and innovative security solutions and services to end users. Open to all partner types, including technology developers, service providers, resellers, and community.We partner with the world's premier technology and solution providers to support all phases of your cybersecurity needs. Explore all our partners' solutions and offerings to build and extend your cyber defense ecosystem.We are committed to increasing the knowledge and capabilities of the cybersecurity community through our research & analysis efforts and open source projects.Learn more about our technology, solutions and services, and stay updated on the cyber threat landscape with our research reports, webinars and other information.We are proud to be an active member in the open source community and to help develop and advance progress of security technology. Learn more about contributions or go directly to our GitHub page.Get the most out of your EclecticIQ cybersecurity solutions.Master the art of cyber threat intelligence and intelligence-led cyberdefense.Explore our world-class partners – or learn about our partner program.Power your CTI practice with analyst-centric threat intelligence solutions.Go beyond the IOC to augment your SOC in defense of your organization.Learn how EclecticIQ can help you address your specific challenges – by team and by need – and improve your overall security posture.Provide your CTI team with the automation, performance, flexibility, and integrations needed to supercharge their CTI operations with our range of analyst-centric products and services.Enable your SOC team to better operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.Improve your situational awareness and mitigate risk with our collection of analyst-centric threat intelligence products and services.Operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.An ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with collaborative partner programs delivering world-class joint solutions. Partner with EclecticIQ to bring valuable and innovative security solutions and services to end users. Open to all partner types, including technology developers, service providers, resellers, and community.We partner with the world's premier technology and solution providers to support all phases of your cybersecurity needs. Explore all our partners' solutions and offerings to build and extend your cyber defense ecosystem.We are committed to increasing the knowledge and capabilities of the cybersecurity community through our research & analysis efforts and open source projects.Learn more about our technology, solutions and services, and stay updated on the cyber threat landscape with our research reports, webinars and other information.We are proud to be an active member in the open source community and to help develop and advance progress of security technology. Learn more about contributions or go directly to our GitHub page.Get the most out of your EclecticIQ cybersecurity solutions.Master the art of cyber threat intelligence and intelligence-led cyberdefense.Explore our world-class partners – or learn about our partner program.Power your CTI practice with analyst-centric threat intelligence solutions.Go beyond the IOC to augment your SOC in defense of your organization.Learn how EclecticIQ can help you address your specific challenges – by team and by need – and improve your overall security posture.Provide your CTI team with the automation, performance, flexibility, and integrations needed to supercharge their CTI operations with our range of analyst-centric products and services.Enable your SOC team to better operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.Improve your situational awareness and mitigate risk with our collection of analyst-centric threat intelligence products and services.Operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.An ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with collaborative partner programs delivering world-class joint solutions. Partner with EclecticIQ to bring valuable and innovative security solutions and services to end users. Open to all partner types, including technology developers, service providers, resellers, and community.We partner with the world's premier technology and solution providers to support all phases of your cybersecurity needs. Explore all our partners' solutions and offerings to build and extend your cyber defense ecosystem.We are committed to increasing the knowledge and capabilities of the cybersecurity community through our research & analysis efforts and open source projects.Learn more about our technology, solutions and services, and stay updated on the cyber threat landscape with our research reports, webinars and other information.We are proud to be an active member in the open source community and to help develop and advance progress of security technology. Learn more about contributions or go directly to our GitHub page.Get the most out of your EclecticIQ cybersecurity solutions.Master the art of cyber threat intelligence and intelligence-led cyberdefense.Explore our world-class partners – or learn about our partner program.Power your CTI practice with analyst-centric threat intelligence solutions.Go beyond the IOC to augment your SOC in defense of your organization.Learn how EclecticIQ can help you address your specific challenges – by team and by need – and improve your overall security posture.Provide your CTI team with the automation, performance, flexibility, and integrations needed to supercharge their CTI operations with our range of analyst-centric products and services.Enable your SOC team to better operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.Improve your situational awareness and mitigate risk with our collection of analyst-centric threat intelligence products and services.Operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.An ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with collaborative partner programs delivering world-class joint solutions. Partner with EclecticIQ to bring valuable and innovative security solutions and services to end users. Open to all partner types, including technology developers, service providers, resellers, and community.We partner with the world's premier technology and solution providers to support all phases of your cybersecurity needs. Explore all our partners' solutions and offerings to build and extend your cyber defense ecosystem.We are committed to increasing the knowledge and capabilities of the cybersecurity community through our research & analysis efforts and open source projects.Learn more about our technology, solutions and services, and stay updated on the cyber threat landscape with our research reports, webinars and other information.We are proud to be an active member in the open source community and to help develop and advance progress of security technology. Learn more about contributions or go directly to our GitHub page.EclecticIQ analysts identified a spear phishing campaign targeting Ukrainian government entities like the Foreign Intelligence Service of Ukraine (SZRU) and Security Service of Ukraine (SSU), likely conducted by APT group Gamaredon.On February 09, 2023, EclecticIQ analysts identified a spear phishing campaign targeting Ukrainian government entities like the Foreign Intelligence Service of Ukraine (SZRU) and Security Service of Ukraine (SSU). Analysts identified a publicly exposed Simple Mail Transfer Protocol (SMTP) server and assess with high confidence that the threat actor used the SMTP server to craft and deliver phishing emails.  The SMTP server contained a web panel designed to create and distribute spear phishing emails. It enables the email to have a malicious attachment and leverages email spoofing techniques to make it appear from a legitimate source.Observed adversary tactics, techniques, and procedures (TTPs), victimology, and infrastructure found in the SMTP server configuration overlap with previously identified Gamaredon activity.Gamaredon APT group is believed to be a Russian State-backed threat group linked to the Federal Security Service (FSB). Gamaredon is known for its cyberespionage activities, primarily targeting Ukrainian government entities. The group uses spear phishing emails and social engineering lures as a primary tactic.The threat actor used a generic web panel to craft and send phishing emails against Ukrainian government entities. This allowed the actor to automate the malware delivery process against specific targets entered by the attackers in the email recipient section of the panel's user interface.  Pivoted IP addresses overlap with previously reported Gamaredon activity (8).  EclecticIQ analysts discovered a publicly facing SMTP server 194[.]180[.]191[.]56 used in a spear phishing campaign against Ukrainian government entities in February 2023. The exposed SMTP server hosts a web panel for crafting and delivering spear phishing emails. Analysts assess with high confidence that the threat actor used this infrastructure to send large number of spear phishing emails automatically. Figure 1 shows two example phishing emails sent from the server:  Figure 1 - Example of phishing emails with malicious attachment sent in in February 2023.EclecticIQ analysts identified these two different spear-phishing emails sent from 194[.]180[.]191[.]56. Both of these emails contain a RAR archive file as an attachment, which are used to deliver the initial malware. Figures 2 and 3 showed two different malware execution flows, sent on Wed, 15 Feb 2023 17:10:18 +0200 and Wed, 08 Feb 2023 17:15:44 which are identical to previous Gamaredon campaigns (1).Figure 2 - Spear phishing email sent on Wednesday, 15 February 2023.Figure 3 - Spear phishing email sent it on Wednesday, 8 February 2023.Figure 4 shows the origin of the phishing email and spoofed email address:  Figure 4 - Source of phishing email.The server had port 80 open for use by the threat actor for crafting spear phishing emails via a simple user interface seen in figure 5.  Figure 5 - Web panel translated from Russian to English.The web panel allowed the threat actor to send emails using the hardcoded sender address pivn-kr@prokuratura[.]dp[.]ua. EclecticIQ analysts identified the same email address in a recent phishing email campaign sent to a Ukrainian military address on February 9, 2023 (5), indicating that the exposed panel was very likely used for malware delivery.EclecticIQ analysts identified that the “.htaccess” file on the exposed SMTP server was misconfigured. The ”.htaccess” file is a directory-level configuration to limit access to a web server from trusted IP addresses only. According to the Apache documentation, users must insert all IP filters inside the \"<RequireAll>\" tag (7). However, this tag was missing in the configuration used by threat actor.Analysts identified five IP addresses in the “.htaccess” file (figure 6):Figure 6 – Reconnaissance with gobuster (6) and pivoting.  The majority of the pivoted IP addresses are located in Moscow, Russia from the same server provider, Crelcom LLC (AS 6789). WHOIS records show that one of the IP addresses - 109[.]200[.]159[.]46 - was registered under the name Michael Tishin. The same name is also listed as registrant for another IP - 109[.]200[.]159[.]54. This IP was attributed to Gamaredon by BlackBerry on January 19, 2023 (8).The adversary TTPs and victimology overlap with Gamaredon activity previously reported by EclecticIQ and other researchers starting in 2020 (1).EclecticIQ analysts identified one IP address 109[.]200[.]159[.]59 in the “.htaccess” file that links to a spear phishing email submitted to VirusTotal on November 20, 2020. In May 2022, Cisco reported the campaign and attributed the activity to Gamaredon (2, 4).Figure 7 shows the connection between the pivoted IP addresses and malicious files uploaded to VirusTotal. The IP address links to a spear phishing email with a malicious attachment. The attachments exploit CVE-2017-0199, a Microsoft Office remote code execution vulnerability in Windows.Figure 7 – Link analysis for 109[.]200[.]159[.]59.Figure 8 shows that spear phishing email was sent to the Security Service of Ukraine (SSU) on November 19, 2020. It contained a malicious Word document attachment used for malware delivery. The email sender section was spoofed by threat actors to make the email look legitimate.Figure 8 – Content of the phishing email.Figure 9 displays the metadata of the spear phishing email. The \"X-Sender-IP\" field in the metadata reveals the IP address 109[.]200[.]159[.]59 of the sender. This IP address does not match the domain name (i.ua) in the “From” field, proving it is a spoofed email.Figure 9 – Metadata section inside phishing email.Once a victim opens the delivered malicious Word document, it will exploit CVE-2017-0199. If the exploitation is successful, then it will download a second-stage malware from the domain  erythrocephala[.]online, which has been attributed to Gamaredon.EclecticIQ analysts assess with high confidence that Russian government-linked APTs will continue to use social engineering tactics during cyberattacks against Ukraine. Additionally, they are expected to increasingly target NATO partners due to NATO's support of Ukraine during the Russian war.It is very likely that the threat actor will modify their TTPs to avoid detection that will increase their chances of success, especially during the malware delivery stage."
   },
   {
      "time": "2023-04-19",
      "title": "Cyber Espionage in India: Decoding APT-36's New Linux Malware Campaign",
      "text": " KuppingerCole positions Uptycs a CSPM Technology LeaderKuppingerCole positions Uptycs a CSPM Technology LeaderThe Uptycs threat research team has discovered a new Linux malware, Poseidon, deployed by the APT-36 group, also known as Transparent Tribe. This Pakistan-based advanced persistent threat group is notorious for targeting Indian government organizations, military personnel, and defense contractors. Transparent Tribe used the Kavach authentication tool as a cover to deliver the Poseidon payload. Kavach is a two-factor authentication (2FA) solution provided by the Indian government for secure access to their email services. Transparent Tribe created a backdoored version of Kavach to target Linux users working for Indian government agencies. When a user interacts with the malicious version of Kavach, the genuine login page is displayed to distract them. Meanwhile, the payload is downloaded in the background, compromising the user's system. Poseidon is a second-stage payload malware associated with Transparent Tribe. It is a general-purpose backdoor that provides attackers with a wide range of capabilities to hijack an infected host. Its functionalities include logging keystrokes, taking screen captures, uploading and downloading files, and remotely administering the system in various ways. Primarily, Poseidon is distributed through malicious websites disguised as legitimate Indian government sites. Uptycs research found that the malware infrastructure, such as malicious domains, is linked to earlier APT-36 campaigns. This highlights the group's continued focus on the aforementioned Indian targets. Repercussions of this APT-36 attack could be significant, leading to loss of sensitive information, compromised systems, financial losses, and reputational damage. Moreover, as the Transparent Tribe is thought to be state-sponsored, its activities could escalate tensions between nations, potentially resulting in retaliatory cyberattacks. This highlights the importance of implementing robust cybersecurity measures and remaining vigilant against the ever-evolving threat landscape. APT-36, aka Transparent Tribe, primarily targets Indian government organizations, military personnel, and defense contractors. Its objective is usually to gather sensitive information, conduct cyber espionage, and compromise the security of its targets.APT-36 is known to have exploited various platforms, including Windows and Android. The bad actors often create fake websites and documents that mimic legitimate government entities or organizations. This can trick targeted users into revealing their credentials or downloading malware onto their systems. It has also used custom-developed malware such as the Crimson RAT (remote access trojan) for cyber espionage.Users can protect themselves by following these best practices: The Uptycs threat research team has uncovered an ELF malware sample (MD5: c82bf2c50900b89b66e9f62d68c415ab). It’s a compiled Python executable (Pyinstaller) of nearly 5 MB in size.Upon extraction, a possible entry point is at Kavach.pyc (Fig. 1). Next we’ll decompile it to produce its source code.Fig. 1 – Extraction of .pyc files from pyinstaller executable Seen in the Fig. 2 Python code, the ELF file distracts the user by opening the legitimate Kavach login page (Fig. 3). This is where 2FA is provided to Indian users wanting to access their government email service. But in the background, a malicious “bosshelp” file is downloaded from hxxps://sharing1[.]filesharetalk.com/bosshelp to the user’s ~/.local/share directory.Fig. 2 – Decompiled Python code This creates a crontab to periodically log the victim's machine “loginname” in /dev/shm/mycron.Fig. 3 – Legitimate Kavach login page to trick users Let's now examine the “bosshelp” second stage payload. “Checkin” keywordProcess nameOSPIDIP AddressHostnameUUID“Amd64aring” keyword(The integrity level is 3 if the process is elevated; otherwise it’s level 2.) Fig. 4 – C2 check-in The C2 was offline during our analysis. But the binary contained a switch case (Fig. 5) having a number of tasks (e.g., keylogging, injecting, screen capture, uploading/downloading files). Each task is associated with a TaskID shown in the following table.Fig. 5 – Switch case to perform various tasks COMMAND CODE (DECIMAL)TASKDESCRIPTION4ShellExecute shell commands5Screencapture_runTake a screenshot of victim’s desktop6Keylog_RunLogging keystrokes7DownloadDownload file from remote system8UploadUpload file to remote machine9LibInjectInject a library10Ps_runList processes running on machine11Sleep_runSleep time12cat_runRead contents inside the file13cd_runChange directory14lsList contents inside the directory15jxa_runJavascript for automation16keys_runRetrieve keys from Kerberos keychain17triagedirectorySearch target directory18sshauthAuthenticate to host using username and password pair19portscanScan target for open ports20main.getJoblistingGet list of current running jobs21main.killJobKill a process with given PID22cp_runCopy a file23drives_runList currently mounted drives along with their description24getuser_runList information about current user25mkdirCreate directory.26mvMove a file27pwdPrint working directory28rmDelete a file29getenvRetrieve current environment variables30setenvSet environment variables31unsetenvDelete environment variable32kill_runKill process with given PID33curl_runExecute curl command34xpc_runCross-process communication35socksSupport for SOCKS proxies36listtask_runGet list of running tasks37list_entitlements_RunList entitlements (permissions associated with a particular PID)38Execute_memoryExecute shellcode directly from the memory39jsimport_runTo load specified javascript module43dyld_inject_RunInject dynamic library This payload serves as an all-purpose backdoor. An attacker can use it to take control of an infected host, record keystrokes, insert new stages, launch screen captures, or remotely monitor computers in a variety of ways using above commands. Fig. 6 – DNS replication of sharing1[.]filesharetalk.com The next table shows suspicious domains masquerading as various government sites hosted on the same IP (153.92.220.48). All were used in earlier APT-36 campaigns. SUSPICIOUS DOMAINSLEGIT DOMAINSOTHER AV DETECTIONS FOR SUSPICIOUS DOMAINSgovscholarships[.]inscholarships.gov.in3kavach-app[.]inkavach.mail.gov.in11supremo-portal[.]insupremo.nic.in6 MD5:382285738bae358060011ad847e845d2 (Name: confirmationId_ksb) masquerades as the Kendriya Sainik board site as seen in Fig.7Suspicious Site present in the malicious pyinstaller file: www[.]ksboard[.]inLegit site: ksb[.]gov[.]in.MD5:02796a813b79928c95b2475798a14688(Name:confirmationId_rodra) masquerades as RODRA (Retired Officers Digital Records Archive) as seen in Fig 8.Suspicious Site present in the malicious pyinstaller file: www[.]rodra[.]in. The legitimate site is rodra[.]gov[.]in. Fig. 7 – Decompiled Python code from malicious pyinstaller confirmationId_ksb Fig. 8 – Decompiled Python code from malicious pyinstaller confirmationId_rodra Transparent Tribe is an APT group that targets users working within the Indian government. It has previously executed many payloads in Windows and Android. Now APT 36 has started targeting Linux users, too. Sites such as Kavach, Rodra, and KSB were used in social engineering attacks to trick targeted users. Users should be extremely careful and double-check URLs before opening or downloading files. We could see new features/advancements from this APT group in the future. The Uptycs threat research team continuously monitors related malware campaigns to safeguard our clients and inform the broader security community. In addition to having YARA built-in and being armed with other advanced detection capabilities, Uptycs XDR users can easily scan for Poseidon. XDR contextual detection provides important details about identified malware. Users can navigate to the toolkit data section in the detection alert, then click a detected item to reveal its profile (Fig. 9). Fig. 9 – Uptycs EDR detection   File NameMD5Kavachc82bf2c50900b89b66e9f62d68c415abconfirmationId_ksb382285738bae358060011ad847e845d2confirmationId_rodra02796a813b79928c95b2475798a14688Bosshelpaeb3ad3426794d4e90de4d139e92ee4dBossstart21316422f8c7f0f3ab2b9a282cdacd03Bosstype7b163e400e481519d74e06c1116a5200Kavachelf9b64528352dd683e55eb308919a596fa sharing1[.]filesharetalk.com/bosshelpksboard[.]inrodra[.]intt1[.]apktrial[.]com70[.]34[.]214[.]252Get regular updates on all things Uptycs—from product updates to expert articles and much more"
   }
]