[
   {
      "time": "2022-11-09",
      "title": "Mississippi election websites knocked out by DDoS attack",
      "text": " Updated Nov. 9 at 1:50 pm EST.Several Mississippi state websites were knocked offline during Tuesday’s midterm election in what was the most significant digital disruption of the day, though a federal official warned that more could be on the way as ballots are counted.“We want to be extremely clear and reassure Mississippians our election system is secure and has not been compromised.\"A senior Cybersecurity and Infrastructure Security Agency (CISA) official confirmed the attack hours before the statement was released.“We have been chatting with them for the last several hours working with some of the vendors to put the mitigations in place,” the official told reporters during the organization’s third press briefing of the day.A second senior CISA official said the agency was “aware” of the claim by Russian hackers, but refrained from pinning the outage on a specific actor.“While attribution is inherently difficult, we've not seen any evidence to suggest that these are part of a widespread coordinated campaign,” the first official said, adding CISA is tracking a “handful” of similar incidents.“I suspect we’re going to see more of this activity,” the official speculated, noting CISA had no evidence of any DDoS attacks on election night result reporting websites.The Mississippi Secretary of State's office said Wednesday that it was not able to attribute the attack. \"At this time, we do not have confirmation as to where the DDoS activity originated and more evidence would be required to attribute to any person or group.\"The official also swatted down conspiratorial allegations that were made throughout the day by Republicans, including former President Donald Trump, about ballot scanner issues in Maricopa County, Arizona.“To be very clear, we have no indication of malfeasance or malicious activity,” the official said. “They’ve been working on the issue. It is a technical issue and they have resolved it.”Earlier in the day, the clerk’s office in Champaign County, Illinois, said its voter registration database was attacked. However, the second senior CISA official said \"we understand the technical issues with a vendor have now been resolved\" with zero impact on the voting process.The first official stressed that tonight's vote counts will be unofficial and that it would take additional time to certify the election results.The process \"may take days to weeks, depending on state law, and that is completely normal.\"Martin Matishak is a senior cybersecurity reporter for The Record. He spent the last five years at Politico, where he covered Congress, the Pentagon and the U.S. intelligence community and was a driving force behind the publication's cybersecurity newsletter.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-09",
      "title": "LockBit affiliate uses Amadey Bot malware to deploy ransomware",
      "text": " A LockBit 3.0 ransomware affiliate is using phishing emails that install the Amadey Bot to take control of a device and encrypt devices.The LockBit 3.0 payload used in this attack is downloaded as an obfuscated PowerShell script or executable form, running on the host to encrypt files.The Amadey Bot malware is an old strain capable of performing system reconnaissance, data exfiltration, and payload loading.The latest version added antivirus detection and auto-avoidance capabilities, making intrusions and dropping payloads stealthier.In the July campaign, Amadey dropped various information-stealing malware, such as RedLine, but the more recent campaign loads a LockBit 3.0 payload instead.AhnLab researchers noticed two distinct distribution chains, one relying on a VBA macro inside a Word document and one disguising the malicious executable as a Word file.In the first case, the user has to click on the \"Enable Content\" button to execute the macro, which creates an LNK file and stores it to \"C:\\Users\\Public\\skem.lnk\". This file is a downloader for Amadey.The second case, seen in late October, uses email attachments with a file named \"Resume.exe\" (Amadey) that uses a Word document icon, tricking recipients into double-clicking.Both distribution paths lead to Amadey infections that use the same command and control (C2) address, so it's safe to assume the operator is the same.At first launch, the malware copies itself to the TEMP directory and creates a scheduled task to establish persistence between system reboots.Next, Amadey connects to the C2, sends a host profiling report, and then waits for the reception of commands.The three possible commands from the C2 server order the download and execution of LockBit, in PowerShell form ('cc.ps1' or 'dd.ps1'), or exe form ('LBB.exe').The payloads are again dropped in TEMP as one of the following three:From there, LockBit encrypts the user's files and generates ransom notes demanding payment, threatening to publish stolen files on the group's extortion site."
   },
   {
      "time": "2022-11-09",
      "title": "US reissues sanctions on Tornado Cash, tying it to North Korea\\'s nuclear weapons program",
      "text": " The U.S. Treasury Department reissued sanctions on the Tornado Cash cryptocurrency mixer service, accusing the platform of helping North Korean government hackers launder more than $455 million stolen in March 2022. State Department spokesman Ned Price said the mixer had provided “material support” to the Lazarus Group — a hacking collective U.S. law enforcement agencies believe works on behalf of the North Korean government. Price said the group’s hacks specifically support North Korea’s weapons of mass destruction program.“The use of Tornado Cash to launder stolen funds represents a larger trend by the DPRK regime to resort to illicit activities, including cyber-enabled heists from virtual currency exchanges and financial institutions, to generate revenue for its unlawful WMD and ballistic missile programs,” Price said. “The United States is committed to countering the regime’s attempts to raise funds through illicit activity and will continue to take actions against entities facilitating such activity.”Under Secretary of the Treasury for Terrorism and Financial Intelligence Brian Nelson said the sanctions targets two key nodes of the DPRK’s weapons programs: its increasing reliance on illicit activities, including cybercrime, to generate revenue, and its ability to procure and transport goods in support of weapons of mass destruction and ballistic missile programs.The U.S. also sanctioned two men – Sok Ri and Zhiyong Yan – for their role in violating sanctions by helping facilitate the sending of missile parts to North Korea. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-09",
      "title": "Malicious extension lets attackers control Google Chrome remotely",
      "text": " A new Chrome browser botnet named 'Cloud9' has been discovered in the wild using malicious extensions to steal online accounts, log keystrokes, inject ads and malicious JS code, and enlist the victim's browser in DDoS attacks.The Cloud9 browser botnet is effectively a remote access trojan (RAT) for the Chromium web browser, including Google Chrome and Microsoft Edge, allowing the threat actor to remotely execute commands.The malicious Chrome extension isn't available on the official Chrome web store but is instead circulated through alternative channels, such as websites pushing fake Adobe Flash Player updates.This method appears to be working well, as researchers at Zimperium reported today that they have seen Cloud9 infections on systems across the globe.Cloud9 is a malicious browser extension that backdoors Chromium browsers to perform an extensive list of malicious functions and capabilities.The extension consists of three JavaScript files for collecting system information, mining cryptocurrency using the host's resources, performing DDoS attacks, and injecting scripts that run browser exploits.Zimperium noticed the loading of exploits for the CVE-2019-11708 and CVE-2019-9810 vulnerabilities in Firefox, CVE-2014-6332 and CVE-2016-0189 for Internet Explorer, and CVE-2016-7200 for Edge.These vulnerabilities are used to automatically install and execute Windows malware on the host, enabling the attackers to conduct even more significant system compromises.However, even without the Windows malware component, the Cloud9 extension can steal cookies from the compromised browser, which the threat actors can use to hijack valid user sessions and take over accounts.Additionally, the malware features a keylogger that can snoop for key presses to steal passwords and other sensitive information.A \"clipper\" module is also present in the extension, constantly monitoring the system clipboard for copied passwords or credit cards.Cloud9 can also inject ads by silently loading webpages to generate ad impressions and, thus, revenue for its operators.Finally, the malware can enlist the host's firepower to perform layer 7 DDoS attacks via HTTP POST requests to the target domain.\"The developer is likely using this botnet to provide a service to perform DDOS.\"The hackers behind Cloud9 are believed to have ties to the Keksec malware group because the C2 domains used in the recent campaign were seen in Keksec's past attacks.The victims of Cloud9 are spread worldwide, and screenshots posted by the threat actor on forums indicate that they target various browsers.Also, the public promotion of Cloud9 on cybercrime forums leads Zimperium to believe that Keksec is likely selling/renting it to other operators.Update 11/9 - A Google spokesperson has provided the following comment to BleepingComputer:We always recommend users update to the latest version of Google Chrome to ensure they have the most up-to-date security protections.Enhanced Protection automatically warns you about potentially risky sites and downloads and inspects the safety of your downloads and warns you when a file may be dangerous."
   },
   {
      "time": "2022-11-09",
      "title": "U.S. Seizes Over 50K Bitcoin Worth $3.3 Billion Linked to Silk Road Dark Web",
      "text": " The U.S. Department of Justice (DoJ) on Monday said it seized 50,676 Bitcoin in November 2021 that was stolen in the 2012 hack of the now-defunct Silk Road dark web marketplace.The bitcoin, which was obtained in 2012 and valued at $3.36 billion when it was discovered last year, is now worth $1.04 billion. Additionally recovered were $661,900 in cash, 25 Casascius coins with an approximate value of 174 Bitcoin, and gold- and silver-colored bars.The Justice Department said it conducted the seizure on November 9, 2021, pursuant to a search warrant issued to James Zhong's house located in the U.S. state of Georgia. It also said the keys to the tokens were found in an underground floor safe and on a \"single-board computer that was submerged under blankets in a popcorn tin stored in a bathroom closet.\"The 32-year-old, on November 4, also pleaded guilty to one count of committing wire fraud in September 2012 when he unlawfully siphoned the cryptocurrency from Silk Road. The charge carries a maximum sentence of 20 years in prison.Zhong, according to court documents, executed a scheme in September 2012 to defraud Silk Road by creating nine fraudulent accounts on the platform and triggering over 140 transactions to plunder more than 50,000 Bitcoin before transferring the funds to a number of wallets under his control.While each of the nine accounts had an initial deposit that ranged anywhere between 200 and 2,000 Bitcoin, Zhong is estimated to have made a series of withdrawals in rapid succession with the goal of tricking Silk Road's processing systems into releasing more crypto than was originally deposited.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-09",
      "title": "EU governments accused of using spyware ‘to cover up corruption and criminal activity’",
      "text": " European Union governments have used “spyware on their citizens for political purposes and to cover up corruption and criminal activity,” according to a new draft report from a committee of the European Parliament.Released on Tuesday, the 159-page report was prompted by reporting from the Pegasus Project, an international journalistic collaboration, which alleged a tool of the same name sold by NSO Group had regularly been used politically, rather than for law enforcement purposes, including against officials within the EU.The committee found there has been an insufficient response to the tool’s misuse, accusing the European Council of practicing “omertà” — a code of silence — over the abuses of spyware inside the bloc. It called for the European Commission to conduct “a comprehensive and in-depth investigation into the abuse of and trade in spyware in the EU” alongside a “full-blown inquiry into all allegations and suspicions of the use of spyware against EU Commission officials.” The committee, which focused on “the use of Pegasus and equivalent surveillance spyware,” has no special investigatory powers, for instance summoning witnesses to testify under oath.Who's who in the EUThere are three major institutions within the European Union. At the top is the European Commission, a 27-person body which effectively functions as a cabinet government. The cabinet is comprised of one person from each member state, whose portfolio is decided by the president of the European Commission. It is the only EU body which may propose new legislation.Then there is the European Council comprised of the heads of each member state’s government. It sets the EU’s strategic direction and political priorities, in particular by choosing the president of the European Commission.The European Parliament is the only EU institution which has directly elected members, 705 of them currently. Although it has ceremonial precedence over the other two bodies, its members are unable to suggest legislation however they may reject laws proposed by the Commission or suggest amendments, and their votes are required to make any such legislation into law.The committee chair said that the draft of the report has not been finalized and members can still amend certain aspects before it should be considered to represent “the position of the European Parliament as a whole.”The committee argues there are a number of existing laws that could “serve as regulatory tools with regard to spyware,” including the EU’s privacy and data protection regulations, alongside its laws on export controls for dual-use technologies. However the report says “without proper and meaningful enforcement, EU laws are mere paper tigers that create ample space for the illegitimate use of spyware.”In ’t Veld complained: “The spyware industry is pan-European, but the European Commission treats it as a purely national matter - leaving the defense of democracy wide open.”Her committee’s report accuses five states of abusing or facilitating the abuse of the technology in ways that would be considered illegal under the EU’s Charter on Fundamental Rights, including Poland, Hungary, Greece, Spain and Cyprus.These governments \"represent almost a quarter of the EU population, so they carry considerable weight in the Council,\" the report says. A spokesperson for the European Council did not respond to The Record’s requests for comment.While the Commission has publicly requested clarification about these allegations from the governments of Poland, Hungary, Spain and Greece — stating that the countries can not simply cite \"national security\" as \"an unlimited carve out from European laws and Treaties\" — the report criticized \"this timid admonition\" and deemed it unlikely that the Commission would engage in any further action. A spokesperson for the Commission also did not respond to a request for comment.Numerous incidents have emerged across the EU in recent years of opposition figures and journalists being hacked in what appear to be politically-charged circumstances. Many of them were uncovered by the University of Toronto’s interdisciplinary Citizen Lab, including cases in Hungary, Spain’s Catalonia region, and Greece.Reuters reported in April that senior officials at the European Commission itself had also been targeted by spyware provided by Israeli vendor NSO Group, which was sanctioned by the U.S. last November, partly for being used to target journalists and other illegitimate targets. The company has denied that officials could have been targeted by its tools.Correction: An earlier version of this story stated that Sophie in 't Veld is the chief of the committee. She is the committee's rapporteur.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-09",
      "title": "Microsoft November 2022 Patch Tuesday fixes 6 exploited zero-days, 68 flaws",
      "text": " ​Today is Microsoft's November 2022 Patch Tuesday, and with it comes fixes for six actively exploited Windows vulnerabilities and a total of 68 flaws.Eleven of the 68 vulnerabilities fixed in today's update are classified as 'Critical' as they allow privilege elevation, spoofing, or remote code execution, one of the most severe types of vulnerabilities.The number of bugs in each vulnerability category is listed below:This month's Patch Tuesday fixes six actively exploited zero-day vulnerabilities, with one being publicly disclosed.Microsoft classifies a vulnerability as a zero-day if it is publicly disclosed or actively exploited with no official fix available.The six actively exploited zero-day vulnerabilities fixed in today's updates are:\"This vulnerability requires that a user with an affected version of Windows access a malicious server. An attacker would have to host a specially crafted server share or website. An attacker would have no way to force users to visit this specially crafted server share or website, but would have to convince them to visit the server share or website, typically by way of an enticement in an email or chat message.\"\"An attacker can craft a malicious file that would evade Mark of the Web (MOTW) defenses, resulting in a limited loss of integrity and availability of security features such as Protected View in Microsoft Office, which rely on MOTW tagging.\"\"An attacker who successfully exploited this vulnerability could gain SYSTEM privileges.\"\"An attacker who successfully exploited this vulnerability could gain SYSTEM privileges.\"\"The privileges acquired by the attacker would be the ability to run PowerShell in the context of the system.\"\"The attacker for this vulnerability could target the server accounts in an arbitrary or remote code execution. As an authenticated user, the attacker could attempt to trigger malicious code in the context of the server's account through a network call.\"More information about the above Microsoft Exchange vulnerabilities can be found in the next section.These vulnerabilities were disclosed in late September by Vietnamese cybersecurity firm GTSC, who first spotted the flaws used in attacks.The vulnerabilities were reported to Microsoft through the Zero Day Initiative program.Other vendors who released updates in November 2022 include:"
   },
   {
      "time": "2022-11-09",
      "title": "Japan joins NATO cyber defense center • The Register",
      "text": " This article is more than 1 year oldJapan’s Ministry of Defence (JMOD) announced on Friday that it has formally joined NATO’s Cooperative Cyber Defense Centre of Excellence (CCDCOE).At the time, CCDCOE director Merle Maigre said Japan joining the center would be “a concrete step forward signalling the commitment in cyber defence cooperation between like-minded nations.”The budget bill detailing the earmarked collab money also includes $3 billion for chip production and $2.5 billion for chip materials. ®The Register   Biting the hand that feeds IT\n                        Copyright. All rights reserved © 1998–2023\n\n                    "
   },
   {
      "time": "2022-11-09",
      "title": "Unencrypted Traffic Still Undermining Wi-Fi Security",
      "text": " Even cybersecurity professionals need to improve their security posture. That's the lesson from the RSA Conference in February, where the security operations center (SOC) run by Cisco and NetWitness captured 55,525 cleartext passwords from 2,210 unique accounts, the companies stated in a report released last week. In one case investigated by the SOC, a chief information security officer had a misconfigured email client that sent passwords and text in the clear, including sensitive documents such as their payment for a professional certification. While the number of cleartext passwords is an improvement compared with the 96,361 passwords exposed in 2020 and the more than 100,000 sent in the clear in 2019, there is still room for improvement, says Jessica Bair Oppenheimer, director of technical alliances at Cisco Secure. \"As the RSA Conference is mostly attended by cybersecurity professionals and supporting roles within the security industry, we generally consider the demographic to represent more of a 'best-case' level of security awareness,\" she says. \"Somewhat shockingly, unencrypted email is still being used in 2022.\"At approximately 19,900 attendees, the 2022 RSA Conference only had about half the number of people as the previous conference in 2020, but about the same number of users on the network, the report stated. The major issue was failure to use encryption for the authentication step when using email and other popular applications. Nearly 20% of all data passed through the network in the clear, the report stated.\"Encrypting traffic does not necessarily make one more secure, but it does stop individuals from giving away their credentials, and organizations from giving away corporate asset information in the clear,\" the report stated.Yet the situation isn't as bad as it could be. Because the wireless network includes traffic from the show floor, many of the usernames and passwords are likely from demo systems and environments, the report stated. Moreover, most of the cleartext usernames and passwords — almost 80% — were actually leaked by devices using the older version of the Simple Network Management Protocol (SNMP). Versions 1 and 2 of the protocol are considered insecure, while SNMP v3 adds significant security capabilities.\"This is not necessarily a high-fidelity threat,\" the report stated. \"[H]owever, it does leak information about the device as well as the organization it's trying to communicate with.\"In addition to the continued use of plaintext usernames and passwords, the SOC found that the number of online applications continues to grow rapidly, suggesting that the attendees are increasingly relying on mobile devices to get work done. The SOC, for example, captured unencrypted video camera traffic connecting to home security systems on port 80 and the unencrypted data used for setting up voice-over-IP calls.For the most part, the unencrypted traffic is likely from small-business users, the companies stated in the report. \"It is difficult to send email in cleartext these days, and analyzing these incidents found similarities,\" the report stated. \"Most of this traffic was to and from hosted domains. This means email services on domains that are family names or small businesses.\"Yet in one case, a chief information security officer had misconfigured their email client and ultimately exposed their email username and password by sending the data in the clear. The SOC discovered the issue when it found a receipt for a CISSP payment sent in the clear from an Android-based email client. \"The discovery sparked an investigation that confirmed dozens of emails from and to the person were downloaded across the open network in the unsecure protocol,\" the report stated.Companies should verify that the technologies used by employees have created end-to-end encrypted connections and should apply zero-trust principles to check — at appropriate times — that the encryption is still being applied. \"We've found applications and websites that authenticate encrypted and then pass the data without encryption across the open networks,\" Cisco Secure's Oppenheimer says. \"Alternatively, some will pass unencrypted credentials across open networks and then encrypt the data. Both scenarios are less than ideal.\"Virtual private networks are not a panacea but can strengthen the security of unencrypted applications. Finally, organizations should use cybersecurity and awareness training to educate their hybrid workers in how to be secure when working from remote locations.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-11-09",
      "title": "New Laplas Clipper Malware Targeting Cryptocurrency Users via SmokeLoader",
      "text": " Cryptocurrency users are being targeted with a new clipper malware strain dubbed Laplas by means of another malware known as SmokeLoader.Cyble said it discovered over 180 samples of the Laplas since October 24, 2022, suggesting a wide deployment.The goal of clipper malware like Laplas is to hijack a virtual currency transaction intended for a legitimate recipient to a wallet owned by the threat actor.\"Laplas is new clipper malware that generates a wallet address similar to the victim's wallet address,\" the researchers pointed out. \"The victim will not notice the difference in the address, which significantly increases the chances of successful clipper activity.\"The newest clipper malware offers support for a variety of wallets like Bitcoin, Ethereum, Bitcoin Cash, Litecoin, Dogecoin, Monero, Ripple, Zcash, Dash, Ronin, TRON, Cardano, Cosmos, Tezos, Qtum, and Steam Trade URL. It's priced from $59 a month to $549 a year.It also comes with its own web panel that enables its purchasers to get information about the number of infected computers and the active wallet addresses operated by the adversary, in addition to allowing for adding new wallet addresses.\"SmokeLoader is a well-known, highly configurable, effective malware that TAs [threat actors] are actively renovating,\" the researchers concluded.\"It is a modular malware, indicating it can get new execution instructions from [command-and-control] servers and download additional malware for expanded functionality. In this case, the TAs use three different malware families for financial gain and other malicious purposes.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]