[
   {
      "time": "2022-11-22",
      "title": "Aurora infostealer malware increasingly adopted by cybergangs",
      "text": " Cybercriminals are increasingly turning to a new Go-based information stealer named ‘Aurora’ to steal sensitive information from browsers and cryptocurrency apps, exfiltrate data directly from disks, and load additional payloads.The reason for this sudden rise in Aurora’s popularity is its low detection rates and general unknown status, making its infections less likely to be detected.Simultaneously, Aurora offers advanced data-stealing features and presumably infrastructural and functional stability.Aurora was first announced in April 2022 on Russian-speaking forums, advertised as a botnet project with state-of-the-art info-stealing and remote access features.However, in late August 2022, SEKOIA noticed that Aurora was advertised as a stealer, so the project abandoned its goal of creating a multi-function tool.The highlight features listed in the promotional posts are:The above features are geared towards high-level stealthiness, which is the main advantage of Aurora over other popular info-stealers.The cost to rent the malware was set to $250 per month or $1,500 for a lifetime license.Upon execution, Aurora runs several commands through WMIC to collect basic host information, snaps a desktop image, and sends everything to the C2.Next, the malware targets data stored in multiple browsers (cookies, passwords, history, credit cards), cryptocurrency browser extensions, cryptocurrency wallet desktop apps, and Telegram.The targeted desktop wallet apps include Electrum, Ethereum, Exodus, Zcash, Armory, Bytecoin, Guarda, and Jaxx Liberty.All stolen data is bundled in a single base64-encoded JSON file and exfiltrated to the C2 through TCP ports 8081 or 9865.SEKOIA reports they couldn’t confirm the existence of a working file grabber as the author of the malware promises.However, the analysts observed Aurora’s malware loader that uses “net_http_Get” to drop a new payload onto the filesystem using a random name and then use PowerShell to execute it.Currently, Aurora is distributed to victims via various channels, which is to be expected considering the involvement of seven distinct operators.SEKOIA noticed cryptocurrency phishing sites promoted via phishing emails and YouTube videos that link to fake software and cheat catalog sites."
   },
   {
      "time": "2022-11-22",
      "title": "Attackers bypass Coinbase and MetaMask 2FA via TeamViewer, fake support chat",
      "text": " A crypto-stealing phishing campaign is underway to bypass multi-factor authentication and gain access to accounts on Coinbase, MetaMask, Crypto.com, and KuCoin and steal cryptocurrency.The threat actors abuse the Microsoft Azure Web Apps service to host a network of phishing sites and lure victims to them via phishing messages impersonating bogus transaction confirmation requests or suspicious activity detection.For example, one of the phishing emails seen in the attacks pretended to be from Coinbase, which says they locked the account due to suspicious activity.When the targets visit the phishing site, they are presented with a chat window supposedly for 'customer support,' controlled by a scammer who directs visitors through a multi-step defrauding process.The first phase of the attack in the fake crypto exchange phishing sites involves a bogus login form followed by a two-factor authentication prompt.Regardless of the credentials entered during this stage, they will still be stolen by the threat actors. The page then proceeds to a prompt asking for the 2FA code needed to access the account.The attackers try out the entered credentials on the legitimate website, triggering the sending of a 2FA code to the victim, who then enters a valid 2FA on the phishing site.The threat actors then attempt to use the entered 2FA code to log in to the victim's account as long as they act before the timer runs out.It should be noted that the MetaMask phishing attacks are targeting recovery phrases, rather than credentials or 2FA codes.Regardless of whether a 2FA code works, the researchers say that the scammers trigger the next attack stage, which is to launch on-screen chat support.This is done by displaying a fake error message stating the account has been suspended due to suspicious activity and asking the visitor to contact support to resolve the matter.In this support chat, the threat actors start a conversation with the targeted victim to keep them around in case different credentials, recovery phrases, or 2FA codes are needed for the threat actors to log in to the account.\"The criminal will then take this directly to a browser on their machine and again try to access the users account.\"For successfully breached accounts, the victim is still engaged with customer support in case they need to confirm fund transfers while the crooks empty their wallets.However, for accounts they cannot breach through the support chat, the threat actors switch to an alternative method to authenticate their device as \"trustworthy\" for the cryptocurrency platform.To overcome the authenticated device obstacle, the attackers convince the victim to download and install the 'TeamViewer' remote access app.Next, the scammers ask the victims to log in to their cryptocurrency wallet or exchange accounts, and while they do so, the threat actors add a random character in the password field to cause a login failure.The attacker then asks the victim to paste the password on the TeamViewer chat, uses the password (minus the random character) to login on to their device, and then snatches the device confirmation link sent to the victim to authenticate their device as trusted.Once they gain access to the account or wallet, the threat actors drain it of all funds while still keeping the victim engaged in the support chat. To avoid getting scammed in attacks like these, it is essential to always pay attention to the sender's email address and any sent URLs.If these URLs do not match the cryptocurrency platform, you should immediately treat the email as suspicious and delete it.Unfortunately, if you fall for one of these scams, there is nothing that a crypto exchange can due to recover your funds once they are transmitted from your wallet. "
   },
   {
      "time": "2022-11-22",
      "title": "Amazon addresses vulnerability affecting AWS AppSync",
      "text": " The bug allows attackers to abuse AWS' AppSync service and assume Identity and Access Management (IAM) roles in other AWS accounts. This gives an attacker the opportunity “to pivot into a victim organization and access resources in those accounts,” according to Datadog.The researchers discovered the bug on September 1 and immediately reported it to AWS, which reproduced the attack and confirmed the impact the next day. By September 6, AWS pushed out a fix for the vulnerability, with Datadog confirming the fix had addressed the issue. “No customers were affected by this issue, and no customer action is required. AWS moved immediately to correct this issue when it was reported. Analysis of logs going back to the launch of the service have been conducted and we have conclusively determined that the only activity associated with this issue was between accounts owned by the researcher,” Amazon’s security team said. “No other customer accounts were impacted. We would like to thank Datadog Security Labs for reporting this issue.”AppSync is a popular AWS service that allows developers to quickly create GraphQL and Pub/Sub Application Programming Interfaces (API), the researchers explained. In that process, a developer must create a data source that holds the data the GraphQL API interacts with. Datadog researchers said AppSync is a common integration with their service, so they started a research project into it before discovering the bug. The researchers sought to answer the question of whether they could find a way to trick the AppSync service to assume a role in an account they don’t control and access its resources.They explained that the vulnerability is an example of an issue they call “confused deputy” – where an attacker with fewer privileges can convince a more privileged entity like AppSync to take actions on its behalf. “We wanted to find a way to confuse AppSync to assume roles in other accounts. AWS safeguards against this type of attack by validating the role’s Amazon Resource Name (ARN), a unique identifier for an AWS resource. During the creation of a data source, the API will look at the provided ARN and determine if it is in the same AWS account. If it is not, the API will throw an error,” the researchers explained. The researchers eventually found a way to bypass the validation and provide an ARN of a role in a different AWS account.In bypassing the ARN validation, Datadog researchers were able to create AppSync data sources tied to roles in other AWS accounts. “This would allow an attacker to interact with any resource associated with a role which trusts the AWS AppSync service in any account,” they wrote. “With this vulnerability in hand, we could create data sources in our own account which pointed to resources in other AWS accounts.” If an attacker was able to phish a victim and gain access to their internal documents, they could get the kind of credentials needed to access other services and tools and use the vulnerability to compromise databases by creating their own AppSync API and data source. Datadog said this would allow the attacker to interact with this data source “as if they owned it.” “This vulnerability in AWS AppSync allowed attackers to cross account boundaries and execute AWS API calls in victim accounts via IAM roles that trusted the AppSync service,” Datadog said. “By using this method, attackers could breach organizations that used AppSync and gain access to resources associated with those roles.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-22",
      "title": "US, Estonian authorities arrest two over $575 million cryptocurrency fraud",
      "text": " Two Estonian citizens were arrested in the capital of Tallinn on Sunday for allegedly running a $575 million cryptocurrency mining operation that authorities said was no more than an \"elaborate Ponzi scheme.\"Sergei Potapenko and Ivan Turõgin, both 37, convinced hundreds of thousands of victims to invest in a cryptocurrency mining service called HashFlare and a virtual currency bank called Polybius, according to court documents published Monday. The two men, who are held pending extradition to the U.S., collected more than half of a billion dollars and used shell companies to launder the cash and use it to buy real estate and luxury cars.According to the indictment, the entire scheme the two men ran was a fraud. Potapenko and Turõgin claimed HashFlare was a massive cryptocurrency mining operation that allowed customers to rent out computing power and collect a portion of the virtual currency it produced. However, HashFlare did not actually have the mining equipment it claimed to have.In reality, Potapenko and Turõgin had been operating the service as a Ponzi scheme, according to the indictment. They took steps to make it difficult for customers to collect their funds, including imposing \"Know-Your-Customer\" requirements that mandated users upload identification documents before they could make withdrawals.Potapenko and Turõgin are also charged with offering investments in a virtual currency bank they created called Polybius — the defendants allegedly siphoned $25 million from investors and never formed a bank or paid any dividends. They also are charged with using shell companies and phony contracts to launder their proceeds, and the money laundering conspiracy involved \"at least 75 real properties, six luxury vehicles, cryptocurrency wallets, and thousands of cryptocurrency mining machines.\"Read the full indictment below:Adam Janofsky is the founding editor-in-chief of The Record by Recorded Future. He previously was the cybersecurity and privacy reporter for Protocol, and prior to that covered cybersecurity, AI, and other emerging technology for The Wall Street Journal.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-22",
      "title": "Google Chrome extension used to steal cryptocurrency, passwords",
      "text": " An information-stealing Google Chrome browser extension named 'VenomSoftX'  is being deployed by Windows malware to steal cryptocurrency and clipboard contents as users browse the web.This Chrome extension is being installed by the ViperSoftX Windows malware, which acts as a JavaScript-based RAT (remote access trojan) and cryptocurrency hijacker.Since the beginning of 2022, Avast has detected and stopped 93,000 ViperSoftX infection attempts against its customers, mainly impacting the United States, Italy, Brazil, and India.The main distribution channel for ViperSoftX is torrent files containing laced game cracks and software product activators.By analyzing the wallet addresses that are hardcoded in samples of ViperSoftX and VenomSoftX, Avast found that the two had collectively earned their operators about $130,000 by November 8th, 2022.This stolen cryptocurrency was obtained by diverting cryptocurrency transactions attempted on compromised devices and does not include profits from parallel activities.The downloaded executable is a malware loader that decrypts AES data to create the following five files:The single malicious code line hides somewhere towards the bottom of the 5MB log text file and runs to decrypt the payload, ViperSoftX stealer.A key feature of newer ViperSoftX variants is the installation of a malicious browser extension named VenomSoftX on Chrome-based browsers (Chrome, Brave, Edge, Opera).To stay hidden from the victims, the installed extension masquerades as \"Google Sheets 2.1\", supposedly a Google productivity app. In May, security researcher Colin Cowie also spotted the extension installed as 'Update Manager.'While VenomSoftX appears to overlap ViperSoftX activity since they both target a victim's cryptocurrency assets, it performs the theft differently, giving the operators higher chances of success.\"VenomSoftX mainly does this (steals crypto) by hooking API requests on a few very popular crypto exchanges victims visits/have an account with,\" explains Avast in the report.\"When a certain API is called, for example, to send money, VenomSoftX tampers with the request before it is sent to redirect the money to the attacker instead.\"The services targeted by VenomSoftX are Blockchain.com, Binance, Coinbase, Gate.io, and Kucoin, while the extension also monitors the clipboard for the addition of wallet addresses.Moreover, the extension can modify HTML on websites to display a user's cryptocurrency wallet address while manipulating the elements in the background to redirect payments to the threat actor.To determine the victim's assets, the VenomSoftX extension also intercepts all API requests to the cryptocurency services mentioned above. It then sets the transaction amount to the maximum available, siphoning all available funds.To make matters worse, for Blockchain.info, the extension will also attempt to steal passwords entered on the site.\"This module focuses on www.blockchain.com and it tries to hook https://blockchain.info/wallet. It also modifies the getter of the password field to steal entered passwords,\" explains Avast.\"Once the request to the API endpoint is sent, the wallet address is extracted from the request, bundled with the password, and sent to the collector as a base64-encoded JSON via MQTT.\"Finally, if a user pastes content into any website, the extension will check if it matches any of the regular expressions shown above, and if so, send the pasted content to the threat actors.As Google Sheets is normally installed in Google Chrome as an app under chrome://apps/and not an extension, you can check your browser's extension page to determine if Google Sheets is installed.If it is installed as an extension, you should remove it and clear your browser data to ensure the malicious extension is removed."
   },
   {
      "time": "2022-11-22",
      "title": "DEV-0569 Ransomware Group Remarkably Innovative, Microsoft Cautions",
      "text": " It generally starts with malvertising and ends with the deployment of Royal ransomware, but a new threat group has distinguished itself by its ability to innovate the malicious steps in between to lure in new targets.The cyberattack group, tracked by Microsoft Security Threat Intelligence as DEV-0569, is notable for its ability to continuously improve its discovery, detection evasion, and post-compromise payloads, according to a report this week from the computing giant.In just a few months, the Microsoft team observed the group's innovations, including hiding malicious links on organizations' contact forms; burying fake installers on legitimate download sites and repositories; and using Google ads in its campaigns to camouflage its malicious activities.\"DEV-0569 activity uses signed binaries and delivers encrypted malware payloads,\" the Microsoft team added. \"The group, also known to rely heavily on defense evasion techniques, has continued to use the open-source tool Nsudo to attempt disabling antivirus solutions in recent campaigns.\"New tricks aside, Mike Parkin, senior technical engineer at Vulcan Cyber, points out the threat group indeed makes adjustments along the edges of their campaign tactics, but consistently relies on users to make mistakes. Thus, for defense, user education is the key, he says.\"The phishing and malvertising attacks reported here rely entirely on getting users to interact with the lure,\" Parkin tells Dark Reading. \"Which means that if the user doesn't interact, there is no breach.\"He adds, \"Security teams need to stay ahead of the latest exploits and malware being deployed in the wild, but there is still an element of user education and awareness that's required, and will always be required, to turn the user community from the main attack surface into a solid line of defense.\"Making users impervious to lures certainly sounds like a solid strategy, but Chris Clements, vice president of solutions architecture at Cerberus Sentinel, tells Dark Reading it's \"both unrealistic and unfair\" to expect users to maintain 100% vigilance in the face of increasingly convincing social engineering ploys. Instead, a more holistic approach to security is required, he explains.\"It falls then to the technical and cybersecurity teams at an organization to ensure that a compromise of a single user doesn't lead to widespread organizational damage from the most common cybercriminal goals of mass data theft and ransomware,\" Clements says.Robert Hughes, CISO at RSA, recommends starting with identity and access management (IAM) controls.\"Strong identity and access governance can help control the lateral spread of malware and limit its impact, even after a failure at the human and endpoint malware prevention level, such as stopping authorized individual from clicking on a link and installing software that they are allowed to install,\" Hughes tells Dark Reading. \"Once you've ensured that your data and identities are safe, the fallout of a ransomware attack won't be as damaging — and it won't be as much of an effort to re-image an endpoint.\"Phil Neray from CardinalOps agrees. He explains that tactics like malicious Google Ads are tough to defend against, so security teams must also focus on minimizing fallout once a ransomware attack occurs.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-11-22",
      "title": "Google releases 165 YARA rules to detect Cobalt Strike attacks",
      "text": " The Google Cloud Threat Intelligence team has open-sourced YARA Rules and a VirusTotal Collection of indicators of compromise (IOCs) to help defenders detect Cobalt Strike components in their networks.Security teams will also be able to identify Cobalt Strike versions deployed in their environment using these detection signatures.\"We decided that detecting the exact version of Cobalt Strike was an important component to determining the legitimacy of its use by non-malicious actors since some versions have been abused by threat actors.\"This enables improved detection of malicious activity by targeting non-current Cobalt Strike releases (potentially leaked and cracked versions) since it helps differentiate easier between legitimate deployments and those controlled by threat actors.As Google explained, cracked and leaked releases of Cobalt Strike are, in most cases, at least one version behind, which allowed the company to collect hundreds of stagers, templates, and beacon samples used in the wild to build YARA-based detection rules with a high degree of accuracy.While the developer is attempting to vet customers and will only sell licenses for legitimate uses, cracked copies of Cobalt Strike have also been obtained and shared by threat actors over time.This has led to Cobalt Strike becoming one of the most common tools used in cyberattacks that could lead to data theft and ransomware. In such attacks, it is used by threat actors for post-exploitation tasks after deploying so-called beacons that provide them with persistent remote access to compromised devices. With the help of beacons deployed on the victims' networks, the attackers can access compromised servers to harvest sensitive data or deploy further malware payloads."
   },
   {
      "time": "2022-11-22",
      "title": "WatchDog Continues to Target East Asian CSPs - Cado Security | Cloud Forensics & Incident Response",
      "text": " Researchers at Cado Labs have recently discovered the re-emergence of the threat actor WatchDog. As regular readers will know, WatchDog are an opportunistic and prominent threat actor, who are known for routinely carrying out cryptojacking attacks against resources hosted by various Cloud Service Providers.We previously reported on WatchDog’s activities after they targeted one of our honeypots back in June 2022. We’ve attributed this new campaign to them based on the presence of a malicious shell script and a Monero wallet ID known to be under their control. Techniques known to be used by this group are also evident.As is common with this type of attack, the script begins with a number of commands designed to weaken the compromised system and remove monitoring tools. We can see the threat actor making use of the ulimit command to configure resource limits for the current user, before removing the Linux syslog – in an attempt to cover their tracks.This section of the script also includes commands to remove various files/directories from /tmp/ which appear to be related to cryptomining (lines 13 – 15). This is likely an attempt to remove artifacts from prior cryptojacking attacks. Moving further down the script, we can see the threat actor has included code to remove monitoring agents native to East Asian Cloud Service Providers. This suggests targeting of these CSPs, as we’ve seen in related campaigns.Perhaps some of the most interesting information to be gained from analysing these types of payloads is the insight into techniques used by competing threat groups. Usually cryptomining shell scripts have a section dedicated to killing processes and removing artifacts from competing cryptojacking attacks – this one is no different. In this particular payload, a number of lines within this section caught our attention.Lines 497 and 501 are used to remove files from a folder named TeamTNT under /usr/bin. It would seem likely that this folder contained executables implanted during an attack by this prominent cloud threat actor.Lines 671, 682 and 693 also demonstrate use of the touch command to perform timestomping on the replaced system utilities. We believe this is an anti-forensics measure, designed to confuse an analyst during the incident response process. We saw this technique in our analysis of CoinStomp, and it’s surprising that we don’t see it more often with cloud threat actors – given that it’s a clever example of “living off the land”.The rest of the script is dedicated to retrieving and setting up the miner – a version of XMRig which is saved with the filename “zzh” and run from /tmp/. The following mining servers are used:Clearly, WatchDog remain active and pose a significant threat to users of Cloud Service Providers such as Tencent and Alibaba Cloud. Several techniques typical of this threat actor were seen in the analysed shell script and the reuse of a particular Monero wallet made attribution relatively easy. The presence of code used to remove TeamTNT executables was an interesting observation. We’ve seen evidence to suggest that cloud-focused cryptojacking groups keep their knowledge of the threat landscape current, so perhaps this indicates that WatchDog have encountered evidence of TeamTNT activities during their campaigns. We mentioned earlier that WatchDog and similar groups are opportunistic, and it’s likely that this malware made use of misconfigured cloud instances as an initial access vector. Once again, this highlights the ease of which certain cloud threat actors can compromise cloud resources and how little effort is required for them to make this endeavour profitable.Cado Security is the provider of the first cloud forensics and incident response platform. By leveraging the scale and speed of the cloud, the Cado platform automates forensic-level data capture and processing across cloud, container, and serverless environments. Only Cado empowers security teams to respond at cloud speed.Cado Security is the provider of the first cloud forensics and incident response platform. By leveraging the scale and speed of the cloud, the Cado platform automates forensic-level data capture and processing across cloud, container, and serverless environments. Only Cado empowers security teams to respond at cloud speed.© Copyright 2023 Cado Security"
   },
   {
      "time": "2022-11-22",
      "title": "Daixin Ransomware Gang Steals 5 Million AirAsia Passengers' and Employees' Data",
      "text": " The cybercrime group called Daixin Team has leaked sample data belonging to AirAsia, a Malaysian low-cost airline, on its data leak portal.The threat actors allegedly claim to have obtained the personal data associated with five million unique passengers and all of its employees.The samples uploaded to the leak site reveal passenger information and the booking IDs as well as personal data related to the company's staff.A spokesperson for the threat actor told DataBreaches.net that further attacks were not pursued owing to AirAsia's poor security measures and \"the chaotic organization of the network.\"It's a rare case of a threat actor stopping its attacks against a company as a result of bad security practices.Other victims of the criminal group include Fitzgibbon Hospital, Trib Total Media, ista International GmbH, and OakBend Medical.The Hacker News has reached out to AirAsia for comment and we will update the story if we hear back.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]