[
   {
      "time": "2022-10-15",
      "title": "Cyberattackers Spoof Google Translate in Unique Phishing Tactic",
      "text": " The messages direct a user to a link that directs them to a credential-harvesting page that appears to be a legitimate Google Translate page, with a pre-populated email field that requires only that a person enter his or her password to log in.The campaign is an example of a number of current, increasingly more sophisticated tactics that threat actors are using in contemporary phishing campaigns to fool both more savvy end users who have become familiar with malicious tactics, as well as email scanners that delete suspicious messages before they get through, noted Jeremy Fuchs, an Avanan cybersecurity researcher and analyst.\"This attack has a little bit of everything,\" he wrote in the post. \"It has unique social engineering at the front end. It leverages a legitimate site to help get into the inbox. It uses trickery and obfuscation to confuse security services.\"Researchers observed a Spanish-language email being used in the campaign, which begins — as most phishing messages do — with social engineering.In this case, hackers make an \"urgent plea\" for a user to confirm access to his or her account by informing them that they are missing out on important emails and have only 48 hours in which to review them before they will be deleted.\"That's a compelling message that might get someone to act,\" Fuchs noted.Upon taking the bait, the link directs a victim to a login page that is a \"pretty convincing\" Google Translate lookalike page, complete with the typical logo on the upper left-hand corner of the page and a drop-down list of languages. Closer inspection shows that the URL has nothing to do with Google Translate, however, the researchers noted.The code in the background makes it even more apparent that the page is a fake, with the \"HTML that goes into turning this site into a Google Translate lookalike,\" Fuchs wrote.One of the JavaScript commands hackers use here is the \"unescape function,\" which is \"a classic command that helps obfuscate the true meaning of the page,\" he wrote.Unescape is a function in JavaScript that computes a new string in which hexadecimal escape sequences are replaced with the character that it represents. The function can be used on a webpage to appear to show the page as one thing but then, when decoded, shows a \"bunch of gibberish\" that can trick email security, according to a video about the phishing campaign posted by Avanan.\"This attack requires vigilance on the part of the end user, and advanced natural language processing on the part of the security service to stop,\" Fuchs noted in the post.Even with the ramp-up in sophistication, however, the usual precautions that all Internet users and security professionals alike should take to avoid giving up their credentials to phishers still apply — not only in the case of the Google Translate campaign but across the board, according to Avanan.Researchers recommend that people always hover over URLs found in messages before clicking on them to ensure the destination is legitimate, as well as pay closer attention to grammar, spelling, and factual inconsistencies within an email before trusting it.And as always, users also should put basic common sense into play when dealing with emails from unknown entities, researchers said. If they ever have doubts about where they're coming from or their intentions, they should just ask the original sender to be sure before taking further actions.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-10-15",
      "title": "Black Basta Ransomware Gang Infiltrates Networks via QAKBOT, Brute Ratel, and Cobalt Strike",
      "text": " BusinessImprove your risk posture with attack surface managementSecurity that enables business outcomesGain visibility and meet business needs with securityConnect with confidence from anywhere, on any deviceSecure users and key operations throughout your environmentMove faster than your adversaries with powerful purpose-built XDR, attack surface risk management, and zero trust capabilitiesMaximize effectiveness with proactive risk reduction and managed servicesUnderstand your attack surface, assess your risk in real time, and adjust policies across network, workloads, and devices from a single consoleDrive business value with measurable cybersecurity outcomesSee more, act fasterEvolve your security to mitigate threats quickly and effectivelyEnsure code runs only as intendedGain visibility and control with security designed for cloud environmentsProtect patient data, devices, and networks while meeting regulationsProtecting your factory environments – from traditional devices to state-of-the-art infrastructuresICS/OT Security for the oil and gas utility industryICS/OT Security for the electric utilityStop threats with comprehensive, set-it-and-forget-it protectionBridge threat protection and cyber risk managementOperationalize a zero trust strategyStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformThe most trusted cloud security platform for developers, security teams, and businessesProactively discover, assess, and reduce cyber riskStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformSecure your data center, cloud, and containers without compromising performance by leveraging a cloud security platform with CNAPP capabilitiesSimplify security for your cloud-native applications with advanced container image scanning, policy-based admission control, and container runtime protectionSecurity for cloud file/object storage services leveraging cloud-native application architecturesDefend the endpoint through every stage of an attackStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformOptimized prevention, detection, and response for endpoints, servers, and cloud workloadsOn-premises and cloud protection against malware, malicious applications, and other mobile threatsExpand the power of XDR with network detection and responseStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformProtect against known, unknown, and undisclosed vulnerabilities in your networkDetect and respond to targeted attacks moving inbound, outbound, and laterallyRedefine trust and secure digital transformation with continuous risk assessmentsStop phishing, malware, ransomware, fraud, and targeted attacks from infiltrating your enterpriseLearn about solutions for ICS / OT security.Stop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformKeep ahead of the latest threats and protect your critical data with ongoing threat prevention and analysisAugment security teams with 24/7/365 managed detection, response, and supportAugment threat detection with expertly managed detection and response (MDR) for email, endpoints, servers, cloud workloads, and networksOur trusted experts are on call whether you're experiencing a breach or looking to proactively improve your IR plansStop breaches with the best response and detection technology on the market and reduce clients’ downtime and claim costsGrow your business and protect your customers with the best-in-class complete, multilayered securityDeliver modern security operations services with our industry-leading XDRPartner with a leading expert in cybersecurity, leverage proven solutions designed for MSPsAdd market-leading security to your cloud service offerings – no matter which platform you useIncrease revenue with industry-leading securityDiscover the possibilitiesWe work with the best to help you optimize performance and valueJoin us at AWS re:Invent Nov. 27-Dec. 1Engage with us >Understanding ChatGPT's potential for misuse via malware creationLearn more >How threat actors leverage file-sharing to harvest credentialsLearn more >Understanding how stolen data is acquired and soldProtect your organization >Content has been added to your FolioNetworkWe analyzed a QAKBOT-related case leading to a Brute Ratel C4 and Cobalt Strike payload that can be attributed to the threat actors behind the Black Basta ransomware.By: Ian Kenefick, Lucas Silva, Nicole Hernandez\n\t\t\n\t\t\tOctober 12, 2022\nRead time:  ( words)\n\tSave to FolioA recent case involving the QAKBOT ‘BB’ distributor led to the deployment of Brute Ratel (detected by Trend Micro as Backdoor.Win64.BRUTEL) —  a framework similar to Cobalt Strike — as a second-stage payload. This is a noteworthy development because it is the first time we have observed Brute Ratel as a second-stage payload via a QAKBOT infection. The attack also involved the use of Cobalt Strike itself for lateral movement. We attribute these activities to the threat actors behind the Black Basta ransomware.Intrusion timeline Brute Ratel is a commercial (paid) Adversary Emulation framework and a relative newcomer to the commercial C&C Framework space, where it competes with more established players such as Cobalt Strike.Adversary Emulation frameworks like Brute Ratel and Cobalt Strike are marketed to penetration testing professionals (Red Teams) for use in legitimate penetration testing activities in which organizations seek to improve their ability to detect and respond to real cyberattacks. These frameworks are used to provide hands-on keyboard access from remote locations to emulate the tactics, techniques, and procedures (TTPs) used by attackers in network intrusions.On top of Cobalt Strike’s legitimate use cases, it has gained notoriety for its illicit usage and near omnipresence in high-profile, human-operated ransomware attacks during the past few years. It serves as a common second-stage payload from Botnets such as QAKBOT (TrojanSpy.Win64.QAKBOT), IcedID (TrojanSpy.Win64.ICEDID), Emotet (TrojanSpy.Win64.EMOTET), and Bumblebee (Trojan.Win64.BUMBLELOADER), among others. Unfortunately, several versions of Cobalt Strike have been leaked over the past couple of years, accelerating its malicious use by cybercriminals.As a result of its popularity compared to Brute Ratel, its detection coverage is greater than that of the latter. This makes Brute Ratel and other less established C&C frameworks an increasingly more attractive option for malicious actors, whose activities may remain undetected for a longer period.Brute Ratel has recently attracted greater interest from threat actors in the cybercriminal underground, where versions of the framework are actively traded and cracked versions circulated. It is unknown how Brute Ratel was initially leaked, but its developers have acknowledged the leak on Twitter.QAKBOT ‘BB’ to Brute RatelThe campaign commences via a SPAM email containing a malicious new URL being sent to potential victims. The URL landing page presents the recipient with a password for a ZIP file.The use of password-protected ZIP files at this stage is likely an attempt to evade analysis by security solutions.The ZIP file contains a single .ISO file. The use of an ISO file is an attempt to defeat the “Mark of the Web (MOTW),” which tags files as being downloaded from the internet. It subjects these files to additional security measures by Windows and endpoint security solutions.The ISO file contains a visible LNK file that uses the “Explorer” icon and two hidden subdirectories, each containing various files and directories. By default, on Windows operating systems, hidden files are not displayed to the user. Figure 5 illustrates what the user sees when the “Show hidden files” setting is enabled.The directory structure is as follows:File NameDescriptionDetection NameSHA-256Accounting#7405.iso Trojan.Win32.QAKBOT.YACIW582a5e2b2652284ebb486bf6a367aaa6bb817c856f08ef54db64c6994c5b91bdContract.lnkLNK FileTrojan.LNK.QAKBOT.YACIWe9e214f7338c6baefd2a76ee66f5fadb0b504718ea3cebc65da7a43a5ff819a4 fodder.txtDecoy text file 4dcf06a5afc699bbb73650cefe4ad86a1b686a257c607e0b96dda85d69544d8a enunciatedNaught.cmdMalicious CMD FileTrojan.BAT.QAKBOT.YACIWd44b05b248f95986211ab3dc2765f1d76683594a174984c8b801bd7eade8aa47eyelid.pngDecoy PNG file dd755395b36acfceaa0d7e9c5479df4b1c919d57837fe43068980c5fa7dd6875 reflectiveness.dbQAKBOT DLLTrojan.Win32.QAKBOT.YACIW01fd6e0c8393a5f4112ea19a26bedffb31d6a01f4d3fe5721ca20f479766208f sharpOutvotes.jsMalicious JS FileTrojan.JS.QAKBOT.YACIW06c4c4d100e9a7c79e2ee8c4ffa1f7ad165a014f5f14f90ddfc730527c564e35 Table 1. The file names, detection names, and hashes for the indicators used in the initial part of the infection routineQAKBOT uses obfuscation across two script files, a JavaScript (.js) file and a Batch Script (.cmd) file, likely in an effort to conceal suspicious-looking command lines.  The C&C Infrastructure is geographically distributed across compromised hosts residing in predominantly residential Internet Service Provider (ISP) broadband networks.The following countries are where the C&C servers reside:These ‘Tier 1’ C&C Servers are considered disposable by the QAKBOT operators and are replaced frequently (nearly every time there is a new distribution of the malware), though some persist across multiple QAKBOT malware configurations.\nAutomated reconnaissance commands\nJust six minutes after the initial C&C communication, and with the QAKBOT malware now running inside an injected process (wermgr.exe),  automated reconnaissance in the infected environment is performed via the execution of multiple built-in command line tools. The execution of these command lines is in the following order:OrderProcessCommand Line1C:\\Windows\\SysWOW64\\net.exenet view2C:\\Windows\\SysWOW64\\ARP.EXEarp -a3C:\\Windows\\SysWOW64\\ipconfig.exeipconfig /all4C:\\Windows\\SysWOW64\\nslookup.exenslookup -querytype=ALL -timeout=12 _ldap._tcp.dc._msdcs.<domain_fqdn>5C:\\Windows\\SysWOW64\\net.exenet share6C:\\Windows\\SysWOW64\\ROUTE.EXEroute print7C:\\Windows\\SysWOW64\\NETSTAT.EXEnetstat -nao8C:\\Windows\\SysWOW64\\net.exenet localgroup9C:\\Windows\\SysWOW64\\whoami.exewhoami /allTable 2. The order of execution for the built-in command linesFive minutes after the automated reconnaissance activities are completed, the QAKBOT-injected wermgr.exe process drops the Brute Ratel DLL and invokes it via a rundll32.exe child process with the “main” export function.The backdoor is a HTTPS , which performs a check-in with the Brute Ratel Server at symantecuptimehost[.]com:POST hxxps://symantecuptimehost[.]com:8080/admin.php?login= HTTP/1.1\n Content-Type: application/json\n User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/90.0.4430.93 Safari/537.36\n Host: symantecuptimehost[.]com:8080\n Content-Length: 122\n Cache-Control: no-cacheFurther reconnaissance is performed in the environment to identify privileged users. First, the built-in net.exe and nltest.exe are used.OrderProcess 1C:\\Windows\\SysWOW64\\net.exenet group \"Domain Admins\" /domain2C:\\Windows\\SysWOW64\\net.exenet group \"Domain Controllers\" /domain3C:\\Windows\\SysWOW64\\nltest.exenltest /domain_trusts /all_trusts4C:\\Windows\\SysWOW64\\net.exenet user <redacted> /domainTable 3. Reconnaissance processes to identify privileged usersSecond, the SharpHound utility is run via Brute Ratel in an injected svchost.exe process to output JSON files that are ingested into BloodHound (that describes the Active Directory Organisational Units, Group Policies, Domains, User Groups, Computers, and Users). The files are then packed into a ZIP file in preparation for exfiltration. The entire process is scripted and takes less than two seconds to complete.\nInterestingly, the actors chose to leverage Cobalt Strike for lateral movement. The first of several beacon files are dropped onto the same infected endpoint running Brute Ratel C4, with the first being:This beacon file is executed on the same host running the Brute Ratel C4 using the following command:The actor drops the other beacon files and copies these to administrative shares on other hosts on the network, again using filenames bearing XLS attachments.The commands used to copy the files are as follows:C:\\WINDOWS\\system32\\cmd.exe /C copy C:\\users\\public\\fksro.xls \n \\\\<HOST>\\C$\\users\\public\\abcabc.xlsThe following list is the beacon C&C Servers:The threat actors were then evicted from the environment before any final actions could be taken. We assess based on the level of access and discovery activity that the likely final actions would have been a domain-wide ransom deployment.QAKBOT ‘Obama’ to Brute Ratel\nIn another, more recent, incident, Trend Micro Research spotted QAKBOT using the “Obama” distributor ID prefix (i.e. “Obama208”) also dropping Brutel Ratel C4 as a second-stage payload.In this case, the malware arrives as a password-protected ZIP file delivered via HTML smuggling, which allows the attacker to “smuggle” an encoded malicious script into an HTML attachment or web page. Once the user opens the HTML page in the browser, the script is decoded and the payload is assembled. Once the ZIP file is decrypted using the password provided in the HTML attachment, the user is presented with an ISO file. The malicious files are contained in the ISO file, which is used as a Mark of the Web bypass. Inside, an ISO file bears the following directory structure:Since QAKBOT’s return, we have observed multiple varieties in the execution chain, from scripting languages to file extensions and the use of export function names and ordinals. For this infection, the following variation was used:The infection plays out with the same TTPs (Tactics, Techniques, and Procedures) described in the first kill chain in this blog. However, one notable difference was observed in the C&C configuration, which used DNS over HTTPS (DoH) vs a more traditional HTTPS C&C Channel.  The C&C servers observed used HTTPS with Let’s-Encrypt.By using DoH, attackers can hide DNS queries from C&C domains. If SSL/TLS traffic is not being inspected using man-in-the-middle (MitM) techniques, DNS queries to the C&C server will therefore go unnoticed. \n Organizations should take note of the trending use of Cobalt Strike in attacks, living-off-the-land binaries (LOLBins), and red team or penetration-testing tools, i.e. Brutel Ratel C4, to blend in with the environment.Users can also protect systems through managed detection and response (MDR), which utilizes advanced artificial intelligence to correlate and prioritize threats, determining if they are part of a larger attack. It can detect threats before they are executed, thus preventing further compromise.Tactic / TechniqueNotesTA0001 Initial AccessT1566.001 Phishing: Spear phishing AttachmentVictims receive spear phishing emails with attached malicious zip files - typically password protected or HTML file. That file contains an ISO file.T1566.001 Phishing: Spear phishing LinkQAKBOT has spread through emails with newly created malicious links.TA0002 ExecutionT1204.001 User Execution: Malicious LinkT1204.002 User Execution: Malicious LinkQAKBOT has gained execution through users opening malicious attachmentsT1569.002 System Services: Service ExecutionT1059.005 Command and Scripting Interpreter: Visual Basic ScriptQAKBOT can use VBS to download and execute malicious filesT1059.007 Command and Scripting Interpreter: JavaScriptQAKBOT abuses Wscript to execute a Jscript file.TA0003 PersistenceT1547.001 Boot or Logon Autostart Execution: Registry Run Keys / Startup FolderQAKBOT can maintain persistence by creating an auto-run Registry keyTA0004 Privilege EscalationT1055 Process InjectionQAKBOT can inject itself into processes like wermgr.exeTA0006 Defense EvasionT1027.006 Obfuscated Files or Information: HTML SmugglingSmuggles a file’s content by hiding malicious payloads inside of seemingly benign HTML files.T1218.010 System Binary Proxy Execution: Regsvr32QAKBOT can use Regsvr32 to execute malicious DLLs\nCobalt Strike can use rundll32.exe to load DLL from the command lineT1140. Deobfuscate/Decode Files or InformationInitial QAKBOT .zip file bypasses some antivirus detections due to password protections.T1562.009. Impair Defenses: Safe Boot ModeBlack Basta uses bcdedit to boot the device in safe mode.TA0007 DiscoveryT1010 Application Window DiscoveryQAKBOT can enumerate windows on a compromised host.T1482 Domain Trust DiscoveryQAKBOT can run nltest /domain_trusts /all_trusts for domain trust discovery.T1135 Network Share DiscoveryQAKBOT can use net share to identify network shares for use in lateral movement.T1069.001 Permission Groups Discovery: Local GroupsQAKBOT can use net localgroup to enable the discovery of local groupsT1057 Process DiscoveryQAKBOT has the ability to check running processesT1018 Remote System DiscoveryQAKBOT can identify remote systems through the net view commandT1082 System Information DiscoveryT1016 System Network Configuration DiscoveryQAKBOT can use net config workstation, arp -a, and ipconfig /all to gather network configuration informationT1049 System Network Connections DiscoveryT1033 System Owner/User DiscoveryQAKBOT can identify the username on a compromised systemTA0008 Lateral MovementT1021 Remote Services: SMB/Windows Admin SharesCobalt Strike can use Window admin shares (C$ and ADMIN$) for lateral movementTA0011 Command and ControlT1071.001 Application Layer Protocol: Web ProtocolsQAKBOT can use HTTP and HTTPS in communication with the C&C servers.T1573. Encrypted ChannelUsed by QAKBOT, BRUTEL and Cobalt StrikeTA0040 ImpactT1486. Data Encrypted for ImpactBlack Basta uses the ChaCha20 algorithm to encrypt files. The ChaCha20 encryption key is then encrypted with a public RSA-4096 key that is included in the executable.T1489. Service StopUses sc stop and taskkill to stop services.T1490. Inhibit System RecoveryBlack Basta deletes Volume Shadow Copies using vssadmin tool.T1491 - DefacementReplaces the desktop wallpaper to display the ransom note.Ian KenefickThreats AnalystLucas SilvaIncident Response AnalystNicole HernandezThreats AnalystTry our services free for 30 daysSelect a country / regionCopyright ©2023 Trend Micro Incorporated. All rights reserved"
   },
   {
      "time": "2022-10-15",
      "title": "What the Uber Breach Verdict Means for CISOs in the US",
      "text": " The government is sending a message to CISOs in the US — disclose and potentially lose your job, or cover up and go to jail. If they disclose information to the government, they meet compliance regulations, but their job will be on the line. A breach, especially one in which personally identifiable information (PII) is compromised, will result in a lawsuit and the CISO will likely get fired. But the punishment for noncompliance, inability to demonstrate full disclosure, or any gray zone in the middle is now personal (unlike other regulations where noncompliance results in fines for the company). Covering up a breach, in the Uber case, and then further hiding details of the hack in the context of a federal investigation, can result in prison time.This case also brings to light a new challenge for CISOs: \"What did you know?\" Concealing information is an important part of this case and verdict. Hiding information by saying \"I didn't know\" isn't an answer for a CISO with a data breach — it reflects negligence at best and is at worst a lie. Security teams need to know — and most likely do know about their security posture, from the many security tools they use — and what they know can't be concealed.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-10-15",
      "title": "Thoma Bravo to Acquire ForgeRock in $2.3B Deal",
      "text": " Private equity firm Thoma Bravo continues its massive multibillion-dollar buying spree in the identity and access management (IAM) space, this time splashing out $2.3 billion in a reportedly all-cash offer for ForgeRock. ForgeRock shareholders will receive $23.25 per share, which represents a premium of about 53.4% to the stock's last closing price on Tuesday. The deal is expected to close in the first half of 2023.Reuters added that the private equity firm has also expressed interest in Darktrace and Nearmap over the past year. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-10-15",
      "title": "‘Critical’ vulnerability found in Siemens industrial tool, allowing theft of cryptographic keys",
      "text": " Siemens has published patches to address a vulnerability in one of its most popular programmable logic controllers, or PLCs – industrial computers used widely in manufacturing and other industries. The bug allows attackers to extract “heavily guarded, hardcoded, global private cryptographic keys” embedded within the Siemens products that can be used by attackers “to perform multiple advanced attacks against Siemens SIMATIC devices and the related TIA Portal, while bypassing all four of its access level protections.”A malicious actor could use this secret information to compromise the entire SIMATIC S7-1200/1500 product line “in an irreparable way,” according to Claroty.“This is Siemens’ most popular programmable logic controller,” Claroty Director of Security Research Sharon Brizinov told The Record. “It’s used in numerous automation tasks worldwide across many industries.”Brizinov recently gave a detailed presentation on the vulnerability’s exploitation. The researchers noted that the information stolen through these kinds of attacks could allow hackers to develop further exploitation tools that would open the door for other attacks and data exfiltration. Siemens urged customers to update their systems and also outlined several workarounds to lessen exposure to the issue. “At the time of the development of the architecture, practical solutions for dynamic key management and key distribution did not exist for industrial control systems. The additional operational effort that key management solutions impose for integrators and customers was not justifiable,” the company said. “Because of these restrictions and the residual risk of the security threat modeling for the architecture, Siemens decided to go with an approach based on fixed key material. As both technology and threat landscape evolved significantly in the past years, this decision needs to be revised and adapted.”Qualys vulnerability signatures manager Saeed Abbasi explained that hardcoded keys “have the power to undermine the security of authentication or encryption processes.” “These types of cryptographic keys are intended to remain secret, and can be utilized for data encryption, integrity protection and identity verification,” Abbasi said. “Siemens SIMATIC is used across many different industries to monitor and control production processes – it essentially acts as an invisible muscle that holds up everything. TLDR: the attacker could take over an entire operation.”Other experts, like Theon Technology’s Bryan Cunningham, said the disclosure was a sober reminder that any encryption-based security architecture is only as secure as the management of the keys on which it is based and can become vulnerable over time. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-15",
      "title": "Tesla Pi Phone Price, Release Date, All the Rumors",
      "text": " Elon Musk’s Tesla is rumored to make its debut in the smartphone market with its own mobile device – the Tesla Pi Phone – to take on the likes of Apple and Samsung.However, in a recent trend, Musk has recently rebranded Twitter to X and has started an AI company xAI. Not to forget mentioning Space X which is owned by Musk too.This suggests if any phone is launched by Musk then it can also be named Xphone or PhoneX or anything That can have the letter X added to it.Previously Musk has replied to a few tweets on Twitter stating that he may launch an alternate phone soon to take on Apple and Google’s monopoly.While much is not known about the phone. Rumors and alleged leaks suggest that the phone may be announced soon followed by a release date.Table Of ContentsAccording to speculations, the upcoming Tesla Pi Phone or P Phone can be powered using Tesla OS AND AI.It is expected to feature a 6.7 inch OLED display with a 1284 x 2778 pixel screen resolution, 120HZ refresh rate, pixel density of 458ppi, and brightness level of around 1600 nits.It will have an oleophobic coating and scratch-resistant glass for added protection.Further, Tesla’s Pi Phone will be powered by its own GPU, the Tesla GPU. It will come with 8/16GB of RAM and 512GB- 1 TB of internal storage.It would measure 156.8 x 72.1 x 7.6 and weigh about 240 grams and will be powered by a 5,000 mAH battery.On the camera front, the Pi Phone would have a triple camera setup on the rear with a resolution of 50MP each, while the selfie camera will be 40MP with high image quality.Other features include dual-pixel PDAF, dual-LED dual-tone flash, HDR (photo/panorama), ProRes, Cinematic mode, and stereo sound recording.These characteristics are also included in rear cameras. It also supports Wi-Fi 802.11, Bluetooth V 5.2, Gyro-EIS, GPS with A-GPS and GLONASS, A2DP, and LE.Tesla Pi Phone will support 5G and will come with Starlink-based Internet connectivity.Moreover, the phone will have several connectivity support for Tesla cars to control the vehicle.Tesla’s Pi Phone will be available in premium black color.Although there is no information about the price of the Tesla Pi Phone it is expected to be priced around 1500-2000 USD.The smartphone is expected to be likely revealed in December 2023.Rumors suggest that Tesla Phones will come with solar power-based charging options and cryptocurrency mining tools inbuilt which doesn’t seems feasible for now."
   },
   {
      "time": "2022-10-15",
      "title": "TOAD attacks: Vishing combined with Android banking malware now targeting Italian banks",
      "text": " 12 October 2022During one of our latest investigations, ThreatFabric’s analysts uncovered a network of phishing websites targeting Italian online-banking users and aiming to steal their banking credentials. Further research defined a connection between this network and the Android banking Trojan dubbed Copybara, that is involved in telephone-oriented attack delivery performed by the threat actors. Latest version of it introduced unique feature that allows to build and show dynamic fake forms on the fly. With the increase in popularity of voice phishing (vishing) attacks, where criminals coach victims into installing Android banking malware, we are entering a new era of hybrid fraud attacks. Despite the popularity of this technique, and the clear trend based on campaigns discovered, vishing used as malware distribution tactic is currently not covered by MITRE mobile matrix.The campaign discovered by our analysts is targeting multiple Italian banks and their customers. It involves multiple phishing sites impersonating several Italian financial services and anti-fraud offices, as it can be seen on the following screenshots:To maintain and manage the large number of phishing pages used in these campaigns, the threat actor(s) used several phishing kits that are quite well-known in the underground scene. Such kits allow to easily create the phishing page, automatically register phishing domain names and create a short link for it to be used in distribution. Besides, they also provide a panel that allows to maintain all created websites and monitor their activity. Such panel is also provided as a service by one of the cybercriminal groups on the underground forum.All phishing sites seen in the campaign request similar set of personal data: account number, PIN code, telephone number. Our team noticed that, in some cases, cybercriminals request victims to choose secret questions and answers that were set during the registration process with the bank as second factor of authentication. Obviously, collecting this data can help cybercriminals to get access to victim’s banking accounts.After submitting the data, victims are notified that a support operator will contact them soon (using the previously collected phone number). At this point, the next step of the campaign takes place: the installation of Android banking Trojan, with the help of the operator, as part of telephone-oriented attack delivery (TOAD). The threat actor calls victims and gives instructions to install the necessary “security” app on victim’s device.Telephone-oriented attack delivery threats involve direct call between cybercriminals (e.g., malicious call center) and a victim. During this call, the victim is being convinced and instructed to install some additional software on his/her devices in order for threat actor to be able to perform some further fraud. The installed software can be legitimate remote access tools that are used by cybercriminals to have a remote control over victim’s device.However, in some cases the victim is instructed to download and install some specific malicious software developed or maintained by threat actors. This is the case for the campaign discovered by ThreatFabric analysts, which involves both phishing sites and subsequent TOAD with installation of Copybara Android banking Trojan.As an entry point for cybercriminals, the victim is asked to install a downloader app that will download the actual payload. The payload then is installed as an update for the downloader, substituting it.Our research also reveals the name of the threat used by the TAs: Joker. Coincidentally, this name is also used by another Android malware family, usually distributed through Google Play, and which specializes in personal information stealing and Subscription services fraud. ThreatFabric can confirm that there is no connection with this malware family and the one discussed in this blogpost, distributed via TOAD. To avoid confusion, we will refer to this new malware family with the initial name that we assigned to it upon discovery, which is Copybara.First samples of Copybara seen by ThreatFabric date back to November, 2021. Despite the fact that it was referred as BRATA by other researchers, TF analysts were able to clearly define it as a separate family, despite using the same framework for development. The name “Copybara” was given by our malware analysts is reference to TAs development process: Copybara’s code has a lot of parts directly copied and pasted from other publicly available modules. Sometimes (like for example with Copybara’s downloader) the code is taken as-is with minor changes in variables.However, such approach does not directly imply the weakness of the malware. Despite the code being messy and full of non-active sections, the TAs managed to equip the Trojan with remote access capability, which tries to masquerade itself as security udpate, while the criminals are performing actions on the infected device “behind the curtains”. While the TA is connected to infected device, Copybara shows a fake overlay that is semi-transparent to cover the actions of the cyber criminals.It allows actors to stay low and not drag attention of the victim while performing fraudulent actions within the banking applications, using data previously stolen with phishing. Copybara’s RAT capabilities are powered by abusing the AccessibilityService: the C2 server sends a specific command/action to perform and Copybara handles it with the help of its Accessibility engine. TAs can open arbitrary apps, install additional ones, perform clicks and swipes, enter text to the text fields, etc.TF received reports that TA’s use Copybara’s ability to uninstall packages in order to remove the original banking app to leave the detection window as small as possible.Another quite unique feature recently introduced by authors is the ability to dynamically build fake input forms and show it to victims. Actors are able to specify arbitrary input fields, text labels, check boxes and collect even more data from victims. At the moment these forms are quite simplistic, but the dynamic approach allows TAs to use full power of Android OS to build genuine-looking screens on-the-fly.The full list of supported commands of Copybara is provided below.Further investigation of the infrastructure utilized by the threat actor(s) reveals certain interesting ties to other Trojans. One of the campaigns involved SMS stealing Trojan. This piece of malware is quite simple in its capabilities, only allowing the actors to get control over incoming messages: all the incoming SMS messages are uploaded to TAs server, thus allowing the TA to perform so-called “new device registration” fraud and log in with other channel (e.g. web) and intercept all OTPs sent by bank to validate login and further transactions.Telephone-oriented attack delivery (TOAD) cases are becoming a trend on the current mobile threat landscape. Personal approach powered with social engineering techniques allow cybercriminals to trick unsuspicious victims and obtain installations of their Trojans with high likelyhood of success. Moreover, most of the cases end up installing some legitimate remote access tools that are not flagged/detected by antivirus engines.We believe that such complicated cases involving threat actor - victim interaction should not be approached in a conventional, traditional way. Behaviour analytics powered by strong Threat Intelligence is a way to cope with such fraudulent activity as it provides additional indicators to detect suspicious activity.ThreatFabric’s Fraud Risk Suite enables safe & frictionless online customer journeys by integrating industry-leading mobile threat intel, behavioural analytics, advanced device fingerprinting and over 10.000 adaptive fraud indicators. This will give you and your customers peace of mind in an age of ever-changing fraud."
   },
   {
      "time": "2022-10-15",
      "title": "Timing Attacks Can Be Used to Check for Existence of Private NPM Packages - SecurityWeek",
      "text": " Hi, what are you looking for?Container and cloud-native application security provider Aqua Security warns that the existence of private NPM packages can be disclosed by performing timing attacks.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...SecurityWeek talks to Billy Spears, CISO at Teradata (a multi-cloud analytics provider), and Lea Kissner, CISO at cloud security firm Lacework.Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-15",
      "title": "Microsoft Accidentally Reveals The Design Prototype Of Windows 12",
      "text": " The company is also rumored to be returning to the traditional three-year release cycle for major versions of the Windows client with Windows 12.During its recent online Ignite 2022 conference, Microsoft gave us a sneak peek at the next generation of Windows version, Windows 12, although accidentally.The Redmond giant happened to reveal a UI (user interface) design prototype for Windows 12 when it had put up an image of a Windows desktop running Microsoft Teams. The next version is known internally as “Next Valley”.Zac Bowden of Windows Central too confirmed that it was indeed a prototype of Windows 12. According to him, the screenshot from the Ignite 2022 conference was an updated version of the Windows UI and not the preliminary design ideas that were exhibited internally at Microsoft a few months ago.The image below is a manually recreated replica of what the prototype should look like by Bowden, as the screenshot shown during the keynote was fairly low-resolution: As one can see, there is a floating taskbar with rounder corners at the bottom of the screen. At the top right corner of the desktop, one can notice there are system icons for the Wi-Fi and battery power indicator.Also, there is a search bar at the top center as well as the weather widget in the top left corner.Other updates that Microsoft has planned for the next operating system include a new lock/login screen, a notification center, and much more.According to Bowden’s sources, the prototype shown during the Ignite 2022 event is probably just one of the design goals that Microsoft is working on for the upcoming Windows OS.Since the next version of Windows OS is expected to ship only in 2024, we can expect many more design changes and improvements to take place before the final version is made public to everyone. Stay tuned for more updates!"
   },
   {
      "time": "2022-10-15",
      "title": "DataGrail Raises $45 Million for Data Privacy Platform - SecurityWeek",
      "text": " Hi, what are you looking for?Data privacy platform DataGrail this week announced that it has raised $45 million in a Series C funding round that brings the total raised by the company to $84.2 million.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.SecurityWeek investigates how political/economic conditions will affect venture capital funding for cybersecurity firms during 2023.SecurityWeek spoke with more than 300 cybersecurity experts to see what is bubbling beneath the surface, and examine how those evolving threats will present...Joanna Burkey, CISO at HP, and Kevin Cross, CISO at Dell, discuss how the role of a CISO is different for a multinational corporation...The CRYSTALS-Kyber public-key encryption and key encapsulation mechanism recommended by NIST for post-quantum cryptography has been broken using AI combined with side channel attacks.In this issue of CISO Conversations we talk to two CISOs about solving the CISO/CIO conflict by combining the roles under one person.Security professionals understand the need for resilience in their company’s security posture, but often fail to build their own psychological resilience to stress.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   }
]