[
   {
      "time": "2022-11-29",
      "title": "Acer fixes UEFI bugs that can be used to disable Secure Boot",
      "text": " Acer has fixed a high-severity vulnerability affecting multiple laptop models that could enable local attackers to deactivate UEFI Secure Boot on targeted systems.The Secure Boot security feature blocks untrusted operating systems bootloaders on computers with a Trusted Platform Module (TPM) chip and Unified Extensible Firmware Interface (UEFI) firmware to prevent malicious code like rootkits and bootkits from loading during the startup process.Attackers with high privileges can abuse it in low-complexity attacks that require no user interaction to alter UEFI Secure Boot settings by modifying the BootOrderSecureBootDisable NVRAM variable to disable Secure Boot.After exploiting the vulnerability on affected Acer laptops and turning off Secure Boot, threat actors can hijack the OS loading process and load unsigned bootloaders to bypass or disable protections and deploy malicious payloads with system privileges.The complete list of impacted Acer laptop models includes Acer Aspire A315-22, A115-21, A315-22G, Extensa EX215-21, and EX215-21G.\"Acer recommends updating your BIOS to the latest version to resolve this issue. This update will be included as a critical Windows update,\" the company added.Allowing threat actors to run unsigned, malicious code before OS boot can lead to severe consequences, including the deployment of malware that can persist between OS re-installations and bypassing anti-malware protections provided by security solutions.In the case of Lenovo, the issue was caused by the company's developers including an early development driver in production drivers that could change secure boot settings from the OS."
   },
   {
      "time": "2022-11-29",
      "title": "Malicious Android app found powering account creation service",
      "text": " ​A fake Android SMS application, with 100,000 downloads on the Google Play store, has been discovered to secretly act as an SMS relay for an account creation service for sites like Microsoft, Google, Instagram, Telegram, and Facebook.A researcher says the infected devices are then rented out as \"virtual numbers\" for relaying a one-time passcode used to verify a user while creating new accounts.While the app has an overall rating of 3.4, many user reviews complain that it is fake, hijacks their phones, and generates multiple OTPs (one-time passwords) upon installation.\"Fake app I just download this app 4-5 times of OTP by Google, Airtel payment, Bank OTP, dream11 OTP, etc. Type of OTP comes at the time of login,\" reads one of the reviews.Symoo was discovered by Evina's security researcher Maxime Ingrao, who reported it to Google but has yet to hear back from the Android team. At the time of writing, the app remains available on Google Play.BleepingComputer has also contacted Google about Symoo, and we will update this story as soon as we receive a response.Upon installation on the device, the app requests access to send and read SMS, which sounds normal since Symoo markets itself as an \"easy to use\" SMS app.On the first screen, it asks the user to provide their phone number; after that, it overlays a fake loading screen that supposedly shows the progress of loading resources.However, this process is prolonged, allowing the remote operators to send multiple 2FA (two-factor authentication) SMS texts for creating accounts on various services, read their content, and forward it back to the operators.When completed, the app will freeze, never reaching the promised SMS interface, so users will typically uninstall it.By this time, the app will have already used the Android users' phone numbers to generate fake accounts on various online platforms, and reviewers say that their messages are now filled with one-time passcodes for accounts they never created.Since phone numbers are often the only possible way to verify accounts, people who want to engage in illegal or anonymous activities find these pseudonymous accounts useful.Additionally, Maxime Ingrao discovered that the Symoo app exfiltrates SMS data to a domain used by another application, 'Virtual Number,' that was also on Google Play at some point but has since been removed.The developer of the 'Virtual Number' app also created another app on Google Play called 'ActivationPW – Virtual numbers,' downloaded 10,000 times, which offers \"Online numbers from more than 200 countries\" that you can use to create an account.Using this app, users can \"rent\" a number for less than 50 cents and, in many cases, use that number to verify the account.While it is unconfirmed, it is believed that the Symoo app is used to receive and forward OTP verification codes generated when people create accounts using ActivationPW.If you are using these apps, you should uninstall them, if nothing else, because they copy your SMS content to their own servers.Their privacy policy also discloses this behavior, though they say it is to \"spam block and back up services.\"Update 11/30/2022 - A Google spokesperson has sent BleepingComputer the following comment:The apps identified - Symoo (com.vanjan.sms) and ActivationPW (com.programmatics.activation) - have been removed from Google Play and the developer has been banned."
   },
   {
      "time": "2022-11-29",
      "title": "Global Cyber-Enforcement Op Nets $130M, Says Interpol",
      "text": " A wide-ranging international operation by law enforcement agencies in 30 countries aiming to prosecute online fraudsters has resulted in nearly a thousand arrests and a net of $130 million in seized virtual assets.Interpol's National Central Bureaus (NCBs) collaborated with local authorities to pursue arrests. Interpol announced that the linked investigations, dubbed Operation Haechi III, tracked cyber-enabled financial crimes and money laundering in 30 countries. The investigations, which took place between June 28 and Nov. 23, intercepted money transfers and virtual assets, leading to the arrest of 975 suspects in the last five months.The ability to recover funds quickly will cut into cybercriminal profits, an important deterrence, says Ed Cabrera, chief cybersecurity officer at endpoint security firm Trend Micro.“Illicit financial transactions are the lifeline of all cyber-enabled crimes,\" he says. \"Having the capability to quickly track, seize and return illicit funds to their victims not only can it make victims whole, but it is an incredibly disruptive tool for law enforcement.\"The effectiveness of the effort highlights the need for cross-border collaboration, Hyung Se Lee, the head of Interpol's National Central Bureau in Seoul, said in a statement announcing the operation.\"As we look to the future, we recognize the importance for decisive and concerted law enforcement action across borders,\" he said, noting that the ongoing operation shows the international community's \"dedicated coordination and the strong commitment of participating countries.\"A year ago, Interpol announced the arrests of 1,003 people and the seizure of $27 million during Operation Haechi II, the second program in a three-year initiative aimed at curtailing specific types of online fraud, such as online financial crime trends, impersonation scams, romance frauds, sextortion, and investment fraud.Many of the cybercriminal groups exchanged information and cryptocurrency over encrypted chat messaging applications, the investigation found. Among the countries that cooperated in the Haechi III operation are Australia, France, Hong Kong (China), India, Indonesia, Ireland, Japan, Korea, Kyrgyzstan, Laos, Philippines, Poland, Singapore, Spain, Thailand, the United Arab Emirates, the United Kingdom, and the United States.In addition to national government, Interpol credited private-sector partners with helping out, including British Telecom, the Cyber Defense Institute, Fortinet’s FortiGuard Labs, Group-IB, Kaspersky, Palo Alto Networks' Unit 42 team, Shadowserver, and Trend Micro.As part of its fight against cybercriminals and their financial pipelines, Interpol announced a new tool last year known as the Anti-Money Laundering Rapid Response Protocol (ARRP), which establishes a procedure for quickly stopping criminals' theft of funds — and reversing transactions — before they have completed.Under ARRP, cooperation channels between Interpol bureaus can be used to freeze the transfer of funds and intercept money before it makes its way into criminals' accounts. Often all, or the vast majority of, funds can be completely recovered.\"Intercepting the illicit proceeds of online financial crimes before they disappear into the pockets of money mules is a race against time,\" Jorge Luis Vargas Valencia, director general of the Colombian National Police, stated in last year's announcement, noting that \"the high level of complexity of coordination with law enforcement units and banking institutions on the other side of the world\" has traditionally made such efforts difficult.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-11-29",
      "title": "TikTok ‘Invisible Body’ challenge exploited to push malware",
      "text": " Hackers are capitalizing on a trending TikTok challenge named 'Invisible Challenge' to install malware on thousands of devices and steal their passwords, Discord accounts, and, potentially, cryptocurrency wallets.A new and trending TikTok challenge requires you to film yourself naked while using TikTok's \"Invisible Body\" filter, which removes the body from the video and replaces it with a blurry background.This challenge has led to people posting videos of them allegedly naked but obscured by the filter. To capitalize on this, threat actors are creating TikTok videos that claim to offer a special \"unfiltering\" filter to remove TikTok's body masking effect and expose the TikTokers' nude bodies.These videos received over a million views shortly after being posted, with one of the threat actor's Discord servers amassing over 30,000 members.In a new report by cybersecurity firm Checkmarx, researchers found two TikTok videos posted by the attackers that quickly amassed over a million views combined.The now-suspended TikTok users @learncyber and @kodibtc created the videos to promote a software app to \"remove filter invisible body\" offered on a Discord server named \"Space Unfilter.\"The threat actors have since moved this Discord server, but Checkmarx states that they had approximately 32,000 members at one point.Once the victims join the Discord server, they see a link posted by a bot pointing to a GitHub repository that hosts the malware.This attack has been so successful that the malicious repository has achieved a \"trending GitHub project\" status, and while it has since been renamed, it currently has 103 stars and 18 forks.The project files contained a Windows batch file (.bat) that, when executed, installs a malicious Python package (WASP downloader) and a ReadMe file that links to a YouTube video containing instructions on installing the TikTok \"unfilter\" tool.Checkmarx analysts discovered that the attackers used multiple Python packages hosted on PyPI, including \"tiktok-filter-api\", \"pyshftuler\", \"pyiopcs,\" and \"pydesings,\" with new ones added every time the old packages are reported and removed.Also, the attackers use the \"StarJacking\" technique on PyPI, linking their project to a popular GitHub project they have no association with to make it appear legitimate.The malicious package copies the original code but contains a modification for installing WASP malware on the host.\"These attacks demonstrate again that cyber attackers have started to focus their attention on the open-source package ecosystem; We believe this trend will only accelerate in 2023.\"At the time of writing this, the GitHub repository used by the attacker is still up, but the \"TikTok unfilter\" packages have been replaced by \"Nitro generator\" files.The Discord server \"Unfilter Space\" was taken offline, with the threat actors claiming to have moved to another server."
   },
   {
      "time": "2022-11-29",
      "title": "Hack-for-Hire Group Targets Android Users With Malicious VPN Apps - SecurityWeek",
      "text": " Hi, what are you looking for?A hack-for-hire group known as Bahamut has been targeting Android users with trojanized versions of legitimate VPN applications, ESET reports.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.WASHINGTON - Cyberattacks are the most serious threat facing the United States, even more so than terrorism, according to American defense experts. Almost half...Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-11-29",
      "title": "Meta fined €265M for not protecting Facebook users' data from scrapers",
      "text": " Meta has been fined €265 million ($275.5 million) by the Irish data protection commission (DPC) for a massive 2021 Facebook data leak exposing the information of hundreds of million users worldwide.The exposed data included personal information, such as mobile numbers, Facebook IDs, names, genders, locations, relationship statuses, occupations, dates of birth, and email addresses. All of this data was shared on a well-known hacking forum, allowing the data to be used by threat actors for targeted attacks.Facebook at the time said threat actors collected the data by exploiting a flaw in its \"Contact Importer\" tool to associate phone numbers with a Facebook ID and then scraping the rest of the information to build a profile for the user.The platform said they had fixed the bug in 2019, and the data was collected before that.DPC's investigation concluded that Meta (then Facebook) infringed Articles 25(1) and 25(2) of the GDPR, summarized as follows:“Those supervisory authorities agreed with the decision of the DPC.”Data scrapers are automated bots that exploit open network APIs of platforms that hold user data, like Facebook, to extract publicly available information and create massive databases of user profiles.While no hacking is involved, the data sets collected by scrapers can be combined with data from multiple points (sites), creating complete profiles on users, hence making their tracking from marketers or targeting from threat actors a lot more effective.However, in Meta's case, the threat actors used a flaw in the Contact Importer on Facebook and Instagram to link phone numbers with this publicly scraped information, allowing them to create profiles containing private and public information.The DPC is considered the spearhead of GDPR compliance in the EU due to many tech companies operating from Ireland, so its decision is bound to create turbulence for other big data controllers, forcing them to re-evaluate their anti-scraping mechanisms."
   },
   {
      "time": "2022-11-29",
      "title": "Canadian food giant refuses to pay ransom after gang threatens data leak",
      "text": " Canadian food giant Maple Leaf Foods said it has refused to pay a ransom after suffering a ransomware attack earlier this month.“Unfortunately, we know that the people behind this incident were able to gain unauthorized access to some of our data, and they are threatening to release it unless we pay a ransom, which we will not do,” a spokesperson told The Record. “We’re sorry this occurred and apologize for the frustration and challenges it may cause. We have invested significant resources into the security of our systems and take the confidentiality and security of the information in our possession very seriously.”  The company said it is providing employees affected by the incident with two years of credit monitoring servicesThe spokesperson said they are “asking responsible people… not to entertain any ‘leads’ they get from stolen or compromised data and not to contact anyone based on illegally obtained information.”In its previous statement on November 6, the company said it hired a cybersecurity firm and recovery experts to help with the response. They said they were working with all customers and suppliers to “minimize these disruptions in order to continue delivering the nutritious food people need.”On Thursday, the Black Basta ransomware group took credit for the attack, posting the company on its leak site and sharing troves of stolen business information that included contracts and invoices. The ransomware emerged in April and quickly racked up more than 90 attacks on organizations by September. “The rapidity and volume of attacks prove that the actors behind Black Basta are well-organized and well-resourced, and yet there has been no indications of Black Basta attempting to recruit affiliates or advertising as a RaaS on the usual darknet forums or crimeware marketplaces,” the researchers said. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-29",
      "title": "Over a Dozen New BMC Firmware Flaws Expose OT and IoT Devices to Remote Attacks",
      "text": " All the issues affect version 1.10.0 of the standard firmware, with the exception of CVE-2021-4228, which impacts version 1.00.0. Four of the flaws (from CVE-2021-26727 to CVE-2021-26730) are rated 10 out of 10 on the CVSS scoring system.In particular, the industrial security company found that CVE-2021-44467, an access control bug in the web interface, could be chained with CVE-2021-26728, a buffer overflow flaw, to achieve remote code execution on the BMC with root privileges.Lanner has since released an updated firmware that addresses the vulnerabilities in question following responsible disclosure.\"BMCs represent an attractive way to conveniently monitor and manage computer systems without requiring physical access, in the IT as well as in the OT/IoT domain,\" the researchers said.\"Nevertheless, their usability comes at the expense of a broader attack surface, and that may lead to an increase of the overall risk if they are not adequately protected.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]