[
   {
      "time": "2022-10-14",
      "title": "Crypto trading platform Mango Markets drained of more than $100 million in flash loan attack",
      "text": " Flash loan attacks involve hackers borrowing funds that do not require collateral, buying a significant amount of a cryptocurrency to artificially raise its price and then offloading the coins. The loan is paid back and the borrower keeps any profit.The company said it was disabling deposits and asking third parties to freeze the stolen funds. It also offered the hacker a bug bounty for the return of the funds. By manipulating the price of the coin, the hacker was able to borrow and withdraw Bitcoin, several U.S. dollar-pegged stablecoins and more cryptocurrency from Mango’s platform. “The net value extracted by the account was around $100 million equivalent at the time,” the company wrote.Ronghui Gu, CEO of blockchain security company CertiK and a Columbia University professor, told The Record that during the flash loan attack Mango’s token grew in price from $0.038 to a peak of $0.91, allowing the hacker to borrow heavily against it. After the coin reached its peak, more than 2000% higher than before, Gu said the attacker used previously purchased MNGO coins as collateral to borrow more than $54 million in USDC; more than $25 million in mSOL; approximately $23 million in SOL; and $5 million in Bitcoin, among other cryptocurrencies. Customers on the platform are not able to withdraw any assets because the hack “effectively resulted in a total draining of all equity available,” leaving the platform insolvent, Gu said.The hacker allegedly contacted Mango Markets and expressed a “willingness to negotiate,” according to the company. “We believe the most constructive way to approach this is to continue communicating with those responsible for the incident and in control of the funds removed from the protocol to attempt to resolve the issues amicably,” they said. “The vulnerability here stemmed from the thin liquidity on the MNGO/USDC market, which was used as the price reference for the MNGO perpetual swap. With only a few million USDC at their disposal, the attacker was able to pump the price of MNGO,” he explained.They proposed returning much of the stolen funds, repaying users who lost out and getting a bug bounty through Mango’s insurance fund. “By voting for this proposal, mango token holders agree to pay this bounty and pay off the bad debt with the treasury, and waive any potential claims against accounts with bad debt, and will not pursue any criminal investigations or freezing of funds once the tokens are sent back as described above,\" the hacker said. Gu said that the account appears to be genuine and linked to the stolen funds. “It remains to be seen how Mango’s governance will react to this offer, and whether the insurance fund will come into play to cover some of the losses,” Gu said. Mango did not respond to requests for comment about the proposal and whether they agree with what is being offered. The attack on Mango is the latest in a string of $100 million cryptocurrency hacks to take place this year. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-14",
      "title": "Georgia State Bar says SSNs of members, employees may have leaked in April ransomware attack",
      "text": " The State Bar is authorized by the Supreme Court of Georgia to hold ethics investigations into the state’s lawyers and sanction those who violate state rules. The organization also provides guidance and assistance to lawyers in the state as well as a directory of attorneys.For more than a week, officials with the State Bar of Georgia responded to a cyberattack that crippled the organization’s network, website and email system. The State Bar’s website carried only a single page of information for members about the attack for days in April and May. Several companies were hired to help with the response, including the organization’s cybersecurity insurance broker Greyling, cybersecurity company Athens Micro, law firm Baker Hostetler and others. Kivu was hired to conduct an investigation of the incident. The information came from current and former employees as well as some members of the State Bar, which has more than 53,000 members.The organization did not respond to requests for comment about how many people had their information leaked and the nature of the attack. Elmore said the attack was first noticed on April 28 when the head of their information systems department heard a beeping sound indicating that servers were restarting “despite not having received a restart command.”As the official began disconnecting devices, screens went black. In total, 17 State Bar servers and 15 workstations were encrypted with the BitLocker ransomware.“Although this has been officially described as a ransomware attack, no monetary demand has been made and no proof of possession of any personally identifiable information (“PII”) or other data has been provided,” Elmore said. “We have been advised that the threat actor behind this is on the specially designated nationals and blocked persons ('SDN') list. That means that even if a monetary demand is made, and proof of personal or sensitive data provided, a ransom payment cannot be made.”The State Bar of Georgia recently learned of unauthorized access to its network. Upon learning of the unauthorized access, we immediately took steps to secure the network, a cybersecurity firm was engaged and a thorough investigation is being conducted.Elmore warned that evidence indicates that there is the “potential for a continued presence” by the hackers in the organization’s network. But the organization did say it was taking steps to build an entirely new network environment as a way to address this issue. The incident response company Kivu kept in contact with the hackers for “intelligence and/or stalling purposes” as the organization rebuilt its systems. Elmore claimed that through communicating with the hacker, Kivu believes the group “cannot identify which of its victims it is dealing with.” Kivu and law firm Baker Hostetler said they could not gather intelligence “without providing the threat actor with the identity of the State Bar as the victim.” At the time, Elmore said “Once sufficient decryption and access are achieved, Kivu will be instructed to terminate communications with the threat actor.”Emsisoft threat analyst and ransomware expert Brett Callow said BitLocker is not particularly common but a number of threat actors have used it in the past. “It's problematic for multiple reasons, which is why it's not more commonly used,” he said.“It's slow, decryption at scale is impossible, the encryption key for all systems is revealed if one system fails to encrypt or reboot, etc.”The State Bar is offering people who had their information leaked free credit monitoring and identity protection services through Transunion, but did not respond to requests for clarification about how long the services would be offered.Correction (10/14): A previous version of this story stated that the State Bar of Georgia disclosed that certain information had leaked. The State Bar told The Record that they could not rule out with complete certainty whether or not information had been accessed.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-14",
      "title": "CommonSpirit confirms ransomware attack as U.S. hospitals deal with fallout",
      "text": " A spokesperson for the organization told The Record that after the ransomware attack was discovered, CommonSpirit staffers contacted law enforcement and hired cybersecurity specialists to deal with the response and contain the incident. Last week, CommonSpirit Health announced that it was “managing an IT security issue” impacting several electronic health record systems across the country. Several facilities among the organization's more than 1,000 care sites and 140 hospitals in 21 states reported widespread outages and issues with computer systems. Patient history is difficult to access for several facilities and pharmacies are reportedly unable to verify orders or print official labels. Some hospitals now have to use fax machines to share prescriptions. Employees are getting more information about the incident from the media than from CommonSpirit, according to the post.But on Wednesday, CommonSpirit Health defended its response to the attack, claiming that patients at their hospitals “continue to receive the highest quality of care” and that they have been providing “relevant” updates on the situation to patients, employees and others. “Patient care remains our utmost priority and we apologize for any inconvenience this matter has created. Our facilities are following existing protocols for system outages, which includes taking certain systems offline, such as electronic health records,” the organization said. “In addition, we are taking steps to mitigate the disruption and maintain continuity of care. To further assist and support our team in the investigation and response process, we engaged leading cybersecurity specialists and notified law enforcement. We are conducting a thorough forensics investigation as we restore full functionality and reconnect our systems. Central to our decision-making has been and will continue to be our ability to carry out our mission in a manner that is safe and effective to those we serve.”The Chicago-based organization did not respond to several questions about the number of facilities affected, a timeline for recovery and whether a ransom has been demanded or paid. “For the other parts of our health system that have seen impacts on operations, we are working diligently every day to bring systems online and restore full functionality as quickly and safely as possible,” the statement said. Several local news outlets across the U.S. reported on hospitals in their area facing issues due to the outage. “The charge nurse expressed two times that they feel like they’re drowning because they had over 45 patients in the waiting room and only five nurses,\" Central Kitsap Fire and Rescue Chief Jay Christian told the Kitsap Sun. \"She said, ‘We’re in dire straits, we need the fire department help, can somebody come up here and help us?’”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-14",
      "title": "New npm timing attack could lead to supply chain attacks",
      "text": " Security researchers have discovered an npm timing attack that reveals the names of private packages so threat actors can release malicious clones publicly to trick developers into using them instead.The attack relies on a small time difference in the return of a \"404 Not Found\" error when searching for a private compared to a non-existent package in the repository.While the response time difference is only a few hundred milliseconds, it is enough to determine whether a private package exists to perform package impersonation attacks.In a report by Aqua Security's threat research team, who shared its findings with BleepingComputer before publication, attackers are increasingly focusing on supply chain attacks, fueling a rise of 300% in associated activities in 2021.When using the npm registry to download a package that does not exist or is set to private, the website will return a 404 HTTP error code, indicating that the package could not be found.The researchers performed their test by checking for the existence of a package name five times. They discovered there is a measurable difference in the average time required for npm to respond to the request, allowing them to discern whether a package is private or non-existent.More specifically, the average response time when the private package exists is 648 milliseconds, while the average time when it doesn't exist drops to just 101 milliseconds.The researchers assume this is due to the caching mechanism and the architecture of npm's API, which introduces this information-disclosure potential.A hacker can try out a \"blind\" dictionary attack or look for naming patterns and combinations in the targeted organization's public packages to derive possible private package names.Additionally, online information contains historic package information, so the attackers could use them to determine what public packages may have been turned private later.In the latter case, a potential compromise with a clone package could be very stealthy, as an old copy of a package that used to be public may still retain enough functionality to work as intended in the software product that uses it.Aqua Security disclosed the bug to GitHub on March 8th, 2022, but was told on March 25th that it would not be fixed due to architectural limitations.\"Because of these architectural limitations, we cannot prevent timing attacks from determining whether a specific private package exists on npm,\" GitHub told Aqua Security.The researchers say that organizations can take preventive action by frequently searching npm for suspicious packages that spoof their private packages with duplicate or similar names.Additionally, organizations can create public packages that spoof their private packages as placeholders since npm doesn't allow uploading same-name packages on public repositories."
   },
   {
      "time": "2022-10-14",
      "title": "Aruba fixes critical RCE and auth bypass flaws in EdgeConnect",
      "text": " Aruba has released security updates for the EdgeConnect Enterprise Orchestrator, addressing multiple critical severity vulnerabilities that enable remote attackers to compromise the host.Aruba EdgeConnect Orchestrator is a widely used WAN management solution, offering enterprise users optimization, administration, automation, and real-time visibility and monitoring features.Critical and easily exploitable flaws in this product introduce risks for systems and networks, so applying the available security updates should be a priority for administrators.The vulnerabilities fixed in the latest Aruba patch are the following:CVE-2022-37913 and CVE-2022-37914 (CVSS v3.1 – 9.8): Authentication bypass flaw in the web-based management interface of EdgeConnect Orchestrator, allowing an unauthenticated, remote attacker to bypass authentication.Successful exploitation of this flaw leads to an attacker elevating their privileges to administrator without credentials, opening the path to complete host compromise.CVE-2022-37915 (CVSS v3.1 – 9.8): Flaw in the web-based management interface of EdgeConnect Orchestrator, allowing arbitrary command execution on the underlying host and leading to complete system compromise.The versions that address the severe security issues are the following:Older versions aren't supported by the vendor and will not receive a security update for the above vulnerabilities. Hence, users of older versions are advised to upgrade to a newer product release as soon as possible.Aruba has noted that, as of today, it has not detected active exploitation of the mentioned flaws and has seen no discussions or proof of concept exploits that target the vulnerabilities.However, considering the criticality of the flaws and broad deployment of EdgeConnect in valuable environments, it's safe to suggest that attackers will attempt to create exploits for the vulnerabilities."
   },
   {
      "time": "2022-10-14",
      "title": "Unofficial WhatsApp Android app caught stealing users’ accounts",
      "text": " A new version of an unofficial WhatsApp Android application named 'YoWhatsApp' has been found stealing access keys for users' accounts.YoWhatsApp is a fully working messenger app that uses the same permissions as the standard WhatsApp app and is promoted through advertisements on popular Android applications like Snaptube and Vidmate.The app includes additional features over the regular WhatsApp, such as the ability to customize the interface or block access to chats, making it enticing for users to install. However, it has now been discovered that YoWhatsApp v2.22.11.75 snatches WhatsApp keys, enabling the threat actors to control users' accounts.According to a report published today, the modded app sends users' WhatsApp access keys to the developer's remote server.While Kaspersky has not stated whether these stolen access keys have been abused, they can lead to account takeover, disclosure of sensitive communications with private contacts, and impersonation to close contacts.Like the real WhatsApp Android app, the malicious app requests permissions, like accessing SMS, which is also granted to the Triada Trojan that's embedded in the app.Kaspersky says the trojan can abuse these permissions to register the victims to premium subscriptions without them realizing it and generate income for the distributors.Kaspersky has informed Snaptube about cybercriminals pushing malicious apps through its ad platform, so this distribution channel should be closed soon.The malicious app offers additional features like a customizable interface, individual chat room blocks, and other stuff not available on the WhatsApp client but many people would like to have.Kaspersky also found a YoWhatsApp clone named \"WhatsApp Plus,\" featuring the same malicious functionality, spread via the VidMate app, presumably without its authors knowing about it.Although not all unofficial WhatsApp mods are malicious, avoiding them altogether would be wise if you want to minimize the chances of installing malware on your device.In this case, the apps that promote the malicious WhatsApp versions can only be downloaded in the form of APKs outside the Google Play Store, which is also a practice to avoid.Triada can use these keys to send malicious spam as a stolen account, taking advantage of people trusting their small circle of friends and family.Therefore, be careful of direct messages from contacts promoting software or asking you to click on unusual links. When receiving messages like this, be sure to reach out directly to your friends and family to confirm they actually sent the texts."
   },
   {
      "time": "2022-10-14",
      "title": "New Alchimist attack framework targets Windows, macOS, Linux",
      "text": " Cybersecurity researchers have discovered a new attack and C2 framework called 'Alchimist,' which appears to be actively used in attacks targeting Windows, Linux, and macOS systems.The framework and all its files are 64-bit executables written in GoLang, a programming language that makes cross-compatibility between different operating systems a lot easier.Alchimist gives operators an easy-to-use framework that lets them generate and configure payloads placed on infected devices to remotely take screenshots, run arbitrary commands, and perform remote shellcode execution.The framework supports building custom infection mechanisms for dropping the 'Insekt' remote access trojan (RAT) on devices and helps hackers by generating PowerShell (for Windows) and wget (for Linux) code snippets for the RATs deployment.The Insekt payload can be configured on Alchimist's interface using several parameters like C2 IP/URL, platform (Windows or Linux), communication protocol (TLS, SNI, WSS/WS), and whether it'll run as a daemon or not.The C2 address is hard-coded to the generated implant and contains a self-signed certificate generated during compilation. The C2 is pinged ten times every second, and if all attempts for a connection fail, the malware retries after an hour.While the Alchemist C2 servers deliver commands to execute, it is the Insekt implant that carries them out on infected Windows and Linux systems.The malicious behavior that an Insekt implant can perform includes:Additionally, Insekt can serve as a proxy (using SOCKS5), manipulate SSH keys, perform port and IP scans, write or unzip files to the disk, and execute shellcode on the host.\"The Linux variant of Insekt also has the functionality to list the contents of “.ssh” directory in the victim’s home directory and adds new SSH keys to the authorised_Keys file,\" explains Cisco Talos in the report.\"Using this feature, the attacker can communicate with the victim’s machine from the C2 over SSH.\"Alchimist operators also can send pre-determined commands to the implant concerning user creation, admin user survey, terminal activation, and firewall disabling and configuration.Insikt doesn't work on macOS yet, so Alchimist covers this gap using a Mach-O file, a 64-bit executable written in GoLang that contains an exploit for CVE-2021-4034.Alchimist offers the same exploit for the Linux platform, too, as long as pkexec is installed on the system.Alchimist is another attack framework available to cybercriminals who don’t have the knowledge or capacity to build all the components required for sophisticated cyberattacks.Unfortunately, these ready-made frameworks are high-quality, rich in features, good at evading detection, and effective in dropping implants on targets.With that said, they are even beneficial for more advanced threat actors who want to minimize their operational expenses and blend with random malicious traffic of other hackers to evade attribution."
   },
   {
      "time": "2022-10-14",
      "title": "Magniber ransomware now infects Windows users via JavaScript files",
      "text": " A recent malicious campaign delivering Magniber ransomware has been targeting Windows home users with fake security updates.Threat actors created in September websites that promoted fake antivirus and security updates for Windows 10. The downloaded malicious files (ZIP archives) contained JavaScript that initiated an intricate infection with the file-encrypting malware.In previous campaign, the threat actor used MSI and EXE files. For the recent on, it switched to JavaScript files that had the following names:These files are obfuscated and use a variation of the \"DotNetToJScript\" technique to execute a .NET file in the system memory, lowering the risk of detection by antivirus products available on the host.The .NET file decodes shellcode that uses its own wrapper to make stealthy syscalls, and injects it into a new process before terminating its own.The shellcode deletes shadow copy files via WMI and disables backup and recovery features through \"bcdedit\" and \"wbadmin.\" This increases the chances of getting paid as victims have one less option to recover their files.To perform this action, Magniber uses a bypass for the User Account Control (UAC) feature in Windows.It relies on a mechanism that involves creating of a new registry key that allows specifying a shell command. In a later step, the \"fodhelper.exe\" utility is executed to run a script for deleting the shadow copies.Finally, Magniber encrypts the files on the host and drops the ransom notes containing instructions for the victim to restore their files.HP's analysts noticed that while Magniber attempts to limit the encryption only to specific file types, the pseudohash it generates during the enumeration isn't perfect, which results in hash collisions and \"collateral damage\", i.e., encrypting non-targeted file types as well.Home users can defend against a ransomware attack by making regular backups for their files and to keep them on an offline storage device. This allows recovery of the data onto a freshly installed operating system.Before restoring the data, users should make sure tha their backups were not been infected."
   },
   {
      "time": "2022-10-14",
      "title": "Russian DDoS attack project pays contributors for more firepower",
      "text": " A pro-Russian group created a crowdsourced project called 'DDOSIA' that pays volunteers launching distributed denial-of-service (DDOS) attacks against western entities.DDoS attacks typically don’t have any security repercussions for the target but can cause a lot of damage by generating service outages. Depending on the target, the impact can extend beyond financial losses.Because DDoS attacks are easy to organize, simple to carry out, and still carry a punch, they have been the de-facto weapon of hacktivists on both sides of the Russian-Ukrainian war.Introducing a financial incentive is a new strategy, researchers at cybersecurity company Radware say in a report shared with BleepingComputer.In hacktivist DDoS attacks, volunteers don't get a monetary reward. Joining the cause is normally what they're in for. With the financial incentive added, DDOSIA attracts attackers that don't necessarily support the cause.Project DDOSIA was launched in mid-August by a group named “NoName057(16)” that had emerged in March 2022. The group was first publicly documented in a report from cybersecurity firm Avast in early September.Avast highlighted the presence of a DDoS module downloaded by ‘Bobik’ - a remote access trojan (RAT) discovered in 2020 that was being dropped by RedLine information stealer.Over three months of monitoring, between June and September, Avast concluded that NoName057(16) has been involved in DDoS-ing Ukrainian organizations but was successful in just 40% of their attacks. Volunteers for DDOSIA need to register through Telegram to receive a ZIP archive with the malware (“dosia.exe”), which contains a unique ID for each user.Members can link this ID to a cryptocurrency wallet and receive money for participating in DDoS attacks, payment being proportional to the firepower they provide.Top contributors in each attack wave receive 80,000 rubles ($1,250), second-place attackers receive 50,000 rubles ($800), and third-place contributors are compensated with 20,000 rubles ($300).In the attacks against the U.S. airports, DDOSIA announced that they would distribute payouts to the top ten contributors, increasing the rewards for the contributors.Currently, DDOSIA has about 400 members and remains a semi-closed invite-only group, regularly targeting a list of 60 military and education organizations in Ukraine.The financial reward is an appealing incentive and could allow NoName057(16) not only draw in a mass of volunteers but also set a trend for other DDoS groups."
   },
   {
      "time": "2022-10-14",
      "title": "GitLab patches RCE bug in GitHub import function | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondData importation mechanism failed to sanitize importsA vulnerability in GitLab allowed attackers to stage various attacks against GitLab servers, including the cloud-hosted GitLab.com platform.However, GitLab directly used the Sawyer results returned by Octokit without sanitizing them, which provided opportunities to insert malicious commands.Yvvdwf found that one of the parameters used in the import function was prone to command injections against GitLab’s Redis database.An attacker with a standalone GitLab installation and an API access token could use the exploit to steal information, inject malicious code, and perform other malicious actions against GitLab.com.All users are advised to upgrade their GitLab installation. For organizations that can’t upgrade right away, GitLab advises them to secure their installation by disabling imports until they can patch their system.Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   }
]