[
   {
      "time": "2022-08-03",
      "title": "Microsoft Defender now better at blocking ransomware on Windows 11",
      "text": " Microsoft has released new Windows 11 builds to the Beta Channel with improved Microsoft Defender for Endpoint ransomware attack blocking capabilities.As the company added, starting with today's builds (22621.450 and 22622.450), the enterprise endpoint security platform also gets better at detecting and intercepting what Redmond calls \"advanced attacks.\"The new builds add several other improvements, including storage replication over low bandwidth or congested wide area networks (WAN) and file compression if Server Message Block (SMB) Compression is configured.They also address issues triggering 0x80070026 errors when copying files from network drives and causing Microsoft Edge to freeze when using IE mode.Today, the Windows Insider Program Team also rolled out updates for Windows Subsystem for Android to all Windows 11 Insider channels.For instance, starting today, Windows Subsystem for Android Settings app allows users to toggle on compatibility for games with joysticks (mapped to WASD), gamepads in games, and aiming and sliding with arrow keys.While ​Microsoft has also updated Windows Subsystem for Android in July to enable Windows 11 Insiders to use their VPN's IP address with Android apps, users are now asked to disable Advanced Networking in settings when using VPNs if they lose network connectivity."
   },
   {
      "time": "2022-08-03",
      "title": "SolidBit Ransomware Enters the RaaS Scene and Takes Aim at Gamers and Social Media Users With New Variant ",
      "text": " BusinessImprove your risk posture with attack surface managementSecurity that enables business outcomesGain visibility and meet business needs with securityConnect with confidence from anywhere, on any deviceSecure users and key operations throughout your environmentMove faster than your adversaries with powerful purpose-built XDR, attack surface risk management, and zero trust capabilitiesMaximize effectiveness with proactive risk reduction and managed servicesUnderstand your attack surface, assess your risk in real time, and adjust policies across network, workloads, and devices from a single consoleDrive business value with measurable cybersecurity outcomesSee more, act fasterEvolve your security to mitigate threats quickly and effectivelyEnsure code runs only as intendedGain visibility and control with security designed for cloud environmentsProtect patient data, devices, and networks while meeting regulationsProtecting your factory environments – from traditional devices to state-of-the-art infrastructuresICS/OT Security for the oil and gas utility industryICS/OT Security for the electric utilityStop threats with comprehensive, set-it-and-forget-it protectionBridge threat protection and cyber risk managementOperationalize a zero trust strategyStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformThe most trusted cloud security platform for developers, security teams, and businessesProactively discover, assess, and reduce cyber riskStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformSecure your data center, cloud, and containers without compromising performance by leveraging a cloud security platform with CNAPP capabilitiesSimplify security for your cloud-native applications with advanced container image scanning, policy-based admission control, and container runtime protectionSecurity for cloud file/object storage services leveraging cloud-native application architecturesDefend the endpoint through every stage of an attackStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformOptimized prevention, detection, and response for endpoints, servers, and cloud workloadsOn-premises and cloud protection against malware, malicious applications, and other mobile threatsExpand the power of XDR with network detection and responseStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformProtect against known, unknown, and undisclosed vulnerabilities in your networkDetect and respond to targeted attacks moving inbound, outbound, and laterallyRedefine trust and secure digital transformation with continuous risk assessmentsStop phishing, malware, ransomware, fraud, and targeted attacks from infiltrating your enterpriseLearn about solutions for ICS / OT security.Stop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformKeep ahead of the latest threats and protect your critical data with ongoing threat prevention and analysisAugment security teams with 24/7/365 managed detection, response, and supportAugment threat detection with expertly managed detection and response (MDR) for email, endpoints, servers, cloud workloads, and networksOur trusted experts are on call whether you're experiencing a breach or looking to proactively improve your IR plansStop breaches with the best response and detection technology on the market and reduce clients’ downtime and claim costsGrow your business and protect your customers with the best-in-class complete, multilayered securityDeliver modern security operations services with our industry-leading XDRPartner with a leading expert in cybersecurity, leverage proven solutions designed for MSPsAdd market-leading security to your cloud service offerings – no matter which platform you useIncrease revenue with industry-leading securityDiscover the possibilitiesWe work with the best to help you optimize performance and valueJoin us at AWS re:Invent Nov. 27-Dec. 1Engage with us >Understanding ChatGPT's potential for misuse via malware creationLearn more >How threat actors leverage file-sharing to harvest credentialsLearn more >Understanding how stolen data is acquired and soldProtect your organization >Content has been added to your FolioThis blog entry offers a technical analysis of a new SolidBit variant that is posing as different applications to lure gamers and social media users. The SolidBit ransomware group appears to be planning to expand its operations through these fraudulent apps and its recruitment of ransomware-as-a-service affiliates.    By: Nathaniel Morales, Ivan Nicole Chavez, Monte de Jesus, Lala Manly, Nathaniel Gregory Ragasa\n\t\t\n\t\t\tAugust 02, 2022\nRead time:  ( words)\n\tSave to FolioThe League of Legends account checker on GitHub (Figures 2 and 3) is bundled with a file that contains instructions on how to use the tool (Figure 4), but that is the extent of the pretense: It has no graphic user interface (GUI) or any other behavior related to its supposed function. When an unsuspecting victim runs the application, it automatically executes malicious PowerShell codes that drop the ransomware. Another file that comes with the ransomware is named “Source code,” but this seems to be different from the compiled binary. \nAmong the files bundled with the account checker, we also found an executable file named Rust LoL Accounts Checker.exe (Figure 5) protected by Safengine Shielden, which obfuscates samples and applications to make reverse engineering and analysis more difficult. When this file is executed, an error window appears and claims that debugging tools have been detected (Figure 6), which may be one of the malware’s anti-virtualization and anti-debugging capabilities. If users click on this executable file, it will drop and execute Lol Checker x64.exe, which runs the malicious PowerShell codes that drop and execute the SolidBit ransomware. After pivoting the binary file in VirusTotal and AnyRun, we found that Rust LoL Accounts Checker.exe downloads and executes Lol Checker x64.exe using the following command:  cmd /c start  \"\" %TEMP%\\LoL Checker x64.exeWhen Lol Checker x64.exe is executed, it will begin disabling Windows Defender’s scheduled scans and any real-time scanning of the following folders and file extensions: The file disables these scans by using the following PowerShell command: cmd /c powershell -Command \"Add-MpPreference -ExclusionPath @($env:UserProfile,$env:AppData,$env:Temp,$env:SystemRoot,$env:HomeDrive,$env:SystemDrive) -Force\" & powershell -Command \"Add-MpPreference -ExclusionExtension @('exe','dll') -Force\" & exit; After successfully disabling Windows Defender from scanning these directories, the file will drop and execute the file Runtime64.exe, which we analyzed as the SolidBit ransomware, using the following command prompt:cmd /c start  \"\" %TEMP%\\Runtime64.exeRansomware analysis of SolidBit’s new variant This new version of SolidBit ransomware is a .NET compiled binary (Figure 7). After opening Runtime64.exe using the debugger and .NET assembly editor DnSpy, we found that this file was obfuscated. We used a .NET deobfuscator and unpacker tool called de4dot to make the strings readable (Figure 8).  The ransomware creates a mutex and will terminate if another copy of itself is found already running on the machine (Figure 9).  It will also create a registry key to a directory named “Software\\Microsoft\\Windows\\CurrentVersion\\Run” with the value “UpdateTask” as its autostart mechanism (Figure 10).  Prior to encryption, the ransomware will check if the directory is in the root path and avoids the following files and directories, as shown in Figure 11: This SolidBit variant uses 256-bit Advanced Encryption Standard (AES) encryption to encrypt the files in its victim’s computer (Figure 12). A key that is appended in the encrypted files’ content (Figure 13) will act as SolidBit’s infection marker. The key came from a hard-coded string from the binary that was encrypted via Rivest-Shamir-Adleman (RSA) encryption and was encoded to Base 64. The ransomware will also append the .SolidBit file extension to the encrypted files and changes their file icons (Figure 14).  Its encryption routine only encrypts files with specific file extensions.  This SolidBit variant will also terminate multiple services, delete any shadow copies (Figure 15) and backup catalogs (Figure 16), and delete 42 services in the victim’s computer.  It will also drop a file, RESTORE-MY-FILES.txt, that contains instructions on how a victim can pay the ransom to every directory (Figure 17) and shows a pop-up window on the victim’s machine (Figure 18).  SolidBit as a LockBit imitator  The new SolidBit sample is larger than its predecessors at 5.56 MB, compared to the 159 KB of earlier SolidBit variants. Its use of a fake League of Legends Account Checker application to drop its ransomware payload is a new technique in its arsenal.   SolidBit posing as social media tools In addition to the fraudulent League of Legends account checker application, the aforementioned GitHub account has uploaded this new SolidBit variant disguised as other legitimate applications named “Social Hacker” (Figure 23) and “Instagram Follower Bot” (Figure 24). However, the account has been taken down at the time of this writing.  Both these malicious applications display an error message when executed on a virtual machine (Figure 25). They exhibit the same behavior as the fake League of Legends account checker, wherein they drop and execute an executable that will, in turn, drop and execute the SolidBit ransomware payload (Figure 26). SolidBit as ransomware-as-a-service  Fending off ransomware attacks The malware authors behind SolidBit ransomware appear to be gearing up to expand their operations through recruiting ransomware-as-a-service partners who will facilitate a wider scale of infection, on top of the distribution approach of their newly found variant. The large commission percentage that SolidBit’s authors offer is likely to attract other opportunistic threat actors, so we anticipate more activity from this ransomware group in the near future.  End users and organizations alike can mitigate the risk of ransomware infection by following these security best practices:  Indicators of compromise (IOCs)  Nathaniel MoralesThreat AnalystIvan Nicole ChavezThreat AnalystMonte de JesusThreats AnalystLala ManlyThreats AnalystNathaniel Gregory RagasaThreat AnalystTry our services free for 30 daysSelect a country / regionCopyright ©2023 Trend Micro Incorporated. All rights reserved"
   },
   {
      "time": "2022-08-03",
      "title": "VMware Ships Urgent Patch for Authentication Bypass Security Hole - SecurityWeek",
      "text": " Hi, what are you looking for?Virtualization technology giant VMware on Tuesday shipped an urgent, high-priority patch to address an authentication bypass vulnerability in its Workspace ONE Access, Identity Manager and vRealize Automation products.ByFlipboardRedditWhatsappWhatsappEmailRyan Naraine is Editor-at-Large at SecurityWeek and host of the popular Security Conversations podcast series. He is a security community engagement expert who has built programs at major global brands, including Intel Corp., Bishop Fox and GReAT. Ryan is a founding-director of the Security Tinkerers non-profit, an advisor to early-stage entrepreneurs, and a regular speaker at security conferences around the world.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...Zero trust is not a replacement for identity and access management (IAM), but is the extension of IAM principles from people to everyone and...A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The CRYSTALS-Kyber public-key encryption and key encapsulation mechanism recommended by NIST for post-quantum cryptography has been broken using AI combined with side channel attacks.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-08-03",
      "title": "Semiconductor manufacturer Semikron hit by LV ransomware attack",
      "text": " German power electronics manufacturer Semikron has disclosed that it was hit by a ransomware attack that partially encrypted the company's network.Semikron has over 3,000 employees in 24 offices and 8 production sites worldwide across Germany, Brazil, China, France, India, Italy, Slovakia, and the USA, with a turnover of around $461 million in 2020.It also says it's one of the world's leading power engineering component manufacturers, with 35% of the wind turbines installed each year operating with its technologies.\"The attack has also led to partial encryption of our IT systems and files. The entire network is currently being studied and adjusted forensic.\"According to an alert issued by the German Federal Office for Information Security (Bundesamt für Sicherheit in der Informationstechnik) and seen by BleepingComputer, the ransomware operators are blackmailing the company and threatening to leak allegedly stolen data.Semikron is investigating attackers' claims that they stole data from the encrypted systems before encryption with the help of external cybersecurity and forensic experts.The company added that it also informed and collaborates with relevant authorities throughout the investigation and would alert customers and partners if any evidence of data theft is found.\"At the same time, we are working on restoring the working ability to minimize disruptions for our employees, customers and contractual partners and to ensure the best possible security of our IT systems,\" Semikron added.\"We are also supported by the competent authorities in the investigation and coordination of further measures.\"A Semikron spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today."
   },
   {
      "time": "2022-08-03",
      "title": "Frenzied mob\\' steals more than $156 million from crypto platform Nomad",
      "text": " Crypto platform Nomad was robbed of more than $156 million in cryptocurrency on Monday evening after a vulnerability in a recent update was discovered and replicated by dozens of hackers.Nomad – a company that facilitates cryptocurrency trades between different blockchains like Avalanche (AVAX), Ethereum (ETH), Evmos (EVMOS) and more – performed an update on their platform in recent days that introduced the vulnerability.In an effort to siphon funds being returned to the platform, some scammers attempted to pose as company representatives, leading the company to put out a statement on Twitter saying the were “aware of impersonators posing as Nomad and providing fraudulent addresses to collect funds.”“We aren’t yet providing instructions to return bridge funds. Disregard comms from all channels other than Nomad’s official channel,” the company said. “Our goal is to identify the accounts involved and to trace and recover the funds. Thank you to our many white hat friends who acted proactively and are safeguarding funds. Please continue to hold them until we provide further instructions on this thread,” the company added. Update: We are working around the clock to address the situation and have notified law enforcement and retained leading firms for blockchain intelligence and forensics. Our goal is to identify the accounts involved and to trace and recover the funds.1/2Quantstamp outlined precisely the scenario that took place on Monday and wrote in the audit that the Nomad team \"has misunderstood the issue.\"Nomad becomes the latest in a string of high-profile cyberattacks on blockchain bridges – which allow people to transfer tokens, assets, smart contract instructions and data between blockchains. But Ronghui Gu, CEO of cryptocurrency security company CertiK, told The Record that the Nomad hack was special because once the initial hacker finished their attack, other users could replicate the exploit by copying the original hacker's transaction calldata and replacing the original address with a personal one. “In four hours, other hackers, bots, and community members replicated the initial attack, draining it in a frenzied mob attack in what Twitter user @0xfoobar called, ‘...the first decentralized crowd-looting of a 9-figure bridge in history,’” he said. “This attack will surely be remembered alongside other 9-figure attacks against cross-chain bridges from this year such as the Ronin Bridge hack and the Wormhole hack. The sums lost show the cross-chain bridges to be both a highly vulnerable, but also a highly sought-after technology due to the amount of value held on them.”If Nomad is unable to recover some amount of funds, the attack would be one of the largest cryptocurrency hacks recorded in recent years. Elliptic said it ranks the attack on Nomad eighth in the list of top 10 crypto hacks of all time based on value lost. Nomad is the fourth blockchain bridge to join the list, and the platforms now account for $1.6 billion of total funds lost in the top 10 thefts.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-03",
      "title": "European missile maker confirms data theft, denies network compromise",
      "text": " In a statement posted to its website, MBDA said it was working with Italian police to investigate a blackmail scheme targeting the company. MBDA is the subject of a blackmail attempt by a criminal group that falsely claims to have hacked the company’s information networks. Following the company’s refusal to yield to this blackmail threat and pay a ransom demand, the criminal group has spread information on the internet, making it accessible for a payment. The company said the source of the advertised data “has already been ascertained” and it confirmed that “no hacking of the company’s secure networks has occurred.” So far, the company added, its “internal verification processes indicate that the data made available online are neither classified data nor sensitive.”Andrea Peterson (they/them) is a longtime cybersecurity journalist who cut their teeth covering technology policy at ThinkProgress (RIP) and The Washington Post before doing deep-dive public records investigations at the Project on Government Oversight and American Oversight.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-03",
      "title": "Mobile store owner hacked T-Mobile employees to unlock phones",
      "text": " A former owner of a T-Mobile retail store in California has been found guilty of a $25 million scheme where he illegally accessed T-Mobile's internal systems to unlock and unblock cell phones.Argishti Khudaverdyan, 44, allegedly ran a scheme between 2014 and 2019 where he unlocked devices from the cellular networks of their vendors and enabled people to use them with other telecommunication providers.This scheme impacted mobile carriers who offer these devices to customers at a special price or even free of charge, offsetting the cost by locking them for some time in their networks.Additionally, Khudaverdyan unlocked devices the carriers had blocked due to their rightful owners reporting them as stolen or lost.This action of unlocking stolen cellphones is particularly detrimental because it allows these phones to be sold on a black market, making the theft and reselling of devices very profitable.\"Removing the unlock allowed the phones to be sold on the black market and enabled T-Mobile customers to stop using T-Mobile's services and thereby deprive T-Mobile of revenue generated from customers' service contracts and equipment installment plans.\"The sentence of Khudaverdyan is to be decided on October 17, 2022, with the maximum imprisonment time for each count being:To find potential clients, Khudaverdyan promoted his unlocking services through websites like “unlocks247.com,” spam email, and various brokers.The man even engaged in false advertising, presenting these unlocks as “official” T-Mobile services so the clients, in most cases, wouldn’t realize they were involved in an illegal exchange.To perform the unlocks, Khudaverdyan compromised over 50 T-Mobile employee credentials, many belonging to high-ranking employees with powerful privileges.This happened through phishing emails that mimicked actual T-Mobile internal correspondence and social engineering, both of which were made easier for Khudaverdyan as he had access to genuine samples from T-Mobile.\"Working with others in overseas call centers, Khudaverdyan also received T‑Mobile employee credentials which he then used to access T-Mobile systems to target higher-level employees by harvesting those employees’ personal identifying information and calling the T-Mobile IT Help Desk to reset the employees’ company passwords, giving him unauthorized access to the T-Mobile systems which allowed him to unlock and unblock cellphones,\" explained the DOJ press release.These stolen credentials were used to access T-Mobile's internal computer systems, and many times he performed password resets too, locking the account owners out of the system.In 2017, T-Mobile suspected Khudaverdyan was performing malicious activities after investigating some unauthorized access events and terminated his contract with the company.The man, however, continued the same fraud by partnering with another owner of a T-Mobile store in Los Angeles, Alen Gharehbagloo, who has also pleaded guilty to three felonies and is scheduled to hear his sentence on December 5, 2022."
   },
   {
      "time": "2022-08-03",
      "title": "New 'ParseThru' Parameter Smuggling Vulnerability Affects Golang-based Applications",
      "text": " Security researchers have discovered a new vulnerability called ParseThru affecting Golang-based applications that could be abused to gain unauthorized access to cloud-based applications.The issue, at its core, has to do with inconsistencies stemming from changes introduced to Golang's URL parsing logic that's implemented in the \"net/url\" library.While versions of the programming language prior to 1.17 treated semicolons as a valid query delimiter (e.g., example.com?a=1;b=2&c=3), this behavior has since been modified to throw an error upon finding a query string containing a semicolon.\"Now, settings with non-percent-encoded semicolons are rejected and net/http servers will log a warning to 'Server.ErrorLog' when encountering one in a request URL.\"The problem arises when a Golang-based public API built upon version 1.17 or later communicates with a backend service running an earlier version, leading to a scenario where a malicious actor could smuggle requests incorporating query parameters that would otherwise be rejected.Put simply, the idea is to send specially crafted requests containing a semicolon in the query string, which is ignored by the user-facing Golang API but is processed by the internal service.Oxeye said it identified several instances of ParseThru in open-source projects such as Harbor, Traefik, and Skipper, which made it possible to bypass validations put in place and carry out unauthorized actions. The issues have been addressed following responsible disclosure to the respective vendors.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]