[
   {
      "time": "2022-07-13",
      "title": "CERT-UA",
      "text": " "
   },
   {
      "time": "2022-07-13",
      "title": "https://krebsonsecurity.com/2022/07/microsoft-patch-tuesday-july-2022-edition/?utm_source=dlvr.it&utm_medium=twitter",
      "text": " "
   },
   {
      "time": "2022-07-13",
      "title": "https://www.bleepingcomputer.com/news/security/cisa-orders-agencies-to-patch-new-windows-zero-day-used-in-attacks/",
      "text": " "
   },
   {
      "time": "2022-07-13",
      "title": "\r\n\tRansomware Attacks on Education on the Rise - Infosecurity Magazine\r\n",
      "text": " Contributing Writer & North America Webinar ModeratorWhile education institutions suffer fewer attacks than the 66% global cross-sector average, more encryption-based attacks against this sector are slightly more successful at 73% on average. The global average encryption rate across all sectors sat at 65% over the past year.Almost all education victims got their data back, mostly from backups. Just under half agreed to pay the ransom fee for data retrieval, which typically got them less than two-thirds of their data back.When ransomware strikes the education sector, the results are dire. On average, just over 95% of all education institutions said that ransomware attacks hindered their operations. It took universities and colleges longer to recover, with 40% of them reporting that operations were not back to normal for a month, compared to 26% of lower education schools. The education sector had the longest recovery time overall, with an average of 7% taking over three months to recover compared to 4% across all sectors.Educators rely heavily on cyber insurance, with 78% adopting it, and it almost always pays out in the event of a ransomware attack, the report said.The survey covered 730 educational institutions (320 from lower education institutions serving children under 18 and 410 from higher education institutions such as universities and colleges. It was part of a cross-sector poll that covered 5600 respondents across 31 countries."
   },
   {
      "time": "2022-07-13",
      "title": "Microsoft: Phishing bypassed MFA in attacks against 10,000 orgs",
      "text": " Microsoft says a massive series of phishing attacks has targeted more than 10,000 organizations starting with September 2021, using the gained access to victims' mailboxes in follow-on business email compromise (BEC) attacks.The threat actors used landing pages designed to hijack the Office 365 authentication process (even on accounts protected by multifactor authentication (MFA) by spoofing the Office online authentication page.In some of the observed attacks, the potential victims were redirected to the landing pages from phishing emails using HTML attachments that acted as gatekeepers ensuring the targets were being sent via the HTML redirectors.After stealing the targets' credentials and their session cookies, the threat actors behind these attacks logged into the victims' email accounts. They subsequently used their access in business email compromise (BEC) campaigns targeting other organizations.\"A large-scale phishing campaign that used adversary-in-the-middle (AiTM) phishing sites stole passwords, hijacked a user's sign-in session, and skipped the authentication process even if the user had enabled multifactor authentication (MFA),\" the Microsoft 365 Defender Research Team and Microsoft Threat Intelligence Center (MSTIC) said.\"The attackers then used the stolen credentials and session cookies to access affected users' mailboxes and perform follow-on business email compromise (BEC) campaigns against other targets.\"The phishing sites used in this campaign worked as reverse proxies and were hosted on web servers designed to proxy the targets' authentication requests to the legitimate website they were trying to sign in to via two separate Transport Layer Security (TLS) sessions.Using this tactic, the attackers' phishing page acted as a man-in-the-middle agent that intercepts the authentication process to extract sensitive information from hijacked HTTP requests, including passwords and, even more importantly, session cookies.After the attackers got their hands on the targets' session cookie, they injected it into their own web browser, which allowed them to skip the authentication process, even if the victims' had MFA enabled on the compromised accounts.​To defend against such attacks, Microsoft recommends using \"phish-resistant\" MFA implementations with certificate-based authentication and Fast ID Online (FIDO) v2.0 support.Other recommended best practices that would boost protection include monitoring for suspicious sign-in attempts and mailbox activities, as well as conditional access policies that would block attackers' attempts to use stolen session cookies from non-compliant devices or untrusted IP addresses.\"MFA is still very effective at stopping a wide variety of threats; its effectiveness is why AiTM phishing emerged in the first place.\""
   },
   {
      "time": "2022-07-13",
      "title": "European Central Bank Head Targeted in Hacking Attempt - SecurityWeek",
      "text": " Hi, what are you looking for?The European Central Bank said Tuesday that its president, Christine Lagarde, was targeted in a hacking attempt but no information was compromised.ByFlipboardRedditWhatsappWhatsappEmailThe European Central Bank said Tuesday that its president, Christine Lagarde, was targeted in a hacking attempt but no information was compromised.The attempt took place “recently,” the Frankfurt-based central bank for the 19 countries that use the euro said in an emailed response to a query about a report by Business Insider. The bank added that “it was identified and halted quickly” but that it had nothing more to say amid an investigation.Business Insider reported, without naming sources, that Lagarde was contacted by text message from what appeared to be former German Chancellor Angela Merkel’s cellphone number by someone claiming that Merkel wanted to communicate with her by WhatsApp because that would be more secure.It said that Lagarde then contacted Merkel by phone to ask whether she really wanted to communicate by WhatsApp and that whoever was behind the attempt apparently aimed to gain control of the accounts of various prominent figures on WhatsApp and other messaging services.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailInfonetics Research has shared excerpts from its Mobile Device Security Client Software market size and forecasts report, which tracks enterprise and consumer security client...Apple rolled out iOS 16.3 and macOS Ventura 13.2 to cover serious security vulnerabilities.Critical security flaws expose Samsung’s Exynos modems to “Internet-to-baseband remote code execution” attacks with no user interaction. Project Zero says an attacker only needs...Samsung smartphone users warned about CVE-2023-21492, an ASLR bypass vulnerability exploited in the wild, likely by a spyware vendor.Two vulnerabilities in Samsung’s Galaxy Store that could be exploited to install applications or execute JavaScript code by launching a web page.Asus patched nine WiFi router security defects, including a highly critical 2018 vulnerability that exposes users to code execution attacks.Technical details published for an Arm Mali GPU flaw leading to arbitrary kernel code execution and root on Pixel 6.A team of researchers has demonstrated a new attack method that affects iPhone owners who use Apple Pay and Visa payment cards. The vulnerabilities...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-13",
      "title": "IBM joins other tech giants and removes Russian state controlled network from its cloud service | CyberScoop",
      "text": " \n\nJuly 12, 2022\n\nUntil the Russian invasion of Ukraine, the state-sponsored RT television network was one of Moscow’s main tools for spreading propaganda beyond its borders. But after the war started, most global tech companies either cut off RT’s programs from their streaming platforms or took steps to severely limit the network’s reach over the internet.It wasn’t until CyberScoop asked IBM about Rumble’s use of IBM Cloud to distribute RT content that the company says it made its tech unavailable to Rumble for that purpose.A spokesperson for IBM said last week that the company was “unaware of the situation,” but, after CyberScoop’s inquiry, has since “taken steps so that RT content is not available via services provided by IBM Cloud.” The spokesperson declined to explain what steps were taken or when. But a review of internet hosting and routing data for Rumble’s web domain showed that IP addresses associated with IBM Cloud infrastructure previously pointing to Rumble’s web domain are no longer listed.RT’s livestream and individual videos are still available on Rumble. The company has its own cloud infrastructure, and its current IP addresses point back to that infrastructure. The IBM spokesperson noted that “Rumble operates its own cloud network, with which IBM has no association.” Rumble did not respond to questions about IBM’s actions or how it affected Rumble.“There is a reason the public has radically turned against both the corporate media (such as your outlet) and Big Tech: because you have arrogantly claimed for yourselves the power to decide for the public what information they can and cannot be trusted to hear and what views they can and cannot express,” the company said. “By stark contrast, the reason Rumble is growing so rapidly is because we trust adults to make decisions for themselves about what ideas they can express, and we trust them to make up their own minds after hearing all sides.”"
   },
   {
      "time": "2022-07-13",
      "title": "New ‘Luna Moth’ hackers breach orgs via fake subscription renewals",
      "text": " A new data extortion group has been breaching companies to steal confidential information, threatening victims to make the files publicly available unless they pay a ransom.The gang received the name Luna Moth and has been active since at least March in phishing campaigns that delivered remote access tools (RAT) that enable the corporate data theft.The Incident Response team at cybersecurity company Sygnia has been tracking the activity of the Luna Moth ransom group, noting that the actor is trying to build a reputation using the name Silent Ransom Group (SRG).To achieve that, Luna Moth relies on phishing attacks. Over the past three months, the group managed a large-scale campaign luring victims with false subscription  emails for using Zoho, MasterClass, or Duolingo services.Victims would receive a message allegedly from one of the aforementioned services announcing that the subscription is about to end and that it will be automatically renewed, with 24 hours to process the payment.Luna Moth uses email addresses with names that impersonate the brands used in the phishing campaign. Looking closer, the scam is obvious since the messages come from Gmail accounts.The email come with a fake invoice in the attachment, which provides a contact for those that want to learn more details about the subscription or to cancel it.Calling the phone number in the invoice puts the victim in contact with the scammer, who provides instructions to install a remote access tool on the system.As seen from the modus operandi, Luna Moth is far from a sophisticated threat actor and the tool they use support this theory.According to Sygnia, the gang uses commercially available remote desktop solutions such as Atera, AnyDesk, Synchro, and Splashtop.In many of the observed attacks, the threat actors installed more than one RAT on the victim’s machine for redundancy and persistence, the researchers say.Other tools installed manually by the threat actors include SoftPerfect Network Scanner, SharpShares, and Rclone, which collectively help adversaries with reconnaissance on the network to locate valuable files, pivoting, and stealing the data.Sygnia says that the threat actors don’t target specific victims. They deploy opportunistic attacks where they grab anything they can access and then proceed to extorting the victim.However, the threat actor's demands are quite high, as researchers say that Luna Moth may ask for \"millions of dollars in ransom.\"Despite lacking sophistication, Sygnia found that Luna Moth has been using close to 90 domain names as part of their infrastructure or for hosting data from breached companies.All sites used for phishing had names that resemble the impersonated brand - in this case Zoho, MasterClass, and Duolingo, and researchers found more than 40. The rest were used as exfiltration servers.While extortion is widely associated with ransomware operations, it appears that stealing sensitive data without encrypting systems is turning into a new way to monetize corporate breaches."
   },
   {
      "time": "2022-07-13",
      "title": "Nearly all governmental websites serve cookies or third-party trackers - Help Net Security",
      "text": " In some countries up to 90% of governmental websites add third-party tracker cookies without users’ consent. This occurs even in countries with strict user privacy laws, according to researchers Matthias Götze (TU Berlin), Srdjan Matic (IMDEA Software), Costas Iordanou (Cyprus University of Technology), Georgios Smaragdakis (TU Delft) and Nikolaos Laoutaris (IMDEA Networks).Previous studies have shown the widespread use of cookies to track users on websites, but this had not been studied so far on government sites.A total of 5,500 websites of international organizations, official COVID-19 information and governments of G20 countries were analyzed: Argentina, Australia, Brazil, Canada, China, France, Germany, India, Indonesia, Italy, Japan, Mexico, Russia, Saudi Arabia, South Africa, South Korea, Turkey, UK and USA.There are several types of cookies. “There are first-party cookies, which are those created by the visited website itself, while third-party cookies are those commonly created by external agents through content embedded in the website. In addition, there is the cookie ghostwriting, in which an external entity creates the cookie on behalf of another party and therefore its origin is unknown”, highlights Srdjan Matic, Research Assistant Professor at IMDEA Software.This paper also distinguishes between cookies by their duration: session cookies active only during the visit to the page or persistent cookies of short, medium or long duration.Most of the websites of the G20 countries analyzed install at least one cookie without the user’s consent. Japan is the country with the lowest percentage of websites with cookies, with 77.2%, and South Korea, Saudi Arabia and Indonesia lead the ranking with almost 100%.Together, third-party cookies and third-party tracking cookies add up from about 30% in the case of Germany to 95% in the case of Russia. Germany is the only country where this percentage decreases significantly, with only 9% of official websites including a TPT cookie.In 16 of the 19 countries analyzed, more than 50% of TP and TPT cookies take more than one day to expire.The study shows that around 95% of the websites of international organizations set cookies and around 60% of these websites use at least one third-party cookie. Matic explains that “there are no special measures to neutralize third-party cookies on these websites since 52% of the websites of international organizations set at least one cookie associated with a tracker”. More than 99% of the websites analyzed in the COVID-19 information study add at least one cookie without the user’s consent. In contrast, there is a lower presence of third-party cookies, at around 62%.As Laoutaris points out, with this publication the research team aims to “put more pressure on governments to clean up their own house first and, by doing so, set an example and be more convincing about the importance of implementing the GDPR in practice”. "
   },
   {
      "time": "2022-07-13",
      "title": "TikTok Postpones Privacy Policy Update in Europe After Italy Warns of GDPR Breach",
      "text": " Popular video-sharing platform TikTok on Tuesday agreed to pause a controversial privacy policy update that could have allowed it to serve targeted ads based on users' activity on the social video platform without their permission to do so.The formal warning was in response to a privacy policy revision that noted the service had historically asked users' \"consent\" to their on-TikTok activity and off-TikTok activity to serve personalized ads and that, therefore, it intends to stop asking users for their permission to profile their behavior and process personal data.The update to its personalized advertising settings covers users who reside in the European Economic Area (EEA), the U.K., and Switzerland.\"Both legal instruments set out explicitly that the data subjects' consent is the only legal basis for 'the storing of information, or the gaining of access to information already stored, in the terminal equipment of a subscriber or user,'\" the watchdog pointed out.It further added that \"processing data on the basis of its 'legitimate interest' would be in conflict with the current regulatory framework, at least with regard to the information stored in users' devices, and would entail all the relevant consequences also in terms of corrective measures and fines.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-07-13",
      "title": "\r\n\tLithuanian Energy Firm Disrupted by DDOS Attack - Infosecurity Magazine\r\n",
      "text": " Technology and Features JournalistLithuanian energy company Ignitis Group was hit by what it described as its “biggest cyber-attack in a decade” on Saturday when numerous distributed denial of service (DDoS) attacks were aimed at it, disrupting its digital services and websites. Speaking on Lithuanian radio, the country’s vice minister for national defense cautioned against excessive attention being paid to such cyber-attacks. He believes that their primary goal is seeking publicity and driving tensions in the region.“We need to understand that publicity is a very important part of these attacks. If we don’t talk about them, the other side will lose motivation. When we talk about alleged victories, about alleged punishment of Lithuania, it’s motivating the other side,” Margiris Abukevicius told Ziniu Radijas news radio.Lithuanian institutions and businesses have been hit by wide-ranging cyber-attacks since late June when it began enforcing EU sanctions on goods traveling to Kaliningrad, a Russian exclave on the Baltic coast. Ignitis Group is one of the largest energy companies in the Baltic states. It operates in Lithuania, Latvia, Estonia, Poland and Finland where its core activities include power and heat generation and supply, power and natural gas trading and distribution. The group’s companies supply power and natural gas to about 1.6 million business and private customers.In a press release, Ignitis Group said it is cooperating with responsible authorities and is continuing efforts to ensure the accessibility of its websites and digital services. Edvinas Kerza, head of business resilience at Ignitis Group, commented: \"Our current priority is to ensure that the Group’s websites and systems used by the customers are running without disruptions. After the works are complete, we will immediately assess how we can improve our processes and strengthen the systems even more so that, even under such a large-scale attack, the operations are disrupted as little as possible.\""
   }
]