[
   {
      "time": "2023-04-19",
      "title": "Recycled Core Routers Expose Sensitive Corporate Network Info",
      "text": " Cameron Camp had purchased a Juniper SRX240H router last year on eBay, to use in a honeypot network he was building to study remote desktop protocol (RDP) exploits, and attacks on Microsoft Exchange and industrial control systems (ICS) devices. When the longtime security researcher at Eset booted up the secondhand Juniper router, to his surprise it displayed a hostname.After taking a closer look at the device, Camp contacted Tony Anscombe, Eset's chief security evangelist, to alert him to what he found on the router. \"This thing has a whole treasure trove of Silicon Valley A-list software company information on it,\" Camp recalls telling Anscombe.\"We got very, very concerned,\" Camp says.Camp and Anscombe decided to test their theory that this could be the tip of the iceberg for other decommissioned routers still harboring information from their previous owners' networks. They purchased several more decommissioned core routers — four Cisco Systems ASA 5500, three Fortinet FortiGate, and 11 Juniper Networks SRX Series Services Gateway routers.After dropping a few from the mix after one failed to power up and another two were actually mirrored routers from a former cluster, they found that nine of the remaining 16 held sensitive core networking configuration information, corporate credentials, and data on corporate applications, customers, vendors, and partners. The applications exposed on the routers were from big-name software vendors used in many enterprises: Microsoft Exchange, Lync/Skype, PeopleSoft, Salesforce, Microsoft SharePoint, Spiceworks, SQL, VMWare Horizon View, voice over IP apps, File Transfer Protocol (FTP), and Lightweight Directory Access Protocol (LDAP) applications.The routers contained one or more set of IPSec or VPN credentials, or hashed root passwords, and each had sufficient data for the researchers to identify the actual previous owner/operator of the device. Nearly 90% included router-to-router authentication keys and details on applications connected to the networks, some 44% had network credentials to other networks (such as a supplier or partner), 33% included third-party connections to the network, and 22% harbored customer information.\"I have the entire network topology of their core infrastructure, both internal and external, like cloud assets,\" for example, Camp says.Camp says the discovery was a far cry from the malware he typically studies, and a lot less work for an attacker who happened upon one of these unwiped routers. \"I don't need a zero day, I have your router,\" quips Camp.\"They are the intersection upon everything that happens in your organization,\" Camp says of core routers. \"Everything touches the router,\" including many cloud services, he adds.Among the organizations whose information was exposed were a manufacturing company, a US law firm, managed services providers, an open source software firm, an events company, a telecommunications equipment supplier, a global data company, and a creative services company. Eset did not disclose the names of the organizations, but the researchers confirmed that they contacted all of them.The Silicon Valley software vendor was quick to respond, even awarding Camp a bug bounty that he then donated to the Electronic Freedom Foundation and the Tor Project. But that was the researchers' easiest disclosure.\"Once we stepped outside of the tech [sector], it was incredibly different\" and harder to disclose our findings, Anscombe notes. The other organizations didn't have processes or even people available to handle the disclosure information, he says.Meanwhile, one of the unwiped routers contained what Camp describes as a \"creepy\" remote administration interface.\"I was never sure if it was on purpose, but it was creepy, very low-level access, and from one of the countries with flags that we're [the US] not happy with right now,\" he says. \"It could be totally legit or that could be really bad. It was a little edgy to me.\"So how do you wipe a router that you want to retire? The good news is most routers are fairly easy to securely decommission, and the big three — Cisco, Fortinet, and Juniper — on their websites provide detailed guidelines for restoring devices to their factory default settings.With Juniper routers, for example, wiping the device is simple: \"Going to config setting and type 'delete,' hit 'Y' [to confirm] and now that router doesn't know who it is anymore,\" Camp says. The entire wiping process takes less than five minutes, including the post-deletion reboot.And if your organization already had disposed of routers that weren't properly wiped, Eset recommends rotating cryptographic keys in case an attacker were to get their hands on your old router and attempt to gain trusted access to your network. Zero trust can help here as well, they say.But that's still no guarantee that a malicious actor who buys your old router still couldn't use it to target your organization. \"Even if somebody goes and changes the credentials of the accounts being cached in router, potentially [the attacker has] got the app lists, so [they] can tell what apps are run internally locally or in the cloud,\" Abscombe says.That gives the attacker just enough intel to plan a targeted attack, according to Abscombe. \"If I know they're running [a specific version of] Exchange and that version had a CVE and they had not applied the patch … I suddenly know things about their network that can make them vulnerable,\" he says. If you buy a secondhand core router, and, like the researchers, find that it still contains the previous owner's information, Eset recommends disconnecting the router and moving it to a secured area and contacting your regional CISA office. They also say it's best to document your purchase process as a precaution for insurance or legal purposes.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-19",
      "title": "NSO Group escalates spyware tactics with 3 new iPhone zero-click exploit chains | SC Media",
      "text": "  The notorious NSO Group’s Pegasus spyware continues to pose a threat, despite reports it was winding down its operations. New zero-click exploits found by watchdogs at Citizen Lab targeted two different remote attack surfaces on iPhones running iOS 15 and 16.PWNYOURHOME and FINDMYPWN are the first zero-click exploits to remotely and simultaneously target two Apple attack surfaces, according to Citizen Lab researchers. The use of zero-click exploits against iOS is not new, as past research showed similar tactics against iOS 14 devices with the NSO Group's Pegasus spyware. The latest Citizen Lab research found three more zero-click exploits tied to the NSO Group being used to hack iOS 15 and iOS 16 devices. The tactics were discovered during their long-running investigation into NSO’s campaign against several Mexican human rights groups. Network defenders should take note that these new tactics demonstrate that NSO Group is escalating its attempts to stop researchers from analyzing their tactics by blocking all traces of infection. Even when they’re not successful, the group is certainly undermining these efforts.The first, PWNYOURHOME, is an iOS exploit that could enable an attacker to infiltrate the iMessage app to modify the HomeKit software. The issue was disclosed to Apple, which later fixed the vulnerability in the iOS 16.3.1 update.The attack is deployed in two phases, with each targeting a different iOS process. The first phase uses a daemon crash in the HomeKit app, then moves to download PNG images from the iMessage app, causing BlastDoor to crash. Citizen Lab could not determine how the exploit leaves BlastDoor, but they found the exploit later launches Pegasus through the iOS component called “mediaserverd.”Fortunately, it appears use of Apple’s Lockdown Mode feature can successfully block PWNYOURHOME attacks levied by the notorious spyware vendor, as the function alerted users to the attempted attack visible through the notification display.However, there are no indications NSO has stopped using the exploit, suggesting the group “may have figured out a way to correct the notification issue, such as by fingerprinting Lockdown Mode.”The second exploit, FINDMYPWN, effectively targets the fmfd process on the ‘Find My’ function of iOS 15.5 and iOS 15.6 devices. The exploit enables items to be written and deleted inside of the cache directory. Citizen Lab is limiting the forensic information it releases for the exploit, so as not to inform the NSO Group of possible evasion tactics.A final exploit was observed after the researchers reassessed earlier forensics. LATENTIMAGE first appeared in January 2022 impacting iOS 15 devices. Evidence suggests the exploit also uses the ‘Find My’ function, but it’s initial access point is not confirmed.For Citizen Lab, “the use of multiple attack surfaces should encourage developers to think holistically about device security, and treat the entire surface reachable through a single identifier as a single surface.”What’s more, “modern exploit mitigations like pointer authentication codes significantly reduce attacker freedom to execute arbitrary code on a device,” researchers wrote. But PWNYOURHOME shows that “real-world attackers can, and do, find practical ways around these mitigations, such as by repurposing signed pointers located at known offsets in the iOS shared cache.”As the NSO group continues these evasive tactics, Citizen Lab stressed that it’s “encouraging” that Lockdown Mode successfully notified targets of ongoing attacks. While no tool is a cure-all, the feature could go far in dampening the impact of similar attack methods.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.The new PCI DSS standard puts more focus on application security, with more tools, testing and documentation required of developers.GitHub has updated its Advanced Security platform available for Enterprise Cloud and Enterprise Server customers to provide new artificial intelligence-powered features in a bid to \"revolutionize\" secure app development, reports SecurityWeek.Vulnerabilities in API authorization have been named by Wallarm as the second greatest security risk facing APIs, emphasizing the ease of leveraging authorizations as backdoors as well as the urgent need to ensure authorization maintenance, reports SiliconAngle.Tue Aug 27 - Wed Aug 28Tue Dec 5On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-04-19",
      "title": "'Zaraza' Bot Targets Google Chrome to Extract Login Credentials",
      "text": " Using Telegram as its command-and-control (C2) mechanism, a new strain of malware, a bot dubbed Zaraza, is capable of extracting login credentials from a victim's open browser and saving them to a file, as well as taking screenshots of open windows to be saved in a JPG file.The type of login credentials that it steals range from bank accounts to email accounts to online wallets, as well as other sensitive and valuable website targets. This information can provide attackers with the opportunity to commit severe crimes such as identity theft and financial fraud, as well as grant access to personal identifiable information (PII) and, especially in the era of remote work, business accounts. This variant of malware and what it allows attackers to do potentially opens the floodgates to financial loss and \"reputational damage,\" according to the analysis.\"To protect yourself against this malware,\" the Uptycs researchers wrote, \"you should update your passwords regularly, follow online security best practices such as using strong passwords and multi-factor authentication, and ensure regular software and security system updates.\" Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-19",
      "title": "QBot Expands Initial Access Malware Strategy With PDF-WSF Combo",
      "text": " A recent surge in QBot Trojan attacks has been observed, spreading via malicious emails written in various languages, including English, German, Italian, and French. The emails are crafted using genuine business letters obtained by the attackers and urge the recipient to open an attached PDF file, which contains several layers of obfuscation that make its maliciousness less detectable by security tools.According to an analysis by Kaspersky this week, the campaign also uses the method of using reply-chain emails to make it more difficult for soon-to-be-victims to flag as malicious. As the name suggests, reply chain is the practice of accessing existing email exchanges from a listserv (or any location) and replying to them, making the interloping messages look legit, less suspicious, and believable.The campaign represents a change in tactics for the operators of QBot (aka QakBot or Pinkslipbot), who maintain an access-as-a-service offering that other cybercriminals use to deliver a range of second-stage malware to already-compromised targets. Initially discovered in 2007, QBot has undergone numerous modifications and enhancements over the years, resulting in its widespread distribution as one of the most actively propagated malware strains in 2020. These latest improvements help boost stealth and legitimacy, according to security researchers. For instance, the emails are crafted to change only minimal parts of the stolen documents; they may contain links or attachments that contain links to malicious sites.\"The WSF is obfuscated to evade detection which will download further payloads,\" explains Timothy Morris, chief security adviser at Tanium. \"The attack 'chaining', or using multiple steps, helps get past some protections since the full context of the nefarious behavior can't be observed as a single activity.\"Morris notes that the multiple phases in the attack flow, from the initial emails to payloads being downloaded to data exfiltration and theft requires a range of cybersecurity strategies to defend against.\"It is important to have a defense-in-depth strategy that includes detection, monitoring, and protection technologies at the endpoint, as well as Web, network, and email security that is up to date,\" he says. \"Also, training users to these types of threats is important.\"Darren Guccione, CEO and co-founder at Keeper Security, says potential targets should also be trained to recognize that, unlike phishing attempts that appear to come from random businesses or the government, the malicious file containing malware will appear to come from someone you've had past email conversations with.\"The threat actors hope to piggyback on your relationship and level of trust to get these contacts to download the files,\" he explains. \"Employees should avoid making risky clicks. Suspicious links should not be clicked and untrusted software should not be installed.\"Other email security best practices include verifying the email sender and content before downloading attachments, and hovering over embedded links to see the actual target URL. Also, defenders also should focus on making sure antivirus and anti-malware solutions are deployed and up to date, and secure endpoints, including PCs, servers, routers, and so on, keeping them patched.Guccione says the latest resurgence of QBot, along with new modules and evasion techniques being added, indicates active development of the malware, so companies should be vigilant when it comes to being prepared for the latest changes.\"It’s still a very capable adversary tool that defenders need to protect against,\" Guccione explains.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-19",
      "title": "Researchers Discover First-Ever Major Ransomware Targeting macOS",
      "text": " Ransomware for Mac may raise alarm bells, though a closer examination of the binary reveals that it's not quite ready for prime time.However, he adds, \"I think this should be looked at as a harbinger of things to come. You have a very well funded and motivated, large ransomware group that's saying: 'Hey, we're setting our sights on on macOS.'\"Will Mac users be ready when ransomware finally comes for them?Saturday's discovery may be best characterized as Windows malware with macOS lipstick.In unpacking the code, Wardle discovered multiple strings related to Windows artifacts — like autorun.inf, ntuser.dat.log, and so on. The lone component indicating its OS intentions was a variable called \"apple_config.\"\"This is the only instance (I found) of any macOS specific references/customizations,\" Wardle noted in the analysis, appending that \"(The rest of the malware's binary simply looks like Linux code, compiled for macOS).\"There were other signs, too, that the developers hadn't yet completed their project. For example, the code was signed \"ad-hoc\" — a stand-in for, say, a stolen Apple Developer ID. This could be a placeholder for future RaaS customers, but for now, Wardle explains, \"this means if downloaded to a macOS system (i.e. deployed by the attackers) macOS won't let it run.\"Suffice it to say: LockBit hasn't breached the Apple dam just yet. But that doesn't mean Mac users can relax.\"Look at, traditionally, who the targets are for large ransomware attacks. It's the enterprises: hospitals, packaging facilities, these more traditional companies,\" Wardle points out. \"They are generally Windows-based.\"\"The pandemic and the work from home really spurred that,\" Wardle postulates. \"A lot of people have Mac computers. And as the younger generation enters the workforce — they are more comfortable with the Apple ecosystem.\"Following from that, he adds, \"hackers who are very opportunistic are realizing that a lot of their potential victims are now transitioning, and thus they need to evolve their malicious creations.\"So the question may not be whether ransomware groups will jump into macOS, but how soon. \"This,\" Wardle thinks, \"is really the million-dollar question.\"Luckily for Mac users, Apple has anticipated this ransomware D-Day, and has proactively gotten ahead of it. Wardle points to two primary defenses already built into the operating system.Firstly, he says, \"system files are under read-only conditions. So even if ransomware gets root access on a computer, it's still not going to be able to modify those critical files and lock or render the system inoperable.\"Second is TCC — short for Transparency, Consent, and Control.\"The idea is that certain directories — for example, the user's document directory, desktop, downloads, their browser folders, and cookies — are actually protected by the operating system,\" Wardle explains. If ransomware finds its way onto the system, \"it's going to run into TCC and it's not going to be able to access the files it wants to encrypt, without either another exploit or getting the user to explicitly approve the access.\"There's a caveat to that happy news though. \"Apple has done a great job implementing security mechanisms, but,\" Wardle warns, \"these features haven't been really tried and tested yet. Maybe hackers will start poking and find some flaws. TCC, for example, has been riddled with bypasses basically since day one.\"\"It would be naive to think that the attackers aren't going to improve their techniques and create more effective ransomware,\" he concludes. \"So, I think it's really great to be talking about this now.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-19",
      "title": "Goldoson Android Malware Infects Over 100 Million Google Play Store Downloads",
      "text": " A new Android malware strain named Goldoson has been detected in the official Google Play Store spanning more than 60 legitimate apps that collectively have over 100 million downloads.An additional eight million installations have been tracked through ONE store, a leading third-party app storefront in South Korea.The rogue component is part of a third-party software library used by the apps in question and is capable of gathering information about installed apps, Wi-Fi and Bluetooth-connected devices, and GPS locations.Following responsible disclosure to Google, 36 of the 63 offending apps have been pulled from the Google Play Store. The remaining 27 apps have been updated to remove the malicious library.Some of the prominent apps include -The findings highlight the need for app developers to be transparent about the dependencies used in their software, not to mention take adequate steps to safeguard users' information against such abuse.\"Attackers are becoming more sophisticated in their attempts to infect otherwise legitimate applications across platforms,\" Kern Smith, vice president of sales engineering for the Americas at Zimperium, said.\"The use of third-party SDKs and code, and their potential to introduce malicious code into otherwise legitimate applications is only continuing to grow as attackers start to target the software supply chain to gain the largest footprint possible.\"A Google spokesperson told The Hacker News that it takes necessary action \"when we find apps that violate our policies\" and that it notified developers to implement necessary fixes to bring the apps into compliance.It's also designed to display rogue overlays on top of a specific list of apps, intercept SMS messages, and even comprises an unused functionality that allows it to download and execute another payload.Chameleon, true to its name, has a penchant for evasion by incorporating anti-emulation checks to detect if the device is rooted or it's being executed in a debugging environment, and if so, terminate itself.To mitigate such threats, users are recommended to only download apps from trusted sources, scrutinize app permissions, use strong passwords, enable multi-factor authentication, and exercise caution when receiving SMS or emails from unknown senders.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-04-19",
      "title": "Takedown of GitHub Repositories Disrupts RedLine Malware Operations - SecurityWeek",
      "text": " Hi, what are you looking for?Four GitHub repositories used by RedLine stealer control panels were suspended, disrupting the malware’s operations.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...The NSA and FBI warn that a Chinese state-sponsored APT called BlackTech is hacking into network edge devices and using firmware implants to silently...No one combatting cybercrime knows everything, but everyone in the battle has some intelligence to contribute to the larger knowledge base.Virtualization technology giant VMware on Tuesday shipped urgent updates to fix a trio of security problems in multiple software products, including a virtual machine...Unpatched and unprotected VMware ESXi servers worldwide have been targeted in a ransomware attack exploiting a vulnerability patched in 2021.Threat actors are increasingly abusing Microsoft OneNote documents to deliver malware in both targeted and spray-and-pray campaigns.The recent ransomware attack targeting Rackspace was conducted by a cybercrime group named Play using a new exploitation method, the cloud company revealed this...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2023-04-19",
      "title": "\r\n\tMuddyWater Uses SimpleHelp to Target Critical Infrastructure Firms - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe Iranian government-sponsored threat actor known as MuddyWater has been observed using the legitimate SimpleHelp remote support software tool to achieve persistence on victim devices.“According to our data, MuddyWater used SimpleHelp for the first time on June 30 2022. At the time of writing, the group has at least eight servers on which they have SimpleHelp installed,” explained Group-IB senior threat analyst Nikita Rostovtsev.The SimpleHelp client installed on victim devices can be run constantly as a system service, enabling attackers to access the user’s device at any point, including after a reboot.“In addition to connecting remotely, SimpleHelp operators can execute various commands on the victim’s device, including those that require administrator privileges,” Rostovtsev said. “SimpleHelp operators can also use the command ‘Connect in Terminal Mode’ to take control of the target device covertly.”Group-IB clarified that the initial infection method is currently unknown, but the team suspects it may be phishing. Rostovtsev also explained that, during the latest analysis of MuddyWater, Group-IB discovered previously unknown infrastructure and some publicly known IP addresses used by the attackers.“Information security specialists can use the ETag hashes mentioned in this article and search for malicious servers using search engines such as Censys or Shodan,” the security expert explained."
   },
   {
      "time": "2023-04-19",
      "title": "New 'Domino' Malware Linked to FIN7 Group, Ex-Conti Members - SecurityWeek",
      "text": " Hi, what are you looking for?New Domino backdoor brings together former members of the Conti group and the FIN7 threat actors.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...The NSA and FBI warn that a Chinese state-sponsored APT called BlackTech is hacking into network edge devices and using firmware implants to silently...No one combatting cybercrime knows everything, but everyone in the battle has some intelligence to contribute to the larger knowledge base.Virtualization technology giant VMware on Tuesday shipped urgent updates to fix a trio of security problems in multiple software products, including a virtual machine...Unpatched and unprotected VMware ESXi servers worldwide have been targeted in a ransomware attack exploiting a vulnerability patched in 2021.Threat actors are increasingly abusing Microsoft OneNote documents to deliver malware in both targeted and spray-and-pray campaigns.The recent ransomware attack targeting Rackspace was conducted by a cybercrime group named Play using a new exploitation method, the cloud company revealed this...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2023-04-19",
      "title": "Exposed Web Panel Reveals Gamaredon Group's Automated Spear Phishing Campaigns",
      "text": " Get the most out of your EclecticIQ cybersecurity solutions.Master the art of cyber threat intelligence and intelligence-led cyberdefense.Explore our world-class partners – or learn about our partner program.Power your CTI practice with analyst-centric threat intelligence solutions.Go beyond the IOC to augment your SOC in defense of your organization.Learn how EclecticIQ can help you address your specific challenges – by team and by need – and improve your overall security posture.Provide your CTI team with the automation, performance, flexibility, and integrations needed to supercharge their CTI operations with our range of analyst-centric products and services.Enable your SOC team to better operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.Improve your situational awareness and mitigate risk with our collection of analyst-centric threat intelligence products and services.Operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.An ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with collaborative partner programs delivering world-class joint solutions. Partner with EclecticIQ to bring valuable and innovative security solutions and services to end users. Open to all partner types, including technology developers, service providers, resellers, and community.We partner with the world's premier technology and solution providers to support all phases of your cybersecurity needs. Explore all our partners' solutions and offerings to build and extend your cyber defense ecosystem.We are committed to increasing the knowledge and capabilities of the cybersecurity community through our research & analysis efforts and open source projects.Learn more about our technology, solutions and services, and stay updated on the cyber threat landscape with our research reports, webinars and other information.We are proud to be an active member in the open source community and to help develop and advance progress of security technology. Learn more about contributions or go directly to our GitHub page.Get the most out of your EclecticIQ cybersecurity solutions.Master the art of cyber threat intelligence and intelligence-led cyberdefense.Explore our world-class partners – or learn about our partner program.Power your CTI practice with analyst-centric threat intelligence solutions.Go beyond the IOC to augment your SOC in defense of your organization.Learn how EclecticIQ can help you address your specific challenges – by team and by need – and improve your overall security posture.Provide your CTI team with the automation, performance, flexibility, and integrations needed to supercharge their CTI operations with our range of analyst-centric products and services.Enable your SOC team to better operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.Improve your situational awareness and mitigate risk with our collection of analyst-centric threat intelligence products and services.Operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.An ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with collaborative partner programs delivering world-class joint solutions. Partner with EclecticIQ to bring valuable and innovative security solutions and services to end users. Open to all partner types, including technology developers, service providers, resellers, and community.We partner with the world's premier technology and solution providers to support all phases of your cybersecurity needs. Explore all our partners' solutions and offerings to build and extend your cyber defense ecosystem.We are committed to increasing the knowledge and capabilities of the cybersecurity community through our research & analysis efforts and open source projects.Learn more about our technology, solutions and services, and stay updated on the cyber threat landscape with our research reports, webinars and other information.We are proud to be an active member in the open source community and to help develop and advance progress of security technology. Learn more about contributions or go directly to our GitHub page.Get the most out of your EclecticIQ cybersecurity solutions.Master the art of cyber threat intelligence and intelligence-led cyberdefense.Explore our world-class partners – or learn about our partner program.Power your CTI practice with analyst-centric threat intelligence solutions.Go beyond the IOC to augment your SOC in defense of your organization.Learn how EclecticIQ can help you address your specific challenges – by team and by need – and improve your overall security posture.Provide your CTI team with the automation, performance, flexibility, and integrations needed to supercharge their CTI operations with our range of analyst-centric products and services.Enable your SOC team to better operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.Improve your situational awareness and mitigate risk with our collection of analyst-centric threat intelligence products and services.Operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.An ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with collaborative partner programs delivering world-class joint solutions. Partner with EclecticIQ to bring valuable and innovative security solutions and services to end users. Open to all partner types, including technology developers, service providers, resellers, and community.We partner with the world's premier technology and solution providers to support all phases of your cybersecurity needs. Explore all our partners' solutions and offerings to build and extend your cyber defense ecosystem.We are committed to increasing the knowledge and capabilities of the cybersecurity community through our research & analysis efforts and open source projects.Learn more about our technology, solutions and services, and stay updated on the cyber threat landscape with our research reports, webinars and other information.We are proud to be an active member in the open source community and to help develop and advance progress of security technology. Learn more about contributions or go directly to our GitHub page.Get the most out of your EclecticIQ cybersecurity solutions.Master the art of cyber threat intelligence and intelligence-led cyberdefense.Explore our world-class partners – or learn about our partner program.Power your CTI practice with analyst-centric threat intelligence solutions.Go beyond the IOC to augment your SOC in defense of your organization.Learn how EclecticIQ can help you address your specific challenges – by team and by need – and improve your overall security posture.Provide your CTI team with the automation, performance, flexibility, and integrations needed to supercharge their CTI operations with our range of analyst-centric products and services.Enable your SOC team to better operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.Improve your situational awareness and mitigate risk with our collection of analyst-centric threat intelligence products and services.Operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.An ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with collaborative partner programs delivering world-class joint solutions. Partner with EclecticIQ to bring valuable and innovative security solutions and services to end users. Open to all partner types, including technology developers, service providers, resellers, and community.We partner with the world's premier technology and solution providers to support all phases of your cybersecurity needs. Explore all our partners' solutions and offerings to build and extend your cyber defense ecosystem.We are committed to increasing the knowledge and capabilities of the cybersecurity community through our research & analysis efforts and open source projects.Learn more about our technology, solutions and services, and stay updated on the cyber threat landscape with our research reports, webinars and other information.We are proud to be an active member in the open source community and to help develop and advance progress of security technology. Learn more about contributions or go directly to our GitHub page.EclecticIQ analysts identified a spear phishing campaign targeting Ukrainian government entities like the Foreign Intelligence Service of Ukraine (SZRU) and Security Service of Ukraine (SSU), likely conducted by APT group Gamaredon.On February 09, 2023, EclecticIQ analysts identified a spear phishing campaign targeting Ukrainian government entities like the Foreign Intelligence Service of Ukraine (SZRU) and Security Service of Ukraine (SSU). Analysts identified a publicly exposed Simple Mail Transfer Protocol (SMTP) server and assess with high confidence that the threat actor used the SMTP server to craft and deliver phishing emails.  The SMTP server contained a web panel designed to create and distribute spear phishing emails. It enables the email to have a malicious attachment and leverages email spoofing techniques to make it appear from a legitimate source.Observed adversary tactics, techniques, and procedures (TTPs), victimology, and infrastructure found in the SMTP server configuration overlap with previously identified Gamaredon activity.Gamaredon APT group is believed to be a Russian State-backed threat group linked to the Federal Security Service (FSB). Gamaredon is known for its cyberespionage activities, primarily targeting Ukrainian government entities. The group uses spear phishing emails and social engineering lures as a primary tactic.The threat actor used a generic web panel to craft and send phishing emails against Ukrainian government entities. This allowed the actor to automate the malware delivery process against specific targets entered by the attackers in the email recipient section of the panel's user interface.  Pivoted IP addresses overlap with previously reported Gamaredon activity (8).  EclecticIQ analysts discovered a publicly facing SMTP server 194[.]180[.]191[.]56 used in a spear phishing campaign against Ukrainian government entities in February 2023. The exposed SMTP server hosts a web panel for crafting and delivering spear phishing emails. Analysts assess with high confidence that the threat actor used this infrastructure to send large number of spear phishing emails automatically. Figure 1 shows two example phishing emails sent from the server:  Figure 1 - Example of phishing emails with malicious attachment sent in in February 2023.EclecticIQ analysts identified these two different spear-phishing emails sent from 194[.]180[.]191[.]56. Both of these emails contain a RAR archive file as an attachment, which are used to deliver the initial malware. Figures 2 and 3 showed two different malware execution flows, sent on Wed, 15 Feb 2023 17:10:18 +0200 and Wed, 08 Feb 2023 17:15:44 which are identical to previous Gamaredon campaigns (1).Figure 2 - Spear phishing email sent on Wednesday, 15 February 2023.Figure 3 - Spear phishing email sent it on Wednesday, 8 February 2023.Figure 4 shows the origin of the phishing email and spoofed email address:  Figure 4 - Source of phishing email.The server had port 80 open for use by the threat actor for crafting spear phishing emails via a simple user interface seen in figure 5.  Figure 5 - Web panel translated from Russian to English.The web panel allowed the threat actor to send emails using the hardcoded sender address pivn-kr@prokuratura[.]dp[.]ua. EclecticIQ analysts identified the same email address in a recent phishing email campaign sent to a Ukrainian military address on February 9, 2023 (5), indicating that the exposed panel was very likely used for malware delivery.EclecticIQ analysts identified that the “.htaccess” file on the exposed SMTP server was misconfigured. The ”.htaccess” file is a directory-level configuration to limit access to a web server from trusted IP addresses only. According to the Apache documentation, users must insert all IP filters inside the \"<RequireAll>\" tag (7). However, this tag was missing in the configuration used by threat actor.Analysts identified five IP addresses in the “.htaccess” file (figure 6):Figure 6 – Reconnaissance with gobuster (6) and pivoting.  The majority of the pivoted IP addresses are located in Moscow, Russia from the same server provider, Crelcom LLC (AS 6789). WHOIS records show that one of the IP addresses - 109[.]200[.]159[.]46 - was registered under the name Michael Tishin. The same name is also listed as registrant for another IP - 109[.]200[.]159[.]54. This IP was attributed to Gamaredon by BlackBerry on January 19, 2023 (8).The adversary TTPs and victimology overlap with Gamaredon activity previously reported by EclecticIQ and other researchers starting in 2020 (1).EclecticIQ analysts identified one IP address 109[.]200[.]159[.]59 in the “.htaccess” file that links to a spear phishing email submitted to VirusTotal on November 20, 2020. In May 2022, Cisco reported the campaign and attributed the activity to Gamaredon (2, 4).Figure 7 shows the connection between the pivoted IP addresses and malicious files uploaded to VirusTotal. The IP address links to a spear phishing email with a malicious attachment. The attachments exploit CVE-2017-0199, a Microsoft Office remote code execution vulnerability in Windows.Figure 7 – Link analysis for 109[.]200[.]159[.]59.Figure 8 shows that spear phishing email was sent to the Security Service of Ukraine (SSU) on November 19, 2020. It contained a malicious Word document attachment used for malware delivery. The email sender section was spoofed by threat actors to make the email look legitimate.Figure 8 – Content of the phishing email.Figure 9 displays the metadata of the spear phishing email. The \"X-Sender-IP\" field in the metadata reveals the IP address 109[.]200[.]159[.]59 of the sender. This IP address does not match the domain name (i.ua) in the “From” field, proving it is a spoofed email.Figure 9 – Metadata section inside phishing email.Once a victim opens the delivered malicious Word document, it will exploit CVE-2017-0199. If the exploitation is successful, then it will download a second-stage malware from the domain  erythrocephala[.]online, which has been attributed to Gamaredon.EclecticIQ analysts assess with high confidence that Russian government-linked APTs will continue to use social engineering tactics during cyberattacks against Ukraine. Additionally, they are expected to increasingly target NATO partners due to NATO's support of Ukraine during the Russian war.It is very likely that the threat actor will modify their TTPs to avoid detection that will increase their chances of success, especially during the malware delivery stage."
   },
   {
      "time": "2023-04-19",
      "title": "Cyber Espionage in India: Decoding APT-36's New Linux Malware Campaign",
      "text": " KuppingerCole positions Uptycs a CSPM Technology LeaderKuppingerCole positions Uptycs a CSPM Technology LeaderThe Uptycs threat research team has discovered a new Linux malware, Poseidon, deployed by the APT-36 group, also known as Transparent Tribe. This Pakistan-based advanced persistent threat group is notorious for targeting Indian government organizations, military personnel, and defense contractors. Transparent Tribe used the Kavach authentication tool as a cover to deliver the Poseidon payload. Kavach is a two-factor authentication (2FA) solution provided by the Indian government for secure access to their email services. Transparent Tribe created a backdoored version of Kavach to target Linux users working for Indian government agencies. When a user interacts with the malicious version of Kavach, the genuine login page is displayed to distract them. Meanwhile, the payload is downloaded in the background, compromising the user's system. Poseidon is a second-stage payload malware associated with Transparent Tribe. It is a general-purpose backdoor that provides attackers with a wide range of capabilities to hijack an infected host. Its functionalities include logging keystrokes, taking screen captures, uploading and downloading files, and remotely administering the system in various ways. Primarily, Poseidon is distributed through malicious websites disguised as legitimate Indian government sites. Uptycs research found that the malware infrastructure, such as malicious domains, is linked to earlier APT-36 campaigns. This highlights the group's continued focus on the aforementioned Indian targets. Repercussions of this APT-36 attack could be significant, leading to loss of sensitive information, compromised systems, financial losses, and reputational damage. Moreover, as the Transparent Tribe is thought to be state-sponsored, its activities could escalate tensions between nations, potentially resulting in retaliatory cyberattacks. This highlights the importance of implementing robust cybersecurity measures and remaining vigilant against the ever-evolving threat landscape. APT-36, aka Transparent Tribe, primarily targets Indian government organizations, military personnel, and defense contractors. Its objective is usually to gather sensitive information, conduct cyber espionage, and compromise the security of its targets.APT-36 is known to have exploited various platforms, including Windows and Android. The bad actors often create fake websites and documents that mimic legitimate government entities or organizations. This can trick targeted users into revealing their credentials or downloading malware onto their systems. It has also used custom-developed malware such as the Crimson RAT (remote access trojan) for cyber espionage.Users can protect themselves by following these best practices: The Uptycs threat research team has uncovered an ELF malware sample (MD5: c82bf2c50900b89b66e9f62d68c415ab). It’s a compiled Python executable (Pyinstaller) of nearly 5 MB in size.Upon extraction, a possible entry point is at Kavach.pyc (Fig. 1). Next we’ll decompile it to produce its source code.Fig. 1 – Extraction of .pyc files from pyinstaller executable Seen in the Fig. 2 Python code, the ELF file distracts the user by opening the legitimate Kavach login page (Fig. 3). This is where 2FA is provided to Indian users wanting to access their government email service. But in the background, a malicious “bosshelp” file is downloaded from hxxps://sharing1[.]filesharetalk.com/bosshelp to the user’s ~/.local/share directory.Fig. 2 – Decompiled Python code This creates a crontab to periodically log the victim's machine “loginname” in /dev/shm/mycron.Fig. 3 – Legitimate Kavach login page to trick users Let's now examine the “bosshelp” second stage payload. “Checkin” keywordProcess nameOSPIDIP AddressHostnameUUID“Amd64aring” keyword(The integrity level is 3 if the process is elevated; otherwise it’s level 2.) Fig. 4 – C2 check-in The C2 was offline during our analysis. But the binary contained a switch case (Fig. 5) having a number of tasks (e.g., keylogging, injecting, screen capture, uploading/downloading files). Each task is associated with a TaskID shown in the following table.Fig. 5 – Switch case to perform various tasks COMMAND CODE (DECIMAL)TASKDESCRIPTION4ShellExecute shell commands5Screencapture_runTake a screenshot of victim’s desktop6Keylog_RunLogging keystrokes7DownloadDownload file from remote system8UploadUpload file to remote machine9LibInjectInject a library10Ps_runList processes running on machine11Sleep_runSleep time12cat_runRead contents inside the file13cd_runChange directory14lsList contents inside the directory15jxa_runJavascript for automation16keys_runRetrieve keys from Kerberos keychain17triagedirectorySearch target directory18sshauthAuthenticate to host using username and password pair19portscanScan target for open ports20main.getJoblistingGet list of current running jobs21main.killJobKill a process with given PID22cp_runCopy a file23drives_runList currently mounted drives along with their description24getuser_runList information about current user25mkdirCreate directory.26mvMove a file27pwdPrint working directory28rmDelete a file29getenvRetrieve current environment variables30setenvSet environment variables31unsetenvDelete environment variable32kill_runKill process with given PID33curl_runExecute curl command34xpc_runCross-process communication35socksSupport for SOCKS proxies36listtask_runGet list of running tasks37list_entitlements_RunList entitlements (permissions associated with a particular PID)38Execute_memoryExecute shellcode directly from the memory39jsimport_runTo load specified javascript module43dyld_inject_RunInject dynamic library This payload serves as an all-purpose backdoor. An attacker can use it to take control of an infected host, record keystrokes, insert new stages, launch screen captures, or remotely monitor computers in a variety of ways using above commands. Fig. 6 – DNS replication of sharing1[.]filesharetalk.com The next table shows suspicious domains masquerading as various government sites hosted on the same IP (153.92.220.48). All were used in earlier APT-36 campaigns. SUSPICIOUS DOMAINSLEGIT DOMAINSOTHER AV DETECTIONS FOR SUSPICIOUS DOMAINSgovscholarships[.]inscholarships.gov.in3kavach-app[.]inkavach.mail.gov.in11supremo-portal[.]insupremo.nic.in6 MD5:382285738bae358060011ad847e845d2 (Name: confirmationId_ksb) masquerades as the Kendriya Sainik board site as seen in Fig.7Suspicious Site present in the malicious pyinstaller file: www[.]ksboard[.]inLegit site: ksb[.]gov[.]in.MD5:02796a813b79928c95b2475798a14688(Name:confirmationId_rodra) masquerades as RODRA (Retired Officers Digital Records Archive) as seen in Fig 8.Suspicious Site present in the malicious pyinstaller file: www[.]rodra[.]in. The legitimate site is rodra[.]gov[.]in. Fig. 7 – Decompiled Python code from malicious pyinstaller confirmationId_ksb Fig. 8 – Decompiled Python code from malicious pyinstaller confirmationId_rodra Transparent Tribe is an APT group that targets users working within the Indian government. It has previously executed many payloads in Windows and Android. Now APT 36 has started targeting Linux users, too. Sites such as Kavach, Rodra, and KSB were used in social engineering attacks to trick targeted users. Users should be extremely careful and double-check URLs before opening or downloading files. We could see new features/advancements from this APT group in the future. The Uptycs threat research team continuously monitors related malware campaigns to safeguard our clients and inform the broader security community. In addition to having YARA built-in and being armed with other advanced detection capabilities, Uptycs XDR users can easily scan for Poseidon. XDR contextual detection provides important details about identified malware. Users can navigate to the toolkit data section in the detection alert, then click a detected item to reveal its profile (Fig. 9). Fig. 9 – Uptycs EDR detection   File NameMD5Kavachc82bf2c50900b89b66e9f62d68c415abconfirmationId_ksb382285738bae358060011ad847e845d2confirmationId_rodra02796a813b79928c95b2475798a14688Bosshelpaeb3ad3426794d4e90de4d139e92ee4dBossstart21316422f8c7f0f3ab2b9a282cdacd03Bosstype7b163e400e481519d74e06c1116a5200Kavachelf9b64528352dd683e55eb308919a596fa sharing1[.]filesharetalk.com/bosshelpksboard[.]inrodra[.]intt1[.]apktrial[.]com70[.]34[.]214[.]252Get regular updates on all things Uptycs—from product updates to expert articles and much more"
   },
   {
      "time": "2023-04-18",
      "title": "Payments Giant NCR Hit by Ransomware - SecurityWeek",
      "text": " Hi, what are you looking for?US payments giant NCR has confirmed being targeted in a ransomware attack for which the BlackCat/Alphv group has taken credit.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.A SaaS ransomware attack against a company’s Sharepoint Online was done without using a compromised endpoint.Several major organizations are confirming impact from the latest zero-day exploits hitting Fortra's GoAnywhere software.Industry professionals comment on the recent disruption of the Hive ransomware operation and its hacking by law enforcement.KFC and Taco Bell parent company Yum Brands says personal information was compromised in a January 2023 ransomware attack.Unpatched and unprotected VMware ESXi servers worldwide have been targeted in a ransomware attack exploiting a vulnerability patched in 2021.The recent ransomware attack targeting Rackspace was conducted by a cybercrime group named Play using a new exploitation method, the cloud company revealed this...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2023-04-18",
      "title": "New LockBit variant targets MacOS, another relies on Conti source code | SC Media",
      "text": "  A screen image of the ransom by the LockBit ransomware group. (Image provided by Recorded Future)LockBit, known for the effective evolution of its tactics, has again modified its variant. In one instance, the ransomware strain was seen targeting Mac devices — the first of its kind for a major ransomware operation.However, Wardle was quick to point out that while the fresh LockBit sample can indeed run on Apple products, “it’s basically the extent of its impact.” As noted, “The codesign utility shows that though it’s signed, it’s signed 'ad-hoc' (say vs. an Apple Developer ID).”“This means if downloaded to a macOS system, i.e. deployed by the attackers, macOS won’t let it run,” Wardle explained. “This is confirmed by the spctl utility which shows ‘invalid signature.’” The sample also suggests that it was initially designed to run on Windows. In fact, several sample strings contained nothing that specifically related to MacOS, which may mean the “code is simply a recompile of LockBit ransomware that targets Windows, Linux, and also VMWare ESXi.So while it’s notable that a LockBit sample has been found targeting MacOS, it’s unlikely the current variant will impact the average user, Wardle stressed. What’s important is to maintain ongoing conversations about detection and prevention of these kinds of threats.In another fresh campaign, the ransomware appears to rely on the source code of Conti, another highly effective variant. After Conti was disbanded in May 2021, an affiliate leaked the source code of the group that enabled other cybercrime groups to recover the code for future use.TrickBot was previously employed by the Conti group, which reaffirms the connection. But the BazaLoader tie “is a little more subtle.” Like Lockbit, the group has also been observed using the leaked Conti code.Glimps was also able to examine LockBit’s payment portal and the group’s ransom note, which found evidence of multiple fresh LockBit variants. The ransom note structure bore similarities to previous variants, while the newly detected strains rely on a string of random characters instead of the .lockbit extension.“The different results produced by the analyzes… confirm what we initially thought: We are indeed faced with variants of Lockbit that shamelessly rely on Conti code, the Lockbit Green version,” researchers wrote.Most recently, data showed LockBit was leveraging a ransomware-as-a-service (RaaS) model to continue its previous campaigns, which have effectively hindered traditional computer network defenses and mitigation.Known as LockBit Black, the variant was “more modular and evasive” than previous versions. Much like the Glimps’ findings, LockBit Black shares similarities with Black Matter and Black Cat ransomware.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.After admitting responsibility for compromising Sony, a Colonial Pipeline supplier, and a Hawai'i government site, the RansomedVC group has claimed that it will be ending operations due to the arrests of six of its affiliates, reports The Record, a news site by cybersecurity firm Recorded Future.U.S. advanced electronic components manufacturer Kyocera AVX Components Corporation has disclosed that 39,111 individuals around the world had their data compromised following a ransomware attack earlier this year, which has been claimed by the LockBit ransomware operation, reports BleepingComputer.Attack on the U.S. subsidiary of the Industrial & Commercial Bank of China disrupted Treasury trading in New York earlier this week.  Tue Jun 25Thu Dec 14Thu Nov 16   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-04-18",
      "title": "Ex-Conti members and FIN7 devs team up to push new Domino malware",
      "text": " Ex-Conti ransomware members have teamed up with the FIN7 threat actors to distribute a new malware family named 'Domino' in attacks on corporate networks.Domino is a relatively new malware family consisting of two components, a backdoor named 'Domino Backdoor,' which in turn drops a 'Domino Loader' that injects an info-stealing malware DLL into the memory of another process.IBM's Security Intelligence researchers have been tracking ex-Conti and TrickBot members utilizing the new malware in attacks since February 2023.It should be noted that this new malware is unrelated to the HCL Domino (formerly IBM Domino) product.Since the fall of 2022, IBM researchers have been tracking attacks using a malware loader named 'Dave Loader' that is linked to former Conti ransomware and TrickBot members.However, more recently, IBM says they have seen Dave Loader installing the new Domino malware family.Most commonly, Dave Loader would drop 'Domino Backdoor,' which would then install 'Domino Loader.'Domino Backdoor is a 64-bit DLL that will enumerate system information, such as running processes, usernames, computer names, and send it back to the attacker's Command and Control server. The backdoor also receives commands to execute or further payloads to install.The backdoor was seen downloading an additional loader, Domino Loader, that installs an embedded .NET info-stealer called 'Nemesis Project.' It can also plant a Cobalt Strike beacon, for greater persistence.\"The Domino Backdoor is designed to contact a different C2 address for domain-joined systems, suggesting a more capable backdoor, such as Cobalt Strike, will be downloaded on higher value targets instead of Project Nemesis,\" explains the IBM researchers Charlotte Hammond and Ole Villadsen.Project Nemesis is a standard information-stealing malware that can collect credentials stored in browsers and applications, cryptocurrency wallets, and browser history.Threat actors, especially those who utilize ransomware, commonly partner with other threat groups to distribute malware and for initial access to corporate networks.Over time, the lines between the malware developers and the ransomware gangs have grown murky, making distinguishing between the two operations hard.IBM has attributed the Domino malware family to FIN7 due to a great deal of code overlap with Lizar (aka Tirion and DiceLoader), a post-exploitation toolkit associated with FIN7.Furthermore, IBM found that a loader named 'NewWorldOrder,' normally used in FIN7's Carbanak attacks, was recently used to push the Domino malware.So, in a confusing joint venture, we have Dave Loader (TrickBot/Conti) pushing the Domino (FIN7) malware, which in turn deploys Project Nemesis or Cobalt Strike beacons believed to be associated with ex-Conti member ransomware activity.This means that defenders have to deal with a confusing web of threat actors, all with malware allowing remote access to networks."
   },
   {
      "time": "2023-04-18",
      "title": "Israeli Spyware Vendor QuaDream to Shut Down Following Citizen Lab and Microsoft Expose",
      "text": " Israeli spyware vendor QuaDream is allegedly shutting down its operations in the coming days, less than a week after its hacking toolset was exposed by Citizen Lab and Microsoft.The company's board of directors are looking to sell off its intellectual property, the report further added.Microsoft described REIGN as a \"suite of exploits, malware, and infrastructure designed to exfiltrate data from mobile devices.\"The attacks entailed the exploitation of a now-patched flaw in iOS to deploy sophisticated surveillanceware capable of surreptitiously gathering sensitive information, including audio, pictures, passwords, files, and locations.Apple told The Hacker News last week that there was no indication to suggest that the exploit, codenamed ENDOFDAYS, had been put to use since the company released iOS 14.4.2 in March 2021.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-04-18",
      "title": "Payments giant says it is investigating ransomware incident that caused POS outage",
      "text": " Payment processing giant NCR disclosed a ransomware attack this weekend that caused an outage on its point of sale technology used widely by restaurants.The company told Recorded Future News that it discovered the ransomware attack on April 13, when a data center outage impacted some of their customers.The incident affected the company’s Aloha service – which provides restaurants with a system to manage point of sale hardware, online orders, marketing tools and more. NCR says the service is used by thousands of restaurants around the world.“Upon such determination, NCR immediately started contacting customers, enacted its cybersecurity protocol and engaged outside experts to contain the incident and begin the recovery process. The investigation into the incident includes NCR experts, external forensic cybersecurity experts and federal law enforcement,” a spokesperson said.“We believe this incident is limited to specific functionality in Aloha cloud-based services and Counterpoint. At this time, our ongoing investigation also indicates that no customer systems or networks are involved. None of our ATM, digital banking, payments, or other retail products are processed at this data center.”The spokesperson confirmed that the ransomware attack has impacted the ability of several restaurants to manage administrative functions. The company is now working on creating alternatives for those customers and restoring the impacted tools.On April 15, cybersecurity expert Dominic Alvieri said the BlackCat/AlphV ransomware group took credit for the attack, posting the company on its leak site.The group shared alleged messages between NCR representatives and BlackCat hackers, claiming that while no data was stolen during the attack, they were able to steal credentials that customers use to access their systems.NCR reported a revenue of more than $7 billion in 2021 through the sale of self-service kiosks, point-of-sale terminals, automated teller machines, check processing systems, and barcode scanners.The company, initially known as National Cash Register, was created in 1879 to sell the first mechanical cash register.Bugcrowd CEO Dave Gerry said point of sale systems remain an attractive target for hackers “given the business criticality of both the customer payment data and broader impact to business operations.”“This is a timely example reinforcing that cyberattacks impact more than just the primary target – in this case potentially thousands of small businesses that rely on the NCR Aloha POS Platform,” he said.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-04-18",
      "title": "Malware variant ‘Legion’ abuses AWS, PayPal, Stripe cloud in spam attacks | SC Media",
      "text": "  A simple mail transfer protocol (SMTP) abuse tool dubbed Legion can scan Shodan to identify misconfigured cloud servers and then take over SMTP email marketing programs or launch phishing campaigns.Legion can also send SMS text messages to launch mobile-based phishing and disinformation campaigns and has targeted 14 different telecoms, including AT&T, Sprint, T-Mobile, and Verizon. It can also bundle additional functionality traditionally found in more common hacking tools, such as the ability to execute web server specific exploit code and brute force account credentials. Matt Muir, a threat intelligence researcher at Cado, said security administrators can neutralize Legion by making sure their environment files are not exposed to the public internet. “Environment files are text files used to store credentials,” explained Muir. “By securing the environment files there’s not much Legion can do. Admins have to make sure that the environment files are not located in a directory that’s exposed to the internet.”Muir said Cado researchers consider Legion an emerging generation of cloud-focused credential harvester/spam utilities. Developers of these tools often steal each other's code, making attribution to a particular group difficult.“Mail and SMS abuse are big business for attackers,” wrote Ahl. “We have come across close to a dozen variants of similar scripts that are being sold regularly for nefarious purposes. Legion is not the first nor will it be the last.”The Telegram groups used to distribute Legion have a combined membership of about 5,000. Muir said although we can assume not everybody in these groups will purchase a license for the software, it’s clear that there’s now considerable demand for such a tool.“If even half of the members purchased a license and used the SMTP abuse capabilities for spam or phishing purposes, I don’t think it’s unreasonable to assume that tens of thousands of users would be affected,” said Muir, who also footnoted that at the time the blog was written, Cado researchers had seen zero detections on VirusTotal.“Attackers often look to get access to an API using credentials or tokens obtained through nefarious means,” said Rago. “Once they gain the valid privileged credential or token, the attacker can leverage the API to exfiltrate data or compromise a service.”Davis McCarthy, principal security researcher at Valtix, added that Legion automates real world tactics, techniques and procedures at scale, reducing the threat actors time to initial access. McCarthy explained that if the hacker can’t exploit the target organization’s infrastructure remotely, then there are options to brute-force AWS credentials and set up phishing campaigns with Amazon SES.“The AWS module also tags newly created malicious users, working as a defense evasion technique and establishing legitimacy,” said McCarthy. “Even target reconnaissance is made easy by integrating with Shodan.”U.S. cloud data analytics and log analysis firm Sumo Logic has confirmed discovering a potential security incident after its Amazon Web Services account was accessed using stolen credentials, reports TechCrunch.Transitioning to cloud-native environments has brought along security risks for companies, according to TechRadar.Vulnerabilities in API authorization have been named by Wallarm as the second greatest security risk facing APIs, emphasizing the ease of leveraging authorizations as backdoors as well as the urgent need to ensure authorization maintenance, reports SiliconAngle.Tue Apr 23Wed Dec 6On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-04-18",
      "title": "Hackers abuse Google Command and Control red team tool in attacks",
      "text": " The Chinese state-sponsored hacking group APT41 was found abusing the GC2 (Google Command and Control) red teaming tool in data theft attacks against a Taiwanese media and an Italian job search company.In Google's April 2023 Threat Horizons Report, released last Friday, security researchers in its Threat Analysis Group (TAG) revealed that APT41 was abusing the GC2 red teaming tool in attacks.GC2, also known as Google Command and Control, is an open-source project written in Go that was designed for red teaming activities.\"Furthermore, the program will interact only with Google's domains (*.google.com) to make detection more difficult.\"The project consists of an agent that is deployed on compromised devices, which then connects back to a Google Sheets URL to receive commands to execute.These commands cause the deployed agents to download and install additional payloads from Google Drive or exfiltrate stolen data to the cloud storage service.According to Google's report, TAG disrupted an APT41 phishing attack against a Taiwanese media company that attempted to distribute the GC2 agent through phishing emails.\"The payload was an open source red teaming tool called \"Google Command and Control\" (GC2).\"Google says that APT41 also used GC2 in attacks against an Italian job search website in July 2022.Using the agent, Google says that the threat actors attempted to deploy additional payloads on the device and exfiltrate data to Google Drive, as illustrated in the attack workflow below.While it is not known what malware was distributed in these attacks, APT41 is known to deploy a wide variety of malware on compromised systems.The threat actors have also been known to deploy the Winnti malware and the China Chopper web shell, tools commonly used by Chinese hacking groups, and Cobalt Strike for persistence in compromised networks.BleepingComputer contacted Google to learn more about the payloads they saw in these attacks, but a response was not immediately available.APT41's use of GC2 is another indicator of a trend of threat actors moving to legitimate red teaming tools and RMM platforms as part of their attacks.Unfortunately, as with any tool that can help red teamers conduct exercises or for admins to manage a network remotely, they can equally be abused by threat actors in their own attacks."
   },
   {
      "time": "2023-04-18",
      "title": "This New Cybercrime Group Uses Ransomware to Target Businesses - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2023-04-18",
      "title": "The Montana Legislature Banned TikTok - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2023-04-18",
      "title": "New QBot Banking Trojan Campaign Hijacks Business Emails to Spread Malware",
      "text": " A new QBot malware campaign is leveraging hijacked business correspondence to trick unsuspecting victims into installing the malware, new findings from Kaspersky reveal.The latest activity, which commenced on April 4, 2023, has primarily targeted users in Germany, Argentina, Italy, Algeria, Spain, the U.S., Russia, France, the U.K., and Morocco.The goal is to entice victims into opening malicious links or malicious attachments, in this case, an enclosed PDF file that masquerades as a Microsoft Office 365 or Microsoft Azure alert.Opening the document leads to the retrieval of an archive file from an infected website that, in turn, contains an obfuscated Windows Script File (.WSF). The script, for its part, incorporates a PowerShell script that downloads malicious DLL from a remote server. The downloaded DLL is the QBot malware.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation with security gurus to learn about technologies that can shield your web apps from stealthy attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-04-18",
      "title": "",
      "text": " "
   },
   {
      "time": "2023-04-18",
      "title": "DoNot APT Targets Individuals in South Asia using Android Malware - CYFIRMA",
      "text": " Recently CYFIRMA observed a cyber-attack on an individual residing in Kashmir, India. CYFIRMA research team collected two pieces of malware from the download folder of the victim’s mobile. Analysis of the samples links this attack with DoNot APT, historically very active in the region.The collected malware in the download folder of the victim’s mobile implicates that the threat actor used third-party file-sharing websites, leading to files being downloaded and saved in the main download folder on the mobile device. There is also a plausibility that the threat actor has developed their own file-sharing online platform as a delivery mechanism. The malware samples were decoyed as chatting apps with the name “Ten Messenger.apk” and “Link Chat QQ.apk”. Based on the naming conventions of the collected samples, there is an impression that they are either related to chat applications or may potentially be chat applications. However, after analyzing both samples, the team found the apps to be total dummies, it doesn’t even work properly to keep victims engaged with the app for the purpose of chatting. After further analysis, it was found that both samples are highly obfuscated, and codes are scattered to make the analyses difficult. The app is similar to other malicious apps used in previous campaigns, which are more than one year old. The malicious app leverages Google’s firebase for a command-and-control server.Our analysis of the obtained samples revealed the presence of encrypted strings. Specifically, in the Android samples from the previous campaign, the strings were encrypted using a layer of the Base64 algorithm. However, in the current sample, the team analyzed, we found that the strings were encrypted with two layers of encryption – Base64 and AES256, with CBC mode and PKCS padding. The code was obfuscated and protected using Pro Guard, making it difficult to understand. Overall, our technical analysis points to the DoNot APT as the perpetrator of this attack, which is consistent with their past targeting of entities in the Kashmir region of India.The threat actor is active since 2016 and has been carrying out cyber strikes in the South Asian region. There are some media articles reporting that the threat actor belongs to the Indian soil, but we cannot confidently confirm if they belong to India, or what interest they are currently serving. In the past, the threat actor has also targeted their adversary with spear phishing attacks from different target industries and regions. The threat actor is known for their consistent attacks and the same was reflected, when we observed two different apps in the victim’s mobile with different command and control servers, belonging to DoNot APT.The attack is not surprising to the threat intelligence community, as DoNot has previously targeted NGOs and other entities in the Kashmir area, as well as other regions of India, Bangladesh, and Pakistan on multiple occasions. The aim behind the attack is still unknown; however, with a medium level of confidence, we can say that the threat actor could have employed a spear messaging attack. The threat actor could have used WhatsApp or other chatting messengers for the initial stage of the social engineering attack to deliver the app. Because apps were found in the download folder, and it is only possible when delivered by a third-party file-sharing site. Attaching the app directly to WhatsApp increases the chances of malicious apps getting detected, but sending the app as a file attachment saves the file in the WhatsApp media location and not in the download folder, which is the same with other chatting messengers.Upon Installing, the Android Malware Sample asks the victim to open the app.After opening the App, it asks the victim to enable the accessibility service, shown below in the screenshot. It shows the victim the same alert every time the app is opened, until the victim enables it.After Clicking on “Ok”, the app takes the victim to the accessibility setting page, where it asks the victim to enable Accessibility, by clicking on “Link Chat” and turning the accessibility service on. Also, upon turning the accessibility on, the app hides from the main menu and it restricts the victim from uninstalling the app to an extent.Below is a snippet from the Android Manifest file, the malicious app tries to access most of the permissions to perform malicious tasks.Below are a few dangerous permissions described that malicious Android app accesses:Below is a screenshot of the files, after decompiling the Android package, using Bytecode Viewer. The snippet shows scattered modules as part of obfuscation.The extract below is the code that interacts with the command-and-control server. The command-and-control domain was encrypted with Base64 and AES256, with CBC mode and PKCS padding. The decryption of the string revealed playstoree[.]xyz domain. The suspected IOC is a year old and belongs to the notorious Do Not APT.The snippet below is of the module, where a class is used for encryption and decryption of the string, using a secret key.The below Snippet shows a module that is exploiting “android.intent.action.NEW_OUTGOING_CALL” and “android.intent.extra.PHONE_NUMBER” permission to monitor outgoing and incoming calls of the compromised victims.The extract below shows that the module is storing call logs with a few other details, such as time and duration in JSON Array and is ready to send it over to the command- and-control server.The snippet below shows the module where it fetches GPS location, if it’s turned on in the victim’s phone.The screenshot below shows the module where Names and Numbers are extracted into Contacts.txt and sent over to the command-and-control server.The threat actor is constantly targeting individuals in the Kashmir region of India. Their attack is not so sophisticated and the aim behind the attack is still unknown. While compiling this report, we have come across another sample that has a different name, but the code used in this sample is similar to that of the previous samples analysed, except for the command-and-control domain. This domain is new and has not been flagged as a malicious IOC anywhere. Also, our analysis of almost two-year- old APKs has revealed that the string was encrypted only with Base64 algorithms, whereas, the samples obtained one year ago revealed that the string was encrypted using two layers of encryption, including Base64 and AES256 with CBC mode and PKCS padding. This indicates that the threat actor has been utilizing the same tactics and techniques for the past two years. It is expected that the group will utilize similar and consistent tactics and techniques, especially in the context of spear phishing via messaging, to target their intended victims.Indicators of CompromiseMITRE ATT&CK Technique DetectionCopyright CYFIRMA. All rights reserved.Your iFrame Code"
   },
   {
      "time": "2023-04-17",
      "title": "Public charging stations may come with a price, federal agencies warn | SC Media",
      "text": "  A charging station is seen at the Miami International Airport. (Photo by: Jeffrey Greenberg/Education Images/Universal Images Group via Getty Images)Two federal agencies issued warnings about USB-based charging attacks, where hackers inject malware or siphon data from devices of unsuspecting consumers looking to charge their phone, computer or gadget on the go. “Malware installed through a corrupted USB port can lock a device or export personal data and passwords directly to the perpetrator. Criminals can then use that information to access online accounts or sell it to other bad actors,” the April 11 post stated. The FCC went on to say that criminals have intentionally left cables plugged in at charging stations, and have been known to give away infected cables as promotional gifts.Andy Thompson, a researcher for identity management firm CyberArk, said he was first introduced to juice jacking in 2011 at Defcon, where it was presented more as a proof of concept than a viable attack method. Thompson said the attack method happens very rarely — if at all — in the wild, but added that juice jacking could be mitigated by using USB Data Blockers or using your own charging cables.Juice jacking has become less theoretical with the commercialization and abuse of penetration testing tools such as Rubber Ducky that market themselves as \"a (USB) flash drive that types keystroke injection payloads into unsuspecting computers at incredible speeds.\" It adds, \"To a human it's a flash drive. To a computer it's a keyboard, typing at superhuman speeds.\"The FCC recommends using AC power outlet instead of charging stations and to use your own USB cables and portable charger when traveling. It adds, if you are prompted to select \"share data\" or “charge only” when you plug in your device, always select “charge only.”Another option is to use a data-blocking USB charging dongle that are designed to limit connections to charging only.Stephen Weigand is managing editor and production manager for SC Media. He has worked for news media in Washington, D.C., covering military and defense issues, as well as federal IT. He is based in the Seattle area.It’s clear iLeakage presents itself as a major flaw with no known mitigation and it’s a real problem for iOS devices – here are some ideas on how to respond. Malware distribution on Android devices has been facilitated by the new SecuriDropper dropper-as-a-service operation by evading Android 13's \"Restricted Settings\" functionality to breach \"Accessibility Services,\" BleepingComputer reports.Jamf says North Korean subgroup of the financially motivated Lazarus Group targets specific users the threat actors believe have access to cryptocurrency.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-04-17",
      "title": "LockBit ransomware encryptors found targeting Mac devices",
      "text": " The LockBit ransomware gang has created encryptors targeting Macs for the first time, likely becoming the first major ransomware operation to ever specifically target macOS.BleepingComputer analyzed the strings in the LockBit encryptor for Apple M1 and found strings that are out of place in a macOS encryptor, indicating that these were likely haphazardly thrown together in a test.Furthermore, the encryptor contains a list of sixty-five file extensions and filenames that will be excluded from encryption, all of them being Windows file extensions and folders.A small snippet of the Windows files the Apple M1 encryptor will not encrypt is listed below, all out of place on a macOS device.Almost all of the ESXi and Windows strings are also present in the MIPs and FreeBSD encryptors, indicating that they use a shared codebase.The good news is that these encryptors are likely not ready for deployment in actual attacks against macOS devices.Instead, Wardle told BleepingComputer that he believes the macOS encryptor is based on the Linux version and compiled for macOS with some basic configuration settings.Furthermore, Wardle told us that when the macOS encryptor is launched, it crashes due to a buffer overflow bug in its code.\"It seems that macOS is now on their radar ... but other than compiling it for macOS, and adding a basic config (which are just basic flags ...not specific to macOS per se) this is far from ready for deployment,\" Wardle told BleepingComputer.Wardle further shared that the LockBit developer must first \"figure out how to bypass TCC, get notarized\" before becoming a functional encryptor.While Windows has been the most targeted operating system in ransomware attacks, nothing prevents developers from creating ransomware that targets Macs.However, as the LockBit operation is known for pushing the envelope in ransomware development, it would not be surprising to see more advanced and optimized encryptors for these CPU architectures released in the future.Therefore, all computer users, including Mac owners, should practice good online safety habits, including keeping the operating system updated, avoiding opening unknown attachments and executables, generate offline backups, and using strong and unique passwords at every site you visit.Update 4/16/23: In response to questions from BleepingComputer, the public-facing representative of LockBit, known as LockBitSupp, said that the Mac encryptor is \"actively being developed.\"While LockBit has a history of toying with security researchers and the media, if true, we will likely see more production-quality versions in the future.Furthermore, while it's not clear how useful a macOS encryptor would be in the enterprise, some LockBit affiliates target consumers and small businesses, where an encryptor like this could be more useful."
   },
   {
      "time": "2023-04-17",
      "title": "Defense Leak Case Arrests 21-year-old Air Force Guardsman - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2023-04-17",
      "title": "Russian SolarWinds Attackers Launch New Wave of Cyber Espionage Attacks - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2023-04-17",
      "title": "EU Privacy Watchdog Forms ChatGPT Task Force - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2023-04-17",
      "title": "Report Reveals ChatGPT Already Involved in Data Leaks, Phishing Scams & Malware Infections",
      "text": " March Saw OpenAI's First Major Data LeakAs many as 1.2% of ChatGPT users during a particular session in March may have had their payment details exposed to the public. While the bug that caused the leak was quickly fixed, the leak's impact on credit card fraud and identity theft may not be known for months.3 New ChatGPT-linked Security Events in First Two Weeks of AprilIn April alone, the report found: ChatGPT was involved in a major data leak at Samsung, where staff members uploaded sensitive information that included source code from defective equipment and the transcripts of private meetings.The report also revealed:Documenting additional cybersecurity risks, the report highlights the first case of ChatGPT creating a Zero Day virus, with undetectable exfiltration, that successfully passed a virus scan.The virus was made by a novice developer, using only prompts from ChatGPT. In his worrying conclusion, the developer noted that \"this kind of end to end, very advanced attack has previously been reserved for nation state attackers.\"A.I. Tools Are Fighting Cybercrime TooFortunately, A.I. tools are also being used to detect and prevent cyberattacks at an increasing rate. The report cites evidence from January 2023 indicating that AI-based security tools stopped over 1.7 million malware attacks within a 90 day period.About Network AssuredCopyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-17",
      "title": "Malware variant ‘Legion’ abuses AWS, PayPal, Stripe cloud in spam attacks | SC Media",
      "text": "  A simple mail transfer protocol (SMTP) abuse tool dubbed Legion can scan Shodan to identify misconfigured cloud servers and then take over SMTP email marketing programs or launch phishing campaigns.Legion can also send SMS text messages to launch mobile-based phishing and disinformation campaigns and has targeted 14 different telecoms, including AT&T, Sprint, T-Mobile, and Verizon. It can also bundle additional functionality traditionally found in more common hacking tools, such as the ability to execute web server specific exploit code and brute force account credentials. Matt Muir, a threat intelligence researcher at Cado, said security administrators can neutralize Legion by making sure their environment files are not exposed to the public internet. “Environment files are text files used to store credentials,” explained Muir. “By securing the environment files there’s not much Legion can do. Admins have to make sure that the environment files are not located in a directory that’s exposed to the internet.”Muir said Cado researchers consider Legion an emerging generation of cloud-focused credential harvester/spam utilities. Developers of these tools often steal each other's code, making attribution to a particular group difficult.“Mail and SMS abuse are big business for attackers,” wrote Ahl. “We have come across close to a dozen variants of similar scripts that are being sold regularly for nefarious purposes. Legion is not the first nor will it be the last.”The Telegram groups used to distribute Legion have a combined membership of about 5,000. Muir said although we can assume not everybody in these groups will purchase a license for the software, it’s clear that there’s now considerable demand for such a tool.“If even half of the members purchased a license and used the SMTP abuse capabilities for spam or phishing purposes, I don’t think it’s unreasonable to assume that tens of thousands of users would be affected,” said Muir, who also footnoted that at the time the blog was written, Cado researchers had seen zero detections on VirusTotal.“Attackers often look to get access to an API using credentials or tokens obtained through nefarious means,” said Rago. “Once they gain the valid privileged credential or token, the attacker can leverage the API to exfiltrate data or compromise a service.”Davis McCarthy, principal security researcher at Valtix, added that Legion automates real world tactics, techniques and procedures at scale, reducing the threat actors time to initial access. McCarthy explained that if the hacker can’t exploit the target organization’s infrastructure remotely, then there are options to brute-force AWS credentials and set up phishing campaigns with Amazon SES.“The AWS module also tags newly created malicious users, working as a defense evasion technique and establishing legitimacy,” said McCarthy. “Even target reconnaissance is made easy by integrating with Shodan.”U.S. cloud data analytics and log analysis firm Sumo Logic has confirmed discovering a potential security incident after its Amazon Web Services account was accessed using stolen credentials, reports TechCrunch.Transitioning to cloud-native environments has brought along security risks for companies, according to TechRadar.Vulnerabilities in API authorization have been named by Wallarm as the second greatest security risk facing APIs, emphasizing the ease of leveraging authorizations as backdoors as well as the urgent need to ensure authorization maintenance, reports SiliconAngle.Tue Apr 23Wed Dec 6On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-04-17",
      "title": "Healthcare websites flooded by fake requests in ongoing DDoS attacks | SC Media",
      "text": "  The latest Department of Health and Human Services Cybersecurity Coordination Center alert warns the onslaught of DNS NXDOMAIN DDoS attacks is designed to overload targeted servers with large volumes of invalid requests.As a result, the targeted DNS server directs its efforts attempting to locate the non-existent domain instead of processing legitimate user requests, slowing down the server and preventing it from responding to those legitimate requests.The greater the volume of invalid requests, the slower the server speeds. The impact is further broadened by legitimate clients working to access the site, as they add to the load size. According to the alert, “In most cases, the DNS proxy server and the DNS authoritative server will use all their time handling those bad requests.” Successful attacks cause a higher utilization of resources and a cache filled with NXDOMAIN replies, which can “ultimately slow or completely prevent an authorized user from gaining access to a website or services.”These NXDOMAIN DDoS attacks could bear negative consequences for end users, network providers, and website owners, HC3 warned. Websites and other service providers are the typical target of these attacks and designed to make their service inaccessible to legitimate customers.Receiving small amounts of NXDOMAIN responses is considered normal during business hours, as users can mistype web addresses or leverage “dead hyperlinks” to nonexistent servers. But these are typically redirected to the proper server.\"A DNS NXDOMAIN flood DDoS attack is dangerous because it can be difficult to detect. Many DNS server administrators misidentify the slowdown as a performance problem when in actuality it is a NXDOMAIN attack on their DNS server,\" according to NETSCOUT researchers.To detect malicious NXDOMAIN attacks, HC3 warned that network defenders should look out for large volumes of DNS queries for non-existent hostnames under legitimate domains.The alert contains a list of all attack techniques, including widely distributed IPs, possibly spoofed source IPS, and traffic made up of UDP packets encapsulated in IPv4 and IPv6. Network defenders are urged to be cautious when blocking IPs, as it could inadvertently block legitimate users from accessing their public services. NETSCOUT recommends several key mitigation measures to reduce the impact, which are contained in the threat analysis. Entities should consider implementing  DNS Response Rate Limiting, adding rate limiting for traffic on overwhelmed servers, and blackhole routing or filtering of suspected domains and servers.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.The new PCI DSS standard puts more focus on application security, with more tools, testing and documentation required of developers.GitHub has updated its Advanced Security platform available for Enterprise Cloud and Enterprise Server customers to provide new artificial intelligence-powered features in a bid to \"revolutionize\" secure app development, reports SecurityWeek.Vulnerabilities in API authorization have been named by Wallarm as the second greatest security risk facing APIs, emphasizing the ease of leveraging authorizations as backdoors as well as the urgent need to ensure authorization maintenance, reports SiliconAngle.Tue Aug 27 - Wed Aug 28Tue Dec 5On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-04-17",
      "title": "NCR suffers Aloha POS outage after BlackCat ransomware attack",
      "text": " NCR is suffering an outage on its Aloha point of sale platform after being hit by an ransomware attack claimed by the BlackCat/ALPHV gang.NCR is an American software and technology consulting company that provides digital banking, POS system, and payment processing solutions for restaurants, businesses, and retailers.One of their products, the Aloha POS platform used in hospitality services, has suffered an outage since Wednesday, with customers unable to utilize the system.After days of silence, NCR has disclosed today that the outage was caused by a ransomware attack on data centers used to power their Aloha POS platform.\"As a valued customer of NCR Corporation, we are reaching out with additional information about a single data center outage that is impacting a limited number of ancillary Aloha applications for a subset of our hospitality customers,\" reads an email sent to Aloha POS customers.\"On April 13, we confirmed that the outage was the result of a ransomware incident.\"\"Immediately upon discovering this development we began contacting customers, engaged third-party cybersecurity experts and launched an investigation.\"\"Law enforcement has also been notified.\"In a statement to BleepingComputer, NCR said that this outage impacts a subset of their Aloha POS hospitality customers and only a \"limited number of ancillary Aloha applications.\"However, Aloha POS customers have shared on Reddit that the outage has caused significant issues in their business operations.\"We have a clear path to recovery and we are executing against it. We are working around the clock to restore full service for our customers,\" NCR told BleepingComputer. \"In addition, we are providing our customers with dedicated assistance and workarounds to support their operations as we work toward full restoration.\"This post also included a snippet of the negotiation chat conversation between an alleged NCR representative and the ransomware gang.According to his chat, the ransomware gang told NCR they had not stolen any data stored on servers during the attack.However, the threat actors claimed to have stolen credentials for NCR's customers and stated that they would be published if a ransom was not paid.\"We take a lot of credentials to your clients networks used to connect for Insight, Pulse, etc. We will give you this list after payment,\" the threat actors told NCR.BlackCat has since taken down the NCR post from their data leak site, likely hoping the company would be willing to negotiate a ransom.The ransomware gang received the name BlackCat due to the image of a black cat on its data leak site. However, the threat actors call themselves ALPHV internally when discussing their operation on hacking forums and in negotiations.Since its launch, the ransomware operation has grown into one of the most significant ransomware active at this time, responsible for hundreds of attacks worldwide, with ransom demands ranging from $35,000 to over $10 million."
   },
   {
      "time": "2023-04-17",
      "title": "Hackers start abusing Action1 RMM in ransomware attacks",
      "text": " Security researchers are warning that cybercriminals are increasingly using the Action1 remote access software for persistence on compromised networks and to execute commands, scripts, and binaries.Action1 is a remote monitoring and management (RMM) product that is commonly used by managed service providers (MSPs) and the enterprise to remotely manage endpoints on a network.The software allows admins to automate patch management and the deploying of security updates, install software remotely, catalog hosts, troubleshoot problems on endpoints, and get real-time reports.While these types of tools are extremely helpful for admins, they are also valuable to threat actors who can use them to deploy malware or gain persistence to networks.Tsale highlights that apart from the remote access capabilities, Action1 is available at no cost for up to 100 endpoints, which is the only restriction in the free version of the product.BleepingComputer tried to learn more about incidents where the Action1 RMM platform is being abused and was told by sources that it was observed in ransomware attacks from multiple threat actors.The product has been leveraged in the initial stages of at least three recent ransomware attacks using distinct malware strains. We could not find the specific ransomware deployed during the incidents, though.However, we were told that the tactics, techniques, and procedures (TTPs) echo an attack that the BlackBerry Incident Response team investigated last summer.From a ransomware perspective, legitimate RMM software is versatile enough to fit their needs, provides wide reach on the network, and ensures continued persistence because security agents in the environment do not usually flag the platforms as a threat.While Action1 RMM is used legitimately across the world by thousands of administrators, the vendor is aware that the product is being abused by threat actors in the post-compromise stage of an attack for lateral movement.Mike Walters, VP of Vulnerability and Threat Research and co-founder of Action1 Corporation, told BleepingComputer that the company introduced last year a system based on artificial intelligence to detect abnormal user behavior and to prevent hackers from using the platform for malicious purposes.“Last year we rolled-out a threat actor filtering system that scans user activity for suspicious patterns of behavior, automatically suspends potentially malicious accounts, and alerts Action1’s dedicated security team to investigate the issue” - Mike Walters\"At the same time, I would like to emphasize that these attacks do not target the Action1 users since our platform has not been compromised,\" Walters added Action1 is working on including new measures to stop the misuse of the platform, the researcher said, adding that the company is “fully open to cooperation with both victims and legal authorities” on cases where Action1 was leveraged for cyberattacks.Update [April 18]: Added updated statement from Action1."
   },
   {
      "time": "2023-04-17",
      "title": "Transparent Tribe (APT36) | Pakistan-Aligned Threat Actor Expands Interest in Indian Education Sector - SentinelOne",
      "text": " Wibemax matches the name of a Pakistani software development company, but at this time we have not identified a clear relationship to the adversary.Our analysis reinforces the assessment that closely monitoring the research endeavors of adversary nations has become an important objective for the adversary, underscoring the crucial role this activity plays in fulfilling the goals and aspirations of the authorities whose interests Transparent Tribe represents.The malicious documents we analyzed stage Crimson RAT using Microsoft Office macros or OLE embedding.The macro code executes when the documents are opened, and its functionality is consistent with known Transparent Tribe macro variants. The macros create and decompress an embedded archive file in the %ALLUSERSPROFILE% directory (C:\\ProgramData) and execute the Crimson RAT payload within. Some macros insert text in the document, which is typically education-themed content relating to India.In addition to macros, we observed that Transparent Tribe have adopted OLE embedding as a technique to stage Crimson RAT. Malicious documents that implement this technique require users to double-click a document element. The documents distributed by Transparent Tribe typically display an image (a “View Document” graphic) indicating that the document content is locked. This lures users to double-click the graphic to view the content, which activates an OLE package that stores and executes Crimson RAT masquerading as an update process (MicrosoftUpdate.exe).As an anti-analysis measure, Crimson RAT variants delay their execution for a given time period, for example, 61, 180, or 241 seconds. Most of the Crimson RAT variants we analyzed evaluate whether they execute at a machine named G551JW or DESKTOP-B83U7C5 and establish persistence by creating a registry key under \\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run only if the victim’s machine name differs. G551JW or DESKTOP-B83U7C5 may be the names of the machines where Crimson RAT developers have been running test executions.Transparent Tribe is a highly motivated and persistent threat actor that regularly updates its malware arsenal, operational playbook, and targets. Our analysis further demonstrates this characteristic of the group by spotlighting the adoption of OLE embedding as a technique for staging malware from lure documents and the Eazfuscator obfuscator to protect Crimson RAT implementations. Transparent Tribe’s constantly changing operational and targeting strategies require constant vigilance to mitigate the threat posed by the group.Get notified when we post new content.Thanks! Keep an eye out for new content!In the era of interconnectivity, when markets, geographies, and jurisdictions merge in the melting pot of the digital domain, the perils of the threat ecosystem become unparalleled. Crimeware families achieve an unparalleled level of technical sophistication, APT groups are competing in fully-fledged cyber warfare, while once decentralized and scattered threat actors are forming adamant alliances of operating as elite corporate espionage teams.Get notified when we post new content.Thanks! Keep an eye out for new content!"
   },
   {
      "time": "2023-04-14",
      "title": "Microsoft: Phishing attack targets accountants as Tax Day approaches",
      "text": " Microsoft is warning of a phishing campaign targeting accounting firms and tax preparers with remote access malware allowing initial access to corporate networks.With the USA reaching the end of its annual tax season, accountants are scrambling to gather clients' tax documents to complete and file their tax returns.Due to this, it makes it an ideal time for threat actors to target tax preparers, hoping that they mistakenly open malicious files that they would generally be more careful with when less busy.This is exactly what Microsoft sees in a new phishing scam targeting tax professionals to install the Remcos remote access trojan malware.\"With U.S. Tax Day approaching, Microsoft has observed phishing attacks targeting accounting and tax return preparation firms to deliver the Remcos remote access trojan (RAT) and compromise target networks beginning in February of this year,\" Microsoft warns in a new report.The phishing campaign starts with emails that pretend to be clients sending the necessary documents to complete their return.\"I apologize not responding sooner; our individual tax return should be simple and not require much of your time,\" reads a phishing email seen by Microsoft.\"I believe you would require a copy of our most recent year's documents, such as W-2s, 1099s, mortages, interest, donations, medical investments, HSAs, and so on which I have uploaded below.\"These phishing emails contain links that utilize click-tracking services to evade detection by security software, and ultimately lead to a file hosting site that downloads a ZIP archive.This ZIP archive contains numerous files pretending to be PDF files for various tax forms but are actually Windows shortcuts.When double-clicked, these Windows shortcuts will execute PowerShell to download a heavily obfuscated VBS file from a remote host, which is saved to C:\\Windows\\Tasks\\ and executed.At the same time, the VBS script will download a decoy PDF file and open it in Microsoft Edge to avoid arousing suspicion by the targeted person.Microsoft says that these VBS files will download and execute the GuLoader malware, which in turn, installs the Remcos remote access trojan.Using this access, the threat actors can spread further through the network, stealing data and deploying other malware on a device.Microsoft says that while phishing campaigns commonly use tax-related themes, this campaign is unusual as its only targets tax preparation firms and individuals.\"While social engineering lures like this one are common around Tax Day and other big topic current events, these campaigns are specific and targeted in a way that is uncommon.\"\"The targets for this threat are exclusively organizations that deal with tax preparation, financial services, CPA and accounting firms, and professional service firms dealing in bookkeeping and tax.\"As accountants hold highly sensitive data for individuals and corporations, a data breach in this type of organization could significantly harm a large group of people.Unfortunately, Windows shortcuts are a special file type that uses the .lnk file extension but does not show the file extension when displayed in File Explorer.This behavior makes detecting that a file is a shortcut in disguise more difficult. However, listing files in File Explorer in 'Details' mode will show that it is Windows Shortcut, making it a bit easier to spot.Ultimately, no one should click on links in emails or open attachments unless they confirm if they are sent from a legitimate contact. Otherwise, delete the email."
   },
   {
      "time": "2023-04-14",
      "title": "QuaDream mobile spyware case raises new concerns over zero-click exploits | SC Media",
      "text": "  Just how dangerous are these new zero-click exploits to rank-and-file businesses?Shridhar Mittal, chief executive officer at Zimperium, explained that there are two main classes of mobile spyware: nation-state level products like those from organizations such as QuaDream that often leverage zero-click vulnerabilities, and those that leverage less sophisticated delivery techniques — such as social engineering — to infect devices. “While the delivery techniques vary, there are hardly any differences in the spying capabilities of both classes once the device has been infected,” said Mittal. “There’s no denying that these threats are real and continue to be a growing problem, which isn’t just impacting government entities and high-profile targets like journalists and activists, but it's a threat to all corporate employees.”Zero-click exploits are cyberattacks that don't require user intervention to trigger the attack. These attacks are automatic and usually go undetected, executed without a trace as soon as the code hits the user’s device.Chuck Everette, Field CISO at Virsec, said that zero-click exploits are terrifying and are considered the crown jewel of vulnerabilities.“What is so disruptive about this spyware is that its ability to monitor, use the camera and geolocation functionalities, access and retrieve files, even get into hardened security areas such as the iOS keychain or even generating one-time passwords that can be used to bypass multi-factor authentication processes,” said Everette. “What makes this spyware variant so destructive is that it’s good at covering its tracks and utilizing Apple’s own native files in a ‘living-off-the-land' type of strategy. This makes it very difficult to detect, let alone protect against.”Everette added that security teams need to start moving into a preventative mindset, being proactive instead of reactive. He recommends that security pros tell their users not to log-on to unknown websites.“For a zero-click compromise to succeed it needs to load from a website or downloaded from an application that has been compromised,” said Everette. “For Apple devices running iOS 16 or Mac OS central lockdown mode is available to assist in protecting against attacks.”On a broader level, Michael Covington, vice president of strategy at Jamf, said his team sees a steady stream of evidence that mobile devices are increasingly targeted by hackers. Because of a misguided perception that modern mobile devices are secure, Covington said organizations often fail to protect remote workers with the same level of attention provided to traditional computer devices.The combination of increased attacks and an under-secured workforce results in more compromises and longer time periods between exploit and detection, not to mention remediation and post-event clean-up.“Providing the attribution to QuaDream puts a spotlight on the commercial malware market that goes largely under-reported,” said Covington. “Many organizations make the incorrect assumption that malware, including mobile spyware like the NSO Group’s Pegasus, is a best-effort exercise. The reality is that there are commercial organizations employing full-time developers, consulting engineers, and customer support teams to help paying attackers target victims, silently launch attacks, maintain malware efficacy, and extract maximum value from a pay-to-use malicious service. It’s these well-funded, for-profit organizations that all vendors — not just security vendors — need to consider as they release and maintain products in all sectors.”Shane Huntley, senior director of Google’s Threat Analysis Group (TAG), added that at this time there are limited options for security teams when it comes to addressing zero-click exploits. Huntley said the most important components are securing and managing devices as best as possible, as well as having strong security controls in place to mitigate any potential compromises.Ukraine had experienced a less than a day-long power outage in October 2022 following an attack by Russian state-sponsored hacking operation Sandworm targeted at an electrical substation amid the ongoing Russia-Ukraine war, marking the first cyberattack-related power interruption in the country since 2017, CyberScoop reports.Attacks deployed by Iranian state-backed threat operation MuddyWater against Israel saw the utilization of the new MuddyC2Go command-and-control framework, which replaced the PhonyC2 custom platform following the exposure of its source code, reports The Hacker News.Israel had its technology, logistics, and transportation industries targeted by Iranian advanced persistent threat operation Charming Kitten, also known as APT35 and Imperial Kitten, last month amid its ongoing war with Palestinian militant group Hamas, according to The Record, a news site by cybersecurity firm Recorded Future.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-04-14",
      "title": "New Mirai Variant Employs Uncommon Tactics to Distribute Malware",
      "text": " A new version of a Mirai variant called RapperBot is the latest example of malware using relatively uncommon or previously unknown infection vectors to try and spread widely.RapperBot first surfaced last year as Internet of Things (IoT) malware containing large chunks of Mirai source code but with some substantially different functionality compared with other Mirai variants. The differences included the use of a new protocol for command-and-control (C2) communications and a built-in feature for brute-forcing SSH servers rather than Telnet services, as is common in Mirai variants.Kaspersky's analysis of the malware showed it also integrated what the security vendor described as an \"intelligent\" and somewhat uncommon feature for brute-forcing telnet. Rather than brute-forcing with a huge set of credentials, the malware checks the prompts received when it telnets to a device — and based on that, selects the appropriate set of credentials for a brute-force attack. That significantly speeds up the brute-forcing process compared with many other malware tools, Kaspersky said.\"When you telnet to a device, you typically get a prompt,\" says Jornt van der Wiel, a senior security researcher at Kaspersky. The prompt can reveal some information that RapperBot uses to determine the device it's targeting and which credentials to use, he says. Depending on the IoT device that is targeted, RapperBot uses different credentials, he says. \"So, for device A, it uses user/password set A; and for device B, it uses user/password set B,\" van der Wiel says.The malware then uses a variety of possible commands, such as \"wget,\" \"curl,\" and \"ftpget\" to download itself on the target system. If these methods don't work, the malware uses a downloader and installs itself on the device, according Kaspersky.RapperBot's brute-force process is relatively uncommon, and van der Weil says he can't name other malware samples that use the approach. Even so, given the sheer number of malware samples in the wild, it's impossible to say if it is the only malware currently using this approach. It's likely not the first piece of malicious code to use the technique, he says.Kaspersky pointed to RapperBot as one example of malware employing rare and sometimes previously unseen techniques to spread.Another example is \"Rhadamanthys,\" an information stealer available under a malware-as-a-service option on a Russian language cybercriminal forum. The info stealer is one among a growing number of malware families that threat actors have begun distributing via malicious advertisements. The growing success that threat actors have had with malvertising scams is spurring an increase in the use of the technique. The authors of Rhadamanthys, for instance, initially used phishing and spam emails before switching to malicious advertisements as the initial infector vector. \"Rhadamanthys doesn’t do anything different from other campaigns using malvertising,\" van der Weil says. \"It is, however, part of a trend that we see malvertising is becoming more popular.\"Another trend Kaspersky has spotted: the growing use of open source malware among less-skilled cybercriminals. Take CueMiner, a downloader for coin-mining malware available on GitHub. Kaspersky's researchers have observed attackers distributing the malware using Trojanized versions of cracked apps downloaded via BitTorrent or from OneDrive sharing networks. \"Due to its open source nature, everybody can download and compile it,\" van der Weil explains. \"As these users are typically not very advanced cybercriminals, they have to rely on relatively simple infection mechanisms, such as BitTorrent and OneDrive.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-14",
      "title": "Massive ILS leak included data of more than 20,000 Iowa Medicaid recipients",
      "text": " Thousands of Medicaid recipients in Iowa had their personal information leaked in a 2022 attack on the healthcare software company Independent Living Systems (ILS), the state's Department of Health and Human Services revealed this week.The information leaked included names, addresses, dates of birth, driver’s license numbers, Social Security numbers, financial account information and medical data such as diagnosis codes and health insurance information.Officials in Iowa said that the information of 20,800 Iowa Medicaid members was involved in the ILS breach.Officials confirmed that Iowa’s Medicaid system was not breached. But the organization works with a private contractor named Telligen, which provides annual assessments for Medicaid members to make sure they are receiving the correct healthcare services.The state said Telligen subcontracted some of that work to ILS, which has provided third-party administrative services to health plans, providers, hospitals, and pharmaceutical and medical device companies for nearly two decades.Despite the initial breach of ILS’ network occurring in July 2022, the company only finished its investigation in the last two months, informing Telligen of the leak on February 14. Telligen in turn notified Iowa officials on February 17.Iowa officials did not respond to requests for comment on if they will continue to work with Telligen and ILS after the leak.Paul Bischoff, the editor of tech services website Comparitech, told The Record that the disclosure of the breach took far too long, giving hackers more than eight months to exploit the leaked information.“A lot of damage could have already been done. Criminals could use the breached info for identity theft, Medicaid fraud, and phishing, among other attacks,” he said.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-04-14",
      "title": "Pakistan-linked hackers target India’s education sector with Crimson malware",
      "text": " According to SentinelLabs, hackers gained access to victims' devices through phishing emails that contained education-themed malicious attachments that were created in July and August 2022. Once opened, the threat actors used either Microsoft Office macros or Object Linking and Embedding (OLE) to install the Crimson malware onto the computer.OLE embedding is a technology used to embed and link objects, such as data or media files, within a document. Attackers can use it to hide the malware within the document itself, so it is executed when the document is opened.Crimson is a remote access trojan (RAT), a type of malware that provides an attacker with remote access to a victim's computer. Crimson is capable of exfiltrating system information, capturing screenshots, starting and stopping processes, and listing all the files and drives on the computer.The group has used Crimson in most of its operations, constantly modifying it.Transparent Tribe has been active since 2013 and has targeted government organizations in around 30 countries. The group usually creates fake domains mimicking a government organization before delivering a payload.According to researchers, Transparent Tribe is likely getting help from third parties to support its work, including Pakistani web hosting provider Zain Hosting.Transparent Tribe is not a “very sophisticated group,” according to SentinelLabs, but is highly persistent and “continuously adapts its operational strategy.”“Transparent Tribe’s constantly changing operational and targeting strategies require constant vigilance to mitigate the threat posed by the group,” the researchers said.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-04-14",
      "title": "Super-Yacht Specialist Lürssen in Dry Dock After Ransomware Attack",
      "text": " German shipbuilder Lürssen, known for making super yachts for the exorbitantly wealthy, experienced a ransomware attack over Easter weekend that has incapacitated operations.With a high revenue — it has an expected annual revenue of nearly $2.2 billion this year — it's likely that the shipbuilding company has a running roster of exclusive clients, making it a quality candidate for threat actors. And while Lürssen makes luxury yachts, it also builds sea vessels for the German navy, making the current standstill in production and operations due to the attack all the more unfavorable.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-14",
      "title": "Vast majority of security and IT pros take IAM more seriously | SC Media",
      "text": "  The study, conducted between December 2022 and January 2023, surveyed 203 security and IT pros from CRA’s Business Intelligence research panel, offered four important findings. Just under half (44%) of respondents have already implemented IAM in part or in full, while 19% are developing an IAM strategy, and 26% are now giving it serious consideration. In total, 98% of respondents have implemented or are considering an IAM strategy. Respondents who have made progress with IAM are choosing various paths to deployment: 22% have opted for an on-prem configuration, 24% for a cloud-based setup, and 25% have chosen a hybrid model blending on-prem and cloud solutions.IAM progress has largely been motivated by a desire to get ahead of the growing pains of transforming today’s workforce. Respondents said today’s IAM efforts prioritize multi-factor authentication (84%), unique passwords (82%), single sign-on (77%), and role-based access control (67%).Respondents worry about the complexity of IAM products and how they can strain the user experience. Fifty-six percent of respondents say they are now focusing on improving the user experience, often cited as a leading pain point in implementing IAM.As one respondent remarked: “Who wants to spend hours in understanding a product that always requires additional expertise to handle when its objective is to provide efficiency?”As they look to the future, companies will need to think carefully about how to roll out IAM in a way that improves the organization’s security posture, and respects the needs and preferences of its users.CRA’s advice to security teams: have an IAM game plan, keep the user experience front and center, focus on iteration, not solving everything all at once, and to more effectively embrace the remote work trend, make identity the perimeter based on zero-trust.TechCrunch reports that more than a million Maine residents were confirmed by state government officials to have had their personal data compromised as part of the widespread MOVEit file transfer system hack conducted by the Cl0p ransomware operation.U.S. advanced electronic components manufacturer Kyocera AVX Components Corporation has disclosed that 39,111 individuals around the world had their data compromised following a ransomware attack earlier this year, which has been claimed by the LockBit ransomware operation, reports BleepingComputer.U.S. cloud data analytics and log analysis firm Sumo Logic has confirmed discovering a potential security incident after its Amazon Web Services account was accessed using stolen credentials, reports TechCrunch.Thu Dec 7Tue Mar 26On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-04-14",
      "title": "Microsoft shares fix for Outlook issue blocking access to emails",
      "text": " Microsoft is working on fixing an issue affecting some Outlook for Microsoft 365 customers and preventing them from accessing emails and their calendars.\"After updating to Outlook Version 2303 (Build 16227.20212) Users may be unable to view or access Microsoft 365 group calendars and email messages in Outlook Desktop,\" the company said in a support document published on Thursday.\"Affected users are part of a Microsoft 365 group. Some affected users may also notice that impact self-resolves after some time, although impact may also reoccur at a later time.\"Outlook users affected by this issue may have problems when trying to perform one of the following actions while using the Outlook desktop client:Microsoft says the Outlook Team is working on a solution to address this known issue and shared a temporary workaround until a fix rolls out for those experiencing problems while trying to access emails.The detailed procedure required to ever to the previous, unaffected Outlook build requires you to:Open a Command Prompt (Run as Administrator).Type/paste the following commands and press Enter after each:cd %programfiles%\\Common Files\\Microsoft Shared\\ClickToRun   officec2rclient.exe /update user updatetoversion=16.0.16130.20332In the backstage, disable Updates (File, Office Account, Update Options, Disable Updates).Set a reminder on your calendar for May 9, 2023, to remember to re-enable updates. The fix should be out sooner, but May 9 is Patch Tuesday, and the fix will be in this update."
   },
   {
      "time": "2023-04-14",
      "title": "Dutch Police mails RaidForums members to warn they’re being watched",
      "text": " Dutch Police is sending emails to former RaidForums members, asking them to delete stolen data and stop illegal cyber activities and warning that they are not anonymous.RaidForums was a very popular and notorious hacking and data leak forum known for hosting, leaking, and selling stolen data obtained from breached organizations.Threat actors who frequented the forum would hack into websites or access exposed database servers to steal customer information. The threat actors would then attempt to sell the data to other threat actors, who use it for their campaigns, such as phishing attacks, cryptocurrency scams, or distributing malware.In many cases, if data was not sold or some time had passed, the stolen data would be leaked for free on RaidForums to gain reputation among the community.These members were identified by analyzing the seized RaidForums forum database, which would have contained members' email addresses, registration IP addresses, and the IP addresses used when posting and downloading files from the site.This data can then be used to identify members, what country they are located in, and their involvement in the site.The sent emails were titled \"Politiewaarschuwing aan Raidforums gebruikers,\" which translates to \"Police warning to Raidforums users.\"The machine-translated email can be read below in English:\"The Dutch Police and international police organizations have launched an investigation into the website Raidforums.com. This resulted in the police taking the website offline and obtaining a dataset containing the platform's user data. As a result of this investigation, several people have been arrested (see QR code).The investigation has shown that you are linked to a Raidforums user account and that you are active in groups where leaked data is traded. Possession of this is a criminal offence.The police are aware that Raidforums was used to trade leaked data such as pornographic material, personal data and/or account data. Raidforums were also used to gain knowledge for the development of cyber skills that are closely related to committing serious cybercrime crimes.The Dutch Police urges you to stop participating in online activities, such as trading leaked data. You run the risk of breaking the law. Remove pirated software or datasets obtained from Raidforums or other similar sites. Participation in or further continuation of cybercriminal activities may lead to further action against YOU. Illegal activities conducted on Raidforums.com (or on similar websites) can lead to: • Conviction: You will be fined, community service or imprisonment\n • Criminal record: You will get a criminal record. This makes it more difficult to find an internship or a job, but it also makes traveling abroad more difficult. \n • Confiscation: You lose your computer, phone or other electronic devices.The police take firm action against cybercrime, in whatever form. You are less anonymous online than you think. Do you still choose to commit cybercrime? Then be aware of the consequences. Prevent the police from showing up at your door. Think about your future and don't commit a cyber crime.\"Politie told BleepingComputer that in addition to sending emails and letters, the Dutch Police have been conducting \"stop calls\" with minors involved in RaidForums.BleepingComputer was told that during these calls minors and their parents are provided with information about the possible consequences of cybercrime.\"Such a conversation is more effective than a letter for this target group,\" Politie told BleepingComputer.Many of the members of these data leak communities are minors who are enticed by the thrill of hacking into networks and websites and being able to share their activities with a community of like-minded peers."
   },
   {
      "time": "2023-04-14",
      "title": "Cambodia Deports 19 Japanese Cybercrime Scam Suspects - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2023-04-14",
      "title": "Following the Lazarus group by tracking DeathNote campaign | Securelist",
      "text": " Solutions for:ThreatsCategories12 Apr 2023\n  minute read\t\t\t\t\t\t\t\tTable of ContentsAuthorsTimeline of DeathNote clusterIn this blog, we will provide an overview of the significant modifications that have taken place within this cluster, both in terms of its technical and strategic aspects.The notorious threat actor Lazarus has persistently targeted cryptocurrency-related businesses for a long time. While monitoring the actor’s activities, we noticed that in one particular case they were using a significantly modified piece of malware. In mid-October 2019, we came across a suspicious document uploaded to VirusTotal. Upon further investigation, we discovered that the actor behind this weaponized document had been using similar malicious Word documents since October 2018. The malware author used decoy documents that were related to the cryptocurrency business such as a questionnaire about buying specific cryptocurrency, an introduction to a specific cryptocurrency, and an introduction to a bitcoin mining company.Decoy documentsOnce the victim opens the document and enables the macro, the malicious Visual Basic Script extracts the embedded downloader malware and loads it with specific parameters. In this initial discovery, the actor used two types of second-stage payload. The first is a manipulated piece of software that contains a malicious backdoor, while the second is a typical backdoor with a multi-stage binary infection process.Infection procedureThe Trojanized application utilized in the second stage is masquerading as a genuine UltraVNC viewer. If executed without any command line parameters, it will display a legitimate UltraVNC viewer window. However, it carries out a malicious routine when it is spawned with “-s {F9BK1K0A-KQ9B-2PVH-5YKV-IY2JLT37QQCJ}” parameters. The other infection method executes the installer, which creates and registers an injector and backdoor in a Windows service. Finally, the backdoor is injected into a legitimate process (svchost.exe) and initiates a command-and-control (C2) operation. In this infection, the final payload injected into the legitimate process was Manuscrypt. Until this discovery, the Lazarus group had primarily targeted the cryptocurrency business. Our investigation has identified potential compromises of individuals or companies involved in cryptocurrency in Cyprus, the United States, Taiwan and Hong Kong.While tracking this campaign, we uncovered a significant shift in the attack’s target along with updated infection vectors in April 2020. Our research showed that the DeathNote cluster was used to target the automotive and academic sectors in Eastern Europe, both of which are connected to the defense industry. At this point, the actor switched all the decoy documents to job descriptions related to defense contractors and diplomatic services.Decoy documentsInfection chainVerification process of Trojanized PDF readerFinally, this Trojanized PDF viewer overwrites the original opened file with a decoy PDF file and opens it to deceive the victim while implementing the malware payload. The payload is executed with command line parameters, and a shortcut file is created in the Startup folder to ensure persistence. This infection mechanism demonstrates the care and precision with which the actor delivers the payload.In May 2021, we observed that an IT company in Europe that provides solutions for monitoring network devices and servers was compromised by the same cluster. It’s believed that the Lazarus group had an interest in this company’s widely used software or its supply chain.In addition, in early June 2021, the Lazarus group began utilizing a new infection mechanism against targets in South Korea. One thing that caught our attention was that the initial stage of the malware was executed by legitimate security software that is widely used in South Korea. It’s thought that the malware was spread through a vulnerability in this widely used software in South Korea.Infection chainAlmost one year later, in March 2022, we discovered that the same security program had been exploited to propagate similar downloader malware to several victims in South Korea. However, a different payload was delivered in this case. The C2 operator manually implanted a backdoor twice, and although we were unable to acquire the initially implanted backdoor, we assume it is the same as the backdoor in the following stage. The newly implanted backdoor is capable of executing a retrieved payload with named-pipe communication. In addition, the actor utilized side-loading to execute Mimikatz and used stealer malware to collect keystroke and clipboard data from users.Infection chainAround the same time, we uncovered evidence that one defense contractor in Latin America was compromised by the same backdoor. The initial infection vector was similar to what we’ve seen with other defense industry targets, involving the use of a Trojanized PDF reader with a crafted PDF file. However, in this particular case, the actor adopted a side-loading technique to execute the final payload. When the malicious PDF file is opened with the Trojanized PDF reader, the victim is presented with the same malware mentioned above, which is responsible for collecting and reporting the victim’s information, retrieving commands and executing them using pipe communication mechanisms. The actor used this malware to implant additional payloads, including legitimate files for side-loading purposes.Infection chainDuring our investigation of this campaign, we have gained extensive insight into the Lazarus group’s post-exploitation strategy. After initial infection, the operator executed numerous Windows commands to gather basic system information and attempt to find valuable hosts, such as an Active Directory server. Before moving laterally, the Lazarus group acquired Windows credentials using well-known methods, and employed public techniques, such as ServiceMove. When the group completed its mission and began exfiltrating data, they mostly utilized the WinRAR utility to compress files and transmit them via C2 communication channels.In one case, they accessed the default domain controllers policy directly.Utilizing ADFind tool to acquire Active directory information.After tracking the DeathNote cluster and its origin, we have determined that the Lazarus group is responsible for this malware strain. Our conclusion is supported by many security vendors who also believe that the Lazarus group is linked to this malware. Furthermore, we have analyzed the delivery of Windows commands to the victim through the DeathNote malware, and discovered that a significant number of commands were executed between GMT 00:00 and 07:00. Based on our knowledge of normal working hours, we can infer that the actor is located in either the GMT+08 or GMT+09 time zone.Timeline of Windows commandsMoreover, the actor left a Korean comment ‘정상호출’, which translates to ‘normal call’ in the C2 script. This further supports the hypothesis that Lazarus is a Korean-speaking actor.Korean comment in the C2 scriptIn conclusion, the Lazarus group is a notorious and highly skilled threat actor. Our analysis of the DeathNote cluster reveals a rapid evolution in its tactics, techniques and procedures over the years. As the Lazarus group continues to refine its approaches, it is crucial for organizations to maintain vigilance and take proactive measures to defend against its malicious activities. By staying informed and implementing strong security measures, organizations can reduce the risk of falling victim to this dangerous adversary.AuthorsFollowing the Lazarus group by tracking DeathNote campaignYour email address will not be published. Required fields are marked *Name * Email * ΔTable of ContentsGReAT webinarsFrom the same authorsThe hottest research right in your inboxΔIn the same categoryAsian APT groups target various organizations from a multitude of regions and industries. We created this report to provide the cybersecurity community with the best-prepared intelligence data to effectively counteract Asian APT groups.We unveil a Lazarus campaign exploiting security company products and examine its intricate connections with other campaignsHow Kaspersky researchers obtained all stages of the Operation Triangulation campaign targeting iPhones and iPads, including zero-day exploits, validators, TriangleDB implant and additional modules.Nobody would even suspect the mining malware was merely a mask, masquerading behind an intricate modular framework that supports both Linux and Windows.  The amount of effort that went into creating the framework is truly remarkable, and its disclosure was quite astonishing.The hottest research right in your inboxΔThreatsCategories© 2023 AO Kaspersky Lab. All Rights Reserved.\nRegistered trademarks and service marks are the property of their respective owners.The hottest research right in your inboxΔ"
   },
   {
      "time": "2023-04-13",
      "title": "Ransomware attack that forced a New York county back to pen and paper began in 2021, official says",
      "text": " New York’s Suffolk County has concluded an investigation into a destabilizing ransomware attack that forced government workers to rely on fax machines and paper records, discovering stark deficiencies in the county clerk's cybersecurity practices.The BlackCat/AlphV ransomware group took credit for the incident and eventually leaked 400GB of data that was stolen during the attack — including thousands of Social Security numbers.“[The report] describes in great detail the eight months that the criminal actors spent in the clerk's office installing bitcoin mining software, establishing persistence, installing exfiltration tools, creating fake accounts, harvesting credentials and installing remote monitoring tools to establish command and control,” he told reporters.By August, the hackers managed to gain access to a folder with passwords to “highly critical systems that were kept on the clerk's network unprotected.” Within three hours of acquiring that folder, the hackers were eventually able to move into the broader county IT environment.The report pinpoints the acquisition of this password folder as one of the main causes of the attack, since it gave the hackers access to “database systems, servers, phone systems, backup systems, network appliances, file shares, service accounts, critical operational systems, web hosting sites, virus software network monitoring software and more,” Bellone explained.The hackers then spent months laying the groundwork for the attack before exfiltrating troves of data on September 1 and finally deploying the ransomware on September 8. Bellone said the hackers initially demanded $2.5 million in ransom before lowering their demand to about $500,000. No ransom was paid, he added.Despite the longstanding access the BlackCat hackers had, Bellone said the report found that just 1.6% of systems across all county domains were impacted in any way.Bellone went on to criticize the IT department of the clerk’s office, noting that because their office was segregated from the county IT department, it “unfortunately made it easy to withhold information” from other offices.At least one member of the clerk office IT department was placed on administrative leave in December 2022 due to their alleged refusal to cooperate with county investigators and a longstanding refusal to implement cybersecurity mechanisms county-wide, Bellone said.The New York Times obtained emails showing she did ask for a firewall but was rejected by Bellone. Bellone said on Wednesday the investigation proved that her claims were false and that the county had provided her with funding to install a different security system that was never implemented.He added that the county is still working to restore many of the systems that were damaged during the attack, noting that teams from Cisco and Palo Alto Networks are working on the effort. Significant parts of the county network have been back up and running for almost two months, Bellone explained.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-04-13",
      "title": "Education sector sees 34% increase in IoT attacks | SC Media",
      "text": "  Check Point said the IoT devices attacked by threat actors range from a variety of common IoT devices such as routers, IP cameras, and digital video recorders to network video recorders, and printers. “Cybercriminals are aware that IoT devices are notoriously one of the most vulnerable parts of the network,” said the researchers, who added that most are not properly secured or managed, and many IoT devices have default passwords, all of which combined gives attackers a foothold into corporate networks.The dramatic rise in IoT weekly attacks has been driven by a few factors, including the rise in vulnerabilities in open source software, the long-time IoT devices spend in the supply chain, and poor installation practices where firmware and default passwords are not changed, said Bud Broomhead, chief executive officer at Viakoo.“Education as the most impacted vertical makes sense, as the variety, age and cyber hygiene of IoT devices in education would make them more exploitable,” said Broomhead. ”However, all verticals should be concerned about these findings and ensure that IoT devices are installed and maintained with current firmware, strong passwords, and certificates. Organizations that do not already include IoT devices in their overall security posture and governance should make it an urgent priority, especially given the growth shown in this study.”Mike Parkin, senior technical engineer at Vulcan Cyber, added that IoT devices are often overlooked as a threat surface in many environments. Parkin said they are often  especially difficult, if not impossible, to patch, which makes them significantly harder to secure when exposed. “Even devices without a lot of computing power can be inviting targets, as they can make useful springboards into the rest of the environment,” said Parkin. “Organizations need to be aware of the IoT devices in their environments and make sure they're deployed and secured correctly, and kept up-to- date on security patches when they're available. They may seem harmless, but they can't be ignored.”It’s clear iLeakage presents itself as a major flaw with no known mitigation and it’s a real problem for iOS devices – here are some ideas on how to respond. Malware distribution on Android devices has been facilitated by the new SecuriDropper dropper-as-a-service operation by evading Android 13's \"Restricted Settings\" functionality to breach \"Accessibility Services,\" BleepingComputer reports.Jamf says North Korean subgroup of the financially motivated Lazarus Group targets specific users the threat actors believe have access to cryptocurrency.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-04-13",
      "title": "Lazarus Group's 'DeathNote' Cluster Pivots to Defense Sector",
      "text": " An operation within North Korea's notorious Lazarus Group that initially focused solely on coin-mining attacks has begun targeting defense sector organizations around the world.The DeathNote cluster's shift in focus began in 2020 with attacks on automotive and academic organizations in Eastern Europe linked to the defense industry. Researchers from Kaspersky that have been tracking DeathNote's activities found the Lazarus subgroup following up on that attack with subsequent campaigns on defense and defense-related companies in Europe, Latin America, Africa, and South Korea.Kaspersky's analysis of the attack showed the malware using numerous legitimate Windows commands and tools such as Mimikatz for everything from initial reconnaissance on a compromised host system and acquiring login credentials, to lateral movement and exfiltration. To acquire basic system info, for instance, the malware used Windows commands to find TCP and system info, or to query the saved server list from the registry.To move laterally, the actor used a technique called ServiceMove which leverages Windows Perception Simulation Service to load arbitrary DLL files, Kaspersky said. \"When the group completed its mission and began exfiltrating data, they mostly utilized the WinRAR utility to compress files and transmit them via C2 communication channels.\"The tactics, techniques, and procedures (TTPs) that DeathNote employed in its campaign against the defense contractor in Africa were similar to those that Kaspersky observed in another 2022 campaign that hit a defense company in Latin America.Kaspersky security researcher Seongsu Park says DeathNote's evolution from cryptocurrency mining attacks to defense sector espionage is consistent with the Lazarus Group's efforts to broaden its target list over the years.The DeathNote cluster is just one of at least seven separate Lazarus malware clusters that are currently active. The others, according to Kaspersky, are ThreatNeedle, Bookcode, AppleJeus, Mata, CookieTime, and Manuscrypt. The Lazarus group operates several clusters simultaneously and each of these clusters operates in a sophisticated manner, using its own malware toolkit with sometimes overlapping features, Park says.\"Each of their clusters changes targets from time to time,\" Park notes. \"We have observed that other clusters, for example, CookieTime and Bookcode, belonging to the Lazarus group, have also targeted the defense industry before.\"DeathNote's typical TTPs have included using spear-phishing emails with weaponized Word or PDF reader apps. During the days when the cluster focused on coin mining, it used cryptocurrency-themed lures to try and get victims to execute the initial infection vector. Since switching to defense targets, the cluster has been using defense themed lures — including those that purport to be job advertisements — as phishing lures. Kaspersky said it found DeathNote only dropping the second-stage payload on systems belonging to victims it deemed valuable from a cyberespionage standpoint.For the moment at least DeathNote's campaigns targeting the defense sector have not affected US organizations.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-13",
      "title": "Miscreants could use Azure access keys as backdoors • The Register",
      "text": " A design flaw in Microsoft Azure – that shared key authorization is enabled by default when creating storage accounts – could give attackers full access to your environment, according to Orca Security researchers.However, after further investigation, the Microsoft Security Response Center \"determined it was not a security issue.\" That said, the Windows giant acknowledged the issue \"warranted discussion and improvement to help customers more effectively deploy environments with least privilege and defense-in-depth to be more resilient against attackers.\"Additionally, at some later date, Redmond says new storage accounts will have shared key and shared access signature authorization disabled by default, but there's no word on when that will happen.The issue here is that the Microsoft.Storage/storageAccounts/listKeys/action permission enables full operations on data. While customers may grant this permission to users within their organization who need read-only access to data, it also allows the data to be manipulated or even deleted. This, on its own, presents a data security risk to organizations, but Nisimi explains that overly permissive storage account keys can also be abused to move laterally inside the cloud environment.As both Nisimi and Microsoft note, there's a connection between Azure Storage and Azure Functions, which is the cloud provider's serverless service. When a developer deploys a Function App, this action creates a dedicated storage account that hosts all functions' source code. As Nisimi explains:The storage account of a Function App can be found inside the AzureWebJobStorage environment variable under Application Settings, which includes a connection string to the storage account, together with one of the storage account keys.In Orca's attack scenario, a fictional employee, Chris Green, is assigned a storage account contributor role. If his account is compromised, attackers can manipulate storage account data.From here, however, it's also possible to compromise a Function App provided the attacker can filter out all function-related storage accounts (and their related file shares with source code) and from that list determine the functions' objectives. For this example, Orca selects a storage account named \"monitorvms98d0,\" because the name suggests it has to do with monitoring virtual machines (VMs). After downloading the code file, the attacker can see that the managed identity assigned to this Function App can execute a command under the Azure Resource Manager Provider.\"At this point stealing credentials and Escalating Privileges, as scary as it may sound, is fairly easy,\" Nisimi said. \"Once an attacker locates the Storage Account of a Function App that is assigned with a strong managed identity, it can run code on its behalf and as a result acquire a subscription privilege escalation (PE).\"After obtaining a managed-identity access token, Orca's fictional attacker uses an API call to list all the VMs in the subscription, finds a promising VM labeled \"CustomersDB,\" uploads a reverse shell to the VM and then sets write permissions to the VM, which the attacker now effectively owns.\"This attack-flow scenario is possible if an AD User with listKeys permissions is being compromised (as in our example), but also if storage accounts' connection-strings/access-keys are leaked,\" Nisimi wrote. \"By overriding function files in storage accounts, an attacker can steal and exfiltrate a higher-privileged identity and use it to move laterally, exploit and compromise victims' most valuable crown jewels.\"For its part, Microsoft says Orca's research \"highlighted opportunities for us to continue to improve to help customers correctly configure their environments with least privilege.\"The Register   Biting the hand that feeds IT\n                        Copyright. All rights reserved © 1998–2023\n\n                    "
   },
   {
      "time": "2023-04-13",
      "title": "DDoS attacks shifting to VPS infrastructure for increased power",
      "text": " Hyper-volumetric DDoS (distributed denial of service) attacks in the first quarter of 2023 have shifted from relying on compromised IoT devices to leveraging breached Virtual Private Servers (VPS).According to internet security company Cloudflare, the newer generation of botnets gradually abandoned the tactic of building large swarms of individually weak IoT devices and are now shifting towards enslaving vulnerable and misconfigured VPS servers using leaked API credentials or known exploits.This approach helps the threat actors build high-performance botnets easier and often quicker, which can be up to 5,000 times stronger than IoT-based botnets.\"Cloud computing providers offer virtual private servers to allow start ups and businesses to create performant applications. The downside is that it also allows attackers to create high-performance botnets that can be as much as 5,000x stronger.\"Cloudflare has been working with key cloud computing providers and partners to crack down on these emerging VPS-based threats and says it has succeeded in taking down substantial portions of these novel botnets.In general, Cloudflare reports steady DDoS activity in the first quarter of the year, with a notable 60% YoY increase in the ransom DDoS attacks, representing 16% of all recorded/reported DDoS attacks.These extortion-based DDoS attacks cause service outages to the target by bombarding them with garbage traffic and continue indefinitely until the victim meets the attacker's demands.The most targeted country by DDoS attacks in general during Q1 '23 was Israel, followed by the United States, Canada, and Turkey. Internet services, marketing, software, and gaming/gambling were the most targeted sectors.The most significant attack seen by Cloudflare this quarter peaked above 71 million requests per second. Another notable incident was a 1.3 terabits per second DDoS attack targeting a telecommunications service provider in South America.In terms of the size and duration of the attacks, most of them (86.6%) lasted for under 10 minutes, while 91% did not exceed 500 Mbps.However, the number of larger attacks is still growing, with attacks surpassing 100 Gbps, recording a rise of about 6.5% compared to the previous quarter.DDoS attacks can manifest in many ways, and as defenses evolve to address them, attackers may devise new methods or return to old tactics that newer protection systems may not prioritize anymore.In this quarter, Cloudflare recorded the following emerging trends:DDoS attacks in Q1 2023 show a trend of increasing in size and duration, targeting a broad range of industries. Therefore, effective defense strategies require automated detection and mitigation solutions."
   },
   {
      "time": "2023-04-13",
      "title": "Reddit is down, not loading content for mobile app users",
      "text": " Reddit is investigating a worldwide outage that prevents users from accessing the social network's website on mobile apps.Users are reporting being automatically logged out when opening the mobile app and seeing several types of content loading errors, including \"No Internet,\" \"Sorry, please try again later,\" and \"Let's try that again.\"On its official status page, Reddit has confirmed that only native mobile apps are currently down, with its engineers already working on addressing the root cause of this outage.\"We are currently investigating issues loading Reddit primarily affecting iOS devices,\" the company said in an incident report published 1 hour ago at 10:51 PDT.\"We identified the problem and working to rectify it currently,\" Reddit added 20 minutes later."
   },
   {
      "time": "2023-04-13",
      "title": "Microsoft: NSO Group-Like 'QuaDream' Actor Selling Mobile Spyware to Governments",
      "text": " Microsoft has identified another Israel-based threat organization, similar to NSO Group, that is selling mobile spyware and other cyber espionage tools and services to international governments to monitor and spy on private individuals.\"Microsoft Threat Intelligence analysts assess with high confidence that the malware, which we call KingsPawn, is developed by DEV-0196 and therefore strongly linked to QuaDream,\" the researchers wrote. \"We assess with medium confidence that the mobile malware we associate with DEV-0196 is part of the [company's 'Reign' offering].\"Meanwhile, Microsoft Threat Intelligence believes that DEV-0196 is selling both exploitation services and its KingsPawn iOS malware to governments to spy on and track members of civil society — including journalists, political opposition figures, and a non-government organization (NGO) worker — in locations across Europe, North America, the Middle East, and Southeast Asia.The behavior of DEV-0196 is consistent with that of \"private sector offensive actors (PSOAs)\" or \"cyber mercenaries,\" according to Microsoft Threat Intelligence, which sell hacking tools or services through a variety of business models — including access as a service — to the highest bidder. They don't directly target individuals or run cyber espionage operations themselves.Microsoft and its partners analyzed samples of the multi-component KingsPawn, which specifically targets iOS 14. However, it's possible that some of the code also could be used on Android devices, the researchers said. It's also likely that the threat group has already updated the malware to target versions of iOS newer than 14, as the latest version of Apple's operating system software is already up to iOS 16, the researchers said.The monitor agent is responsible for reducing the forensic footprint of the malware to prevent detection and hinder investigations, as well as manage the various processes and threads spawned on behalf of the malware to avoid artifacts created from unexpected process crashes.Within the main agent of KingsPawn is the real gravy of the spyware where all of the capabilities to track victims and steal data lies, the researchers said.Capabilities of the main agent include: obtaining device, Wi-Fi, cellular info, searching for and retrieving files, using the camera in the background, locating where the device is, monitoring phone calls, accessing the iOS keychain for passwords, and generating an iCloud one-time password that's time sensitive to retrieve stored data.\"The agent also creates a secure channel for XPC messaging by creating a nested app extension called fud.appex,\" the researchers wrote. \"XPC messaging allows the agent to query various system binaries for sensitive device information, such as location details.\"Microsoft has developed unique network detections that could be used to fingerprint DEV-019's infrastructure on the Internet based on the group's heavy use of domain registrars and inexpensive cloud hosting providers that accept cryptocurrency as payment, the researchers said.\"They tended to only use a single domain per IP address and domains were very rarely reused across multiple IP addresses,\" they wrote in the post. \"Many of the observed domains were deployed using free Let's Encrypt SSL certificates, while others used self-signed certificates designed to blend in with normal Kubernetes deployments.\"The blog post includes network-based indicators that the researchers gleaned from their investigation to help potential victims identify if they've been compromised, including domains strongly associated with some countries that Citizen Lab has identified as locations of victims, countries where QuaDream platforms were operating, or both.While acknowledging that preventing exploitation of mobile devices by threat actors who are exploiting zero-click vulnerabilities is difficult, there are ways to minimize the risk of mobile devices being compromised, the researchers said.Following basic cyber hygiene and best practices to keep device software updated through automatic updates, the use of anti-malware software, and maintaining vigilance not to click on malicious links or suspicious messages can also help potential victims avoid compromise.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-04-13",
      "title": "Kyocera Android app with 1M installs can be abused to drop malware",
      "text": " A Kyocera Android printing app is vulnerable to improper intent handling, allowing other malicious applications to abuse the flaw to download and potentially install malware on devices.Although the apps list different publishers, they are based on the same code; thus, the vulnerability impacts all three.KYOCERA published a security bulletin on the issue yesterday, urging users of its printing app to upgrade to version 3.2.0.230227, currently available via Google Play.\"And, by using the KYOCERA Mobile Print web browser functionality, malicious sites can be accessed and malicious files can be downloaded and executed, which can lead to the acquisition of internal information on mobile devices.\"For such an attack to occur, the user must also install a second malicious application on their device that will trigger the payload download.Despite that requirement mitigating the severity of the flaw, it would be easy to distribute a malicious app that takes advantage of the issue, as it wouldn't have to include risky code, request the approval of risky permissions upon installation, etc.Instead, it would just have to check for the presence of these vulnerable apps and abuse them to install malware.Starting from Android 14, the exchange of intents between apps will be restricted, requiring the definition of specific recipients by the sender, the declaration of what information an app needs to receive from other apps, and whether or not receivers should be limited to system broadcasts.This security enhancement would shield privileged apps like printing utilities from malicious intents sent by other applications running on the same device."
   },
   {
      "time": "2023-04-13",
      "title": "Windows admins warned to patch critical MSMQ QueueJumper bug",
      "text": " Security researchers and experts warn of a critical vulnerability in the Windows Message Queuing (MSMQ) middleware service patched by Microsoft during this month's Patch Tuesday and exposing hundreds of thousands of systems to attacks.The list of affected Windows server and client versions includes all currently supported releases up to the latest versions, Windows 11 22H2 and Windows Server 2022. Redmond has also attached an \"exploitation more likely\" tag to CVE-2023-21554, given that it's \"aware of past instances of this type of vulnerability being exploited,\" which makes it \"an attractive target for attackers.\"Security researchers Wayne Low of Fortinet's FortiGuard Lab and Haifei Li of Check Point Research were credited for reporting the flaw to Microsoft.Check Point Research also shared additional details regarding the potential impact of CVE-2023-21554, saying that it found more than 360,000 Internet-exposed servers running the MSMQ service and potentially vulnerable to attacks.The number of unpatched systems is likely much higher, seeing that Check Point Research's estimate doesn't include devices running the MSMQ service that aren't reachable over the Internet.For instance, Check Point Research found that MSMQ will be automatically enabled during Exchange Server installs.\"The important takeaway is that if MSMQ is enabled on a server, the attacker could potentially exploit this or any MSMQ vulnerability and take over the server.\"​While Microsoft has already addressed this bug and 96 other security flaws as part of the April Patch Tuesday, it also advised admins who can't immediately deploy the patch to disable the Windows MSMQ service (if possible) to remove the attack vector.Organizations that can't immediately disable MSMQ or deploy Microsoft's patch can also block 1801/TCP connections from untrusted sources using firewall rules."
   },
   {
      "time": "2023-04-13",
      "title": "Microsoft shares guidance to detect BlackLotus UEFI bootkit attacks",
      "text": " Microsoft has shared guidance to help organizations check if hackers targeted or compromised machines with the BlackLotus UEFI bootkit by exploiting the CVE-2022-21894 vulnerability.Organizations and individuals can also use Microsoft’s advice to recover from an attack and to prevent threat actors using BlackLotus from achieving persistence and evading detection.Malware for the Unified Extensible Firmware Interface (UEFI) is particularly challenging to detect as these threats run before the operating system, being capable to deploy payloads early on in the boot process to disable security mechanisms.Analyzing devices compromised with BlackLotus, the Microsoft Incident Response team identified several points in the malware installation and execution process that allow its detection.The researchers note that defenders can look for the following artifacts to determine a BlackLotus UEFI bootkit infection:Since BlackLotus needs to write malicious bootloader files to the EFI system partition, also referred to as ESP, it will lock them to prevent their deletion or modification.For instance, if the G: drive letter is free, you can execute this command:If the modification time does not look suspicious, threat hunters can try to calculate the hash of the bootloader file. On a compromised device the output should be a file access error because BlackLotus locks them to prevent their tampering.Another tell of BlackLotus is the presence of the “/system32/” directory on the ESP, which is the storage location for the files required to install the UEFI malware.Microsoft says that successful installation of BlackLotus results in deleting the files inside “ESP:/system32/” but the directory remains. Forensic analysts can use this to search for the removed files.One of the BlackLotus capabilities is to disable the hypervisor-protected code integrity (HVCI), which allows it to load unsigned kernel code.A second safety feature that BlackLotus disables is Microsoft Defender Antivirus, the default security agent on the Windows operating system.This action may leave traces in the Windows Event Logs in the form of an entry under the Microsoft-Windows-Windows Defender/Operational Log.Turning off Defender may also generate an Event ID 7023 in the System event log as a result of the service stopping unexpectedly.Microsoft investigators advise threat hunters to examine network logs for outbound connections from winlogon.exe on port 80, which may be indicative of BlackLotus trying to communicate with its command and control (C2) server.Additional evidence of BlackLotus compromise can be present in the boot configuration logs - MeasuredBoot logs, that provide details about the Windows boot process.When the bootkit becomes active, two boot drivers become available, specifically grubx64.efi and winload.efi. By comparing the logs for each reboot of the system, analysts can find the components that have been added or removed from each machine boot.Microsoft warns that accessing the MeasuredBoot log files is possible using a forensic image or raw NTFS reading tool.Below is an example of the BlackLotus drivers the sample script showed on an infected machine:Cleaning a machine after a BlackLotus infection requires removing it from the network and reinstalling it with a clean operating system and EFI partition, or restoring from a clean backup with an EFI partition.While the post-infection artifacts are revealing in determining the type of malware used, defenders can prevent the compromise by detecting an intrusion before the adversary can deploy UEFI malware.Launching a UEFI bootkit, though, requires privileged access to the target machine, either remote or physical, meaning that a first-stage threat and an initial access vector precede the persistent infection.To fend off an infection via BlackLotus or other malware exploiting CVE-2022-21894, Microsoft recommends organizations practice the principle of least privilege and credential hygiene.“Avoid the use of domain-wide, admin-level service accounts. Restricting local administrative privileges can help limit installation of remote access trojans (RATs) and other unwanted applications” - MicrosoftBy implementing multiple layers of security controls, the so-called defense in-depth strategies, organizations can reduce the risk of an adversary gaining access or administrative privilege in the environment.This can essentially stop a BlackLotus attack in its earlier stages before the threat actor can compromise a user or service account credentials to move laterally on the network and escalate their privileges."
   },
   {
      "time": "2023-04-13",
      "title": "3CX Security Update 11 April 2023 | Mandiant Initial Results",
      "text": " Following the appointment of Mandiant as our security incident response team, forensic analysis on our network and product is in progress. In a nutshell, the interim assessment concluded:Based on the Mandiant investigation into the 3CX intrusion and supply chain attack thus far, they attribute the activity to a cluster named UNC4736. Mandiant assesses with high confidence that UNC4736 has a North Korean nexus.Mandiant determined that the attacker infected targeted 3CX systems with TAXHAUL (AKA “TxRLoader”) malware. When executed on Windows systems, TAXHAUL decrypts and executes shellcode located in a file named <machine hardware profile GUID>.TxR.0.regtrans-ms located in the directory C:\\Windows\\System32\\config\\TxR\\. The attacker likely chose this file name and location to attempt to blend into standard Windows installations. The malware uses the Windows CryptUnprotectData API to decrypt the shellcode with a cryptographic key that is unique to each compromised host, which means the data can only be decrypted on the infected system. The attacker likely made this design decision to increase the cost and effort of successful analysis by security researchers and incident responders.The following YARA rule can be used to hunt for TAXHAUL (TxRLoader):rule TAXHAUL\n{\nmeta:\nauthor = \"Mandiant\"\ncreated = \"04/03/2023\"\nmodified = \"04/03/2023\"\nversion = \"1.0\"\nstrings:\n$p00_0 = {410f45fe4c8d3d[4]eb??4533f64c8d3d[4]eb??4533f64c8d3d[4]eb}\n$p00_1 = {4d3926488b01400f94c6ff90[4]41b9[4]eb??8bde4885c074}\ncondition:\nuint16(0) == 0x5A4D and any of them\n}Please note that in a similar way to any YARA rule, this should be properly assessed within a test environment first before usage in production. This also comes with no guarantees regarding false positive rates, as well as coverage for this entire malware family and eventual variants.Mandiant also identified a MacOS backdoor, currently named SIMPLESEA, located at /Library/Graphics/Quartz (MD5: d9d19abffc2c7dac11a16745f4aea44f). Mandiant is still analysing SIMPLESEA to determine if it overlaps with another known malware family.*The backdoor written in C communicates via HTTP. Supported backdoor commands include shell command execution, file transfer, file execution, file management, and configuration updating. It can also be tasked to test the connectivity of a provided IP and port number.The backdoor checks for the existence of its configuration file at /private/etc/apdl.cf. If it does not exist, it creates it with hard-coded values. The config file is single-byte XOR encoded with the key 0x5e. C2 comms are sent over HTTP requests. A bot id is generated randomly seeded with the PID of the malware upon initial execution. The id is sent with C2 communications. A brief host survey report is included in beacon requests. Message contents are encrypted with the A5 stream cipher according to the function names in the binary.* Previous reporting mentioned the macOS build server was compromised with SIMPLESEA. Mandiant Intelligence analyzed the sample and determined it to have a high degree of code overlap with POOLRAT, deprecating SIMPLESEA in favor of POOLRAT.On Windows, the attacker used DLL side-loading to achieve persistence for TAXHAUL malware. DLL side-loading triggered infected systems to execute the attacker's malware within the context of legitimate Microsoft Windows binaries, reducing the likelihood of malware detection. The persistence mechanism also ensures the attacker malware is loaded at system start-up, enabling the attacker to retain remote access to the infected system over the internet.The malware was named C:\\Windows\\system32\\wlbsctrl.dll to mimic the legitimate Windows binary of the same name. The DLL was loaded by the legitimate Windows service IKEEXT through the legitimate Windows binary svchost.exe.Mandiant identified that malware within the 3CX environment made use of the following command and control infrastructure:Subscribe to our Product News:Trusted by 350,000+ companiesThe #1 Communications System!12,000,000+ users everyday"
   }
]