[
   {
      "time": "2022-10-09",
      "title": "Biden signs new US-EU privacy framework, setting up surveillance safeguards",
      "text": " “U.S. and EU companies large and small across all sectors of the economy rely upon cross-border data flows to participate in the digital economy and expand economic opportunities,” the administration said in a press statement. The order outlines additional safeguards for U.S. signals intelligence collection activities and how information gathered through those systems is handled. Among those safeguards is a preference for targeted — rather than bulk — collection. It also limits the use of information gathered through bulk collection to protecting against terrorism, foreign nation espionage, proliferation of weapons of mass destruction, threats against U.S. personnel, and foreign cybersecurity threats. The order also sets up a new process for people in the European Union to object if they believe their data is being inappropriately spied upon. The review process involves two steps. The first is an investigation by the Civil Liberties Protection Officer in the Office of the Director of National Intelligence. Depending on the outcome of that inquiry, complainants may apply to be heard by the Data Protection Review Court (DPRC) — a new body with judges to be appointed from outside the U.S. government. Special advocates will be appointed by the DPRC advocate for complainants.U.S. intelligence agencies are required to adjust their practices to account for the new safeguards in the order, which also tasks the Privacy and Civil Liberties Oversight Board with reviewing their compliance on an annual basis. Greg Nojeim, Senior Counsel and Director of Security and Surveillance Project at the Center for Democracy and Technology, said the order’s safeguards are a step in the right direction. However, “questions remain about the breadth of permissible surveillance” and if the DPRC can provide a functional forum for review and redress of surveillance claims. “It remains uncertain whether EU authorities – and ultimately the EU Court of Justice – will deem these steps sufficient to satisfy the legal requirements for a new adequacy decision to support transatlantic data flows,” he said.Andrea Peterson (they/them) is a longtime cybersecurity journalist who cut their teeth covering technology policy at ThinkProgress (RIP) and The Washington Post before doing deep-dive public records investigations at the Project on Government Oversight and American Oversight.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-09",
      "title": "Researchers find bugs in IKEA smart lighting system",
      "text": " Two vulnerabilities have been discovered in a line of IKEA smart lights that would allow an attacker to take control of the system and make the bulbs rapidly blink on and off. By the end of October 2021, IKEA responded to the inquiry and said it was producing a fix for the vulnerabilities. The company published a fix for CVE-2022-39065 on February 16, 2022 and a partial remedy for CVE-2022-39064 in June. The vulnerability allows an attacker to send a malicious frame through the protocol to make IKEA's TRÅDFRI bulb blink. If they resend the malicious message multiple times, the bulb performs a factory reset.“This causes the bulb to lose configuration information about the Zigbee network and current brightness level. After this attack, all lights are on with full brightness, and a user cannot control the bulbs with either the IKEA Home Smart app or the TRÅDFRI remote control,” Synopsys researchers explained. The second related bug can make it so the TRÅDFRI is unresponsive to the device remote control and the IKEA Home Smart app. Hulkko and Untinen said all vulnerable devices “within radio range are affected” and noted that it has a CVSS score of 6.5. “To recover from this attack, a user could manually power cycle the gateway. However, an attacker could reproduce the attack at any time,” they said. An IKEA spokesperson told The Record that the company has worked with Synopsys since the disclosures to improve the “safety and functionality” of their smart devices.“It is important to note that the identified issue is not jeopardizing the safety for our customers and can be replicated in other, already known ways due to the design of the Zigbee protocol,” the spokesperson said. “We also want to clarify that it is not possible to gain access to sensitive information inside TRÅDFRI Gateway or our smart devices.”Hulkko and Untinen said that while CVE-2022-39065 has been solved with all software versions 1.19.26 or later, CVE-2022-39064 has not been fully dealt with. “Version V-2.3.091 fixes issues with some malformed frames but not with all known malformed frames,” they said, sharing a video of the exploit. IKEA did not respond to requests for comment about when a full patch will be released. Bud Broomhead, CEO of IoT security firm Viakoo, explained that the danger of an exploit like this is it can cause a factory reset. With many Zigbee and related IoT devices this can lead to the IoT device connecting into a threat actor-controlled Zigbee network, not the one it was intended to. “Zigbee is a network of connected IoT devices; this form of IoT where devices work together in a tightly-coupled way is very attractive to threat actors, because of the ability to exploit multiple devices through a single network breach (as opposed to loosely coupled individual devices that do not impact each other if one is compromised),” he said. Broomhead added that more work needs to be done on improving and securing Zigbee as a standard because he believes it is too easy for threat actors to intercept encrypted data transmissions and impact device operations or worse.“I’m thankful that this was just lightbulbs, not door locks, cameras, or industrial control systems, all of which can be connected through Zigbee, yet can have more devastating consequences from being breached and exploited,” he noted. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-09",
      "title": "Eternity Group Hackers Offering New LilithBot Malware-as-a-Service to Cybercriminals",
      "text": " The threat actor behind the malware-as-a-service (MaaS) known as Eternity Group has been linked to new piece of malware called LilithBot.\"The group has been continuously enhancing the malware, adding improvements such as anti-debug and anti-VM checks.\"LilithBot is the latest addition to this list. Like its counterparts, the multifunctional malware bot is sold on a subscription basis to other cybercriminals in return for a cryptocurrency payment.Upon a successful compromise, the information gathered through the bot – browser history, cookies, pictures, and screenshots – is compressed into a ZIP archive (\"report.zip\") and exfiltrated to a remote server.The development is a sign that the Eternity Project is actively expanding its malware arsenal, not to mention adopting sophisticated techniques to bypass detections.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-10-09",
      "title": "LofyGang Distributed ~200 Malicious NPM Packages to Steal Credit Card Data",
      "text": " Multiple campaigns that distributed trojanized and typosquatted packages on the NPM open source repository have been identified as the work of a single threat actor dubbed LofyGang.Checkmarx said it discovered 199 rogue packages totaling thousands of installations, with the group operating for over a year with the goal of stealing credit card data as well as user accounts associated with Discord Nitro, gaming, and streaming services.It's also known to employ a Discord server created nearly a year ago on October 31, 2021, to provide technical support and communicate with their members. One of its main offerings is a service that sells fake Instagram followers.\"Discord, Repl.it, glitch, GitHub, and Heroku are just a few services LofyGang is using as [command-and-control] servers for their operation,\" the researchers noted.What's more, the fraudulent packages traced back to the group have been found to embed password stealers and Discord-specific malware, some of which are designed to steal credit cards.To conceal the scale of the supply chain attack, the packages are intentionally published through different user accounts so that other weaponized libraries remain unaffected on the repositories even if one of them is spotted and removed by the maintainers.Furthermore, the adversary has been found using a sneaky technique wherein the top-level package is kept free of malware but have it depend on another package that introduces the malicious capabilities.That's not all. Even the hacking tools shared by LofyGang on GitHub depend on malicious packages, effectively acting as a conduit to deploy persistent backdoors on the operator's machines.\"Communities are being formed around utilizing open-source software for malicious purposes,\" the researchers concluded. \"We believe this is the start of a trend that will increase in the coming months.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-10-09",
      "title": "Hacker steals $566 million worth of crypto from Binance Bridge",
      "text": " This article was updated on 10/7/22 with further information.Hackers have reportedly stolen 2 million Binance Coins (BNB), worth $566 million, from the Binance Bridge.Soon after the hacker began spreading some of the funds across a variety of liquidity pools, attempting to transfer the BNB into other assets.Binance acknowledged the security incident at 6:19 PM EST and paused the BNB Smart Chain while they investigated the incident.At 7:51 PM EST, the CEO of Binance tweeted that an exploit was used in the BSC Token Hub to transfer the BNB to the attacker and that they had asked all validators to suspend the Binance Smart Chain.\"We have asked all validators to temporarily suspend BSC. The issue is contained now. Your funds are safe. We apologize for the inconvenience and will provide further updates accordingly.\"While the majority of the stolen funds remain on the BNB Smart Chain, and are now inaccessible to the hacker, Binance estimates that between $70M - $80M were taken off-chain.Working with partners in the cryptocurrency community, $7 million of those off-chain assets have already been frozen.Update 10/7/22: At approximately 2:30 AM EST Friday, Binance again resumed the BNB Smart Chain (BSC) and enabled deposits and withdrawals on Binance.In a further update on Binance.com, the company apologized to the community for the attack and thanked partners and validators for their swift response.While Binance says they will provide a postmortem with further details in the future, they confirmed that 2 million BNB was stolen using an exploit on the BSC Token Hub.A total of 2 million BNB was withdrawn. The exploit was through a sophisticated forging of the low level proof into one common library.\"This is a developing story."
   },
   {
      "time": "2022-10-09",
      "title": "Fortinet warns admins to patch critical auth bypass bug immediately",
      "text": " Fortinet has warned administrators to update FortiGate firewalls, FortiProxy web proxies, and FortiSwitch Manager (FSWM) on-premise management platforms to the latest versions, which address a critical severity vulnerability.The security flaw (tracked as CVE-2022-40684) is an authentication bypass on the administrative interface that could allow remote threat actors to log into unpatched devices.\"An authentication bypass using an alternate path or channel [CWE-88] in FortiOS and FortiProxy may allow an unauthenticated attacker to perform operations on the administrative interface via specially crafted HTTP or HTTPS requests,\" Fortinet explains in a customer support bulletin issued today.\"This is a critical vulnerability and should be dealt with the utmost urgency,\" the company adds.Fortinet has also emailed customers and advised them to update to the latest available versions immediately.The complete list of products vulnerable to attacks attempting to exploit the CVE-2022-40 flaw includes:Per today's customer support bulletin, Fortinet released security patches on Thursday, asking customers to update vulnerable devices to FortiOS 7.0.7 or 7.2.2 and above, FortiProxy 7.0.7 or 7.2.1 and above, and FortiSwitchManager 7.2.1 or above.The company also provides a workaround for those who can't immediately deploy security updates.To block remote attackers from bypassing authentication and logging into vulnerable FortiGate and FortiProxy deployments, customers should limit the IP addresses that can reach the administrative interface using a local-in-policy.However, as revealed in an advanced communication to \"selected customers,\" Fortinet advises admins to disable remote management user interfaces to ensure that potential attacks are blocked.\"If these devices cannot be updated in a timely manner, internet facing HTTPS Administration should be immediately disabled until the upgrade can be performed,\" Fortinet said.A Fortinet spokesperson refused to comment when asked if the vulnerability is actively exploited in the wild and hinted that the company would share more information in the coming days.\"Customer communications often detail the most up-to-date guidance and recommended next steps to best protect and secure their organization,\" the Fortinet spokesperson said.\"There are instances where confidential advance customer communications can include early warning on Advisories to enable customers to further strengthen their security posture, which then will be publicly released in the coming days to a broader audience.\"Update October 07, 13:22 EDT: Added Fortinet statement.Update October 10, 11:36 EDT: Added info on FortiSwitchManager versions."
   },
   {
      "time": "2022-10-09",
      "title": "Hackers exploiting unpatched RCE bug in Zimbra Collaboration Suite",
      "text": " Hackers are actively exploiting an unpatched remote code execution (RCE) vulnerability in Zimbra Collaboration Suite (ZCS), a widely deployed web client and email server.Successful exploitation of the vulnerability allows an attacker to overwrite the Zimbra webroot, implant shellcode, and access other users' accounts.The root cause of the vulnerability is using the 'cpio' file archiving utility to extract archives when Amavis scans a file for viruses.The cpio component has a flaw that allows an attacker to create archives that can be extracted anywhere on a filesystem accessible to Zimbra.When an email is sent to a Zimbra server, the Amavis security system will extract the archive to perform a virus scan of its contents. However, if it extracts a specially crafted .cpio, .tar, or .rpm archive, the contents could be extracted to the Zimbra webroot.Using this vulnerability, an attacker could deploy web shells to the Zimbra root, effectively giving them shell access to the server.Zimbra released a security advisory on September 14 to warn system administrators to install Pax, a portable archiving utility, and restart their Zimbra servers to replace cpio, which is the vulnerable component.\"For most Ubuntu servers the pax package should already be installed as it is a dependency of Zimbra. Due to a packaging change in CentOS, there is a high chance pax is not installed.\"Installing Pax is enough to mitigate the problem as Amavis prefers it over cpio automatically, so no further configuration is required.Even worse, tests conducted by Rapid7 show that many Linux distributions officially supported by Zimbra still do not install Pax by default, making these installations vulnerable to the bug.These distros include Oracle Linux 8, Red Hat Enterprise Linux 8, Rocky Linux 8, and CentOS 8. Ubuntu's older LTS releases, 18.04 and 20.04, include Pax, but the package was removed in 22.04.Since proof-of-concept (PoC) exploits have been publicly available for a while, the risk of not implementing the workaround is dire.Zimbra plans to mitigate this issue decisively by deprecating cpio and making Pax a prerequisite for Zimbra Collaboration Suite, thus enforcing its use.However, the risks remain for existing installations, so administrators need to take immediate action to protect their ZCS servers."
   },
   {
      "time": "2022-10-09",
      "title": "ADATA denies RansomHouse cyberattack, says leaked data from 2021 breach",
      "text": " Taiwanese chip maker ADATA denies claims of a RansomHouse cyberattack after the threat actors began posting stolen files on their data leak site.The RansomHouse gang added ADATA files to their data leak site on Tuesday, claiming they stole 1TB worth of documents in a 2022 cyberattack. The threat actors also leaked samples of allegedly stolen files, which appear to belong to the company.\"By several technical ways check, we are confident what Ransomhouse claimed are fake and those data has been stolen by Ragnar Locker in 2021,\" a spokesperson for ADATA told BleepingComputer.\"After the hit by Ragnar Locker in 2021, ADATA retained information security experts and implemented effective methods to set up strong protection.  Since then, no attack to ADATA was successful.  None of confidential information of ADATA was leaked.\"Comparing the timestamps on the data shared by RansomHouse with the data leaked by Ragnar Locker in June 2021, both sets of stolen data have similar timestamps, with no file being newer than May 2021.ADATA added that RansomHouse had not left any ransom notes on their servers to prove that an attack occurred.However, RansomHouse continues to claim they breached ADATA recently in a data theft attack and that they had negotiated with the company on the stolen data.The threat actors claim not to use any ransomware in their attacks, but the White Rabbit ransom notes clearly link encryption attacks to Ransom House.More recently, RansomHouse claimed an attack on eight municipalities in Italy.During this attack, ransomware was used that appended the .mario extension to encrypted files and left a ransom note greeting victims with, \"Buongiorno la mia bella Italia.\""
   },
   {
      "time": "2022-10-09",
      "title": "Кіберполіція викрила масштабну мережу ботоферм, що поширювала фейки та пропаганду про війну в Україні – Юрій Виходець — Департамент Кіберполіції",
      "text": " Реалізація державної політики в сфері протидії кіберзлочинності\n                         Завчасне інформування населення про появу нових кіберзлочинців\n                         Впровадження програмних засобів для систематизації кіберінцидентів\n                         Реагування на запити зарубіжних партнерів, які будуть надходити по каналах Національної Цілодобової мережі контактних пунктів06 жовтня 2022 р. 17:03Ботоферма нараховувала понад 50 тисяч ботів у соціальних мережах та поштових сервісах. Про це, сьогодні, 6 жовтня, повідомив начальник Департаменту кіберполіції під час брифінгу у Military Media Center.  Юрій Виходець зазначив, що спільно з Головним слідчим управлінням Нацполіції встановлено чотирьох організаторів мережі ботоферм: «Для реалізації злочинної схеми фігуранти залучали громадян рф та жителів тимчасово окупованих територій України. Виконавці отримували оплату за створені акаунти у російських рублях через заборонені в Україні електронні платіжні системи».Начальник Департаменту кіберполіції додав, що фейкові сторінки використовувалися для поширення недостовірної інформації щодо війни, виправдання окупації українських територій та пропаганди у вигляді дописів та коментарів у соцмережах: «Правопорушники генерували майже 3 тисячі фейкових акаунтів на тиждень. Загалом мережа ботоферм налічувала більше 50 тисяч ботів. Крім цього, фігуранти здійснювали рекламування фішингових шахрайських сторінок».За словами Юрія Виходця, під час проведених обшуків вилучено майже 35 тисяч SIM-карт різних мобільних операторів України та інших держав, а також комп’ютерну техніку, мобільні телефони та документацію. \r\nРозслідується кримінальне провадження за ч. 3 ст. 361 Кримінального кодексу України. Фігурантам загрожує до восьми років позбавлення волі.Департамент кіберполіції Національної поліції УкраїниЗазначте деталі події (фішинг, malware). Завантажте шкідливий файл. При наявності email листа, додайте його у форматі: .emlЗверніть увагу, що дана форма розрахована тільки на отримання інфомації про шкідливий контент. Для звернень використувуйте форму:АДМІНІСТРАЦІЯ ПРЕЗИДЕНТА УКРАЇНИКАБІНЕТМІНІСТРІВ УКРАЇНИВЕРХОВНАРАДА УКРАЇНИМІНІСТЕРСТВО ВНУТРІШНІХ СПРАВ УКРАЇНИтел. 0 800 505 170"
   },
   {
      "time": "2022-10-09",
      "title": "IBM: Ransomware attacks take psychological toll on incident responders",
      "text": " Hundreds of cybersecurity incident responders said ransomware attacks are having a dramatic effect on their mental health, according to a survey from IBM and Morning Consult.Laurance Dine, global lead of incident response at IBM Security X-Force, told The Record that ransomware has changed the stakes because of the immediate disruption and direct financial loss it can cause businesses, as well as the potential public impact.“On the one hand these are destructive attacks to a business. Every minute a manufacturer’s assembly line is offline its CEO knows exactly how much money the business is losing — and incident responders are made very much aware of it,” Dine said. “On the other, targeting has become much more intentional, with critical services high on ransomware actors' target list. When you’re potentially what stands in the way of a malicious actor and someone being able to heat their home, get to work, or stock grocery shelves, the pressure adds up quickly. You know the repercussions would be palpable for many people. These aren’t theoretical scenarios — but fights fought.”The IBM study found that most incident responders were driven into the cybersecurity industry by an instinct to protect, but that sense of responsibility is also one of the most stressful aspects of incidents. About half of all respondents had a “sense of responsibility toward their team/client” and “managing stakeholder expectations” as the top three stressors during cyber incidents. More than three-fourths of respondents said they experience stress and anxiety in their daily lives as a result of responding to cyber incidents. About 65% of respondents have sought mental health assistance as a result of responding to cybersecurity incidents. The most stressful period of a cybersecurity engagement are the first three days, where more than a third of respondents said they worked more than 12 hours a day.The average incident response engagement lasts between two to four weeks and about a third said they typically deal with engagements beyond four weeks. It is also common for incident responders to be assigned to two or more incidents. Dine added that time has never been a luxury for cybersecurity incident responders but ransomware has heightened the level of urgency even more with the added pressure from potential public exposure as well. “Not only are we rushing to find out how they got, what they did while they were in, but also what they took and what category of data it is,” Dine noted.“The real-world repercussions that cyberattacks now have are causing public safety concerns and market-stressing risks to grow“. Incident responders are the frontline defenders standing between cyber adversaries causing disruption and the integrity and continuity of critical services.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   }
]