[
   {
      "time": "2022-07-21",
      "title": "Neopets data breach exposes personal data of 69 million members",
      "text": " Virtual pet website Neopets has suffered a data breach leading to the theft of source code and a database containing the personal information of over 69 million members.Neopets is a popular website where members can own, raise, and play games with their virtual pets. Neopets recently launched NFTs that will be used as part of an online Metaverse game.On Tuesday, a hacker known as 'TarTarX' began selling the source code and database for the Neopets.com website for four bitcoins, worth approximately $94,000 at today's prices.In a conversation with BleepingComputer, TarTarX says that they stole the database and approximately 460MB (compressed) of source code for the neopets.com website.The seller claims that this database contains the account information of over 69 million members, and in a screenshot shared with BleepingComputer, you can see the data includes members' usernames, names, email addresses, zip code, date of birth, gender, country, an initial registration email, and other site/game-related information.While the hacker would not reveal how they gained access to the website, they told us that they did not ransom the data to Jumpstart, the owners of Neopets, but have received interest from potential buyers.At this time, BleepingComputer has not been able to independently verify the authenticity of the database. However, pompompurin, the owner of the Breached.co hacking forum, verified the hacker's claims by registering an account on Neopets.com and being sent their newly created record from the database.\"Vouch, I registered an account on the website and he sent the full entry,\" pompompurin posted to the Breached.co forums.Furthermore, this verification showed that TarTarX continued to have access to the neopets.com site even as they began selling the data.After the news of the breach spread online, the Neopets team, designated by the TNT abbreviation, has confirmed on the unofficial Neopets Discord server that they are aware of the security incident and working on resolving it.Volunteer Discord moderators are warning that changing passwords on Neopets may not help secure your account if the attackers still have access to their servers.\"We cannot therefore strictly advise you on the best course of action given the circumstances.\"However, if you use the same Neopets password on other sites, you are strongly advised to change your password on those sites to a different one.BleepingComputer has contacted Jumpstart about the breach but has not received a reply at this time.\"Neopets recently became aware that customer data may have been stolen. We immediately launched an investigation assisted by a leading forensics firm. We are also engaging law enforcement and enhancing the protections for our systems and our user data.It appears that email addresses and passwords used to access Neopets accounts may have been affected. We strongly recommend that you change your Neopets password. If you use the same password on other websites, we recommend that you also change those passwords.As our investigation continues, we will update you as appropriate. We truly appreciate your patience and understanding at this time. Thank you.\" - Neopets.While this breach appears to be new, Neopets has a history of unauthorized access to their systems.neo_truths told us that they use this access to analyze and share information about the game mechanics on Reddit.Unfortunately, neo_truths says that the code is huge and spread out over many servers, with only a few developers to manage it. This lack of staff has led to numerous breaches by multiple people in the past, with one actively used exploit reported to the devs who ultimately fixed it.\"I have already reported 2 exploits that allowed db access that other people had used (one of them for months/years hard to tell). I could have not found them if I didn't have access myself.\"I could always choose to reveal my own method thus losing access which would be the correct thing, but at the same time that would let the others run free. But yes I understand that from a user perspective its very worrying someone can arbitrarily access their data.\"While neo_truths has had access to the Neopets database for some time, they told BleepingComputer that they were not involved in this recent breach and believes the threat actors gained access using a flaw unrelated to Neopets code.\"The exploit this time is unrelated to neo code, just a general exploit many websites have,\" neo_truths told BleepingComputer.Update 7/20/22 11:07 PM EST: Clarified that the Discord server is an unofficial Neopets server and that the announcement was from volunteer moderators. Added information about Neo_Truths.Update 7/21/22 09:25 AM EST: Added statement from Neopets."
   },
   {
      "time": "2022-07-21",
      "title": "Google boosts Android privacy with support for DNS-over-HTTP/3",
      "text": " Google has added support for the DNS-over-HTTP/3 (DoH3) protocol on Android 11 and later to increase the privacy of DNS queries while providing better performance.HTTP/3 is the third major version of the Hypertext Transfer Protocol, which relies on QUIC, a multiplexed transport protocol built on UDP, rather than TCP like previous versions.The new protocol fixes the problem of \"head-of-line blocking,\" which slows down internet data transactions when a packet is lost or reordered, something quite common when moving around on mobile and switching connections frequently.Android previously supported DNS-over-TLS (DoT) for version 9 and later to bolster DNS query privacy, but this system inevitably slowed down DNS requests due to the encryption overhead.Moreover, DoT requires a complete renegotiation of the new connection when changing networks. In contrast, QUIC can resume a suspended connection in a single RTT (time needed for a signal to reach the destination).With DoH3, many of DoT's performance burdens are lifted, and according to Google's measurements, achieves a 24% increase in performance for median query times. In some cases, Google has seen performance increases up to 44%.Additionally, DoH3 may help with unreliable networks, even outperforming traditional DNS thanks to the proactive flow control mechanisms that immediately generate package delivery fail alerts instead of waiting for timeouts to elapse.DNS-over-HTTPS is already widely supported by many DNS providers to provide increased privacy when performing DNS requests.In the future, Google plans on adding support for other DoH3 providers through the use of Discovery of Designated Resolvers (DDR), which automatically selects the best provider for your specific configuration.Another point of superiority of DoH3 is the use of Rust in its implementation, which resulted in a lean system comprising 1,640 lines of code that use a single runtime thread instead of DoT’s four.The result is a performant low-level system with a few dependencies, is light, and uses a memory-safe language that reduces the number of bugs attackers can leverage to abuse it.At the time of reading this, all Android devices running Android 11 and later should use DoH3 for Google DNS and Cloudflare DNS (more to be added soon).In addition, a subset of Android 10 devices whose vendors adopted Google Play system updates early will also receive this new feature.The end-users don’t have to take any action to enable the new feature, as Android will handle this part automatically."
   },
   {
      "time": "2022-07-21",
      "title": "Apple Ships Urgent Security Patches for macOS, iOS - SecurityWeek",
      "text": " Hi, what are you looking for?It’s a very busy Patch Wednesday for computer users running Apple’s flagship macOS and iOS devices.Apple’s security response team has pushed out software fixes for at least 39 software vulnerabilities haunting the macOS Catalina, iOS and iPadOS platforms.ByFlipboardRedditWhatsappWhatsappEmailRyan Naraine is Editor-at-Large at SecurityWeek and host of the popular Security Conversations podcast series. He is a security community engagement expert who has built programs at major global brands, including Intel Corp., Bishop Fox and GReAT. Ryan is a founding-director of the Security Tinkerers non-profit, an advisor to early-stage entrepreneurs, and a regular speaker at security conferences around the world.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...Zero trust is not a replacement for identity and access management (IAM), but is the extension of IAM principles from people to everyone and...A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The CRYSTALS-Kyber public-key encryption and key encapsulation mechanism recommended by NIST for post-quantum cryptography has been broken using AI combined with side channel attacks.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-21",
      "title": "Atlassian fixes critical Confluence hardcoded credentials flaw",
      "text": " Atlassian has patched a critical hardcoded credentials vulnerability in Confluence Server and Data Center that could let remote, unauthenticated attackers log into vulnerable, unpatched servers.The hardcoded password is added after installing the Questions for Confluence app (versions 2.7.34, 2.7.35, and 3.0.2) for a user account with the username disabledsystemuser — designed to help admins with the migration of data from the app to the Confluence Cloud.\"A remote, unauthenticated attacker with knowledge of the hardcoded password could exploit this to log into Confluence and access any pages the confluence-users group has access to.\"However, the company warned that \"the hardcoded password is trivial to obtain after downloading and reviewing affected versions of the app.\"Admins who want to determine if their servers are affected by this hardcoded credentials security flaw have to check for an active user account with the following info:On affected servers, uninstalling the Questions for Confluence app does not remediate this vulnerability and will not remove the attack vector (i.e., the disabledsystemuser account with a hardcoded password).To fix the issue until you install the update, Atlassian recommends updating to a patched version of Questions for Confluence or disabling/deleting the disabledsystemuser account."
   },
   {
      "time": "2022-07-21",
      "title": "Cisco fixes bug that lets attackers execute commands as root",
      "text": " Cisco has addressed severe vulnerabilities in the Cisco Nexus Dashboard data center management solution that can let remote attackers execute commands and perform actions with root or Administrator privileges.The first security flaw (rated critical severity and tracked as CVE-2022-20857) enables unauthenticated threat actors to access an API by sending crafted HTTP requests to execute arbitrary commands remotely with root privileges \"in any pod on a node.\"A second bug (a high severity vulnerability in the web UI tracked as CVE-2022-20861) allows remote attackers to conduct a cross-site request forgery attack by persuading authenticated admins to click a malicious link.\"A successful exploit could allow the attacker to perform actions with Administrator privileges on an affected device,\" Cisco explains.Another high severity security bug (CVE-2022-20858) patched today can let unauthenticated, remote attackers download container images or upload malicious ones to affected devices by opening a TCP connection to the container image management service.The vulnerabilities affect Cisco Nexus Dashboard 1.1 and later. Cisco has addressed the flaws in the 2.2(1e) security update published today and advises customers to migrate to a fixed release as soon as possible.These security vulnerabilities were found by security researchers with Cisco's Advanced Security Initiatives Group (ASIG) during internal security testing.Cisco's Product Security Incident Response Team (PSIRT) said that the company is unaware of publicly available exploits or active exploitation in the wild.Today, Cisco has also patched a fourth vulnerability (CVE-2022-20860) in the SSL/TLS implementation of the Cisco Nexus Dashboard that could let unauthenticated, remote threat actors alter communications by intercepting traffic in man-in-the-middle attacks.Successful exploitation could also allow attackers to view sensitive information, including Administrator credentials for affected controllers."
   },
   {
      "time": "2022-07-21",
      "title": "Russian hacking risks ‘spillover effects’ and possible escalation, EU warns",
      "text": " One of the European Union’s top legislative bodies warned Tuesday that Russian hacking groups are “indiscriminately targeting essential entities globally” amid the country’s war with Ukraine, threatening potential spillover effects.“This increase in malicious cyber activities, in the context of the war against Ukraine, creates unacceptable risks of spillover effects, misinterpretation and possible escalation,” the Council said.“The latest [DDoS] attacks against several EU Member States and partners claimed by pro-Russian hacker groups are yet another example of the heightened and tense cyber threat landscape that EU and its Member States have observed,” the Council said in a statement. “We strongly condemn this unacceptable behaviour in cyberspace and express solidarity with all countries that have fallen victim.”“We remain determined to address and investigate malicious cyber activities affecting international peace, security and stability, including the security of the European Union and its Member States, their democratic institutions, citizens, businesses, and civil society,” the statement continued.Adam Janofsky is the founding editor-in-chief of The Record by Recorded Future. He previously was the cybersecurity and privacy reporter for Protocol, and prior to that covered cybersecurity, AI, and other emerging technology for The Wall Street Journal.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-21",
      "title": "Cyber Command shares bevy of new malware used against Ukraine",
      "text": " U.S. Cyber Command on Wednesday disclosed dozens of forms of malware that have been used against computer networks in Ukraine, including 20 never-before-seen samples of malicious code.The indicators of compromise were shared with the command’s Cyber National Mission Force (CNMF) by the Security Service of Ukraine, that country’s law enforcement authority and intelligence agency. The disclosure is part of what has become a regular effort by Cyber Command and other U.S. agencies to highlight hacking tools used by foreign adversaries like Russia, China, Iran and North Korea to blunt the impact of their digital operations.“These IOCs were shared with us by our Ukrainian partners to enable industry to take action and assess their own networks — we are actively communicating with our Ukrainian partners to share cybersecurity threat information,” a Cyber Command spokesperson said in a statement. “We share information and intelligence to enable our U.S. government partners, such as DHS and FBI, and industry as well as our international allies and partners to defend critical infrastructure and our democratic values and institutions.”The spokesperson declined to say if the indicators originated from Cyber Command’s months-long “hunt forward” mission to Ukraine before Moscow’s unprovoked invasion in February.He noted U.S. personnel “sat side-by-side with our partners to gain critical insights that have increased homeland defense for both the United States and Ukraine.”Martin Matishak is a senior cybersecurity reporter for The Record. He spent the last five years at Politico, where he covered Congress, the Pentagon and the U.S. intelligence community and was a driving force behind the publication's cybersecurity newsletter.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-21",
      "title": "LinkedIn remains the most impersonated brand in phishing attacks",
      "text": " LinkedIn is holding the top spot for the most impersonated brand in phishing campaigns observed during the second quarter of 2022.Statistical data from cybersecurity company Check Point shows that the social platform for professionals is at the top of the list for the second quarter in a row.Compared to the first quarter of the year, LinkedIn impersonation dropped from 52% to 45%. However, it maintains a considerable distance from the second most imitated brand by fraudsters, Microsoft, currently at 13%.The central theme in spoofed Microsoft emails is requests to verify Outlook accounts to steal usernames and passwords.DHL currently holds the third spot in the list with 12%, down from 14%.Amazon rose to the fourth position, jumping from 2% in Q1 2022 to 9% this quarter, while Apple follows on fifth place with 3%; also a notable increase compared to last quarter’s 0.8%.In the case of Amazon, the phishing emails attempt to steal the target’s billing information, including full credit card data, the researchers say.The sender addresses are spoofed to appear as if the messages are automated or come from the support or even the security department.Some lures used in these campaigns include fake promotions for the LinkedIn Pro service, bogus policy updates, or even threats of account termination for “unverified customers.”They all lead to a phishing web page where the victims are asked to enter their LinkedIn credentials, enabling the threat actors to take over the accounts.With access to a LinkedIn account, a threat actor could deploy targeted phishing campaigns to reach the victim's coworkers or valuable individuals in their connections network."
   },
   {
      "time": "2022-07-21",
      "title": "82% of global insurers expect the rise in cyber insurance premiums to continue - Help Net Security",
      "text": " A Panaseer survey of global insurers across the UK and US found that 82% are expecting the rise in premiums to continue, with 74% of insurers agreeing that their inability to accurately understand a customer’s security posture is impacting price increases.Insurers also see the increasing cost of ransomware as a leading factor (78%) affecting premium rises, with largest ransom pay-outs by insurers in the last two years averaging £3.26m in the UK and $3.52m in the US.This is closely followed by security awareness (36%), along with application security (32%), vulnerability management (31%), privileged access management (31%) and patch management (30%), highlighting that insurers expect to see evidence of a layered, multi-faceted approach to cybersecurity.  Additional key findings from the research include:"
   },
   {
      "time": "2022-07-21",
      "title": "New Rust-based Ransomware Family Targets Windows, Linux, and ESXi Systems",
      "text": " Advertisements for Luna on darknet forums suggest that the ransomware is intended for use only by Russian-speaking affiliates. Its core developers are also believed to be of Russian origin owing to spelling mistakes in the ransom note hard-coded within the binary.\"Luna confirms the trend for cross-platform ransomware,\" the researchers stated, adding how the platform agnostic nature of languages like Golang and Rust are giving the operators the ability to target and attack at scale and evade static analysis.That said, there is very little information on the victimology patterns given that Luna is a freshly discovered criminal group and its activity is still being actively monitored.\"Ransomware remains a big problem for today's society,\" the researchers said. \"As soon as some families come off the stage, others take their place.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]