[
   {
      "time": "2022-12-30",
      "title": "SSRF vulnerabilities caused by SNI proxy misconfigurations | Invicti",
      "text": " SNI proxies are load balancers that use the SNI extension field to select backend systems. When misconfigured, SNI proxies can be vulnerable to SSRF attacks that provide access to web application backends.A typical task in complex web applications is routing requests to different backend servers to perform load balancing. Most often, a reverse proxy is used for this. Such reverse proxies work at the application level (over HTTP), and requests are routed based on the value of the Host header (:authority for HTTP/2) or parts of the path.Server Name Indication (SNI) is an extension of the TLS protocol that provides the foundation of HTTPS. When a browser wants to establish a secure connection to a server, it initiates a TLS handshake by sending a ClientHello message. This message may contain an SNI extension field that includes the server domain name. In its ServerHello message, the server can then return a certificate appropriate for the specified server name. The typical use case for this is when there are multiple virtual hosts behind one IP address.When a reverse proxy (more correctly, a load balancer) uses a value from the SNI field to select a specific backend server, we have an SNI proxy. With the widespread use of TLS and HTTPS in particular, this approach is becoming more popular. (Note that another meaning of SNI proxy refers to the use of such proxies to bypass censorship in some countries.)There are two main options for running an SNI proxy: with or without SSL termination. In both cases, the SNI proxy uses the SNI field value to select an appropriate backend. When running with SSL termination, the TLS connection is established with the SNI proxy, and then the proxy forwards the decrypted traffic to the backend. In the second case, the SNI proxy forwards the entire data stream, really working more like a TCP proxy.To give an example for Nginx, the simplest configuration would look as follows (note that this requires the Nginx modules ngx_stream_core_module and ngx_stream_ssl_preread_module to work):Here, we configure a server (TCP proxy) called stream and enable SNI access using ssl_preread on. Depending on the SNI field value (in $ssl_preread_server_name), Nginx will route the whole TLS connection either to backend1 or backend2.The simplest misconfiguration that would allow you to connect to an arbitrary backend would look something like this:Here, the SNI field value is used directly as the address of the backend.With this insecure configuration, we can exploit the SSRF vulnerability simply by specifying the desired IP or domain name in the SNI field. For example, the following command would force Nginx to connect to internal.host.com:Another class of vulnerable configurations is similar to typical HTTP reverse proxy misconfigurations and involves mistakes in the regular expression (regex). In this example, traffic is forwarded to the backend if the name provided via SNI matches the regex:This regex is incorrect because the first period character in www.example.com is not escaped, and the expression is missing the $ terminator at the end. The resulting regex matches not only www.example.com but also URLs like www.example.com.attacker.com or wwwAexample.com. As a result, we can perform SSRF and connect to an arbitrary backend. While we can’t use the IP address directly here, we can bypass this restriction simply by telling our DNS server that www.example.com.attacker.com should resolve to 127.0.0.1.Whenever you configure a reverse proxy, you should be aware that any misconfigurations may potentially lead to SSRF vulnerabilities that expose backend systems to attack. The same applies to SNI proxies, especially as they are gaining popularity in large-scale production systems. In general, to avoid vulnerabilities when configuring a reverse proxy, you should understand what data could be controlled by an attacker and avoid using it directly in an insecure way.Aleksei is a security researcher and pentester with broad experience in offensive security. He is also an active member of the global security community, participating in events and giving lectures.Invicti Security Corp 1000 N Lamar Blvd Suite 300 Austin, TX 78703, US© Invicti 2023"
   },
   {
      "time": "2022-12-30",
      "title": "Port of Lisbon website still down as LockBit gang claims cyberattack",
      "text": " The website for the Port of Lisbon is still down days after officials confirmed it was the target of a cyberattack. The Port of Lisbon is Portugal's busiest and one of the most used across all of Europe, handling 13,200,000 tonnes of cargo each year due to its strategic location between Europe and Africa.“All security protocols and response measures planned for this type of occurrence were quickly activated,” port officials told Publico in a statement. \"The Administration of the Port of Lisbon (APL) is working permanently and closely with all the competent authorities, in order to guarantee the security of the systems and respective data.”The gang gave the port until January 18 to comply with ransom demands, threatening to leak the stolen data. \"We are increasing the level of technology by which our ports operate and that is why not only Customs and Border Protection have a focus on cybersecurity but so does the United States Coast Guard,” Mayorkas said. “I would identify, with respect to our ports, cybersecurity, as a significant threat stream and we are of course very focused on defending against it and strengthening our cybersecurity.” Several cybersecurity experts said ports are ripe targets for cybercriminals and nation-states interested in causing disruption and harm. Chris Grove, a director at cybersecurity firm Nozomi Networks, told The Record that disrupting port operations can have cascading impacts into other sectors, similar to attacks on power infrastructure.“For example, China is heavily reliant on their ports to feed their energy backbone, most of their power generation comes from imported-by-sea coal and oil,” he said.  “Any disruption to that flow, ranging from a naval blockade to a cyberattack, could be crippling to any nation. Having that powerful capability in the hands of criminal ransomware operators should cause concern for those responsible for public safety and security.”Ports and maritime operations have unique attributes that are attractive to threats: global footprint, high frequency of contact, and an amplified impact of loss all make a cyberattack a critical consideration, according to SynSaber co-founder Ron Fabela. During the NotPetya attack in 2017 it became apparent that ports do not need to be specifically targeted in order to be impacted, he explained, noting that Maersk reported losses of up to $300 million dollars.  Grant Geyer, chief product officer at Claroty, echoed that assessment, explaining that the Russian NotPetya worm paralyzed supply chains by locking up ports and shipping companies worldwide – costing billions of dollars in direct and collateral damage.With aging infrastructure, IT and OT systems in ports represent a prime target for cyber criminals to extract a payment for ransomware attacks, Geyer said, adding that for foreign adversaries, a cyberattack against a port creates an opportunity to project power by taking down supply chains and seize up an economy without using bombs or bullets.“For industrial control systems, specifically ports and maritime, drive-by ransomware events will continue as we move into 2023. The impact of a cyberattack on ports has a downstream effect on numerous critical infrastructure and way of life for people,” Fabela said. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-12-30",
      "title": "Netgear warns users to patch recently fixed WiFi router bug",
      "text": " Netgear has fixed a high-severity vulnerability affecting multiple WiFi router models and advised customers to update their devices to the latest available firmware as soon as possible.Although Netgear did not disclose any information about the component affected by this bug or its impact, it did say that it is a pre-authentication buffer overflow vulnerability.Attackers can exploit this flaw in low-complexity attacks without requiring permissions or user interaction.In a security advisory published on Wednesday, Netgear said it \"strongly recommends that you download the latest firmware as soon as possible.\"The list of vulnerable routers and the patched firmware versions can be found in the table below.To download and install the latest firmware for your Netgear router, you have to go through the following steps:\"NETGEAR is not responsible for any consequences that could have been avoided by following the recommendations in this notification.\"A Netgear spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today for more information."
   },
   {
      "time": "2022-12-30",
      "title": "Indian Railways Data Breach: 30 Million User Records up for Sale - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-12-30",
      "title": "Google Home speakers allowed hackers to snoop on conversations",
      "text": " A bug in Google Home smart speaker allowed installing a backdoor account that could be used to control it remotely and to turn it into a snooping device by accessing the microphone feed.Researcher Matt Kunze discovered the issue and received $107,500 for responsibly reporting it to Google last year. Earlier this week, the researcher published technical details about the finding and an attack scenario to show how the flaw could be leveraged.While experimenting with his own Google Home mini speaker, the researcher discovered that new accounts added using the Google Home app could send commands to it remotely via the cloud API.Using a Nmap scan, the researcher found the port for the local HTTP API of Google Home, so he set up a proxy to capture the encrypted HTTPS traffic, hoping to snatch the user authorization token.The researcher discovered that adding a new user to the target device is a two-step process that requires the device name, certificate, and \"cloud ID\" from its local API. With this info, they could send a link request to the Google server.To add a rogue user to a target Google Home device, the analyst implemented the link process in a Python script that automated the exfiltration of the local device data and reproduced the linking request.The PoCs take things a step further from just planting a rogue user and enable spying over the microphone, making arbitrary HTTP requests on the victim's network, and reading/writing arbitrary files on the device.Having a rogue account linked to the target device makes it possible to perform actions via the Google Home speaker, such as controlling smart switches, making online purchases, remotely unlocking doors and vehicles, or stealthily brute-forcing the user's PIN for smart locks.More worryingly, the researcher found a way to abuse the \"call [phone number]\" command by adding it to a malicious routine that would activate the microphone at a specified time, calling the attacker's number and sending live microphone feed.During the call, the device's LED would turn blue, which is the only indication that some activity is taking place. If the victim notices it, they may assume the device is updating its firmware. The standard microphone activation indicator is a pulsating LED, which does not happen during calls.Finally, it's also possible to play media on the compromised smart speaker, rename it, force a reboot, force it to forget stored Wi-Fi networks, force new Bluetooth or Wi-Fi pairings, and more.Kunze discovered the issues in January 2021 and sent additional details and PoCs in March 2021. Google fixed all problems in April 2021.The patch includes a new invite-based system to handle account links, which blocks any attempts not added on Home.Deauthenticating Google Home is still possible, but this can't be used to link a new account, so the local API that leaked the basic device data is also inaccessible.As for the \"call [phone number]\" command, Google has added a protection to prevent its remote initiation through routines.It's worth noting that Google Home was released in 2016, scheduled routines were added in 2018, and the Local Home SDK was introduced in 2020, so an attacker finding the issue before April 2021 would have had plenty of time to take advantage."
   },
   {
      "time": "2022-12-30",
      "title": "Crypto platform 3Commas admits hackers stole API keys",
      "text": " An anonymous Twitter user published yesterday a set of 10,000 API keys allegedly obtained from the 3Commas cryptocurrency trading platform.3Commas bots use these API keys to generate profit for the customers by interacting with cryptocurrency trading exchanges without requiring account credentials, to perform automated investment and trading actions on behalf of the users.The Twitter user claimed the leaked set is just 10% of the 100,000 API keys they hold and said that they plan to publish them all in the following days.3Commas looked into the leaked data and confirmed today that the files contain valid API keys. As a result, the platform now urges all supported exchanges, including Kucoin, Coinbase, and Binance, to revoke all keys connected to 3Commas.Users are advised to reissue their keys on all linked exchanges by themselves and contact 3Commas support to receive advice on subsequent actions on a case-by-case basis.Additionally, the platform claims it has investigated the possibility of the leak being an inside job but found no evidence of that.“Since then, we have implemented new security measures, and we will not stop there; we are launching a full investigation in which law enforcement will be involved,” the company added.Unfortunately, 3Commas took its time to confirm the breach and many of its users have already lost funds over the past few months after seemingly unauthorized trades coming from their accounts.The first reports of unauthorized transactions triggered via 3Commas came in October 2022 and culminated in recent weeks.Throughout this time, the trading platform dismissed the possibility of a breach, suggesting that users who reported these issues must have fallen victim to phishing attacks or used unofficial trojanized apps.At the time of publishing, 3Commas has not made any statement about a possible compensation. BleepingComputer has contacted the company for clarification in this regard and is waiting for a reply."
   },
   {
      "time": "2022-12-30",
      "title": "New Malvertising Campaign via Google Ads Targets Users Searching for Popular Software",
      "text": " The activity makes use of seemingly credible websites with typosquatted domain names that are surfaced on top of Google search results in the form of malicious ads by hijacking searches for specific keywords.In one campaign disclosed by Guardio Labs, threat actors have been observed creating a network of benign sites that are promoted on the search engine, which when clicked, redirect the visitors to a phishing page containing a trojanized ZIP archive hosted on Dropbox or OneDrive.Among the impersonated software include AnyDesk, Dashlane, Grammarly, Malwarebytes, Microsoft Visual Studio, MSI Afterburner, Slack, and Zoom, among others.Guardio Labs, which has dubbed the campaign MasquerAds, is attributing a huge chunk of the activity to a threat actor it is tracking under the name Vermux, noting that the adversary is \"abusing a vast list of brands and keeps on evolving.\"The Vermux operation has mainly singled out users in Canada and the U.S., employing masquerAds sites tailored to searches for AnyDesk and MSI Afterburner to proliferate cryptocurrency miners and Vidar information stealer.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-30",
      "title": "Several DoS, Code Execution Vulnerabilities Found in Rockwell Automation Controllers - SecurityWeek",
      "text": " Hi, what are you looking for?Organizations using controllers made by Rockwell Automation have been informed recently about several potentially serious vulnerabilities.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-30",
      "title": "EarSpy: Spying on Phone Calls via Ear Speaker Vibrations Captured by Accelerometer - SecurityWeek",
      "text": " Hi, what are you looking for?As smartphone manufacturers are improving the ear speakers in their devices, it can become easier for malicious actors to leverage a particular side-channel for eavesdropping on a targeted user’s conversations, according to a team of researchers from several universities in the United States.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe three primary drivers for cyber regulations are voter privacy, the economy, and national security – with the complication that the first is often...Infonetics Research has shared excerpts from its Mobile Device Security Client Software market size and forecasts report, which tracks enterprise and consumer security client...Two of humanity’s greatest drivers, greed and curiosity, will push AI development forward. Our only hope is that we can control it.Apple rolled out iOS 16.3 and macOS Ventura 13.2 to cover serious security vulnerabilities.Critical security flaws expose Samsung’s Exynos modems to “Internet-to-baseband remote code execution” attacks with no user interaction. Project Zero says an attacker only needs...Los Gatos, Calif-based data protection and privacy firm Titaniam has raised $6 million seed funding from Refinery Ventures, with participation from Fusion Fund, Shasta...Samsung smartphone users warned about CVE-2023-21492, an ASLR bypass vulnerability exploited in the wild, likely by a spyware vendor.Two vulnerabilities in Samsung’s Galaxy Store that could be exploited to install applications or execute JavaScript code by launching a web page.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   }
]