[
   {
      "time": "2022-12-23",
      "title": "Leading sports betting firm BetMGM discloses data breach",
      "text": " Leading sports betting company BetMGM disclosed a data breach after a threat actor stole personal information belonging to an undisclosed number of customers.While the personal info stolen in the attack varies for each customer, the attackers obtained a wide range of data, including names, contact info (like postal addresses, email addresses, and phone numbers), dates of birth, hashed Social Security numbers, account identifiers (like player IDs and screen names) and info related to transactions with BetMGM.The company added that it discovered the incident on November 2022 but believes the breach occurred in May 2022.\"BetMGM's online operations were not compromised. BetMGM is coordinating with law enforcement and taking steps to further enhance its security.\"A BetMGM spokesperson did not reply to an email sent by BleepingComputer today, asking for additional information on the number of affected customers.While the betting firm is yet to disclose the number of customers that had their information stolen in the May breach, the likely attackers are already selling it online.\"We breached BetMGM's casino database current as of Nov 2022,\" says the threat actor named 'betmgmhacked' who put up the stolen information for sale on a hacking forum yesterday.\"The database is inclusive of every BetMGM casino customer (over 1.5M) as of November 2022 from MI, NJ, ON, PV, and WV. Any customer that has placed a casino wager included in this database.\"According to the threat actor's post titled \"BetMGM.com Casino Database Breach,\" the database of stolen BetMGM customer information allegedly contains 1,569,310 user records.It also claims to include data sets belonging to players from BetMGM casinos in New Jersey and Pennsylvania, as well as a \"Master Casino\" data set with information on customers from all states (all customer records include phone number, email, and address info, according to the threat actor).New Jersey-based BetMGM is a sports betting operator founded in 2018 as a joint venture between American hospitality and entertainment firm MGM Resorts International and Entain plc, one of the largest sports betting and gaming companies worldwide.BetMGM's sports betting and online gaming brand portfolio includes BetMGM, Borgata Casino, Party Casino, and Party Poker."
   },
   {
      "time": "2022-12-23",
      "title": "Lastpass: Hackers stole customer vault data in cloud storage breach",
      "text": " LastPass revealed today that attackers stole customer vault data after breaching its cloud storage earlier this year using information stolen during an August 2022 incident.This follows a previous update issued last month when the company's CEO, Karim Toubba, only said that the threat actor gained access to \"certain elements\" of customer information.Today, Toubba added that the cloud storage service is used by LastPass to store archived backups of production data.The attacker gained access to Lastpass' cloud storage using \"cloud storage access key and dual storage container decryption keys\" stolen from its developer environment.\"The threat actor copied information from backup that contained basic customer account information and related metadata including company names, end-user names, billing addresses, email addresses, telephone numbers, and the IP addresses from which customers were accessing the LastPass service,\" Toubba said today.\"The threat actor was also able to copy a backup of customer vault data from the encrypted storage container which is stored in a proprietary binary format that contains both unencrypted data, such as website URLs, as well as fully-encrypted sensitive fields such as website usernames and passwords, secure notes, and form-filled data.\"Fortunately, the encrypted data is secured with 256-bit AES encryption and can only be decrypted with a unique encryption key derived from each user's master password.According to Toubba, the master password is never known to LastPass, it is not stored on Lastpass' systems, and LastPass does not maintain it.Customers were also warned that the attackers might try to brute force their master passwords to gain access to the stolen encrypted vault data.\"Your sensitive vault data, such as usernames and passwords, secure notes, attachments, and form-fill fields, remain safely encrypted based on LastPass' Zero Knowledge architecture.\"Lastpass published the August advisory days after BleepingComputer reached out and received no response to questions regarding a possible breach.In emails sent to customers, Lastpass confirmed the attackers stole proprietary technical information and source code from its systems.LastPass says its password management software is being used by more than 33 million people and 100,000 businesses worldwide."
   },
   {
      "time": "2022-12-23",
      "title": "Guacamaya leaks spark debate about militarization, spyware, but no accountability",
      "text": " In September, journalists in Mexico started receiving terabytes of hacked data stolen from the country's Ministry of National Defense.The leak, which is now considered the largest of its kind in Mexico's history, included details about the president's health, as well as communication between some of the country's top military officials.Around the same time, similar troves were being leaked from police and military organizations throughout Latin America, including El Salvador’s National Police and Armed Forces, the General Command of the Armed Forces in Colombia, the Peruvian Army and Chile’s General Staff of National Defense.But what, three months after their release, has the impact of the leaks actually been? On this, cybersecurity experts across Latin America are mixed. The ramifications have been specific to the country, and to how each nation’s press has handled the documents.None of the governments involved responded to repeated requests for comment. Several experts noted that the official silence on much of what was leaked was typical of governments across Latin America but highlighted precisely why the hacks were so important. CyberPeace Institute CEO Stéphane Duguin explained that the hacks shed light on a range of illegal activities that otherwise would not have been known. Dilmar Villena, executive director of rights group Hiper Derecho, told The Record that the leaks did not shock the region uniformly, with each country perceiving them differently. “It is worth highlighting what happened in Chile and Mexico due to the political repercussions they had. However, it cannot be said that Latin American public opinion has unanimously paid attention to Guacamaya hacks,” he said. “The response that the governments gave has to do with the level of attention that public opinion has given to it. In some cases there were changes of ministers and high command of the army; however, in other countries, such as the Peruvian case, there was no great response or institutional changes about it.” Much of it comes down to the importance each country’s national press gave the leaks, Villena explained, noting that if the local press did not take an interest in the leaks, it did not end up stirring public debate.The documents revealed that Peru’s army was monitoring several human rights groups, including Amnesty International, IDL, Derechos Humanos sin Fronteras and CooperAcción.The largest tranche of documents – six terabytes in total – came from servers run by Mexico’s army and there has been a slow trickle of news from the leaked documents. The stolen emails and files reveal the army’s growing control of the country’s institutions as well as plans for the military’s involvement in several economic and infrastructure projects across the country – something Guacamaya told The Record it was intent on revealing.  The leaks concerning Mexico revealed that the army also has plans for other infrastructure projects in the region and has interest in creating its own airline.“We decided to share [the stolen documents] with any that we can verify are reputable journalists, whether we agree with their politics and like their reporting or not,” the group told The Record. “And unfortunately those doing serious investigations take time, while those reporting tabloid gossip on the health of the president are fast to publish.”Maria Paz Canales, a lawyer in Chile and executive director of the nonprofit Derechos Digitales, said the revelations from the Guacamaya leaks have also given momentum to discussions about the cybersecurity shortcomings of Latin American institutions, and their militaries. “They relied a lot on the fact that because they are powerful institutions inside their own countries, that they are in some way beyond the actions of other groups that can access to their systems and information,” she said. “At the same time, there is a huge deficit in terms of the knowledge and sophistication that they have for protecting their own systems.”Dozens of government agencies across Latin America have faced ransomware attacks and cybersecurity incidents throughout 2022, highlighting the need for institutions to better protect citizen data. Canales explained she was recently invited to a hearing held by Mexico’s Senate on cybersecurity, and similar discussions are being held in Chile’s legislature about the need for some kind of cybersecurity legislation. “It's really embarrassing that they are failing in very basic things. In this case one person failed to fulfill the basic duty of updating software or ensuring to patch software,” Canales said. Villena asserted that the hacks were evidence that cybersecurity is not taken seriously in the region. This was clear, according to Villena, by how small the military budgets were when it comes to cybersecurity. Shortcomings and deficiencies in cybersecurity are “a common denominator in the countries of the region,” Villena told The Record. But he warned that little would change until there was a cyberattack that “put critical assets at risk.”“I am not very optimistic on this point. What I think should happen is a real investigation and conversation with the people responsible for cybersecurity policies about designing public policies that comprehensively address this problem,” he said. “This would include sanctioning the high command of the armed forces and carrying out regular inspections, at the very least. However, again, I am not very optimistic that all this will come to pass.” One of the standout themes from the leaks were revelations about military use of spyware against journalists and human rights defenders. “In this case we already had a lot of evidence of the army's participation, a situation that was confirmed days before publication thanks to the Guacamaya leaks. It has also shown how the military intelligence catalogs social and dissident groups as subjects of interest and equates them with criminal and terrorist groups,” Maldonado said. Pegasus was allegedly used against two journalists and one human rights defender in Mexico, according to Article 19. Vladimir Cortés Roshdestvensky, digital rights programme officer at the organization, said the leaks revealed contracts signed between the Mexican Army and NSO Group. Electronic Frontier Foundation’s Alimonti added that the leaks raised the issue of government surveillance to the public and highlighted the lack of human rights standards around the use of spyware.She noted that the United Nations High Commissioner for Human Rights also raised concerns about the spyware revelations in October. “The acts of illegal surveillance have an intimidating effect and send a negative signal of government intolerance to criticism, contrary to the free and safe environment that must be guaranteed for the exercise of the right to defend human rights and freedom of the press,” Fernández-Maldonado said.Alimonti said the revelations about military surveillance were important for efforts among civil rights organizations like hers to create human rights safeguards and standards with regard to how spyware is deployed across the region. The tools are currently being used “abusively and arbitrarily,” she said, highlighting the need for institutional public oversight. Alimonti said the government was effectively working against itself, attempting to provide more device security for citizens while also hiring companies that specialize in exploiting those same devices. “It is another paradox: you have states that are claiming left and right that the internet needs to be secure, be a safe space to trust but they're spending public money and giving it to companies that make sure that the old constructs of the internet are full of holes and vulnerabilities,” Duguin said. In Mexico especially, the leaks have spurred conversations about the country’s growing militarization and the army’s ever larger role in civilian life. But army officials in Mexico have sought to downplay the significance of the leaks, criticizing news outlets for publishing information, while failing to address the content of the stories. “It's part of the strategy of the Mexican Government,” said Cortés Roshdestvensky, the digital rights programme officer at Article 19. “They’re attacking those who reveal certain information of public interest by stigmatizing their work as journalists or their work as human rights defenders.” Maldonado, Article 19’s regional director, said some government officials in El Salvador and Mexico have claimed the hacks are part of a campaign by opposition parties against them. While the leaks have prompted Mexico’s Congress to draft tough cybersecurity measures, he said the rules are “more like cyber-patrolling and censorship of the Internet.”While interest in the hacks has waned in recent weeks, there were intensive discussions and debate about cybersecurity in the first weeks after the leaks. “I believe we’re going to continue seeing those debates around access to information, around militarization in Mexico, around the cybersecurity debate and more,” he said. Maldonado hoped that the leaked information would lead to accountability processes but explained that the Mexican government has already dismissed any such measure. There needs to be some level of accountability and transparency, Roshdestvensky explained, noting that the monitoring of opposition parties by multiple governments showed that this conduct “must be regulated by civilians.”There is no information on where the Guacamaya group – which takes its name from the Mayan word for “macaw” – is based. But in conversations with The Record, the group communicated mostly in Spanish and spoke passionately of launching the hacking campaign to expose the environmental degradation and human rights abuses of militaries across Latin America. The group told The Record that their work is a “continuation of the struggle and resistance of the people of Abya Yala” and explained that the leaks “are a form of fighting.”Their ultimate goal is to reveal “what we all already know in a way that is more palpable and documented” – lauding the news outlets and human rights organizations that have “fearlessly” covered the corruption and abuses revealed in the documents. “The oppressed peoples, as well as mother earth, have a weariness in the face of how the capitalist system has devastated life, putting capital and production above all else. We want a ‘return to life,’ to the good life that only occurs in harmony with others,” a representative for the group said. The stolen files showed “reprehensible” conduct from the militaries and police forces in the region as well as the widespread criminal repression that people face from “extractive” and “pyramidal” organizations. The group said its hope was a future where the “global north abandons the looting and extractivism of natural resources and stops violating Mother Earth.”“There is very little of the jungle left and when the rivers dry up, when our people are being poisoned, we can only be on the side of life, and our hope is to continue acting, resisting like our ancestors,” they said, calling their effort a “popular movement.” Guacamaya said the response to the leaks was evidence that most governments will not “put themselves on trial” and address the issues that people have concerns about. When asked what they hoped would come from their actions, the group said they believed “only the people save the people” and called for others to take similar action against what they allege are corrupt governments. “These actions also are an invitation to use this tool – hacking – and make it functional to the legacy left by our ancestors so that as oppressed peoples we can launch rebellion and resistance against oppression.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-12-23",
      "title": "Comcast Xfinity accounts hacked in widespread 2FA bypass attacks",
      "text": " ​Comcast Xfinity customers report their accounts being hacked in widespread attacks that bypass two-factor authentication. These compromised accounts are then used to reset passwords for other services, such as the Coinbase and Gemini crypto exchanges.Starting on December 19th, many Xfinity email users began receiving notifications that their account information had been changed. However, when attempting to access the accounts, they could not log in as the passwords had been changed.After regaining access to the accounts, they discovered they had been hacked and a secondary email at the disposable @yopmail.com domain was added to their profile.Similar to Gmail, Xfinity allows customers to configure a secondary email address to be used for account notifications and password resets in the event they lose access to their Xfinity account.All Xfinity customers we spoke to said they have two-factor authentication enabled on their accounts, yet the threat actors could bypass it and log in to their accounts.A researcher has told BleepingComputer that the attacks are being conducted through credential stuffing attacks to determine the login credentials for Xfinity attacks.Once they gain access to the account and are prompted to enter their 2FA code, the attackers allegedly use a privately circulated OTP bypass for the Xfinity site that allows them to forge successful 2FA verification requests.Once logged into the account, they can change the secondary email to the @yopmail.com account and perform password resets.The main Xfinity email will also receive a notification that their information was changed, but as the password has been changed as well, will be unable to access it.Once they gain full access to an Xfinity email account, the threat actors attempt to breach further online services used by the customer, verifying password reset requests to the now compromised email account.BleepingComputer has been told by some of the affected customers that the hackers attempted to reset passwords at DropBox, Evernote, and the Coinbase and Gemini cryptocurrency exchanges.While BleepingComputer has been unable to verify the legitimacy of this OTP bypass independently and whether it has been used in the reported hacks, it would explain how the threat actors can gain access to accounts with 2FA enabled.BleepingComputer reached out to Comcast press contacts several times this week but has yet to receive a reply to our emails.However, an Xfinity customer posted on Reddit that the company is aware of the account breaches and looking for the source of the hacks.\"I spoke to a second person in the xfinity security department that told me not to worry about the fraudulent yopmail account on my xfinity account and indicated that this had happened with many (maybe all) xfinity accounts,\" a user posted to Reddit about the hacks.\n\"She indicated that xfinity is still working to find the source of the hack. Apparently this this is a much more widespread issue than is being reported. It does not seem that xfinity e-mail is secure at this time.\""
   },
   {
      "time": "2022-12-23",
      "title": "Vice Society ransomware gang switches to new custom encryptor",
      "text": " The Vice Society ransomware operation has switched to using a custom ransomware encrypt that implements a strong, hybrid encryption scheme based on NTRUEncrypt and ChaCha20-Poly1305.According to cybersecurity firm SentinelOne, which discovered the new strain and named it \"PolyVice,\" it's likely that Vice Society sourced it from a vendor who supplies similar tools to other ransomware groups.Vice Society first appeared in the summer of 2021, when they began stealing data from corporate networks and encrypting devices. The threat actors would then perform double-extortion attacks, threatening to publish the data if a ransom is not paid.Historically, Vice Society has used other ransomware operations' encryptors during attacks, including Zeppelin, Five Hands, and HelloKitty. However, this appears to have changed, with Vice Society now using a new encryptor that is believed to be generated by a commodity ransomware builder.The new PolyVice strain, however, gives Vice Society attacks a unique signature, appending the \".ViceSociety\" extension onto locked files and dropping ransom notes named 'AllYFilesAE'.The new variant was first seen in the wild on July 13, 2022, but it wasn't fully adopted by the group until much later.SentinelOne's analysis reveals that PolyVice has extensive code similarities to Chilly ransomware and SunnyDay ransomware, with a 100% match on functions.The differences lie in campaign-specific details like the file extension, ransom note name, hardcoded master key, wallpaper, etc., which supports the common vendor hypothesis.\"This allows buyers to customize their ransomware without revealing any source code. Unlike other known RaaS builders, buyers can generate branded payloads, enabling them to run their own RaaS programs.\"PolyVice uses a hybrid encryption scheme combining asymmetric encryption with the NTRUEncrypt algorithm and symmetric encryption with the ChaCha20-Poly1305 algorithm.Upon launch, the payload imports a pre-generated 192-bit NTRU public key and then generates a random 112-bit NTRU private key pair on the compromised system, which is unique to each victim.This pair is then used for encrypting the ChaCha20-Poly1305 symmetric keys, which are unique to each file. Finally, the NTRU key pair is eventually encrypted using the public NTRU key to protect it from retrieval attempts.PolyVice ransomware is a 64-bit binary that uses multi-threading for parallel symmetric data encryption, utilizing the victim's processor in full to speed up the encryption process.After encryption, each PolyVice worker writes the file footer with information necessary for decryption.All these features indicate that whoever develops the new ransomware strains used by Vice Society, Chilly, and SunnyDay ransomware is an experienced and knowledgeable malware creator.In conclusion, SentinelOne's findings further underline the trend of outsourcing in the space, with ransomware gangs paying specialists to create sophisticated, high-performing tools.Depending on the level of availability and cost, these tools may make it easier for low-skilled ransomware actors to launch catastrophic attacks and cause significant damage to organizations."
   },
   {
      "time": "2022-12-23",
      "title": "Two New Security Flaws Reported in Ghost CMS Blogging Software",
      "text": " Tracked as CVE-2022-41654 (CVSS score: 9.6), the authentication bypass vulnerability allows unprivileged users (i.e., members) to make unauthorized modifications to newsletter settings.Even worse, the ability of a site administrator to inject JavaScript into the newsletter by default could be exploited to trigger the creation of arbitrary administrator accounts when attempting to edit the newsletter.The CMS platform blamed the bug due to a \"gap\" in its API validation, adding it found no evidence that the issue has been exploited in the wild.Also patched by Ghost is an enumeration vulnerability in the login functionality (CVE-2022-41697, CVSS score: 5.3) that could lead to the disclosure of sensitive information.Per Talos, this flaw could be leveraged by an attacker to enumerate all valid users of Ghost by supplying an email address, which could then be used to narrow down potential targets for a next-stage phishing attack.The flaws have been addressed in the Ghost (Pro) managed hosting service, but users who self-host the service and run a version between 4.46.0 and 4.48.7 or any version of v5 up to and including 5.22.6 are required to update to versions 4.48.8 and 5.22.7.(The story has been updated with a revised CVSS score for CVE-2022-41654 based on an advisory issued by Cisco Talos.)Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-23",
      "title": "FIN7 Cybercrime Syndicate Emerges as a Major Player in Ransomware Landscape",
      "text": " An exhaustive analysis of FIN7 has unmasked the cybercrime syndicate's organizational hierarchy, alongside unraveling its role as an affiliate for mounting ransomware attacks.More than 8,147 victims have been compromised by the financially motivated adversary across the world, with a majority of the entities located in the U.S. Other prominent countries include China, Germany, Canada, Italy, and the U.K.FIN7's intrusion techniques, over the years, have further diversified beyond traditional social engineering to include infected USB drives, software supply chain compromise, and the use of stolen credentials purchased from underground markets.The idea is to resell access to other ransomware outfits and re-target the victims as part of its illicit money-making scheme, underscoring its attempts to minimize efforts and maximize profits, not to mention prioritize companies based on their annual revenues, founded dates, and the number of employees.This \"demonstrates a particular type of feasibility study considered a unique behavior among cybercrime groups,\" the researchers said.Put differently, the modus operandi of FIN7 boils down to this: It utilizes services like Crunchbase, Dun & Bradstreet (DNB), Owler, and Zoominfo to shortlist firms and organizations with the highest revenue. It also uses other website analytics platforms like MuStat and Similarweb to monitor traffic to the victims' sites.Initial access is then obtained through one of the many intrusion vectors, followed by exfiltrating data, encrypting files, and eventually determining the ransom amount based on the company's revenue.While two members named Alex and Rash are the chief players behind the operation, a third managerial member named Sergey-Oleg is responsible for delegating duties to the group's other associates and overseeing their execution.However, an examination of the group's Jabber conversation history has revealed that operators in administrator positions engage in coercion and blackmail to intimidate team members into working more and issue ultimatums to \"hurt their family members in case of resigning or escaping from responsibilities.\"\"FIN7 has established itself as an extraordinarily versatile and well-known APT group that targets enterprise companies,\" PRODAFT concluded. \"Their signature move is to thoroughly research the companies based on their revenue, employee count, headquarters and website information to pinpoint the most profitable targets.\"\"Although they have internal issues related to the unequal distribution of obtained monetary resources and somewhat questionable practices towards their members, they have managed to establish a strong presence in the cybercrime sphere.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-23",
      "title": "France Seeks to Protect Hospitals After Series of Cyberattacks - SecurityWeek",
      "text": " Hi, what are you looking for?The French government announced a “vast training programme” on Wednesday to help hospital staff guard against hackers after a series of cyberattacks against medical facilities.ByFlipboardRedditWhatsappWhatsappEmailAFP 2023Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.SecurityWeek spoke with more than 300 cybersecurity experts to see what is bubbling beneath the surface, and examine how those evolving threats will present...A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Joanna Burkey, CISO at HP, and Kevin Cross, CISO at Dell, discuss how the role of a CISO is different for a multinational corporation...In this issue of CISO Conversations we talk to two CISOs about solving the CISO/CIO conflict by combining the roles under one person.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-23",
      "title": "Researchers Link Royal Ransomware to Conti Group - SecurityWeek",
      "text": " Hi, what are you looking for?The highly active Royal ransomware is operated by seasoned threat actors who used to be part of Conti Team One, cybersecurity firm Trend Micro reports.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-23",
      "title": "FIN7 hackers create auto-attack platform to breach Exchange servers",
      "text": " The notorious FIN7 hacking group uses an automated attack system that exploits Microsoft Exchange and SQL injection vulnerabilities to breach corporate networks, steal data, and select targets for ransomware attacks based on financial size.This system was discovered by Prodaft's threat intelligence team, which has been closely following FIN7 operations for years now.In a report shared with BleepingComputer before publication, Prodaft reveals details about FIN7's internal hierarchy, affiliations with various ransomware projects, and a new SSH backdoor system used for stealing files from compromised networks.FIN7 is a Russian-speaking and financially motivated threat actor active since at least 2012.The auto-attack system discovered by Prodaft is called 'Checkmarks,' and it's a scanner for multiple Microsoft Exchange remote code execution and privilege elevation vulnerabilities like CVE-2021-34473, CVE-2021-34523, and CVE-2021-31207.Starting in June 2021, FIN7 used Checkmarks to automatically discover vulnerable endpoints inside companies’ networks and exploit them to gain access by dropping web shells via PowerShell.FIN7 used various exploits to gain access to the target networks, including their own custom code and publicly available PoCs.In addition to the MS Exchange flaws, the Checkmarks attack platform also features a SQL injection module using SQLMap to scan for potentially exploitable flaws on a target's website.After the initial attack stage, Checkmarks automatically performs post-exploitation steps, such as email extraction from Active Directory and Exchange server information gathering.New victims are automatically added to a central panel where FIN7 operators can see additional details about the compromised endpoint.Next, FIN7's internal 'marketing' team scrutinizes new entries and adds comments on the Checkmarks platform to list victims' current revenue, number of employees, domain, headquarters details, and other information that helps pentesters determine if the firm is worth the time and effort of a ransomware attack.The due diligence that goes into evaluating a firm's size and financial status is notable, with FIN7's marketing team collecting information from diverse sources, including Owler, Crunchbase, DNB, Zoominfo, Mustat, and Similarweb.Prodaft says FIN7's Checkmarks platform has already been used to infiltrate 8,147 companies, primarily based in the United States (16.7%), after scanning over 1.8 million targets.Prodaft's investigations discovered further evidence of the DarkSide connection after they found what appeared to be ransom notes and encrypted files from the ransomware operation.Moreover, the researchers found abundant evidence of communications with multiple ransomware gangs, including Darkside, REvil, and LockBit, from retrieved Jabber logs.One notable detail from these logs is that FIN7 likes to maintain a SSH backdoor on extorted ransomware victims’ networks even after ransoms are paid, either to sell access to other groups or to try a new attack themselves in the future.This SSH backdoor is a recent addition to FIN7's arsenal, allowing them to steal files from breached devices using reverse SSH connections (SFTP) through an Onion domain.FIN7's Checkmarks platform illustrates how threat actors are industrializing public exploits to perform wide-scale attacks with a global impact.Furthermore, the investigation shows that instead of specifically targeting valuable firms, FIN7 targets everyone and evaluates how valuable they are in a second phase.Prodaft has provided indicators of compromise (IOCs) in their report for the SSH-based backdoor and other malware used in their attacks. It is strongly recommended that all admins review the report to learn how FIN7 targets their networks."
   }
]