[
   {
      "time": "2023-11-22",
      "title": "Experts warn of a surge in NetSupport RAT attacks",
      "text": " NetSupport RAT is a remote control and desktop management software developed by NetSupport Ltd. It is designed to facilitate IT administrators and support staff in managing and controlling multiple remote computers from a centralized location. NetSupport Manager allows users to perform various tasks remotely, including troubleshooting, software distribution, system monitoring, and file transfers.Carbon Black researchers observed threat actors using older variations of NetSupport RAT, which used .BAT and .VBS files as decoys. The researchers did not observe newer variants utilizing older methods.In the attacks detected by Carbon Black, NetSupport RAT was distributed through fake browser updates. “The following infection showcases the victim getting tricked into downloading a fake browser update after visiting a compromised website.  These infected websites host a PHP script which displays a seemingly authentic update.  When the victim clicks on the download link, an additional Javascript payload is downloaded onto the endpoint.”Upon downloading the Javascript (“Update_browser_10.6336.js“) it retrieves and execute a Powershell from an external domain (i.e. implacavelvideos[.]com). The Powershell is used to retrieve a ZIP archive containing NetSupport RAT that.“Multiple NetSupport dependencies/DLL’s as well as the NetSupport Manager are contained within this decompressed file.” concludes the report published by Carbon Black that also includes Indicators of Compromise (IOC).”Once installed on a victim’s device, NetSupport is able to monitor behavior, transfer files, manipulate computer settings, and move to other devices within the network.”\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-11-22",
      "title": "Hacktivists breach U.S. nuclear research lab, steal employee data",
      "text": " The Idaho National Laboratory (INL) confirms they suffered a cyberattack after 'SiegedSec' hacktivists leaked stolen human resources data online.INL is a nuclear research center run by the U.S. Department of Energy that employs 5,700 specialists in atomic energy, integrated energy, and national security.The INL complex extends over an 890-square-mile (2,310 km2) area, encompassing 50 experimental nuclear reactors, including the first ones in history to produce usable amounts of electricity and the first power plant designed for nuclear submarines.Currently, INL is occupied with research on next-gen nuclear plants, light water reactors, control systems cybersecurity, advanced vehicle testing, bioenergy, robotics, nuclear waste processing, and other studies.On Monday, SiegedSec announced it had gained access to INL data, including details on \"hundreds of thousands\" of employees, system users, and citizens.The data leaked by SiegedSec includes:On Telegram, SiegedSec also posted alleged proof of the breach by sharing screenshots of tools used internally by INL for document access and announcement creation.The attackers also showed the creation of a custom announcement on INL's system to let everyone in the complex know about the breach.INL has not published any statements on the incident yet. However, a spokesperson confirmed the breach to local media outlets, commenting that it is currently under investigation and that federal law enforcement is involved.\"INL has been in touch with federal law enforcement agencies, including the FBI and the Department of Homeland Security's Cyber Security and Infrastructure Security Agency to investigate the extent of data impacted in this incident.\"Although SiegedSec has neither accessed nor disclosed any data on nuclear research, the incident will inevitably intensify law enforcement scrutiny of the hacktivist group, as INL is considered a vital part of U.S. critical infrastructure."
   },
   {
      "time": "2023-11-22",
      "title": "\r\n\tKonni Campaign Deploys Advanced RAT With UAC Bypass Capabilities - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistSecurity researchers have detected a Russian-language Word document carrying a malicious macro in the ongoing Konni campaign. Despite its September 2023 creation date, FortiGuard Labs’ internal telemetry revealed continued activity on the campaign’s command-and-control (C2) server. This long-running campaign utilizes a remote access Trojan (RAT) capable of extracting information and executing commands on compromised devices, employing diverse strategies for initial access, payload delivery and persistence within victim networks.According to an advisory published by Fortinet security researcher Cara Lin on Monday, a Visual Basic for Applications (VBA) script is triggered upon opening the document, displaying Russian text related to a military operation. “A VBA script is initiated that displays an article in Russian that translates to ‘Western Assessments of the Progress of the Special Military Operation,’” Lin explained.The script retrieves information and runs a discreet batch script that performs system checks, UAC bypass and DLL file manipulations. The User Account Control (UAC) bypass module, in particular, leverages a legitimate Windows utility to execute commands with elevated privileges without triggering UAC prompts.The subsequent script stops redundant execution, copies files, creates a new service, configures registry settings and initiates the service. The final payload encrypts its C2 configuration using AES-CTR encryption, gathers system information, compresses and uploads data to the C2 server, and fetches commands.“The payload incorporates a UAC bypass and encrypted communication with a C2 server, enabling the threat actor to execute privileged commands. As this malware continues to evolve, users are advised to exercise caution with suspicious documents,” Lin wrote."
   },
   {
      "time": "2023-11-22",
      "title": "Microsoft now rolling out Copilot to Windows 10 devices",
      "text": " Microsoft is now rolling out the Copilot AI assistant to eligible non-managed systems enrolled in the Windows Insider program and running Windows 10 22H2 Home and Pro editions.Insiders in the Release Preview Channel can start testing Copilot by navigating to Settings > Update & Security > Windows Update, activating the newly added \"Get the latest updates as soon as they're available\" toggle, and checking for updates after installing Windows 10 22H2 Build 19045.3757 (KB5032278).\"As a reminder, this will be a phased launch via controlled feature rollout (CFR) over the coming months.\"Microsoft will add devices running Windows 10 Enterprise or Education version 22H2 and Professional devices managed by organizations to the rollout process in a subsequent deployment phase.​After it's added to a Windows 10 system, users can launch the AI assistant by clicking the new Copilot icon at the end of the Windows taskbar.This will open a chat window docked on the desktop for entering queries. Like its Windows 11 counterpart, Copilot in Windows 10 also allows voice interactions via the microphone icon within the chat window.However, unlike the Windows 11 interface, not all Copilot features will be accessible on Windows 10 devices. For instance, functionality like opening applications or customizing preferences will not be available.The preview release of Copilot in Windows 10 is currently only available in select global markets. North America, parts of Asia, and South America serve as the primary markets for the preview, with additional markets gradually joining the rollout at a later time."
   },
   {
      "time": "2023-11-22",
      "title": "New Agent Tesla Malware Variant Using ZPAQ Compression in Email Attacks",
      "text": " \"That means that ZPAQ archives can be smaller, saving storage space and bandwidth when transferring files. However, ZPAQ has the biggest disadvantage: limited software support.\"It's often used as a first-stage payload, providing remote access to a compromised system and utilized to download more sophisticated second-stage tools such as ransomware.The latest attack chain begins with an email containing a ZPAQ file attachment that purports to be a PDF document, opening which extracts a bloated .NET executable that's mostly padded with zero bytes to artificially inflate the sample size to 1 GB in an effort to bypass traditional security measures.\"The main function of the unarchived .NET executable is to download a file with .wav extension and decrypt it,\" Lvova explained. \"Using commonly used file extensions disguises the traffic as normal, making it more difficult for network security solutions to detect and prevent malicious activity.\"The development is a sign that threat actors are experimenting with uncommon file formats for malware delivery, necessitating that users be on the lookout for suspicious emails and keep their systems up-to-date.\"The usage of the ZPAQ compression format raises more questions than answers,\" Lvova said. \"The assumptions here are that either threat actors target a specific group of people who have technical knowledge or use less widely known archive tools, or they are testing other techniques to spread malware faster and bypass security software.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-22",
      "title": "Lumma malware can allegedly restore expired Google auth cookies",
      "text": " The Lumma information-stealer malware (aka 'LummaC2') is promoting a new feature that allegedly allows cybercriminals to restore expired Google cookies, which can be used to hijack Google accounts.Session cookies are specific web cookies used to allow a browsing session to log in to a website's services automatically. As these cookies allow anyone possessing them to log in to the owner's account, they commonly have a limited lifespan for security reasons to prevent misuse if stolen.Restoring these cookies would allow Lumma operators to gain unauthorized access to any Google account even after the legitimate owner has logged out of their account or their session has expired.The forum post also clarifies that each key can be used twice so that cookie restoration can work only one time. That would still be enough to launch catastrophic attacks on organizations that otherwise follow good security practices.This new feature allegedly introduced in recent Lumma releases is yet to be verified by security researchers or Google, so whether or not it works as advertised remains uncertain.However, it is worth mentioning that another stealer, Rhadamanthys, announced a similar capability in a recent update, increasing the likelihood that malware authors discovered an exploitable security gap.BleepingComputer has contacted Google multiple times requesting a comment on the possibility of malware authors having discovered a vulnerability in session cookies, but we have yet to receive a response.A few days after contacting Google, Lumma's developers released an update that claims to be an additional fix to bypass newly introduced restrictions imposed by Google to prevent cookie restoration.BleepingComputer has also attempted to learn more about how the feature works and what weakness it exploits directly from Lumma. However, a \"support agent\" of the malware operation declined to share anything about it.When asked about the similar feature Rhadamantis added recently, Lumma's agent told us their competitors had carelessly copied the feature from their stealer.If information-stealers can indeed restore expired Google cookies as promoted, there's nothing that users can do to protect their accounts until Google pushes out a fix besides preventing the malware infection that leads to the theft of those cookies.Precautions include avoiding downloads of torrent files and executables from dubious websites and skipping promoted results in Google Search."
   },
   {
      "time": "2023-11-22",
      "title": "Citrix warns admins to kill NetScaler user sessions to block hackers",
      "text": " Citrix reminded admins today that they must take additional measures after patching their NetScaler appliances against the CVE-2023-4966 'Citrix Bleed' vulnerability to secure vulnerable devices against attacks.Besides applying the necessary security updates, they're also advised to wipe all previous user sessions and terminate all active ones. This is a crucial step, seeing that attackers behind ongoing Citrix Bleed exploitation have been stealing authentication tokens, allowing them to access compromised devices even after they have been patched.Mandiant also warned that compromised NetScaler sessions persist after patching, enabling attackers to move laterally across the network or compromise other accounts depending on the compromised accounts' permissions.This is the second time the company has warned customers to kill all active and persistent sessions using the following commands:Today, CISA and the FBI cautioned that the LockBit ransomware gang is exploiting the Citrix Bleed security flaw in a joint advisory with the Multi-State Information Sharing & Analysis Center (MS-ISAC) and the Australian Cyber Security Center (ACSC).The agencies also shared indicators of compromise and detection methods to help defenders thwart the ransomware group's attacks.\"Responding to the recently disclosed CVE-2023-4966, affecting Citrix NetScaler ADC and NetScaler Gateway appliances, CISA received four files for analysis that show files being used to save registry hives, dump the Local Security Authority Subsystem Service (LSASS) process memory to disk, and attempts to establish sessions via Windows Remote Management (WinRM),\" CISA added in a Malware Analysis Repor also published today."
   },
   {
      "time": "2023-11-22",
      "title": "CISA orders federal agencies to patch Looney Tunables Linux bug",
      "text": " Today, CISA ordered U.S. federal agencies to secure their systems against an actively exploited vulnerability that lets attackers gain root privileges on many major Linux distributions.The security flaw impacts systems running the latest releases of widely used Linux platforms, including Fedora, Ubuntu, and Debian in their default configurations.\"With the capability to provide full root access on popular platforms like Fedora, Ubuntu, and Debian, it's imperative for system administrators to act swiftly,\" Qualys' Saeed Abbasi warned.Following its inclusion in CISA's KEV list, U.S. Federal Civilian Executive Branch Agencies (FCEB) must patch Linux devices on their networks by December 12, as mandated by a binding operational directive (BOD 22-01) issued one year ago.Although the BOD 22-01 primarily targets U.S. federal agencies, CISA also advised all organizations (including private companies) to prioritize patching the Looney Tunables security flaw immediately.The attacks start with exploiting a known vulnerability within the PHP testing framework 'PHPUnit.' This initial breach allows them to establish a code execution foothold, followed by leveraging the 'Looney Tunables' issue to escalate their privileges.After gaining root access to compromised Linux devices, threat actors install a JavaScript web shell for backdoor access. This shell allows them to execute commands, manage files, and conduct network and server reconnaissance.The Kinsing attackers' ultimate goal is to steal cloud service provider (CSP) credentials, aiming for access to AWS instance identity data.Kinsing is known for breaching and deploying crypto mining software cloud-based systems, including Kubernetes, Docker APIs, Redis, and Jenkins."
   },
   {
      "time": "2023-11-22",
      "title": "\r\n\tUkraine Sacks Two Senior Cyber Officials - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineThe Ukrainian government has fired the leader and deputy head of a state cybersecurity agency, as anti-corruption investigators launched a new probe into wrongdoing.Yurii Shchyhol was head of the State Service of Special Communications and Information Protection of Ukraine (SSSCIP), whose job it is to secure internal government communications, among other things.Although there was no word on the post about the reasons for the dismissal, reports suggest Ukraine’s National Anti-Corruption Bureau is looking at the duo’s role in a plot to embezzle 62 million Ukrainian hryvnia ($1.7m) between 2020 and 2022.The plotters are said to have conspired to buy software at an inflated price from two companies they controlled, in a sale closed to other bidders.The Zelenskiy administration is putting much effort into weeding out corruption as it looks to accelerate its accession to the EU. The European Commission earlier this month recommended that formal talks should begin with the war-torn country soon, although the process will take years.For their part, both Shchyhol and Zhora have taken to social media to protest their innocence.“In the near future, I plan to decide how I can best be useful to the Armed Forces.”"
   }
]