[
   {
      "time": "2023-11-07",
      "title": "\r\n\tUS, Japan and South Korea Unite to Counter North Korean Cyber Activiti - Infosecurity Magazine\r\n",
      "text": " Deputy Editor, Infosecurity MagazineThe US, Japan and South Korea have established a high-level consultative body designed to counter North Korea’s cyber activities.A key purpose of the new group is to prevent cyber-attacks and crypto heists used to fund North Korea’s weapons development, including its nuclear program, according to South Korea’s Office of National Security.The consultative body will “strengthen the ability of the three countries to jointly respond to global cyber threats,” the South Korean office added.Under the framework, officials from the US, Japan and South Korea will hold quarterly meetings to enhance cooperation in this area.Anne Neuberger, Deputy Assistant to the President and Deputy National Security Advisor for Cyber and Emerging Technologies at the US National Security Council (NSC), agreed to the creation of the consultative body with counterparts from South Korea and Japan on October 10 in Washington DC.“Addressing North Korean hacking has been a priority of the United States,” Neuberger said.The creation of the consultative body follows an agreement between the three nations to establish a new trilateral working group to counter North Korea’s cyber threats in an August 2023 meeting at Camp David in the US."
   },
   {
      "time": "2023-11-07",
      "title": "Cybercrime service bypasses Android security to install malware",
      "text": " A new dropper-as-a-service (DaaS) cybercrime operation named 'SecuriDropper' has emerged, using a method that bypasses the 'Restricted Settings' feature in Android to install malware on devices and obtain access to Accessibility Services.Restricted Settings is a security feature introduced with Android 13 that prevents side-loaded applications (APK files) installed from outside Google Play to access powerful features like the Accessibility settings and Notification Listener.The two permissions are commonly abused by malware, so the feature was intended to protect users by blocking the approval of requests by displaying a warning when these permissions are requested.Accessibility can be abused to capture on-screen text, granting additional permissions, and performing navigation actions remotely, while the Notification Listener can be used to steal one-time passwords.Based on its observations, the firm created a proof-of-concept (PoC) dropper to showcase that the bypass was possible.The trick is to use the session-based installation API for the malicious APK (Android package) files, which installs them in multiple steps, involving a \"base\" package and various \"split\" data files.When the particular API is used instead of the non-session method, Restricted Settings is bypassed, and users are not shown the 'Restricted setting' dialog that prevents them from granting the malware access to dangerous permissions.BleepingComputer has confirmed that the security issue is still present in Android 14, and, according to a new ThreatFabric report, SecuriDropper follows the same technique to side-load malware on target devices and give them access to risky sub-systems.This is the first observed case of this method being used in cybercrime operations targeting Android users.SecuriDropper infects Android devices posing as a legitimate app, most often impersonating a Google app, Android update, video player, security app, or a game, and then installing a second payload, which is some form of malware.The dropper achieves this by securing access to the \"Read & Write External Storage\" and \"Install & Delete Packages\" permissions upon installation.The second-stage payload is installed through user deception and interface manipulation, prompting users to click a \"Reinstall\" button after displaying bogus error messages about the dropper app's installation.Worryingly, Zombinder's recent advertisements highlight the same Restricted Settings bypass strategy previously discussed, so the payloads are granted permission to use Accessibility settings upon installation.To protect against these attacks, Android users should avoid downloading APK files from obscure sources or publishers they don't know and trust.Access to permissions for any installed app can be reviewed and revoked by going to Settings → Apps → [select an app] → Permissions.Update 11/6: In response to a request for a comment by BleepingComputer, a Google spokesperson has sent us the following statement:Restricted settings add an extra layer of protection on top of the user confirmation that is required for apps to access Android settings/permissions.As a core protection, Android users are always in control of which permissions they grant to an app.Users are also protected by Google Play Protect, which can warn users or block apps known to exhibit malicious behavior on Android devices with Google Play Services.We are constantly reviewing attack methods and improving Android's defenses against malware to help keep users safe."
   },
   {
      "time": "2023-11-07",
      "title": "TellYouThePass ransomware joins Apache ActiveMQ RCE attacks",
      "text": " Internet-exposed Apache ActiveMQ servers are also targeted in TellYouThePass ransomware attacks targeting a critical remote code execution (RCE) vulnerability previously exploited as a zero-day.Since Apache ActiveMQ is used as a message broker in enterprise environments, applying the security updates should be considered time-sensitive.Admins are advised to patch all vulnerable systems immediately by upgrading to ActiveMQ versions 5.15.16, 5.16.7, 5.17.6, and 5.18.3.The attacks observed by both cybersecurity companies' security researchers started on October 27, just days after Apache released security patches.The security researchers also found similarities between the HelloKitty and TellYouThePass attacks, with both campaigns sharing \"email address, infrastructure, as well as bitcoin wallet addresses.\"\"Evidence of exploitation of CVE-2023-46604 in the wild from an assortment of threat actors with differing objectives demonstrates the need for rapid remediation of this vulnerability,\" Arctic Wolf researchers warned."
   },
   {
      "time": "2023-11-07",
      "title": "QNAP warns of critical command injection flaws in QTS OS, apps",
      "text": " QNAP Systems published security advisories for two critical command injection vulnerabilities that impact multiple versions of the QTS operating system and applications on its network-attached storage (NAS) devices.QTS versions affected by the security issue are QTS 5.0.x and 4.5.x, QuTS hero h5.0.x and h4.5.x, and QuTScloud c5.0.1.Fixes are available in the following releases: Impacted QTS versions include 5.1.x, 4.3.6, 4.3.4, 4.3.3, and 4.2.x, Multimedia Console 2.1.x and 1.4.x, and Media Streaming add-on 500.1.x and 500.0.x.Fixes are available in:Updating the Multimedia Console is possible by looking for the installation in the App Center and clicking the \"Update\" button (available only if a newer version exists). The process is similar for updating the Media Streaming add-on, which users can also locate by searching the App Center.Since NAS devices are typically used to store data, command execution flaws could have a serious impact as cybercriminals are often looking for new targets to steal and/or encrypt sensitive data from. Attackers can then demand a ransom from the victim to not leak the data or to decrypt it.That said, QNAP users are advised to apply the available security updates as soon as possible."
   },
   {
      "time": "2023-11-07",
      "title": "Critical Atlassian Confluence bug exploited in Cerber ransomware attacks",
      "text": " Attackers are exploiting a recently patched and critical severity Atlassian Confluence authentication bypass flaw to encrypt victims' files using Cerber ransomware.Described by Atlassian as an improper authorization vulnerability and tracked as CVE-2023-22518, this bug received a 9.1/10 severity rating, and it affects all versions of Confluence Data Center and Confluence Server software.\"There are no reports of active exploitation at this time; however, customers must take immediate action to protect their instances.\"Atlassian updated their advisory on Friday to caution that threat actors were already targeting the flaw in attacks after the PoC exploit's release.\"We received a customer report of an active exploit. Customers must take immediate action to protect their instances. If you already applied the patch, no further action is required,\" the company said.\"As of November 5, 2023, Rapid7 Managed Detection and Response (MDR) is observing exploitation of Atlassian Confluence in multiple customer environments, including for ransomware deployment,\" the company said.\"In multiple attack chains, Rapid7 observed post-exploitation command execution to download a malicious payload hosted at 193.43.72[.]11 and/or 193.176.179[.]41, which, if successful, led to single-system Cerber ransomware deployment on the exploited Confluence server.\""
   },
   {
      "time": "2023-11-07",
      "title": "Microsoft will roll out MFA-enforcing policies for admin portal access",
      "text": " Microsoft will soon start rolling out Conditional Access policies requiring multifactor authentication (MFA) from administrators when signing into Microsoft admin portals such as Microsoft Entra, Microsoft 365, Exchange, and Azure.The company will also roll out policies that will require MFA for per-user MFA users for all cloud apps and one that will require MFA for high-risk sign-ins (the latter only available to Microsoft Entra ID Premium Plan 2 customers).These Microsoft-managed policies (created by Microsoft on customers' tenants) will gradually be added in report-only mode to eligible Microsoft Entra tenants starting next week. After the rollout reaches their tenant, admins will have 90 days to review them and choose if they want to enable them or not.Redmond will automatically enable these Conditional Access policies only on tenants where they weren't toggled off within 90 days after the rollout.\"Please note that while you can opt out of these policies, teams at Microsoft will increasingly require multifactor authentication for specific interactions, as they already do for certain Azure subscription management scenarios, Partner Center, and Microsoft Intune device enrollment.\"​Once added, administrators with at least the Conditional Access Administrator role can find these policies in the Microsoft Entra admin center under Protection > Conditional Access > Policies.They can also modify the state (On, Off, or Report-only) for all Microsoft-managed policies, as well as excluded identities (Users, Groups, and Roles) within the policy.Redmond advises organizations to exclude emergency access or break-glass accounts from these policies, just as they would with other Conditional Access policies.Microsoft also provides the option to modify these policies further by cloning them using the Duplicate button in the policy list view and tailoring them like any other Conditional Access policy, starting with Microsoft-recommended defaults.\"Our eventual goal is to combine machine learning-based policy insights and recommendations with automated policy rollout to strengthen your security posture on your behalf with the right controls.\""
   },
   {
      "time": "2023-11-07",
      "title": "Hackers exploit Looney Tunables Linux bug, steal cloud creds",
      "text": " The operators of the Kinsing malware are targeting cloud environments with systems vulnerable to \"Looney Tunables,\" a Linux security issue identified as CVE-2023-4911 that allows a local attacker to gain root privileges on the system.In a report from cloud security company Aqua Nautilus, researchers describe a Kinsing malware attack where the threat actor exploited CVE-2023-4911 to elevate permissions on a compromised machine.Aqua Nautilus researchers say that the attack starts with exploiting a known vulnerability in the PHP testing framework 'PHPUnit' to gain a code execution foothold, followed by triggering the 'Looney Tunables' issue to escalate privileges.In contrast to their normal operational standard, Kinsing tested the latest attack manually, probably to ensure it works as expected before developing exploitation scripts to automate the task.Exploiting the PHPUnit flaw (CVE-2017-9841) leads to opening a reverse shell over port 1337 on the compromised system, which Kinsing operators leverage to execute reconnaissance commands like 'uname -a' and 'passwrd.'Additionally, the attackers drop a script named 'gnu-acme.py' on the system, which leverages CVE-2023-4911 for privilege elevation.The attackers also download a PHP script, which deploys a JavaScript web shell backdoor ('wesobase.js') that supports the subsequent attack stages.Specifically, the backdoor provides attackers the ability to execute commands, perform file management actions, collect information about the network and the server, and perform encryption/decryption functions.Ultimately, Kinsing showed interest in cloud service provider (CSP) credentials, particularly for accessing AWS instance identity data, which AquaSec characterizes as a significant shift towards more sophisticated and damaging activities for the particular threat actor.The researchers believe that this campaign was an experiment since the threat actor relied on a different tactics and expanded the scope of the attack to collecting Cloud Service Providers credentials."
   },
   {
      "time": "2023-11-07",
      "title": "Veeam warns of critical bugs in Veeam ONE monitoring platform",
      "text": " Veeam released hotfixes today to address four vulnerabilities in the company's Veeam ONE IT infrastructure monitoring and analytics platform, two of them critical.The company assigned almost maximum severity ratings (9.8 and 9.9/10 CVSS base scores) to the critical security flaws since they let attackers gain remote code execution (RCE) and steal NTLM hashes from vulnerable servers. The remaining two are medium-severity bugs that require user interaction or have limited impact.\"A vulnerability in Veeam ONE allows an unprivileged user who has access to the Veeam ONE Web Client the ability to acquire the NTLM hash of the account used by the Veeam ONE Reporting Service,\" the company says when describing the second critical vulnerability (CVE-2023-38548) patched today.Veeam also fixed a security flaw tracked as CVE-2023-38549 that could let attackers with Power User roles steal the access token of an admin in a Cross-Site Scripting (XSS) attack, which requires user interaction from someone with the Veeam ONE Administrator role.CVE-2023-41723, the fourth vulnerability addressed today, can be exploited by malicious actors with the Read-Only User role to access the Dashboard Schedule (the attacker can't make changes).Admins must stop the Veeam ONE monitoring and reporting services on impacted servers, replace the files on the disk with the files in the hotfix, and restart the services to deploy the hotfixes."
   },
   {
      "time": "2023-11-07",
      "title": "US sanctions Russian who laundered money for Ryuk ransomware affiliate",
      "text": " The U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC) has sanctioned Russian national Ekaterina Zhdanova for laundering millions in cryptocurrency for various individuals, including ransomware actors.Both OFAC and Chainalysis note that Zhdanova also leveraged her connections to an extensive global network of other money launderers to further obscure her financial activities activities and access a more traditional clientele.Zhdanova's system to hide the illegal origin of the Ryuk affiliate's money involved a fraudulently opened investment account and making real estate purchases.Apart from ransomware, Zhdanova also assisted Russian oligarchs in evading sanctions imposed by the Western world in response to Russia’s invasion of Ukraine.In one case, she facilitated the transfer of over $100 million on behalf of a Russian oligarch to the United Arab Emirates. Authorities have also confirmed several cases where she arranged for Russian clients to obtain UAE tax residency, ID cards, and bank accounts.As a result of the OFAC sanctions, Ekaterina Zhdanova will have all her U.S.-based assets frozen, while U.S. persons and entities will be prohibited from engaging in any transactions with her."
   },
   {
      "time": "2023-11-07",
      "title": "\r\n\tSpy Trojan SpyNote Unveiled in Attacks on Gamers - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe SpyNote Trojan, camouflaged as a mod for the game Roblox, has been observed targeting Android users. This mobile malware can log keystrokes, record screens, stream video from phone cameras and impersonate Google and Facebook applications to deceive users into revealing their passwords.These findings are part of Kaspersky’s latest report. The investigation, spanning from July 2022 to July 2023, exposes the vulnerabilities that cyber-criminals are actively exploiting within the gaming user base. Their tactics encompass a range of attacks, including web vulnerabilities, Distributed Denial of Service (DDoS) assaults, cryptocurrency mining and intricate Trojan or phishing campaigns.During this period, Kaspersky’s solutions identified 4,076,530 attempts to download 30,684 unique files disguised as popular games, mods, cheats and other game-related software. These attempts affected 192,456 users worldwide. The files, predominantly classified as unwanted software, were labeled as not-a-virus. The most commonly identified were Downloaders (89.70%). While not inherently dangerous, they can download other programs, including malicious ones, onto users’ devices. Adware (5.25%) and Trojans (2.39%) were also significant threats to desktop gamers.Minecraft emerged as the most targeted game by cyber-criminals, causing 70.29% of all alerts, affecting 130,619 players. Roblox was the second most targeted, with 20.37% of all alerts impacting 30,367 users.“In the dynamic gaming industry, which hosts a wealth of personal and financial data, cyber-criminals are seizing enticing opportunities. They exploit gaming accounts by pilfering in-game assets, virtual currency and selling compromised gaming accounts, often with real-world value,” said Vasily Kolesnikov, a cybersecurity expert at Kaspersky.“The relentless pursuit of personal data has led to a surge in ransomware attacks, even affecting professional gamers who depend on uninterrupted play. This underscores the critical need for enhanced cybersecurity awareness within the gaming community.”Kaspersky recommended individuals download games only from official stores, avoid downloading pirated software, be cautious of unfamiliar gamers and phishing campaigns, and use robust security solutions to protect themselves from cyber-threats.Image credit: Diego Thomazini / Shutterstock.com"
   }
]