[
   {
      "time": "2022-11-23",
      "title": "Personal data of nearly 4,000 people leaked in hack of Radio Free Asia",
      "text": " Radio Free Asia, a U.S. government-sponsored news outlet, announced a breach this week that affected almost 4,000 people – leaking troves of personal information including Social Security and passport numbers, as well as financial data.“The investigation determined that unauthorized access resulted from an exploit of a service provider’s vulnerability, unknown by RFA at the time of the compromise. At this time, there is no evidence Information has been misused; nevertheless, we are providing this notice.”Victims are being offered two years of credit monitoring through Equifax. RFA did not respond to requests for comment but spokesperson Rohit Mahajan told The Washington Post on Tuesday that they were never contacted by the hackers.Mahajan added that RFA notified law enforcement, the U.S. Congress, the Cybersecurity and Infrastructure Security Agency and the United States Agency for Global Media, which funds the organization through an annual grant. RFA provides news on several Asian countries including China, Myanmar, Cambodia, Laos, North Korea, Vietnam and more. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-23",
      "title": "Donut extortion group also targets victims with ransomware",
      "text": " The Donut (D0nut) extortion group has been confirmed to deploy ransomware in double-extortion attacks on the enterprise.Strangely, the data for Sando and DESFA was also posted to several ransomware operations’ sites, with the Sando attack claimed by Hive ransomware and DESFA claimed by Ragnar Locker.This cross-posting of stolen data and affiliation leads us to believe the threat actor behind Donut Leaks is an affiliate for numerous operations, now trying to monetize the data in their own operation.The ransomware is still being analyzed, but when executed, it will scan for files matching specific extensions to encrypt. When encrypting files, the ransomware will avoid files and folders containing the following strings:When a file is encrypted, the Donut ransomware will append the .d0nut extension to encrypted files. So, for example, 1.jpg will be encrypted and renamed to 1.jpg.d0nut, as shown below.The Donut Leaks operation has a flair for theatrics, using interesting graphics, a bit of humor, and even offering a builder for an executable that acts as a gateway to their Tor data leak site (see below).This flair is especially shown in its ransom notes, where they use different ASCII art, such as the spinning ASCII donut below.Another ransomware note seen by BleepingComputer pretends to be a command prompt displaying a PowerShell error, which then prints a scrolling ransom note.The ransom notes are heavily obfuscated to avoid detection, with all strings encoded and the JavaScript decoding the ransom note in the browser.These ransom notes include different ways to contact the threat actors, including via TOX and a Tor negotiation site. The Donut ransomware operation also includes a \"builder\" on their data leak site that consists of a bash script to create a Windows and Linux Electron app with a bundled Tor client to access their data leak sites.This app is currently \"broken\" as it uses HTTPS URLs, which are not currently operational.Overall, this extortion group is one to keep an eye out for, not only for their apparent skills but their ability to market themselves."
   },
   {
      "time": "2022-11-23",
      "title": "CISA releases updated infrastructure guide for local gov't, tribal defenders",
      "text": " The Cybersecurity and Infrastructure Security Agency has published updates to its guide for state, local, tribal, and territorial cybersecurity defenders protecting infrastructure across the U.S. The updated framework, which was published on Tuesday, includes the Datasets for Critical Infrastructure Identification guide, a new tool that provides information on how to find publicly accessible information on critical infrastructure assets.CISA also provides defenders tips around drought resilience, including advice on gathering a range of opinions for planning purposes. Included is a new guide with an overview of the drought hazard, examples of direct and indirect impacts it can have on infrastructure systems, and federal resources for assessing and mitigating drought risk.David Mussington, executive assistant director for infrastructure security at CISA, said the updates “will help planners better understand how to approach future threats and hazards so they can be prepared to meet and recover from an incident.”\"Our safety and security depend on the ability of critical infrastructure to prepare for and adapt to changing conditions and to withstand and recover rapidly from disruptions,” he said.CISA said it believes the plan could be used to support capital improvement, hazard mitigation, and other planning measures, as well as funding requests.Experts have lauded CISA’s efforts to increase awareness around the need for better cybersecurity around critical infrastructure among government agencies and private companies. Robert M. Lee, CEO and co-founder of Dragos, noted that CISA has taken extensive input and feedback from industry stakeholders before providing guidance. “This guidance can help lift industrial cybersecurity standards across the board to better protect our nation’s critical infrastructure. CISA’s continued focus on OT [operational technology] cybersecurity as foundational to national security, and distinct from IT cybersecurity, is an important contribution to the community's advancement,” Lee said. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-23",
      "title": "Android file manager apps infect thousands with Sharkbot malware",
      "text": " A new collection of malicious Android apps posing as harmless file managers had infiltrated the official Google Play app store, infecting users with the Sharkbot banking trojan.The apps do not carry the malicious payload upon installation to evade detection when submitted on Google Play but instead fetch it later from a remote resource.Because the trojan apps are file managers, it’s less likely to raise suspicions when requesting dangerous permissions for loading the Sharkbot malware.Sharkbot is a dangerous malware that attempts to steal online bank accounts by displaying fake login forms over legitimate login prompts in banking apps. When a user attempts to log in to their bank using one of these fake forms, the credentials are stolen and sent to the threat actors.However, many users who downloaded them previously may still have them installed on their phones or still suffer from undiscovered remnant malware infections.The first malicious app is ‘X-File Manager’ by Victor Soft Ice LLC (com.victorsoftice.llc), downloaded 10,000 times via Google Play before Google eventually removed it.The app performs anti-emulation checks to evade detection and will only load Sharkbot on Great British or Italian SIMs, so it’s part of a targeted campaign.The list of mobile bank apps targeted by the malware is displayed below, but as Bitdefender notes, the threat actors can remotely update this list anytime.Bitdefender’s telemetry data reflects the narrow targeting of this campaign, as most victims of the particular Sharkbot distribution wave are located in the United Kingdom, followed by Italy, Iran, and Germany.The malicious app requests the user to grant risky permissions like reading and writing external storage, installing new packages, accessing account details, deleting packages (to wipe traces), etc.However, these permissions appear normal and expected in the context of file management apps, so users are less likely to treat the request with caution.Sharkbot is fetched as a fake program update, which X-File Manager prompts the user to approve before installing.The second malicious app that installs the banking trojan is ‘FileVoyager’ by Julia Soft Io LLC (com.potsepko9.FileManagerApp), downloaded 5,000 times via Google Play.FileVoyager features the same operational pattern as X-File Manager and targets the same financial institutions in Italy and the UK.Another Sharkbot loading app spotted by Bitdefender is ‘LiteCleaner M’ (com.ltdevelopergroups.litecleaner.m), which amassed 1,000 downloads before it got spotted and removed from the Play Store.Currently, this app is only available via third-party app stores like APKSOS. The same third-party app store hosts a fourth Sharkbot loader named ‘Phone AID, Cleaner, Booster 2.6’ (om.sidalistudio.developer.app).If these apps are installed, Android users should remove them immediately and change the passwords for any online bank accounts they use.As the threat actors distributed these apps directly from Google Play, the best way to protect yourself is to keep the Play Protect service enabled so that malicious apps are removed as they are detected.Furthermore, an Android mobile security antivirus application would help to detect malicious traffic and apps, even before they are reported to Google Play."
   },
   {
      "time": "2022-11-23",
      "title": "Leaked Algolia API Keys Exposed Data of Millions of Users - SecurityWeek",
      "text": " Hi, what are you looking for?Threat detection firm CloudSEK has identified thousands of applications leaking Algolia API keys, and tens of applications with hardcoded admin secrets, which could allow attackers to steal the data of millions of users.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.The CRYSTALS-Kyber public-key encryption and key encapsulation mechanism recommended by NIST for post-quantum cryptography has been broken using AI combined with side channel attacks.The three primary drivers for cyber regulations are voter privacy, the economy, and national security – with the complication that the first is often...PayPal is alerting roughly 35,000 individuals that their accounts have been targeted in a credential stuffing campaign.A CSRF vulnerability in the source control management (SCM) service Kudu could be exploited to achieve remote code execution in multiple Azure services.GitHub this week announced the revocation of three certificates used for the GitHub Desktop and Atom applications.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-11-23",
      "title": "Belarusian hacktivists claim to breach Russia’s internet regulator",
      "text": " © Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-23",
      "title": "Vietnam-Based Ducktail Cybercrime Operation Evolving, Expanding - SecurityWeek",
      "text": " Hi, what are you looking for?The Ducktail information stealer has been updated with new capabilities and the threat actors that use it have been expanding their operation, according to WithSecure, formerly known as F-Secure Business.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-11-23",
      "title": "Researchers Warn of Cyber Criminals Using Go-based Aurora Stealer Malware",
      "text": " A nascent Go-based malware known as Aurora Stealer is being increasingly deployed as part of multiple campaigns designed to steal sensitive information from compromised hosts.First advertised on Russian cybercrime forums in April 2022 by a threat actor calling themselves Cheshire, Aurora was offered as a commodity malware for other threat actors, describing it as a \"multi-purpose botnet with stealing, downloading and remote access capabilities.\"In the intervening months, the malware has been scaled down to a stealer that can harvest files of interest, data from 40 cryptocurrency wallets, and applications like Telegram.Aurora also comes with a loader that can deploy a next-stage payloading using a PowerShell command.\"Aurora is another infostealer targeting data from browsers, cryptocurrency wallets, local systems, and acting as a loader,\" SEKOIA said. \"Sold at a high price on market places, collected data is of particular interest to cybercriminals, allowing them to carry out follow-up lucrative campaigns, including Big Game Hunting operations.\"The development also comes as researchers from Palo Alto Networks Unit 42 detailed an enhanced version of another stealer called Typhon Stealer.\"Typhon Stealer provided threat actors with an easy to use, configurable builder for hire,\" Unit 42 researchers Riley Porter and Uday Pratap Singh said.\"Typhon Reborn's new anti-analysis techniques are evolving along industry lines, becoming more effective in the evasion tactics while broadening their toolset for stealing victim data.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-23",
      "title": "PoC Code Published for High-Severity macOS Sandbox Escape Vulnerability - SecurityWeek",
      "text": " Hi, what are you looking for?A security researcher has published details and proof-of-concept (PoC) code for a macOS vulnerability that could be exploited to escape a sandbox and execute code within Terminal.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   }
]