[
   {
      "time": "2023-11-06",
      "title": "American Airlines pilot union hit by ransomware attack",
      "text": " Allied Pilots Association (APA), a labor union representing 15,000 American Airlines pilots, disclosed a ransomware attack that hit its systems on Monday.The APA union was founded in 1963 and is currently the largest independent pilots' trade union in the world.\"While the investigation is ongoing, we can share that we have determined the incident was due to ransomware and that certain systems were encrypted.\"APA said that its IT team and outside experts are working on restoring systems impacted by the ransomware attack from backups, with an initial focus on first bringing back pilot-facing products and tools in the hours and days ahead.The union has launched an investigation led by third-party cybersecurity experts to assess the full extent of the incident and its impact on data stored on compromised systems.The APA has not yet shared whether pilots' personal information was compromised in the attack or the exact number of individuals affected.Gregg Overman, the union's communications director, told BleepingComputer that the organization couldn't provide further details beyond what had been disclosed when asked to link the incident to a ransomware operation.Information exposed in the April third-party breach includes names and Social Security numbers, driver's license numbers, passport numbers, dates of birth, Airman Certificate numbers, and other government-issued identification numbers."
   },
   {
      "time": "2023-11-06",
      "title": "Apple 'Find My' network can be abused to steal keylogged passwords",
      "text": " Apple's \"Find My\" location network can be abused by malicious actors to stealthily transmit sensitive information captured by keyloggers installed in keyboards.The Find My network and application is designed to help users locate lost or misplaced Apple devices, including iPhones, iPads, Macs, Apple Watches, AirPods, and Apple Tags.The service relies on GPS and Bluetooth data crowd-sourced from millions of Apple devices worldwide to find devices reported as lost or stolen, even if those are offline.Lost devices send Bluetooth signals in a constant loop detected by nearby Apple devices, which then anonymously relay their location to the owner through the Find My network.They integrated a keylogger with an ESP32 Bluetooth transmitter into a USB keyboard to show that it's possible to relay passwords and other sensitive data typed on the keyboard through the Find My network via Bluetooth.Bluetooth transmission is far stealthier than WLAN keyloggers or Raspberry Pi devices that can be easily noticed in well-guarded environments, and the Find My platform can covertly leverage omnipresent Apple devices for the relay.The keylogger doesn't have to use an AirTag or an officially supported chip, as Apple devices are tuned to respond to any Bluetooth message. If that message is appropriately formatted, the receiving Apple device will create a location report and upload it to the Find My network.The sender needs to create many slightly different public encryption keys simulating multiple AirTags and encode arbitrary data into the keys by assigning specific bits at predetermined positions in the keys.This way, the multiple reports retrieved from the cloud can be concatenated and decoded at the receiving end to retrieve the arbitrary data, in this case, the keylogger's captures.Bräunlein explained that the total cost of the data-siphoning contraption was roughly $50, using a Bluetooth-enabled version of the 'EvilCrow' keylogger and a standard USB keyboard.The PoC attack achieved a transmission rate of 26 characters per second and a reception rate of 7 characters/sec, with a latency of between 1 and 60 minutes, depending on the presence of Apple devices at the keylogger's range.While this is admittedly not very fast, if recovering valuable information such as passwords is the goal, waiting for several hours or even days wouldn't be a deal-breaker for malicious actors.The best part is that Apple's anti-tracking protections that notify users Air Tags might be tracking them are not activated by the stationary keylogger inside the keyboard, so the device remains hidden and unlikely to be discovered.BleepingComputer has asked Apple for a statement on the abuse of Find My, but we have not received a response by publication time."
   },
   {
      "time": "2023-11-06",
      "title": "New Microsoft Exchange zero-days allow RCE, data theft attacks",
      "text": " Microsoft Exchange is impacted by four zero-day vulnerabilities that attackers can exploit remotely to execute arbitrary code or disclose sensitive information on affected installations.The zero-day vulnerabilities were disclosed by Trend Micro's Zero Day Initiative (ZDI) yesterday, who reported them to Microsoft on September 7th and 8th, 2023.Despite Microsoft acknowledging the reports, its security engineers decided the flaws weren't severe enough to guarantee immediate servicing, postponing the fixes for later.ZDI disagreed with this response and decided to publish the flaws under its own tracking IDs to warn Exchange admins about the security risks.A summary of the flaws can be found below:All these vulnerabilities require authentication for exploitation, which reduces their severity CVSS rating to between 7.1 and 7.5. Furthermore, requiring authentication is a mitigation factor and possibly why Microsoft did not prioritize the fixing of the bugs.It should be noted, though, that cybercriminals have many ways to obtain Exchange credentials, including brute-forcing weak passwords, performing phishing attacks, purchasing them, or acquiring them from info-stealer logs.That said, the above zero-days shouldn't be treated as unimportant, especially ZDI-23-1578 (RCE), which can result in complete system compromise.ZDI suggests that the only salient mitigation strategy is to restrict interaction with Exchange apps. However, this can be unacceptably disruptive for many businesses and organizations using the product.We also suggest implementing multi-factor authentication to prevent cybercriminals from accessing Exchange instances even when account credentials have been compromised.Update 11/4 - A Microsoft spokesperson responded to BleepingComputer's request for a comment with the following statement:We appreciate the work of this finder submitting these issues under coordinated vulnerability disclosure, and we’re committed to taking the necessary steps to help protect customers.Further Microsoft provided the below additional context on each of the discovered flaws:  "
   },
   {
      "time": "2023-11-06",
      "title": "Socks5Systemz proxy service infects 10,000 systems worldwide",
      "text": " A proxy botnet called 'Socks5Systemz' has been infecting computers worldwide via the 'PrivateLoader' and 'Amadey' malware loaders, currently counting 10,000 infected devices.The malware infects computers and turns them into traffic-forwarding proxies for malicious, illegal, or anonymous traffic. It sells this service to subscribers who pay between $1 and $140 per day in crypto to access it.The Socks5Systemz bot is distributed by the PrivateLoader and Amadey malware, which are often spread via phishing, exploit kits, malvertizing, trojanized executables downloaded from P2P networks, etc.The samples seen by BitSight are named 'previewer.exe,' and their task is to inject the proxy bot onto the host's memory and establish persistence for it via a Windows service called 'ContentDWSvc.'The proxy bot payload is a 300 KB 32-bit DLL. It uses a domain generation algorithm (DGA) system to connect with its command and control (C2) server and send profiling info on the infected machine.In response, the C2 can send one of the following commands for execution:The connect command is crucial, instructing the bot to establish a backconnect server connection over port 1074/TCP.Once connected to the threat actors' infrastructure, the infected device can now be used as a proxy server and sold to other threat actors.When connecting to the backconnect server, it uses fields that determine the IP address, proxy password, list of blocked ports, etc. These field parameters ensure that only bots in the allowlist and with the necessary login credentials can interact with the control servers, blocking unauthorized attempts.BitSight mapped an extensive control infrastructure of 53 proxy bot, backconnect, DNS, and address acquisition servers located mainly in France and across Europe (Netherlands, Sweden, Bulgaria).Since the start of October, the analysts recorded 10,000 distinct communication attempts over port 1074/TCP with the identified backconnect servers, indicating an equal number of victims.The geographic distribution is sparse and random, covering the entire globe, but India, the United States, Brazil, Colombia, South Africa, Argentina, and Nigeria count the most infections.Subscribers must declare the IP address from where the proxied traffic will originate to be added to the bot's allowlist.Standard subscribers are limited to a single thread and proxy type, while VIP users can use 100-5000 threads and set the proxy type to SOCKS4, SOCKS5, or HTTP. Prices for each service offering are given below.These services are commonly used for shopping bots and bypassing geo-restrictions, making them very popular."
   },
   {
      "time": "2023-11-06",
      "title": "Google Play adds security audit badges for Android VPN apps",
      "text": " Google Play, Android's official app store, is now tagging VPN apps with an 'independent security reviews' badge if they conducted an independent security audit of their software and platform.Starting with VPN apps, which Google considers critical for user privacy and security due to handling sensitive data, the Play Store will display the \"Independent security review\" badge in the Data Safety Section.This badge indicates that the apps' compliance with the MASA standard has been independently verified, enhancing transparency and bolstering user trust.As VPN providers are used to provide anonymity while browsing the web, many make claims that they do not keep any logs and do not expose the user's actual IP address, whether that be through bugs or other reasons.To prove these claims, some VPN providers perform third-party audits that examine source code, server configurations, and attempt to find bugs that may make users less secure while using the app.The VPN vendors that have opted to go through the MASA security audit and currently display the new Google Play badge are NordVPN, Google One, and ExpressVPN.Other VPN apps that hold a valid MASA certificate but haven't received a Google Play badge yet are Aloha Browser + Private VPN, Private Internet Access VPN, SkyVPN – Fast Secure VPN, Tomato VPN, and vpnify – Unlimited VPN Proxy.It is anticipated that a growing number of VPN apps will join this initiative shortly, helping foster greater transparency on Google Play.It is expected that the 'Independent security review' program will expand to other app types beyond VPNs, but Google has not provided a timeline for that yet."
   },
   {
      "time": "2023-11-06",
      "title": "Discord will switch to temporary file links to block malware delivery",
      "text": " Discord will switch to temporary file links for all users by the end of the year to block attackers from using its CDN (content delivery network) for hosting and pushing malware.\"Discord is evolving its approach to attachment CDN URLs in order to create a safer and more secure experience for users. In particular, this will help our safety team restrict access to flagged content, and generally reduce the amount of malware distributed using our CDN,\" Discord told BleepingComputer.\"There is no impact for Discord users that share content within the Discord client. Any links within the client will be auto refreshed. If users are using Discord to host files, we'd recommend they find a more suitable service.\"Discord developers may see minimal impact and we’re working closely with the community on the transition. These changes will roll out later this year and we’ll share more info with developers in the coming weeks.\"After the file hosting change (described by Discord as authentication enforcement) rolls out later this year, all links to files uploaded to Discord servers will expire after 24 hours.CDN URLs will come with three new parameters that will add expiration timestamps and unique signatures that will remain valid until the links expire, preventing the use of Discord's CDN for permanent file hosting.While these parameters are already being added to Discord links, they still need to be enforced, and links shared outside Discord servers will only expire once the company rolls out its authentication enforcement changes.\"To improve security of Discord's CDN, attachment CDN URLs have 3 new URL parameters: ex, is, and hm. Once authentication enforcement begins later this year, links with a given signature (hm) will remain valid until the expiration timestamp (ex),\" the Discord development team explained in a post shared on the Discord Developers server.\"To access the attachment CDN link after the link expires, your app will need to fetch a new CDN URL. The API will automatically return valid, non-expired URLs when you access resources that contain an attachment CDN URL, like when retrieving a message.\"These payloads primarily consist of malware loaders and scripts that install malware, such as RedLine stealer, Vidar, AgentTesla, zgRAT, and Raccoon stealer.According to Trellix's data, various malware families, including Agent Tesla, UmbralStealer, Stealerium, and zgRAT, have also used Discord webhooks over the past few years to steal sensitive information like credentials, browser cookies, and cryptocurrency wallets from compromised devices."
   },
   {
      "time": "2023-11-06",
      "title": "Kinsing threat actors probed the Looney Tunables flaws",
      "text": " Subsequently, Kinsing fetches and executes an additional PHP exploit.”Once de-obfuscated, a JavaScript is revealed and it is designed to create a web shell backdoor allowing further unauthorized access to the server.Kinsing threat actors attempt to enumerate the details and credentials associated with the Cloud Service Provider (CSP) to carry out further malicious actions. The types of credentials and sensitive data that can be compromised by the attackers are Temporary Security Credentials, IAM Role Credentials, and Instance Identity Tokens.“This marks the inaugural instance of Kinsing actively seeking to gather such information,” security researcher Assaf Morag said.“The threat actor manually exploited the Looney Tunables vulnerability (CVE-2023-4911) in GNU libc’s ld.so, marking the first known instance of such an exploit. Additionally, Kinsing is expanding its operations by attempting to collect credentials from Cloud Service Providers (CSPs), indicating a potential broadening of their operational scope and an increased threat to cloud-native environments.” concludes the report that also includes Indicators of Compromise (IoCs).\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-11-06",
      "title": "Dutch hacker jailed for extortion, selling stolen data on RaidForums",
      "text": " A former Dutch cybersecurity professional was sentenced to four years in prison after being found guilty of hacking and blackmailing more than a dozen companies in the Netherlands and worldwide.The suspect, a 21-year-old man from Zandvoort named Pepijn Van der Stap, has been convicted on multiple charges, including hacking into victims' computers, extortion, and laundering at least 2.5 million euros in cryptocurrency.The group resorted to blackmail as a means of extorting large amounts of money from targeted companies, threatening to leak the stolen data online unless a ransom was paid. Additionally, Van der Stap infiltrated various networks, stealing sensitive data from compromised companies and organizations.When searching his computer, law enforcement agents found various malicious tools and personal information stolen from millions of individuals, acquired through hacking, purchases, or exchanges with other cyber criminals, and put up for sale on various hacking forums.The Dutch Public Prosecution Service also revealed that Van der Stap helped other criminals by selling or trading this stolen sensitive data, causing millions in damages to the affected organizations.The investigation into Van der Stap's cybercriminal activity commenced in March 2021 following a report from an Amsterdam-based company. Despite ongoing legal proceedings, not all organizations have reported being targeted and the extent of their losses.He was also a member of the now-defunct RaidForums and BreachForums, as well as other hacking forums like Sinister[.]ly, HackForums, Leakforums, and Maza, using multiple nicknames, including Espeon, Umbreon, Lizardom, Egoshin, Togepi, OFTF, and Rekt.Both were considered the biggest hacking forums before their seizure, with hundreds of thousands of users employing them as online platforms for trading and selling stolen databases.\"The majority of my criminal hacking activities took place before I started doing lawful work. I had already started cutting back on blackhat hacking before I started working for whitehat entities. Once I began working in legitimate jobs, I really started dedicating my skills to ethical purposes,\" Van der Stap told DataBreaches.net in an interview.\"For about 16 months before my arrest, I was not engaged in much illegal activity and wanted to get out altogether. But as much as I wanted to get out, it felt impossible at times.\""
   },
   {
      "time": "2023-11-06",
      "title": "\r\n\tHealthcare Data Breaches Impact 88 Million Americans This Year - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineThreat actors have compromised sensitive health data on tens of millions of US patients so far this year, according to new figures released by the Department of Health and Human Services (HHS).The HHS said that there had been a 239% increase in “large breaches” reported to its Office for Civil Rights (OCR) in the past four years and a 278% increase in ransomware.The same trends can be observed in 2023 alone, with large breaches impacting over 88 million individuals, a 60% year-on-year (YoY) increase. The HHS said hacking accounts for 77% of these reported breaches.It’s unclear from the statement how many breaches stemmed from ransomware incidents this year, although it would appear to be a key driver.“In this ever-evolving space, it is critical that our healthcare system take steps to identify and address cybersecurity vulnerabilities along with proactively and regularly review risks, records, and update policies. These practices should happen regularly across an enterprise to prevent future attacks.”Jan Lovmand, CTO of BullWall, argued that ransomware attacks in the sector have become a serious threat to health and safety.“These attacks not only disrupt the delivery of essential medical services, postponing critical surgeries and treatments and putting patients' lives at risk, but also compromise the security of sensitive patient information,” he added.“Hospitals and healthcare organizations are particularly attractive targets for cybercriminals, and their reliance on technology to manage everything from patient records to surgical equipment makes them uniquely vulnerable. This is compounded by their limited resources to invest in cybersecurity measures.”"
   },
   {
      "time": "2023-11-06",
      "title": "\r\n\tAtlassian Finds Public Exploit for Critical Bug - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineSoftware vendor Atlassian has discovered “publicly posted critical information” about a recently published critical vulnerability, increasing the likelihood it will be exploited in the wild.A brief update by the Australian developer on Thursday said its discovery had come during “ongoing monitoring” of the vulnerability in the popular Confluence workspace tool.“There are still no reports of an active exploit, though customers must take immediate action to protect their instances,” it urged.The bug has a CVSS score of 9.1, which should single it out as a priority to patch for any sysadmin managing the software in their organization.Although the CVE will not enable an attacker to exfiltrate corporate data, it could allow an attacker to wipe any data they find in affected Confluence environments.Atlassian CISO, Bala Sathiamurthy, warned that exploitation by an unauthenticated attacker could lead to “significant data loss.”Atlassian has become an increasingly popular target for attacks in recent years as users flock to its Confluence product for remote collaboration."
   }
]