[
   {
      "time": "2022-11-11",
      "title": "Windows 11 Task Manager will let you filter processes by name, PID",
      "text": " Windows 11 will soon let you filter processes in the Task Manager by their name, process ID, or publisher, making it easier to find a running program.As new versions of Windows are released, the Task Manager has increasingly begun to fill up with a long list of running processes.For example, in a brand-new installation of Windows 11, over 130 processes are running in the operating system. On systems with many applications installed and with regular use, you can have over 300 processes running at the same time.This long list of processes can make it challenging to find the specific one you are looking for when using the Windows Task Manager.Today, Microsoft announced that they are testing a new Task Manager feature in the Windows 11 Dev Channel preview builds that lets you filter the list of the process by name, process ID, or publisher.\"You can also use the keyboard shortcut ALT + F to focus on the filter box.\"\"This is a helpful feature if you want to single out a process or a group of processes and want to take action or just monitor the performance of the filtered processes.\"While there is some lag to the input and the text field needs to be a bit bigger, from BleepingComputer's tests, the new filter feature makes it much easier to find the process you are looking for, as demonstrated below.To test this feature, you will need to install Windows 11 Insider build 22623.891, which is currently offered in the Dev channel.In addition to the process filtering feature, this build also adds better color theme support to the Task Manager and the ability to opt-out of future confirmations when enabling 'Efficiency mode' on a process.As new features in a Windows Insider build are not guaranteed to make it into production and could be removed from future preview builds, you should test the feature before upgrading to a newer Insider release."
   },
   {
      "time": "2022-11-11",
      "title": "Phishing drops IceXLoader malware on thousands of home, corporate devices",
      "text": " A ongoing phishing campaign has infected thousands of home and corporate users with a new version of the 'IceXLoader' malware.The authors of IceXLoader, a malware loader first spotted in the wild this summer, have released version 3.3.3, enhancing the tool’s functionality and introducing a multi-stage delivery chain.Minerva Labs published a new post on Tuesday, warning that the latest version of IceXLoader marks a departure from the project’s beta development stage.For a malware loader so aggressively promoted on the cybercrime underground, any development of this kind is significant and could lead to a sudden uptick in its deployment.The infection begins with the arrival of a ZIP file via a phishing email containing the first-stage extractor.The extractor creates a new hidden folder (.tmp) under “C:\\Users\\<username>\\AppData\\Local\\Temp” and drops the next-stage executable, ‘STOREM~2.exe.’Then, depending on the extract settings selected by the operator, the infected system may be rebooted, and a new registry key will be added to delete the temp folder when the computer restarts.The dropped executable is a downloader that fetches a PNG file from a hardcoded URL and converts it into an obfuscated DLL file which is the IceXLoader payload.After decrypting the payload, the dropper performs checks to ensure it’s not running inside an emulator and waits 35 seconds before executing the malware loader to evade sandboxes.Finally, IceXLoader is injected into the STOREM~2.exe process using process hollowing.Upon the first launch, IceXLoader version 3.3.3 copies itself into two directories named after the operator’s nickname and then collects the following information about the host and exfiltrates it to the C2:To ensure persistence between reboots, the malware loader also creates a new registry key at “HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run.”For evasion, it uses a method of in-memory patching in AMSI.DLL, bypassing the Microsoft Windows Antimalware Scan Interface used by Windows Defender and other security products.The commands supported by the loader are the following:Minerva reports that the threat actors behind this campaign aren’t interested in securing the stolen data, as the SQLite database holding stolen information is accessible in the C2 address.The exposed database contains records corresponding to thousands of victims, containing a mix of home PC and corporate PC infections.The security researchers have informed the affected companies of the exposure, but the database is updated with new entries daily."
   },
   {
      "time": "2022-11-11",
      "title": "US Health Dept warns of Venus ransomware targeting healthcare orgs",
      "text": " The U.S. Department of Health and Human Services (HHS) warned today that Venus ransomware attacks are also targeting the country's healthcare organizations.In an analyst note issued by the Health Sector Cybersecurity Coordination Center (HC3), HHS' security team also mentions that it knows about at least one incident where Venus ransomware was deployed on the networks of a U.S. healthcare org.However, there is no known data leak site that threat actors deploying Venus ransomware are known to use for publishing stolen data online, according to HC3's report.\"The operators of Venus ransomware are not believed to operate as a ransomware-as-a-service (RaaS) model and no associated data leak site (DLS) exists at this time.\"The threat actors behind the Venus ransomware attacks are known for hacking into the victims' publicly-exposed Remote Desktop services to encrypt Windows devices.Besides terminating database services and Office apps, the ransomware will also delete event logs, Shadow Copy Volumes, and disable Data Execution Prevention on compromised endpoints.Since August, when it began operating, Venus ransomware has been relatively active, with new submissions being uploaded to ID Ransomware every day.U.S. federal authorities have warned about other ransomware operations targeting healthcare organizations across the United States this year.However, the attack could've had a much more significant impact since PFC helps thousands of U.S. healthcare, government, and utility organizations to ensure that their customers pay their invoices on time."
   },
   {
      "time": "2022-11-11",
      "title": "Popular UK motor racing circuit investigating ransomware attack",
      "text": " One of the most popular motor racing circuits in the United Kingdom is investigating a ransomware attack after a gang added it to its list of victims this week. \"We are aware of this posting and are investigating this matter,” a spokesperson for Silverstone Circuit told The Record on Thursday. The circuit – home of the British Grand Prix since 1950 – was allegedly attacked by the Royal ransomware gang, which took credit for the alleged incident on Tuesday.Dozens of Formula One races and motorcycle events are held at the track and it is operated by the British Racing Drivers' Club (BRDC). Emsisoft threat analyst Brett Callow said the Royal ransomware group is a relatively new gang following the encrypt-and-exfiltrate model. “The ransomware is secure, meaning its encryption cannot be broken,” Callow said. Recorded Future senior security architect Allan Liska said that while the group is new, it appears to be made up of experienced hackers that previously worked as affiliates for other ransomware groups. “They have been known to use multiple ransomware types and unlike a lot of current ransomware groups which randomly generated extensions for encrypted files, they use the .Royal extension,” he explained. “They were also seen earlier this year using callback phishing campaigns. While this attack is not new, it is uncommon for ransomware groups.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-11",
      "title": "Russian military hackers linked to ransomware attacks in Ukraine",
      "text": " A series of attacks targeting transportation and logistics organizations in Ukraine and Poland with Prestige ransomware since October have been linked to an elite Russian military cyberespionage group.Researchers with Microsoft Security Threat Intelligence (MSTIC) pinned the ransomware attacks on the Russian Sandworm threat group based on forensic artifacts and victimology, tradecraft, capabilities, and infrastructure overlapping with the group's previous activity.\"The Prestige campaign may highlight a measured shift in IRIDIUM's destructive attack calculus, signaling increased risk to organizations directly supplying or transporting humanitarian or military assistance to Ukraine.\"More broadly, it may represent an increased risk to organizations in Eastern Europe that may be considered by the Russian state to be providing support relating to the war.\"The threat actors' sophistication was highlighted by their use of multiple methods for Prestige ransomware deployment, including the use of Windows scheduled tasks, encoded PowerShell commands, and the Default Domain Group Policy Object."
   },
   {
      "time": "2022-11-11",
      "title": "Worok hackers hide new malware in PNGs using steganography",
      "text": " A threat group tracked as 'Worok' hides malware within PNG images to infect victims' machines with information-stealing malware without raising alarms.This has been confirmed by researchers at Avast, who built upon the findings of ESET, the first to spot and report on Worok's activity in early September 2022.While the method used to breach networks remains unknown, Avast believes Worok likely uses DLL sideloading to execute the CLRLoader malware loader into memory.This is based on evidence from compromised machines, where Avast's researchers found four DLLs containing the CLRLoader code.Next, the CLRLoader loads the second-stage DLL (PNGLoader), which extracts bytes embedded in PNG files and uses them to assemble two executables.Steganography is concealing code inside image files that appear normal when opened in an image viewer.In the case of Worok, Avast says the threat actors used a technique called \"least significant bit (LSB) encoding,\" which embeds small chunks of the malicious code in the least important bits of the image's pixels.The first payload extracted from those bits by PNGLoader is a PowerShell script that neither ESET nor Avast could retrieve.The second payload hiding in the PNG files is a custom .NET C# info-stealer (DropBoxControl) that abuses the DropBox file hosting service for C2 communication, file exfiltration, and more.The PNG image containing the second payload is the following:The 'DropBoxControl' malware uses an actor-controlled DropBox account to receive data and commands or upload files from the compromised machine.The commands are stored in encrypted files on the threat actor's DropBox repository that the malware accesses periodically to retrieve pending actions.​The supported commands are the following:These functions indicate that Worok is a cyberespionage group interested in stealthy data exfiltration, lateral movement, and spying on the infected device.Avast comments that the tools sampled from Worok attacks aren't circulating in the wild, so they're likely used exclusively by the threat group."
   },
   {
      "time": "2022-11-11",
      "title": "Kaspersky to kill its VPN service in Russia next week",
      "text": " Kaspersky is stopping the operation and sales of its VPN product, Kaspersky Secure Connection, in the Russian Federation, with the free version to be suspended as early as November 15, 2022.Purchases of the paid version of Kaspersky Secure Connection will remain available on both the official website and mobile app stores until December 2022.Customers with active subscriptions will continue to enjoy the product's VPN service until the end of the paid period, which cannot go beyond the end of 2023 (one-year subscription).Russian-based users of the free version of Kaspersky Secure Connection will not be able to continue using the product after November 15, 2022, so they will have to seek alternatives.BleepingComputer emailed Kaspersky questions regarding its decision to stop offering VPN products in Russia, but a spokesperson has declined to provide more information.There are few trustworthy legal VPN alternatives left for Russians to choose from.The reason for banning 15 VPNs in the country was because their vendors refused to connect their services to the FGIS database, which would apply government-imposed censorship in VPN connections, and would also make user traffic and identity subject to state scrutiny.This system will further motivate Russians to use VPNs, so the pressure on VPN providers to stop offering tools that can hide the poster's identity may have risen."
   },
   {
      "time": "2022-11-11",
      "title": "North Korea Ransomware Attempt, Siphon Funds From an Israeli Company - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " Earlier this week, North Korea tried to get access to the systems of an Israeli company that does business in the field of cryptocurrency and extracts the money that Pyongyang planned to use for its nuclear program. The hacking attack was done by North Koreans disguising themselves as the company's Japanese supplier. The hacking attempt was immediately caught by cybersecurity personnel from the \"Konfidas\" agency, which was able to stop the hack. Authorities say the attempt was sophisticated and professional, unique tools were used- something that caught the eye of concerned authorities in Israel. The attacks do not happen overnight. There is a pattern behind the operation of most attacks, in the first step, the hacker does a conversation with the person on the other end, and gains your trust. After that, the hacker sends a malicious file containing the virus which is aimed to infiltrate the computer. Once the file reaches the computer, it will start spreading out on the network and access financial assets or data that the hacker wants, and in the end, can do whatever he wishes. Ransom demands generally happen in financial attacks, threat actors behind them are cyber criminals who intend to steal data and ask for ransom in exchange for not leaking the data and releasing the systems. In this particular incident, the North Korean mode of operation is a pattern in which the actors simply spy, steal money, and vanish. There is no user interaction except that he has to open the malicious files which allow the hacker to take control of the systems. North Korean hackers are believed to be behind the theft of around $100 million in cryptocurrency from a US company earlier this year in June, as the country is trying to manage funding for its nuclear and ballistic missile programs. The assets were stolen from \"Horizon Bridge,\" a Harmony blockchain service that lets assets to be sent to other blockchains. Following the theft, the activities by threat actors suggest that they may be linked to North Korea. Experts believe these actors to be highly skilled in the field of cyber penetration attacks. your nameYour Emailyour message"
   },
   {
      "time": "2022-11-11",
      "title": " Cyberattacks Against US Hospitals are Growing Rapidly - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-11-11",
      "title": "Russian LockBit ransomware operator arrested in Canada",
      "text": " Europol has announced today the arrest of a Russian national linked to LockBit ransomware attacks targeting critical infrastructure organizations and high-profile companies worldwide.The suspect was arrested in Ontario, Canada, last month following an investigation led by the French National Gendarmerie with the help of Europol's European Cybercrime Centre (EC3), the FBI, and the Canadian Royal Canadian Mounted Police (RCMP).\"One of the world's most prolific ransomware operators has been arrested on 26 October in Ontario, Canada,\" Europol said today.\"A 33-year old Russian national, the suspect is believed to have deployed the LockBit ransomware to carry out attacks against critical infrastructure and large industrial groups across the world.\"Law enforcement agents also seized eight computers and 32 external hard drives, two firearms, and €400,000 worth of cryptocurrency from the suspect's home, Europol added that this LockBit operator \"was one of Europol's high-value targets due to his involvement in numerous high-profile ransomware cases,\" and he is known for trying to extort victims with ransom demands between €5 to €70 million.While Europol describes the suspect as an 'operator' of the LockBit ransomware, he is likely an affiliate rather than a manager of the cybercrime operation.Furthermore, the public-facing LockBit representative known as 'LockBitSupp' was posting in hacker forums as recently as yesterday.The U.S. Department of Justice (DOJ) said in a press release published today that the 33-year-old suspect's name is Mikhail Vasiliev, a dual Russian and Canadian national from Bradford, Ontario, Canada. He is now awaiting extradition to the United States for his alleged participation in the LockBit global ransomware campaign.Vasiliev was charged with conspiracy to transmit ransom demands and to intentionally damage protected computers. He faces a maximum of five years of incarceration if convicted.\"It is also a result of more than a decade of experience that FBI agents, Justice Department prosecutors, and our international partners have built dismantling cyber threats.\" This arrest follows a similar action in Ukraine in October 2021 when a joint international law enforcement operation involving the FBI, the French police, and the Ukrainian National Police led to the arrest of two of his accomplices.\"Both these individuals were part of the same group which focused not only on ransom attacks, but also laundered criminal funds,\" Europol said.Both suspects were arrested in Kyiv, Ukraine, with one of them described as a 25-year-old male \"hacker.\"Update November 10, 12:13 EST: Added more info from DOJ press release and criminal complaint."
   }
]