[
   {
      "time": "2022-07-11",
      "title": "Rolling PWN",
      "text": " \n\t\t Modern vehicles are often equipped with a remote keyless entry system. These RKE systems allow unlocking or starting the vehicle remotely. The goal of our research was to evaluate the resistance of a modern-day RKE system. Our research disclosed a Rolling-PWN attack vulnerability affecting all Honda vehicles currently existing on the market (From the Year 2012 up to the Year 2022). This weakness allows anyone to permanently open the car door or even start the car engine from a long distance.\n\t\t \n\n\t\tThe Rolling-PWN bug is a serious vulnerability. We found it in a vulnerable version of the rolling codes mechanism, which is implemented in huge amounts of Honda vehicles. A rolling code system in keyless entry systems is to prevent replay attack. After each keyfob button pressed the rolling codes synchronizing counter is increased. However, the vehicle receiver will accept a sliding window of codes, to avoid accidental key pressed by design. By sending the commands in a consecutive sequence to the Honda vehicles, it will be resynchronizing the counter. Once counter resynced, commands from the previous cycle of the counter worked again. Therefore, those commands can be used later to unlock the car at will.\n\t\t 0: Please show me Rolling-PWN in action? 1: Why it is called the Rolling-PWN, not a Honda-PWN?\n\t\t\tBecause this bug may exist in other brands of vehicles too ;)\n\t\t   2: Who found the Rolling-PWN Bug?\n\t\t\tA team of security Researchers Kevin2600 and Wesley Li from Star-V Lab independently discovered this bug.\n\t\t   3: Am I affected by the bug?\n\t\t\tAs long as the vulnerable version of Honda vehicles is in use, it can be abused.\n\t\t   4: Is there an assigned CVE for Rolling-PWN? \n\t\t\tCVE-2021-46145 is the official reference to this  bug. CVE is the Standard for Information Security Vulnerability Names maintained by MITRE.\n\t\t   5: Can I detect if someone has exploited this against me? \n\t\t\tProbably not. The exploitation does not leave any traces in traditional log files. But considering the ease of exploitation and attacks leaving no trace, this threat should take seriously.\t\t  \n\t\t   6: Is this a Honda vehicle only Bug? \n\t\t\tNo. Although the main targets for the research is Honda Automobiles. But we have leads to show the impact of this vulnerability also applies to other car manufacturers. We will release more details in the future.\t\t   7: Is the risk real? \n\t\t\tWe have successfully tested the latest models of Honda vehicles. And we strongly believe the vulnerability affects all Honda vehicles currently existing on the market. Please see the field test video down below.\t\t   8: What makes this Bug unique or what's the Difference between CVE-2022-27254 and CVE-2019-20626?  9: Is there more technical information about Rolling-PWN? \n\t\t\tYou can follow the author on Twitter [@kevin2600]. However, we will not be releasing any tools required to go out and steal the affected vehicles. \n\t\t\tAt a later stage, we will release technical information in order to encourage more researchers to get involved in the car security research.\t\t  \n\t\t   10: How to patch the modern automobile for Rolling-PWN bug like this?\n\t\t    The common solution requires us to bring the vehicle back to a local dealership as a recall. But the recommended mitigation strategy is to upgrade the vulnerable BCM firmware through Over-the-Air (OTA) Updates if feasible. However, some old vehicles may not support OTA.\n\t\t   11: What does Honda think about this Rolling-PWN Bug? \n\t\t\tWe have searched through the Honda official website, but we can not find any contact info for report Vulnerability. Seems Honda motor DOES NOT have a department to deal with security related issue for their products.\n\t\t\tAnd a person who works at HONDA has told us \"The best way to report the Honda vulnerability is to contact customer service\". Therefore, we filed a report to Honda Customer service.\t\t\t\n\t\t  \n\t\t\tHonda spokesperson first denied the bug's existence \"The keyfobs in the referenced vehicles are equipped with rolling code technology that would not allow the vulnerability as represented in the report\".\n\t\t  \n\t\t\tHowever, in the end Honda concluded this is a low risk to the customers, and Honda regularly improves security features as new models are introduced that would thwart this and similar approaches. So lets fingers crossed.\n\t\t  Rolling Pwn"
   },
   {
      "time": "2022-07-11",
      "title": "Hackers Used Fake LinkedIn Job Offer to Steal $625M - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-07-11",
      "title": "https://www.cysecurity.news/2022/07/callback-malware-campaign-imitates.html?utm_source=dlvr.it&utm_medium=twitter",
      "text": " "
   },
   {
      "time": "2022-07-11",
      "title": "New Google Chrome feature reduces CPU use to extend battery life",
      "text": " Google is testing a new 'Quick Intensive Throttling' feature that reduces CPU time by 10%, extending the battery life for laptops and mobile devices.In Chrome 87, Google introduced a new feature called 'Intensive Wake Up Throttling' that prevents JavaScript from waking up a tab more than once a minute after it has been suspended and hidden from view for more than 5 minutes.With this change, Google found that it reduced Chrome's CPU usage by up to 5x and extended the battery life up to 1.25 hours.\"The 5 minutes timeout is very conservative and was chosen to allow a launch of Intensive Wake Up Throttling with minimal regression risk.\"\"So now we’re considering reducing the timeout to 10 seconds, only for pages considered loaded when they are hidden.\"The new feature is being tested in the Chrome Canary and Dev versions, and you can try it by enabling a Chrome flag using the following instructions:Now that the Quick intensive throttling after loading setting is enabled, you should find that Chrome uses less CPU on the device, and the overall battery life is extended on your device."
   },
   {
      "time": "2022-07-11",
      "title": "This New RedAlert Ransomware Targets Windows, Linux VMware ESXi Servers - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-07-11",
      "title": "Russian intelligence to enhance information campaign in the Netherlands - Robert Lansing Institute",
      "text": " Russia keeps on carrying out information campaigns and psyops in the Netherlands to enhance impact on country’s political system.A workshop “Understanding the Conflict in Ukraine”, assisted by the Forum voor Democratie pro-Russian political party, is scheduled for July 10, in Amsterdam at Europe Square 24, 1078GZ. Moscow has set a goal for the organizers of the event to blame the West, and the United States for the war, and prevent the Netherlands from providing military assistance for Ukraine. The organizers are also expected to make an attempt to question the facts of Russian war crimes in Ukraine and justify Putin’s policies.The Kremlin has set up to restage the operation of 2016 that way, when Russian puppet party’s leader, Thierry Baudet, campaigned against granting Ukraine the status of an associated EU member. Russia is eager not just to use the FvD to hit Ukraine, but also to oust the Dutch government by stirring up a government crisis.For that Russian information campaign, Thierry Baudet got funding from the Russian embassy in the Netherlands. Russian Ambassador O. Shulgin  will be one of the key speakers at the Forum.Anonymous counterintelligence sources say that Moscow helped Thierry Baudet to form the party and promote it in the media.Henk Otten, a former party colleague of Thierry Baudet, told the NL Times this February that Baudet was a “puppet of an enemy power” (Russia).The FvD party announced itself in 2016, with its ideology promoted amid the migration crisis from Syria, initiated by Russia, and effort to squash the Association Agreement between Ukraine and the EU. Despite tough criticism of migration, Baudet’s mother has origins in Indonesia. There is a possibility of Moscow having got dirt on Baudet.Those efforts were largely funded by Russian intelligence, which facilitated setting up the party’s administrative structure, its assets, and media promotion.Direct democracy through referendums is among the FvD’s priorities, also consistently promoted by Russia in some countries by means of friendly parties, including Ukraine. Moscow believes disinformation campaigns and controlled propaganda media can shape temporary public opinion that might affect the outcome of those referendums. That is why Russia provides substantial funding for the far-right parties and Eurosceptics, and infiltrates there to create preconditions for the EU’s disintegration. The FvD, for instance, is in favor of the Netherlands leaving the EU by a referendum, like Brexit.As Russia started the war against Ukraine, Baudet became heavily involved in the Kremlin’s information campaigns. He twitted a video accusing the West of making Russia launch the military operation to demilitarize Ukraine. Prior to the war, Baudet was excited about the actions by Russia’s President Vladimir Putin, as the allies warned of highly possible Russian invasion of Ukraine.Otten said that in 2015, Baudet hinted in personal letter that Russia was giving him money for pro-Russian propaganda in the Netherlands.5 years later, in 2020, Baudet’s WhatsApp messages, revealing his contact with Vladimir Kornilov, associated with the Russian Foreign Intelligence Service, came out in the media. Those messages proved Kornilov had significant impact on what Baudet did concerning Ukraine and anti-NATO campaigns. Baudet also mentioned financial support by Kornilov in message exchanges with his FvD colleagues. Baudet was also among those who initiated an appeal to ex-US President Donald Trump demanding a new investigation of MH-17 Malaysia Airlines downing, as part of Russian intelligence operation.Thierry and Kornilov were engaged in active cooperation to discredit the JIT investigation in the Netherlands in 2019, when they attracted the RLI’s attention.An investigation by Zembla TV program and De Nieuws BV confirmed the RLI’s findings and proved that Baudet met Kornilov in late 2015 for an interview on a Russian website and they have been in touch ever since.Baudet invited Kornilov to address the FvD meeting and translated Kornilov’s articles into Dutch. Baudet most likely facilitated posting of those articles on the GeenStijl blog, which was the information core for the propaganda by Eurosceptics.That way, Baudet is likely to have come to the attention of Russian SVR station in Amsterdam as a promising candidate to recruit. Lots of signals he was getting Russian money and taking part in campaigns carried out by Russians just confirm that Russian intelligence recruited him in exchange for money and dirt.Fully opaque Baudet’s income that he gets aside from the work in parliament, does not work to his advantage. That indirectly proves he is financed by Russian intelligence. A VVD (People’s Party for Freedom and Democracy) MP Ruben Brekelmans, said Baudet’s statements were “reprehensible and appalling,” while D66 (Democrats 66) MP Sjoerd Sjoerdsma said that was “Kremlin’s propaganda in parliament.”Headquarter:19 Holly Cove Ln., Dover,  Kent,  Del., 19901.Phone: +1 302.499.20.07European branch:La Grande Arche – Paroi Nord La Défense FR,1 Tunnel de Nanterre-La Défense, 92044 Paris, FrancePhone: +33 695.42.57.44"
   },
   {
      "time": "2022-07-11",
      "title": "PyPI mandates 2FA for critical projects, developer pushes back",
      "text": " On Friday, the Python Package Index (PyPI), the official repository of third-party open-source Python projects announced plans to mandate two-factor authentication requirement for maintainers of \"critical\" projects.Although many community members praised the move, the developer of a popular Python project decided to delete his code from PyPI and republish it to invalidate the \"critical\" status assigned to his project. Yesterday, admins of the PyPI registry announced they were in the process of introducing two-factor authentication (2FA) requirement for projects deemed \"critical.\"Any PyPI project accounting for the top 1% of downloads over the last six months as well as PyPI's dependencies have been designated critical.Additionally, the maintainers of critical projects are being offered free hardware security keys, with support from the Google Open Source Security Team, a sponsor of Python Software Foundation (PSF). The initiative follows recent repeated incidents of legitimate software libraries getting hijacked—across both the npm and PyPI ecosystems.In spite of this, over 28,000 PyPI user accounts (including those not associated with a \"critical\" project) have voluntarily enabled 2FA.Markus Unterwaditzer, developer of the 'atomicwrites' PyPI project decided to delete his code from the registry after receiving a \"Congratulations!\" email from PyPI notifying the developer of his project having been deemed critical and now requiring two-factor authentication.nice, I just deleted the atomicwrites package, then uploaded a new version. now it's no longer a critical projectAlthough, in this case, Unterwaditzer simply re-published versions of 'atomicwrites' to reset his project's download counts (and hence its \"critical\" project status assigned by PyPI) as opposed to permanently withdrawing his code. By contrast, the circumstances surrounding the 'left-pad' incident were somewhat different and involved a trademark dispute.BleepingComputer observed Unterwaditzer has indeed republished all versions of his project shortly after removing them within the last 24 hours:Other community members chimed in on the matter as well:\"Right now the consequence of being a critical package is quite mild: you only need to enable 2FA. But a line has been drawn now and I'm not sure why it wouldn't be in [PyPI's] best interest to put further restrictions in place.\"\"Instead of putting the burden to the user of packages, we're now piling stuff onto the developer who already puts their own labor and time into it. From the Index' point of view there is a benefit to not enforce rules on everybody as some of these rules might make the use of the index burdensome, but putting the burden only on critical packages does not hurt the adoption just as much,\" further writes the developer.The repeated malware incidents and attacks involving open source software components have forced registry administrators to step up security across their platforms. It remains yet to be seen how well would the added burden of securing their projects, in addition to developing them, aligns with the expectations of an open source software developer."
   },
   {
      "time": "2022-07-11",
      "title": "Hackers Target National Portal of India Via ‘Unprecedented’ Phishing Method - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-07-11",
      "title": "https://www.cysecurity.news/2022/07/abcsoup-adware-campaign-employs-350.html?utm_source=dlvr.it&utm_medium=twitter",
      "text": " "
   },
   {
      "time": "2022-07-11",
      "title": "Rozena Backdoor Deployed by Abusing the Follina Vulnerability - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   }
]