[
   {
      "time": "2022-12-05",
      "title": "Bluebugging: A Cyberattack that Abuses Bluetooth Connectivity and Steals User data - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " Blue bugging is a type of hacking which hackers use to get into users' devices with discoverable Bluetooth connectivity connections. The devices which are hacked through this technique are called being blue bugged. Once a device is bluebugged, hackers can access contact information, tap calls, view and send messages, and more.Bluebugging was earlier used to compromise laptops or computers with Bluetooth connectivity. Later, hackers used this method to compromise mobile phones and other devices. Martin Herfurt, an independent cybersecurity security researcher, claimed that the flaw was able to get the user's call log and call history for abusing a flaw in the Bluetooth protocol. The devices with Bluetooth functions can be bluebugged. Threat actors use wireless earphones execute this technique. Hackers can record the conversations of users via apps that connect to TWS (True Wireless Stereo) earphones or other devices. Once the device is bluebugged, the hacker has access to your contacts and can modify or overtake them, perform and record chats, view and send messages, and much more. Hackers use Bluetooth connection to hack the Bluetooth enabled devices. If a device's Bluetooth is set as discoverable, the hacker attempts to pair with the bluetooth. We should note that most of the devices with bluetooth connection stay configured to be found out as default setting. When a connection has been set, threat actors use brute force to escape detection. After that, the hackers deploy a malware bluebugged on the bluebugged device to gain unauthorised entry into the device. If a bluetooth-enabled device is within a 10-meter range of the hacker, the attack can be performed.\"You can save your device from Bluebugging by first disabling Bluetooth to stop anyone from finding your Bluetooth devices. This will prevent hackers from pairing with your device. Then you should remove paired Bluetooth devices if they are not being used. One more thing you can do is update the system software on the device, limiting the usage of open WiFi, and using a VPN is also an additional layer of security,\" reports Kalinga TV.your nameYour Emailyour message"
   },
   {
      "time": "2022-12-05",
      "title": "Android malware apps with 2 million installs spotted on Google Play",
      "text": " A new set of Android malware, phishing, and adware apps have infiltrated the Google Play store, tricking over two million people into installing them.One app illustrated by Dr. Web that has amassed one million downloads is TubeBox, which remains available on Google Play at the time of writing this.TubeBox promises monetary rewards for watching videos and ads on the app but never delivers on its promises, presenting various errors when trying to redeem the collected rewards.Even users who get to complete the final withdrawal step never really receive the funds, as the researchers say it’s all a trick to try and keep them on the app for as long as possible, watching ads and generating revenue for the developers.Other adware apps that appeared on Google Play in October 2022 but have since been removed are:The above apps receive commands from Firebase Cloud Messaging and load the websites specified in these commands, generating fraudulent ad impressions on the infected devices.In the case of Fast Cleaner & Cooling Master, which had a low download volume, the remote operators could also configure an infected device to act as a proxy server. This proxy server would allow the threat actors to channel their own traffic through the infected device.Finally, Dr. Web discovered a set of loan scam apps claiming to have a direct relationship with Russian banks and investment groups, each having an average of 10,000 downloads on Google Play.These apps were promoted via malvertizing through other apps, promising guaranteed investment profits. In reality, the apps take the users to phishing sites where their personal information is collected.To protect yourself from fraudulent apps on Google Play, always check for negative reviews, scrutinize the privacy policy, and visit the developer’s site to evaluate its authenticity.In general, try to keep the number of installed apps on your device at a minimum and periodically check and ensure that Google's Play Protect feature is active.Update 12/6/22 - A Google spokesperson has confirmed to BleepingComputer that all the apps presented in this report have been removed from Google Play."
   },
   {
      "time": "2022-12-05",
      "title": "Private Data Leaked in Ransomware Attack on Virginia Mason Franciscan Health - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-12-05",
      "title": "WhatsApp Files on Dark Web Show Millions of Records for Sale - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-12-05",
      "title": "SIM swapper gets 18-months for involvement in $22 million crypto heist",
      "text": " Florida man Nicholas Truglia was sentenced to 18 months in prison on Thursday for his involvement in a fraud scheme that led to the theft of millions from cryptocurrency investor Michael Terpin.The funds were stolen following a January 2018 SIM swap attack that allowed Truglia's co-conspirators to hijack Terpin's phone number and fraudulently transfer roughly $23.8 million in cryptocurrency from his crypto wallet to an online account under Truglia's control.In all, Truglia kept at least approximately $673,000 of the stolen funds to assist the other fraudsters in collecting and dividing the illegally obtained funds among them.The 25-year-old was ordered to pay a total of $20,379,007 to Terpin within the next 60 days, until January 30, 2023.\"Nevertheless, today's sentencing goes to show that no matter how sophisticated the crime is, this Office will continue to successfully prosecute those who choose to defraud others.\"In addition to the prison term, Truglia was sentenced to three years of supervised release and was ordered to forfeit $983,010.72.FCC's move is the result of an increasing wave of consumer complaints regarding significant distress and financial harm from SIM hijacking attacks and port-out fraud.\"From January 2018 to December 2020, the FBI Internet Crime Complaint Center (IC3) received 320 complaints related to SIM swapping incidents with adjusted losses of approximately $12 million,\" the FBI said,\"In 2021, IC3 received 1,611 SIM swapping complaints with adjusted losses of more than $68 million.\""
   },
   {
      "time": "2022-12-05",
      "title": "Hackers Sign Android Malware Apps with Compromised Platform Certificates",
      "text": " Platform certificates used by Android smartphone vendors like Samsung, LG, and MediaTek have been found to be abused to sign malicious apps.\"The 'android' application runs with a highly privileged user id – android.uid.system – and holds system permissions, including permissions to access user data.\"This effectively means that a rogue application signed with the same certificate can gain the highest level of privileges as the Android operating system, permitting it to harvest all kinds of sensitive information from a compromised device.The list of malicious Android app packages that have abused the certificates is below -That said, it's not immediately clear how and where these artifacts were found, and if they were used as part of any active malware campaign.When reached for comment, Google said it informed all impacted vendors to rotate the certificates and that there's no evidence these apps were delivered through the Play Store.\"OEM partners promptly implemented mitigation measures as soon as we reported the key compromise,\" the company told The Hacker News in a statement. \"End users will be protected by user mitigations implemented by OEM partners.\"\"Google has implemented broad detections for the malware in Build Test Suite, which scans system images. Google Play Protect also detects the malware. There is no indication that this malware is or was on the Google Play Store. As always, we advise users to ensure they are running the latest version of Android.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-05",
      "title": "BlackProxies proxy service increasingly popular among hackers",
      "text": " A new residential proxy market is becoming popular among hackers, cybercriminals, phishers, scalpers, and scammers, selling access to a million claimed proxy IP addresses worldwide.A new entity that claims such a big pool of available proxies is an important development considering that law enforcement has shut down several large proxy providers like RESNET and INSORG in the past couple of years.Proxies are online servers that accept and forward requests for other devices on the Internet, making it appear that a connection originates from their IP address while hiding the actual initiator behind them.Residential proxies use home users' IP addresses rather than a data center's address space, making them ideal for running shopping bots or for threat actors who want to blend into regular website traffic.Sometimes, residential users willingly become proxies in exchange for money; however, in many cases, they become proxies involuntarily through malware infections on their computers, IoTs, and modems.Cybercriminals use these residential proxies to improve their illegal operations' efficiency while hiding themselves from law enforcement and blockers.The BlackProxies service claims to have access to a pool of 1,000,000 IP addresses from around the world, all coming from real residential users, ensuring unblocked status, low detection rates, and good speeds.Also, the service offers an auto-rotation system that refreshes IP addresses automatically, ensuring that each request is made from a new address.Clients are also given an easy-to-use control panel with live usage stats and a REST API for versatility and even reselling potential.The cost for using the service is $14/day, $39/week, or $89 per month, while a try-out package costs $4.9.DomainTools examined the platform and found its IP address pool claims are false, as the service counts just over 180,000 available IP addresses.However, this is still significant, surpassing even platforms that use unreliable methods like botnets to build their IP pools.DomainTools investigated further and discovered that an IP address used in the service's infrastructure had previously been linked to other shady services.While the BlackProxies service prohibits malicious and illegal activities, the service has quickly grown to become popular among threat actors.When the DomainTools researchers confronted the operator of the BlackProxies service about the alleged criminal activities, the operator didn't show interest in discussing details.BleepingComputer has contacted the BlackProxies operator on the listed contact method, a Telegram channel, to learn how exactly access to these residential IPs is achieved, but we have yet to hear back.At the time of writing, BlackProxies remains online."
   },
   {
      "time": "2022-12-05",
      "title": "New CryWiper data wiper targets Russian courts, mayor’s offices",
      "text": " A previously undocumented data wiper named CryWiper is masquerading as ransomware, but in reality, destroys data beyond recovery in attacks against Russian mayor's offices and courts.CryWiper was first discovered by Kaspersky this fall, where they say the malware was used in an attack against a Russian organization.As the code analysis reveals, the data-wiping function of CryWiper isn't a mistake but a purposeful tactic to destroy targets' data.CryWiper is a 64-bit Windows executable named 'browserupdate.exe' written in C++, configured to abuse many WinAPI function calls.Upon execution, it creates scheduled tasks to run every five minutes on the compromised machine.Next, it contacts a command and control server (C2) with the name of the victim's machine. The C2 responds with either a \"run\" or \"do not run\" command, determining whether the wiper will activate or stay dormant.Kaspersky reports seeing execution delays of 4 days (345,600 seconds) in some cases, likely added in the code to help confuse the victim as to what caused the infection.CryWiper will stop critical processes related to MySQL, MS SQL database servers, MS Exchange email servers, and MS Active Directory web services to free locked data for destruction.Next, the malware deletes shadow copies on the compromised machine to prevent the easy restoration of the wiped files.CryWiper also modifies the Windows Registry to prevent RDP connections, likely to hinder intervention and incident response from remote IT specialists.Finally, the wiper will corrupt all enumerated files except for \".exe\", \".dll\", \"lnk\", \".sys\", \".msi\", and its own \".CRY\", while also skipping System, Windows, and Boot directories to prevent rendering the computer completely unusable.The algorithm for corrupting the files is based on \"Mersenne Twister,\" a pseudorandom number generator. This is the same algorithm used by IsaacWiper, but the researchers established no further connection between the two families.After this step, CryWiper will generate ransom notes named 'README.txt,' asking for 0.5 Bitcoin (approximately $8,000) in exchange for a decrypter. Unfortunately, this is a false promise, as the corrupted data cannot be restored.Even though CryWiper is not ransomware in the typical sense, it can still cause severe data destruction and business interruption."
   },
   {
      "time": "2022-12-05",
      "title": "Researchers Disclose Supply-Chain Flaw Affecting IBM Cloud Databases for PostgreSQL",
      "text": " IBM has fixed a high-severity security vulnerability affecting its Cloud Databases (ICD) for PostgreSQL product that could be potentially exploited to tamper with internal repositories and run unauthorized code.The privilege escalation flaw (CVSS score: 8.8), dubbed \"Hell's Keychain\" by cloud security firm Wiz, has been described as a \"first-of-its-kind supply-chain attack vector impacting a cloud provider's infrastructure.\"Successful exploitation of the bug could enable a malicious actor to remotely execute code in customers' environments and even read or modify data stored in the PostgreSQL database.Hell's Keychain commences with an SQL injection flaw in ICD that grants an attacker superuser (aka \"ibm\") privileges, which is then used to execute arbitrary commands on the underlying virtual machine hosting the database instance.This capability is weaponized to access a Kubernetes API token file, allowing for broader post-exploitation efforts that involve pulling container images from IBM's private container registry, which stores images related to ICD for PostgreSQL, and scanning those images for additional secrets.\"Container images typically hold proprietary source code and binary artifacts that are the company's intellectual property,\" the researchers explained. \"They can also contain information that an attacker could leverage to find additional vulnerabilities and perform lateral movement within the service's internal environment.\"Wiz said it was able to extract internal artifact repository and FTP credentials from the image manifest files, effectively permitting unfettered read-write access to trusted repositories and IBM build servers.An attack of this kind could have severe ramifications, as it enables the adversary to overwrite arbitrary files that are used in the build process of the PostgreSQL image, which would then be installed on every database instance.It further stated that the fixes have been automatically applied to customer instances and that no further action is required. The mitigations were rolled out on August 22 and September 3, 2022.\"These vulnerabilities could have been exploited by a malicious actor as part of an extensive exploit chain culminating in a supply-chain attack on the platform,\" the researchers said.To mitigate such threats, it's recommended that organizations monitor their cloud environments for scattered credentials, enforce network controls to prevent access to production servers, and safeguard against container registry scraping.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-05",
      "title": "Samsung, LG, Mediatek certificates compromised to sign Android malware",
      "text": " ​Multiple platform certificates used by Android OEM device vendors to digitally sign core system applications have also been used to sign Android apps containing malware.OEM Android device manufacturers use platform certificates, or platform keys, to sign devices' core ROM images containing the Android operating system and associated apps.If apps, even malicious ones, are signed with the same platform certificate and assigned the highly privileged 'android.uid.system' user id, these apps will also gain system-level access to the Android device.These privileges provide access to sensitive permissions not normally granted to apps, such as managing ongoing calls, installing or deleting packages, gathering information about the device, and other highly sensitive actions.\"A platform certificate is the application signing certificate used to sign the \"android\" application on the system image. The \"android\" application runs with a highly privileged user id - android.uid.system - and holds system permissions, including permissions to access user data,\" the Google reporter explains.\"Any other application signed with the same certificate can declare that it wants to run with the same user id, giving it the same level of access to the Android operating system.\"Siewierski spotted multiple malware samples signed using these ten Android platform certificates and provided the SHA256 hashes for each of the samples and the digitally signed certificates.At the moment, there is no information on what led to these certificates being abused to sign malware — if one or more threat actors stole them or if an insider with authorized access signed the APKs with the vendor keys.Also, there is no information on where these malware samples were found — if they were found on Google's Play Store or if they've been distributed via third-party stores or in malicious attacks.The package names for the ten listed malware samples signed with platform keys are listed below:A search on VirusTotal for these hashes allowed BleepingComputer to discover that some of the abused platform certificates belong to Samsung Electronics, LG Electronics, Revoview, and Mediatek.For the other certificates, it was not possible to determine who they belonged to at this time.Malware signed with their certificates includes those detected as HiddenAd trojans, information stealers, Metasploit, and malware droppers that threat actors can use to deliver additional malicious payloads on compromised devices.Google informed all affected vendors about the abuse and advised them to rotate their platform certificates, investigate the leak to find out how it happened, and keep the number of apps signed with their Android platform certs at a minimum to prevent future incidents.\"All affected parties should rotate the platform certificate by replacing it with a new set of public and private keys. Additionally, they should conduct an internal investigation to find the root cause of the problem and take steps to prevent the incident from happening in the future,\" the Google reporter added.\"We also strongly recommend minimizing the number of applications signed with the platform certificate, as it will significantly lower the cost of rotating platform keys should a similar incident occur in the future.\"However, based on the results, even though Google said that \"all affected parties were informed of the findings and have taken remediation measures to minimize the user impact,\" it looks like not all the vendors have followed Google's recommendations since, at least in Samsung's case, the leaked platform certificates are still being used to digitally sign apps.When we reached out to Google about these compromised keys, Google told BleepingComputer that they had added detections for the compromised keys to the Android Build Test Suite (BTS) and malware detections to Google Play Protect.\"OEM partners promptly implemented mitigation measures as soon as we reported the key compromise. End users will be protected by user mitigations implemented by OEM partners,\" Google said in a statement to BleepingComputer.\"Google has implemented broad detections for the malware in Build Test Suite, which scans system images. Google Play Protect also detects the malware.\"\"There is no indication that this malware is or was on the Google Play Store. As always, we advise users to ensure they are running the latest version of Android.\""
   }
]