[
   {
      "time": "2022-11-14",
      "title": "Malicious Google Play Store App Spotted Distributing Xenomorph Banking Trojan",
      "text": " Google has removed two new malicious dropper apps that have been detected on the Play Store for Android, one of which posed as a lifestyle app and was caught distributing the Xenomorph banking malware.\"It is also capable of intercepting users' SMS messages and notifications, enabling it to steal one-time passwords and multi-factor authentication requests.\"The cybersecurity firm said it also found an expense tracker app that exhibited similar behavior, but noted that it couldn't extract the URL used to fetch the malware artifact.The two malicious apps are as follows -Both the apps function as a dropper, meaning the apps themselves are harmless and are a conduit to retrieve the actual payload, which, in the case of Todo, is hosted on GitHub.What's more, the malware leverages a Telegram channel's description to decode and construct the command-and-control (C2) domain used to receive additional commands.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-14",
      "title": " Russian-Canadian National Charged Over Involvement in LockBit Ransomware Attacks",
      "text": " The 33-year-old Ontario resident, Mikhail Vasiliev, has been taken into custody and is awaiting extradition to the U.S., where is likely to be sentenced for a maximum of five years in prison.A search of the defendant's home in August and October 2022 by Canadian law enforcement unearthed a file stored on a device containing what's suspected to be a list of \"prospective or historical\" victims as well as screenshots of communications exchanged with \"LockBitSupp\" on the Tox messaging platform.Also found were a text file with instructions to deploy LockBit ransomware, the malware's source code, and a website that's believed to be the control panel operated by the group to administer the ransomware.Furthermore, an analysis of bitcoin payments made to Vasiliev's wallet purportedly uncovered the receipt of roughly 0.8BTC (~$17,332) that originated from a ransom payment that was paid by a LockBit victim in February 2022 to a wallet address provided by the group.\"Since first appearing, LockBit has been deployed against at least as many as 1,000 victims in the United States and around the world,\" the DoJ said. \"LockBit members have made at least $100 million in ransom demands and have extracted tens of millions of dollars in actual ransom payments from their victims.\"The arrest, which is likely to cause the RaaS gang to rebrand, is the result of an investigation set in motion by the U.S. Federal Bureau of Investigation (FBI) since around March 2020, the DoJ added.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-14",
      "title": "Burner Phones Warn World Cup Fans of Qatar Apps - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-11-14",
      "title": "Abortion Data of Medibank Patient’s Leaked on the Dark Web - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-11-14",
      "title": "Ukraine says Russian hacktivists use new Somnia ransomware",
      "text": " Russian hacktivists have infected multiple organizations in Ukraine with a new ransomware strain called 'Somnia,' encrypting their systems and causing operational problems.The group previously disclosed creating the Somnia ransomware on Telegram and even posted evidence of attacks against tank producers in Ukraine.However, until today, Ukraine has not confirmed any successful encryption attacks by the hacking group.According to CERT-UA, the hacking group uses fake sites that mimic the 'Advanced IP Scanner' software to trick Ukrainian organization employees into downloading an installer.In reality, the installer infects the system with the Vidar stealer, which steals the victim's Telegram session data to take control of their account.Next, CERT-UA says that the threat actors abused the victim's Telegram account in some unspecified manner to steal VPN connection data (authentication and certificates).If the VPN account isn't protected by two-factor authentication, the hackers use it to gain unauthorized access to the victim's employer's corporate network.Next, the intruders deploy a Cobalt Strike beacon, exfiltrate data, and use Netscan, Rclone, Anydesk, and Ngrok, to perform various surveillance and remote access activities.CERT-UA reports that since the spring of 2022, with the help of initial access brokers, FRwL has carried out several attacks on computers belonging to Ukrainian organizations.The agency also notes that the latest samples of the Somnia ransomware strain used in these attacks rely on the AES algorithm, whereas Somnia initially used the symmetric 3DES.The file types (extensions) targeted by Somnia ransomware are shown below, including documents, images, databases, archives, video files, and more, reflecting the destruction this strain aims to cause.The ransomware will append the .somnia extension to the encrypted file's names when encrypting files.Somnia does not request the victims to pay a ransom in exchange for a working decryptor, as its operators are more interested in disrupting the target's operations than generating revenue.Therefore, this malware should be considered a data wiper rather than a traditional ransomware attack."
   },
   {
      "time": "2022-11-14",
      "title": "Surveillance Vendor Exploited Zero-Days Vulnerability In Samsung Phone",
      "text": " The Project Zero team at Google revealed that a commercial surveillance vendor was exploiting three zero-day security vulnerabilities in newer Samsung smartphone models to spy on people and steal user data.The three Samsung phone vulnerabilities disclosed by Google’s Threat Analysis Group (TAG) are CVE-2021-25337, CVE-2021-25369, and CVE-2021-25370.When Google found exploit samples in the late 2020s, it immediately reported these vulnerabilities to Samsung, which have all been patched since by the company in its March 2021 release.Further, the vulnerabilities, discovered in Samsung’s custom-built software of the devices, were all used together as part of an exploit chain to target Samsung phones running Android.The chained vulnerabilities would allow the attacker to obtain kernel read and write privileges as the root user, which could eventually disclose personal data on the device.In addition, the exploit chain targeted Samsung phones running kernel 4.14.113 with the Exynos SOC. According to Google, the models that were affected in the late 2020s were Samsung’s Galaxy S10, Galaxy A50, and Galaxy A51 and running kernel 4.14.113.Samsung phones with Exynos SOC are primarily sold across Europe and Africa, which were likely where the targets of the surveillance were located. The exploit sample relies on both the Mali GPU driver and the DPU driver that are specific to the Exynos Samsung phones.The three zero-day vulnerability issues that were discovered by Google’s TAG team are:The flaws were reportedly exploited by a malicious Android app, likely sideloaded, tricking users into installing from outside of Google Play Store. The malicious app allowed the attacker to escape the app sandbox and access the remaining of the device’s operating system. It, however, isn’t yet known what the final payload actually was.“The Java components in Android devices don’t tend to be the most popular targets for security researchers despite it running at such a privileged level.”Stone further added, “All three vulnerabilities in this chain were in the manufacturer’s custom components rather than in the AOSP platform or the Linux kernel. It’s also interesting to note that 2 out of the 3 vulnerabilities were logic and design vulnerabilities rather than memory safety.”The above vulnerabilities were chained by the commercial surveillance vendor to compromise the Samsung phones.While Google has not revealed the surveillance vendor’s name, the tech giant highlighted the similarities with other campaigns that targeted Apple and Android users in Italy and Kazakhstan, which has been linked to Italian company RCS Lab.Stone noted that the advisories published by Samsung at that time did not mention that the vulnerabilities were being actively exploited, but it has since committed to begin disclosing when vulnerabilities are actively exploited, following in the footsteps of Apple and Google, who disclose vulnerabilities that are under attack in their security updates.“Labeling when vulnerabilities are known to be exploited in-the-wild is important both for targeted users and for the security industry. When in-the-wild 0-days are not transparently disclosed, we are not able to use that information to further protect users, using patch analysis and variant analysis, to gain an understanding of what attackers already know,” concludes the blog post.“The analysis of this exploit chain has provided us with new and important insights into how attackers are targeting Android devices. It highlights a need for more research into manufacturer specific components. It shows where we ought to do further variant analysis.”"
   },
   {
      "time": "2022-11-14",
      "title": "Australia sets up 100-strong permanent 'operation' to target hackers - Security - iTnews",
      "text": " Australia will set up a permanent operation comprising around 100 police and defence personnel to “hack the hackers”, with an immediate priority to target ransomware groups.The personnel come together from the Australian Federal Police and Australian Signals Directorate under what is being termed a “joint standing operation”.“This operation will collect intelligence and identify ring-leaders, networks and infrastructure in order to disrupt and stop their operations – regardless of where they are,” Attorney-General Mark Dreyfus and Minister for Cyber Security Clare O’Neil said on Saturday morning.The operation will aim to “stop… incidents before they start”; in addition, “where incidents do take place… cyber criminals will be hunted down and their networks disrupted.”O’Neil said in a press conference from Melbourne that the permanent operation represented “a new model of policing”.She said the two agencies had come together initially to coordinate a response to the Optus data breach. The announcement this morning formalises that arrangement.\"When Optus [was] hit, these two organisations started a new type of policing and a new partnership, and today we’re announcing that partnership will be formalised and made permanent,” O’Neil said.“Around 100 officers across these two organisations will be a part of this permanent joint standing operation.“Many of these officers will be physically, co-located, working from the Australian Signals Directorate.“The joint standing operation will not simply be responding to crimes as they affect Australians; they will be hunting these gangs around the world and disrupting the activities of these people. “The smartest and toughest people in our country are going to hack the hackers.”O’Neil said the work of the two agencies on high-profile attacks against Optus and Medibank “will not be obvious to everyone”, owing to the covert nature of the work.“But I want to tell you that they have had an enormous impact on preventing harm that would have occurred in these two attacks,” O’Neil said.“They have prevented significant harm.”O'Neil said Australia was \"waking up from a cyber security slumber that we've been in.\"\"When I look at previous years, you saw in 2020 and 2021 major attacks which are quite similar to Optus and Medibank happen in countries around the world.\"Now, what I know the Attorney-General and I would've really liked to see is real energy and focus behind this problem since that time. I don't think we got that, but you have it now.\"It should be beyond a shadow of a doubt from Medibank and Optus that this is an extraordinarily important thing for the government to be focused on.\"O'Neil suggested it was unlikely that investigations into high-profile attacks would lead to arrests and jail time, hence the focus on \"disruption\" instead.\"I think we need to shift away from the mindset here that the only thing that means success [from a law enforcement perspective] is having someone behind bars,\" she said.\"There is an enormous amount that can be done which doesn't look in that exact direction, and I'm not going to go into the specifics but this term 'disruption' is what we're here to talk about.\"Post-attribution actionsDreyfus did not rule out diplomatic action as a result.He said the government is \"looking hard at Russia's diplomatic profile in Australia, and all options remain under consideration.\"However, he added that the government's \"preference is to maintain diplomatic channels, but diplomatic profiles must always be consistent with our national interest.\""
   },
   {
      "time": "2022-11-14",
      "title": "Canadian food retail giant Sobeys hit by Black Basta ransomware",
      "text": " Grocery stores and pharmacies belonging to Canadian food retail giant Sobeys have been experiencing IT systems issues since last weekend.Sobeys is one of two national grocery retailers in Canada, with 134,000 employees servicing a network of 1,500 stores in all ten provinces under multiple retail banners, including Sobeys, Safeway, IGA, Foodland, FreshCo, Thrifty Foods, and Lawtons Drugs.In a press release published Monday, Sobeys' parent company Empire revealed that while its grocery stores were still open, some services were impacted by this company-wide IT issue.\"In addition, certain of the Company's pharmacies are experiencing technical difficulties in fulfilling prescriptions. The Company however remains committed to the continuity of care of all its pharmacy patients.\"The company also added that it's working on resolving the issues affecting its IT systems to reduce store disruption.BleepingComputer reached out to Sobeys with several requests for comment since Sunday but is yet to receive a reply.As the Quebec watchdog told The Canadian Press, such alerts are only sent following incidents where personal information has been accessed in a breach.Furthermore, based on ransom notes and negotiation chats BleepingComputer has seen, the attackers deployed Black Basta ransomware payloads to encrypt systems on Sobeys' network.BleepingComputer was told by multiple sources that the attack occurred late Friday/early Saturday morning.Photographs shared by Sobeys employees online also show in-store computers displaying a Black Basta ransom note.Although the gang's ransom demands likely differ in size between victims, BleepingComputer knows of at least one incident where the victim received a demand of more than $2 million for a decryptor to avoid having stolen data leaked online.Even though details are scarce regarding this ransomware gang, this is likely not a new operation but a rebrand, given their negotiating style and ability to quickly breach new victims.Some researchers believe that Black Basta is linked to the Conti ransomware but BleepingComputer has not been able to confirm this."
   },
   {
      "time": "2022-11-14",
      "title": "Australian Federal Police say cybercriminals in Russia behind Medibank hack",
      "text": " The Australian Federal Police (AFP) has identified the perpetrators of the hack and attempted extortion of health insurance company Medibank, its commissioner told journalists on Friday.Giving a short press conference without taking questions, AFP Commissioner Reece Kershaw said the force was “undertaking covert measures and working around the clock with our domestic agencies and our international networks, including INTERPOL,” as part of its investigation.“This is important because we believe that those responsible for the breach are in Russia,” Kershaw said, explaining that the AFP’s “intelligence points to a group of loosely affiliated cyber criminals, who are likely responsible for past significant breaches in countries across the world.”Australian Prime Minister Anthony Albanese, who has confirmed that he himself is a Medibank customer, said he had authorized the AFP to confirm where the cybercriminals were based.“We know where they’re coming from, we know who is responsible, and we say that they should be held to account,” said Albanese, adding: “The nation where these attacks are coming from should also be held accountable for the disgusting attacks and the release of information — including very private and personal information.”All of the data which the criminals accessed “could have been taken,” the company said. This includes sensitive healthcare claims data for around 480,000 individuals, including information about drug addiction treatments and abortions.Specialist investigators under the name Operation Guardian are “scouring the internet and dark web to identify people who are accessing this personal information and trying to profit from it,” said the commissioner.It is not clear which ransomware group attempted to extort Medibank, although the company has now been listed on the extortion site formerly operated by REvil. It is not known who the current operators are.On Friday, the AFP’s Kershaw said: “We believe we know which individuals are responsible but I will not be naming them. What I will say is that we will be holding talks with Russian law enforcement about these individuals.”Kershaw stressed that Russia “benefits from the intelligence-sharing and data shared through INTERPOL, and with that comes responsibilities and accountability.”He said that the AFP was leading the investigation under the name Operation Pallidus and explained the ransomware ecyosystem’s business model: “These cyber criminals are operating like a business with affiliates and associates, who are supporting the business,” said Kershaw, adding that “some affiliates may be in other countries.”The commissioner declined to take questions, saying he wanted to provide as much information as he could “without putting at risk the criminal investigation.” “I know Australians are angry, distressed and seeking answers about the highly-sensitive and deeply personal information that is being released,” he added.“This is a crime that has the potential to impact on millions of Australians and damage a significant Australian business,” he said, describing the cyberattack as “an unacceptable attack on Australia… [deserving] a response that matches the malicious and far-reaching consequences that this crime is causing.”He said he had a direct message to the criminals: “We know who you are, and moreover, the AFP has some significant runs on the scoreboard when it comes to bringing overseas offenders back to Australia to face the justice system.”Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-14",
      "title": "A Muddy, Advanced Persistent Teacher\r\n",
      "text": " More Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedGlobal Consumer Insights Pulse Survey - June 2023Achieving net zero infrastructureManufacturing COO Pulse Survey Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedUkraine: Tax, Legal and People considerationsPwC Global Internal Audit Study 2023M&A industry trends report  Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedThe Leadership AgendaPwC’s Global Workforce Hopes and Fears Survey 2023strategy+business — a PwC publication Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu Menu MenuFeaturedThe New EquationPwC's Global Annual ReviewCommitting to Net Zero by 2030 Menu Menu MenuFeaturedThe New EquationPwC's Global Annual ReviewLoading ResultsNo Match FoundThese incorporation records list the following corporate appointments. These match the co founders listed on Ravin Academy’s website and in the October 2022 US Treasury sanctions announcement.Yellow Nix ZeroLogon exploitationWe identified a temporal overlap between Ravin Academy’s experimentation with CVE-2020- 1472 (a.k.a. ZeroLogon) exploitation, and Yellow Nix exploiting this CVE in attacks. This is shown in Figure 3.The outcome of sanctions and public disclosure of Iran-based operations has had mixed impact on the associated threat actors; specifically, some threat actors continue with their operations despite the disclosures, while others have ceased to operate. At the time of this publication, it remains to be seen how the October 2022 sanctions will impact the named entities and associated threat actor activity.[2] CTO-SIB-20220121-01A - Advanced persistent teacher[3] CTO-SIB-20200727-01A - Whos who of Iran-based threat actors[6] @lab_dookhtegan, Telegram, https://t.me/s/lab_dookhtegan (6th September 2019)[7] CTO-TIB-20201118-02A - Learning on the job with Yellow Dev 19[8] CTO-TIB-20200528-01A - Wading through smoke on the MuddyWater[10] CTO-GCB-20210412-01A - Global Cyber Bulletin - March 2021[12] CTO-TIB-20200514-02A - A muddy masquerade[14] CTO-TIB-20200514-02A - A muddy masquerade[15] ravinacademy, Aparat, https://www.aparat.com/RavinAcademy[17] CTO-SIB-20220121-01A - Advanced persistent teacher?\n[20] CTO-TIB-20201020-01A - Seedworm sees a CVE\n[24] CTO-SIB-20200727-01A - Whos who of Iran-based threat actorsYour request / feedback has been routed to the appropriate person. Should you need to reference this in the future we have assigned it the reference number \"refID\" .Thank you for your comments / suggestions.\r\n\t\t\t\tRequired fields are marked with an asterisk(*)\r\n\t\t\t\r\n\t\t\t   Please correct the errors and send your information again.\r\n\t\t\t\nTick this box to verify you are not a robot\nCyber Threat Operations Lead Partner, PwC United KingdomTel: +44 (0)7725 707360"
   }
]