[
   {
      "time": "2023-11-15",
      "title": "Alert: OracleIV DDoS Botnet Targets Public Docker Engine APIs to Hijack Containers",
      "text": " Publicly-accessible Docker Engine API instances are being targeted by threat actors as part of a campaign designed to co-opt the machines into a distributed denial-of-service (DDoS) botnet dubbed OracleIV.The malicious activity starts with attackers using an HTTP POST request to Docker's API to retrieve a malicious image from Docker Hub, which, in turn, runs a command to retrieve a shell script (oracle.sh) from a command-and-control (C&C) server.\"Once a valid endpoint is discovered, it's trivial to pull a malicious image and launch a container from it to carry out any conceivable objective,\" the researchers said. \"Hosting the malicious container in Docker Hub, Docker's container image library, streamlines this process even further.\"It's not just Docker, as vulnerable MySQL servers have emerged as the target of a Chinese-origin DDoS botnet malware known as Ddostf, according to the AhnLab Security Emergency Response Center (ASEC).\"Only DDoS commands can be performed on the new C&C server. This implies that the Ddostf threat actor can infect numerous systems and then sell DDoS attacks as a service.\"Palo Alto Networks Unit 42 said the campaign began in late July 2023, before peaking around August 12, 2023.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-15",
      "title": "Danish critical infrastructure hit by the largest cyber attack in Denmark's history",
      "text": " In May, Danish critical infrastructure faced the biggest cyber attack on record that hit the country, reported SektorCERT, Denmark’s Computer Security Incident Response Team (CSIRT) for the critical infrastructure sectors.A first wave of attacks was launched on May 11, then after a short pause, a second wave of attacks began on May 22. SektorCERT became aware of the attacks on May 22. SektorCERT reported that threat actors compromised the networks of 22 companies operating in the energy infrastructure. According to the report, 11 companies were immediately compromised. The attackers exploited zero-day vulnerabilities in Zyxel firewalls used by many critical infrastructure operators in Denmark.Zyxel released security patches to address the vulnerability and urges customers to install them.The SektorCERT experts believe the attackers had detailed information about the targets, likely obtained through a previously undetected reconnaissance activity. At this time, there was no public information about which organizations were using vulnerable firewalls.Below is the Cyber Kill Chain for the overall attack described in the report:“To this day, there is no clear explanation of how the attackers had the necessary information, but we can state that among the 300 members, they did not miss a single shot.” continues the report.The experts also pointed out that the attackers were able to attack many companies at the same time, avoiding that impacted infrastructure could have shared information on the attack with peers. This kind of coordination requires planning and resources. Threat actors were able to exploit the zero-day flaw in a large-scale campaign, this circumstance suggests the attackers could be an APT group. The report includes indicators of compromise (IOCs) that have been observed in the attacks.“Whether Sandworm was involved in the attack cannot be said with certainty. Individual indicators of this have been observed, but we have no opportunity to neither confirm nor deny it. A situation which as such is not unusual. Cyber attacks are notoriously difficult to attribute to a specific attacker and often it is small, almost insignificant errors from the attacker that can indicate who the attacker may be. There is therefore no evidence to accuse Russia of being involved in the attack.” concludes the report. “The only thing we can ascertain is that Danish critical infrastructure is in the spotlight and that cyber weapons are being used against our infrastructure, which require careful monitoring and advanced analysis to detect.”\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-11-15",
      "title": "LockBit ransomware exploits Citrix Bleed in attacks, 10K servers exposed",
      "text": " The Lockbit ransomware attacks use publicly available exploits for the Citrix Bleed vulnerability (CVE-2023-4966) to breach the systems of large organizations, steal data, and encrypt files.Although Citrix made fixes available for CVE-2023-4966 more than a month ago, thousands of internet-exposed endpoints are still running vulnerable appliances, many in the U.S.If LockBit used the vulnerability to breach one company, it is believed they likely breached Boeing and DP World similarly.These attacks are likely being conducted by a LockBit affiliate who is heavily utilizing this vulnerability to breach networks rather than the ransomware operation itself being behind the attack.As LockBit is the largest Ransomware-as-a-Service, it utilizes many affiliates who have complete discretion on how they breach networks.As we saw with an affiliate who belonged to both the GandCrab and then REvil operations, it is not uncommon for a hacker to focus on one particular industry or initial access method.The majority of the servers, 3,133, are in the U.S., followed by 1,228 in Germany, 733 in China, 558 in the U.K., 381 in Australia, 309 in Canada, 301 in France, 277 in Italy, 252 in Spain, 244 in the Netherlands, and 215 in Switzerland.Sejiyama’s scans have revealed vulnerable servers in large and critical organizations in many other countries, all of which remain unpatched over a full month following the public disclosure of the critical flaw."
   },
   {
      "time": "2023-11-15",
      "title": "New CacheWarp AMD CPU attack lets hackers gain root in Linux VMs",
      "text": " A new software-based fault injection attack, CacheWarp, can let threat actors hack into AMD SEV-protected virtual machines by targeting memory writes to escalate privileges and gain remote code execution.This new attack exploits flaws in AMD's Secure Encrypted Virtualization-Encrypted State (SEV-ES) and Secure Encrypted Virtualization-Secure Nested Paging (SEV-SNP) tech designed to protect against malicious hypervisors and reduce the attack surface of VMs by encrypting VM data and blocking attempts to alter it in any way.The underlying vulnerability (CVE-2023-20592) was discovered by security researchers with CISPA Helmholtz Center for Information Security and Graz University of Technology and independent researcher Youheng Lue.\"In 3 case studies, we demonstrate an attack on RSA in the Intel IPP crypto library, recovering the entire private key, logging into an OpenSSH server without authentication, and escalating privileges to root via the sudo binary.\"In successful attacks, malicious actors could, for instance, revert variables used for authentication to a previous version, enabling them to hijack a previously authenticated session. Moreover, exploiting CacheWarp enables attackers to manipulate return addresses on the stack, thereby altering the control flow of a targeted program.\"Improper or unexpected behavior of the INVD instruction in some AMD CPUs may allow an attacker with a malicious hypervisor to affect cache line write-back behavior of the CPU leading to a potential loss of guest virtual machine (VM) memory integrity,\" AMD says.CacheWarp affects only AMD systems with the following processors that come with SEV support:According to AMD's advisory, the issue does not impact AMD 4th generation 'Genoa' EPYC processors (Zen 4 microarchitecture).The company says there is no mitigation for first or second generations of EPYC processors because the SEV and SEV-ES features lack protection functionality for guest VM memory, while the SEV-SNP feature is unavailable.Nevertheless, for customers using AMD's 3rd generation EPYC processors with the AMD Secure Encrypted Virtualization-Secure Nested Paging (SEV-SNP) feature enabled, AMD has released a hot-loadable microcode patch and updated firmware image (the patch should not result in any performance hit)."
   },
   {
      "time": "2023-11-15",
      "title": "WP Fastest Cache plugin bug exposes 600K WordPress sites to attacks",
      "text": " The WordPress plugin WP Fastest Cache is vulnerable to an SQL injection vulnerability that could allow unauthenticated attackers to read the contents of the site’s database.SQL injection vulnerabilities occur when software accepts input that directly manipulates SQL queries, leading to running arbitrary SQL code that retrieves private information or command execution.In this case, the flaw impacts the ‘is_user_admin’ function of the ‘WpFastestCacheCreateCache’ class within the WP Fastest Cache plugin, which is intended to check if a user is an administrator by extracting the ‘$username’ value from cookies.Because the ‘$username’ input isn’t sanitized, an attacker may manipulate this cookie value to alter the SQL query executes by the plugin, leading to unauthorized access to the database.WordPress databases typically include sensitive information like user data (IP addresses, emails, IDs), account passwords, plugin and theme configuration settings, and other data necessary for the site’s functions. WPScan will release a proof-of-concept (PoC) exploit for CVE-2023-6063 on November 27, 2023, but it should be noted that the vulnerability isn’t a complex one and hackers can figure out how to exploit it.A fix has been made available by the WP Fastest Cache developer in version 1.2.2, released yesterday. All users of the plugin are recommended to upgrade to the latest version as soon as possible."
   },
   {
      "time": "2023-11-15",
      "title": "VMware discloses critical VCD Appliance auth bypass with no patch",
      "text": " VMware disclosed a critical and unpatched authentication bypass vulnerability affecting Cloud Director appliance deployments.Cloud Director enables VMware admins to manage their organizations' cloud services as part of Virtual Data Centers (VDC).The auth bypass security flaw only affects appliances running VCD Appliance 10.5 that were previously upgraded from an older release. The company also added that CVE-2023-34060 does not impact fresh VCD Appliance 10.5 installs, Linux deployments, and other appliances.Unauthenticated attackers can remotely exploit the bug in low-complexity attacks that don't require user interaction.\"On an upgraded version of VMware Cloud Director Appliance 10.5, a malicious actor with network access to the appliance can bypass login restrictions when authenticating on port 22 (ssh) or port 5480 (appliance management console),\" VMware explains.\"This bypass is not present on port 443 (VCD provider and tenant login). On a new installation of VMware Cloud Director Appliance 10.5, the bypass is not present.\"While VMware doesn't have a patch for this critical authentication bypass, the company provided admins with a temporary workaround until security updates are released.According to VMware, the workaround does not cause any functional disruptions, and downtime is not a concern as neither a service restart nor a reboot is necessary."
   },
   {
      "time": "2023-11-15",
      "title": "IPStorm botnet with 23,000 proxies for malicious traffic dismantled",
      "text": " The U.S. Department of Justice announced today that Federal Bureau of Investigation took down the network and infrastructure of a botnet proxy service called IPStorm.IPStorm enabled cybercriminals to run malicious traffic anonymously through Windows, Linux, Mac, and Android devices all over the world.In connection to the case, Sergei Makinin, a Russian-Moldovan national, pleaded guilty to three counts relevant to computer fraud and now faces a maximum penalty of 10 years in prison.The DoJ announcement describes IPStorm as a proxy botnet enabling cybercriminals, scammers, and others, to evade blocks and remain anonymous by channeling their traffic through thousands of compromised devices in people’s homes, or offices.Apart from unknowingly and involuntarily becoming cybercrime facilitators, the victims of IPStorm suffered the consequences of having their network bandwidth hijacked by malicious actors and risked receiving more dangerous payloads at any time.Makinin’s proxying service was offered through the websites ‘proxx.io’ and ‘proxx.net,’ where it was advertised that it provided over 23,000 anonymous proxies worldwide.“According to court documents, from at least June 2019 through December 2022, Makinin developed and deployed malicious software to hack thousands of Internet-connected devices around the world, including in Puerto Rico,” reads the U.S. DoJ announcement.Makinin admitted that he made a profit of at least $550,000 from the proxy services he sold to others and agreed to forfeit cryptocurrency wallets holding the crime proceeds.The law enforcement operation to dismantle the IPStorm botnet have not extended to victim computers.IPStorm started as a Windows-targeting malware that later evolved to target Linux architectures, including Android-based IoT devices.Its authors followed a modular design approach with different Golang packages offering a set of dedicated functionality, keeping it lean and versatile across a range of target systems.The malware used the InterPlanetary File System (IPFS) peer-to-peer network to hide its malicious activities and resist infrastructure takedown attempts. It featured SSH brute-forcing for spreading to adjacent systems, antivirus evasion, and persistence mechanisms.Through this infrastructure, cybercriminals could use thousands of systems to route traffic and thus hide their tracks. The price for access to the IPStorm network could reach hundreds of dollars per month.Multiple law enforcement organizations were involved in the investigation, including the Spanish National Police Cyber Attack Group, Dominican National Police-International Organized Crime Division, and Ministry of the Interior and Police-Immigration Directorate."
   },
   {
      "time": "2023-11-15",
      "title": "New Reptar CPU flaw impacts Intel desktop and server systems",
      "text": " Intel has fixed a high-severity CPU vulnerability in its modern desktop, server, mobile, and embedded CPUs, including the latest Alder Lake, Raptor Lake, and Sapphire Rapids microarchitectures.\"Intel does not expect this issue to be encountered by any non-malicious real-world software. Redundant REX prefixes are not expected to be present in code nor generated by compilers. Malicious exploitation of this issue requires execution of arbitrary code. Intel identified the potential for escalation of privilege in limited scenarios as part of our internal security validation in a controlled Intel lab environment.\"Specific systems with affected processors, including those with Alder Lake, Raptor Lake, and Sapphire Rapids, have already received updated microcodes before November 2023, with no performance impact observed or expected issues.The company also released microcode updates to address the issue for the other CPUs, with users advised to update their BIOS, system OS, and drivers to receive the latest microcode from their original equipment manufacturer (OEM), operating system vendor (OSV), and hypervisor vendors.\"At the request of customers, including OEMs and CSPs, this process typically includes a validation, integration, and deployment window after Intel deems the patch meets production quality, and helps ensure that mitigations are available to all customers on all supported Intel platforms when the issue is publicly disclosed.\"While Intel is not aware of any active attacks using this vulnerability, affected platforms have an available mitigation via a microcode update.\"While, commonly, redundant prefixes should be ignored, they're triggering \"very strange behavior\" because of this vulnerability, as discovered by Ormandy during testing.\"This already seemed like it could be indicative of a serious problem, but within a few days of experimenting we found that when multiple cores were triggering the same bug, the processor would begin to report machine check exceptions and halt.\"Update: Added Intel statement."
   },
   {
      "time": "2023-11-15",
      "title": "Pharmacy provider Truepill data breach hits 2.3 million customers",
      "text": " Postmeds, doing business as ‘Truepill,’ is sending notifications of a data breach informing recipients that threat actors accessed their sensitive personal information.Truepill is a B2B-focused pharmacy platform that uses APIs for order fulfillment and delivery services for direct-to-consumer (D2C) brands, digital health companies, and other healthcare organizations across all 50 states in the U.S.The data types that might have been accessed by the threat actors include:The above information increases the risks of phishing and social engineering attacks. The notice clarifies that Social Security numbers (SSNs) were not in the exposed data set.Specifically, Postmeds is blamed for not encrypting sensitive healthcare information stored on its servers, which would significantly lessen the impact of a data breach.The delay in notifying consumers may also be part of the possible lawsuits, as the firm took more than two months to inform affected persons.The content of the notices is also criticized for being too vague, not providing details about how the intruders gained access to the firm’s systems, and lacking any protection guidance for the recipients and identity theft protection service coverage."
   },
   {
      "time": "2023-11-15",
      "title": "21 Vulnerabilities Discovered in Crucial IT-OT Connective Routers",
      "text": " Researchers have discovered 21 vulnerabilities in a popular brand of industrial router.OT/IoT routers bridge the wider Internet with internal networks, via 3G and 4G cellular networks. They're most often found in critical sectors such as transportation, government, and water treatment. Compromising these devices can enable lateral movement within networks, malware deployment, espionage, disruption of services, and much more.Seven of the newly discovered vulnerabilities lie in internal components of the routers. Fourteen of them derive from open source components, specifically, a captive portal for Wi-Fi networks and an XML processing library.The nature of the vulnerabilities run the gamut: cross-site scripting (XSS), denial of service (DoS), remote code execution (RCE), unauthorized access, and authentication bypass.Viewed another way, these bugs can be grouped into two broad categories. \"It's either a design flaw — things like hardcoded credentials, SSL certificates, and so on — or how the device handles potentially malicious or malformed inputs that could lead to injecting malicious code or to crashing the device,\" explains Daniel dos Santos, head of security research at Forescout.With an opening into one of these devices, attackers can circumvent traditional industrial security protections and charge straight at the most critical devices in a plant.\"When we talk about attacks in OT, the typical path is that somebody would find an initial access point on the IT network — a workstation of an employee that clicks on a phishing link,\" dos Santos says. \"Then there's lateral movement, until something that bridges the gap with OT — an engineering workstation, data historian, SCADA system, or something like that — and then you manage to get access to IoT devices.\" The interesting thing with these routers is that they tend to be bridging potentially critical devices with the Internet directly. \"For pipelines or substations or things like that, you can imagine that they would be connected directly to potentially safety critical devices without requiring the typical IT-OT lateral movement,\" dos Santos says.Using only regular scans, the researchers identified over 86,000 such OT/IoT devices unprotected on the open Web (68,605 of them in the US). And it gets worse: 22,000 of them use default SSL certificates, enabling easy man-in-the-middle (MitM) attacks.Even aside from the 21 new ones, less than 10% of those 86,000 devices are hardened to already publicly known vulnerabilities.Among those running management interfaces, 80% are at end of life, meaning that they cannot be patched any longer.\"I believe that people tend to think: it's still in the OT world, so it's legacy,\" he concludes. \"We don't need to replace it right now. But that's definitely problematic, and this is one area of the OT perimeter that could be helped in upgrading devices.\" Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   }
]