[
   {
      "time": "2022-07-29",
      "title": "France Closes 'Cookies' Case Against Facebook - SecurityWeek",
      "text": " Hi, what are you looking for?French privacy regulators on Thursday closed a case against Facebook after determining the US tech giant had changed the way it collected user data to comply with the law.ByFlipboardRedditWhatsappWhatsappEmailAFP 2023Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.SecurityWeek spoke with more than 300 cybersecurity experts to see what is bubbling beneath the surface, and examine how those evolving threats will present...Joanna Burkey, CISO at HP, and Kevin Cross, CISO at Dell, discuss how the role of a CISO is different for a multinational corporation...The CRYSTALS-Kyber public-key encryption and key encapsulation mechanism recommended by NIST for post-quantum cryptography has been broken using AI combined with side channel attacks.In this issue of CISO Conversations we talk to two CISOs about solving the CISO/CIO conflict by combining the roles under one person.Security professionals understand the need for resilience in their company’s security posture, but often fail to build their own psychological resilience to stress.SecurityWeek examines how a layoff-induced influx of experienced professionals into the job seeker market is affecting or might affect, the skills gap and recruitment...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-29",
      "title": "U.S. Justice Department probing cyber breach of federal court records system | Reuters",
      "text": " WASHINGTON, July 28 (Reuters) - The U.S. Justice Department is investigating a cyber breach involving the federal court records management system, the department's top national security attorney told lawmakers on Thursday.Matt Olsen, head of the Justice Department's National Security Division, alluded to the threat of cyber attacks by foreign nations as he told the U.S. House of Representative Judiciary Committee that the incident was a \"significant concern.\"Olsen made the remarks in response to questions from Representative Jerrold Nadler, the panel's Democratic chairman, who said that \"three hostile foreign actors\" had attacked the courts' document filing system.Nadler said the committee learned only in March of the \"startling breadth and scope\" of the breach. Olsen said the Justice Department was working closely with the federal judiciary around the country to address the issue.“While I can’t speak directly to the nature of the ongoing investigation of the type of threats that you’ve mentioned regarding the effort to compromise public judicial dockets, this is of course a significant concern for us given the nature of the information that's often held by the courts,\" Olsen said.Olsen did not comment on who was behind the attack, but he noted that his division was focused generally on the risk of cyber attacks by foreign nations like China, Russia, Iran and North Korea.The Administrative Office of the U.S. Courts in January 2021 said it was adding new security procedures to protect confidential or sealed records following an apparent compromise of its electronic case management and filing system.The Administrative Office, the judiciary's administrative arm, in a statement on Thursday called cybersecurity a high priority and said it has been taking \"significant actions to protect our systems and the sensitive information they contain.\"Further details could not be immediately determined. AJustice Department spokesman said the department as a general policy does not confirm or deny the existence of specific investigations.The federal judiciary has been working to modernize its electronic case management and filing system and the related online portal known as PACER, which is used to access records, citing the risk of cyber attacks on the aging electronic system.\"We are vulnerable,\" U.S. Circuit Judge Amy St. Eve testified at a House committee hearing in May on the judiciary's budget request.Reporting by Sarah N. Lynch and Nate Raymond\nEditing by Bernadette Baum and Leslie AdlerThomson ReutersSarah N. Lynch is the lead reporter for Reuters covering the U.S. Justice Department out of Washington, D.C. During her time on the beat, she has covered everything from the Mueller report and the use of federal agents to quell protesters in the wake of George Floyd’s murder, to the rampant spread of COVID-19 in prisons and the department's prosecutions following the Jan. 6 attack on the U.S. Capitol.\nThomson ReutersNate Raymond reports on the federal judiciary and litigation. He can be reached at nate.raymond@thomsonreuters.com.Rescuers hope to drill through the last third of the debris blocking a collapsed tunnel in the Indian Himalayas by early on Thursday to reach 41 workers trapped for ten days, an official said, so long as there are no new hurdles.Reuters, the news and media division of Thomson Reuters, is the world’s largest multimedia news provider, reaching billions of people worldwide every day. Reuters provides business, financial, national and international news to professionals via desktop terminals, the world's media organizations, industry events and directly to consumers.Build the strongest argument relying on authoritative content, attorney-editor expertise, and industry defining technology.The most comprehensive solution to manage all your complex and ever-expanding tax and compliance needs.The industry leader for online information for tax, accounting and finance professionals. Access unmatched financial data, news and content in a highly-customised workflow experience on desktop, web and mobile. Browse an unrivalled portfolio of real-time and historical market data and insights from worldwide sources and experts.Screen for heightened risk individual and entities globally to help uncover hidden risks in business relationships and human networks."
   },
   {
      "time": "2022-07-29",
      "title": "LofyLife: malicious npm packages steal Discord tokens and bank card data | Securelist",
      "text": " Solutions for:ThreatsCategories28 Jul 2022\n  minute read\t\t\t\t\t\t\t\tAuthorsOn July 26, using the internal automated system for monitoring open-source repositories, we identified four suspicious packages in the Node Package Manager (npm) repository. All these packages contained highly obfuscated malicious Python and JavaScript code. We dubbed this malicious campaign “LofyLife”.The Python malware is a modified version of an open-source token logger called Volt Stealer. It is intended to steal Discord tokens from infected machines, along with the victim’s IP address, and upload them via HTTP. The JavaScript malware we dubbed “Lofy Stealer” was created to infect Discord client files in order to monitor the victim’s actions. It detects when a user logs in, changes email or password, enables/disables multi-factor authentication (MFA) and adds new payment methods, including complete bank card details. Collected information is also uploaded to the remote endpoint whose address is hard-coded. Data is exfiltrated to Replit-hosted instances:Kaspersky solutions detect the threat with the following verdicts:We are constantly monitoring the updates to repositories to ensure that all new malicious packages are detected.Timeline of uploaded packagesAuthorsLofyLife: malicious npm packages steal Discord tokens and bank card dataYour email address will not be published. Required fields are marked *Name * Email * ΔGReAT webinarsFrom the same authorsThe hottest research right in your inboxΔIn the same categoryAsian APT groups target various organizations from a multitude of regions and industries. We created this report to provide the cybersecurity community with the best-prepared intelligence data to effectively counteract Asian APT groups.We unveil a Lazarus campaign exploiting security company products and examine its intricate connections with other campaignsHow Kaspersky researchers obtained all stages of the Operation Triangulation campaign targeting iPhones and iPads, including zero-day exploits, validators, TriangleDB implant and additional modules.Nobody would even suspect the mining malware was merely a mask, masquerading behind an intricate modular framework that supports both Linux and Windows.  The amount of effort that went into creating the framework is truly remarkable, and its disclosure was quite astonishing.The hottest research right in your inboxΔThreatsCategories© 2023 AO Kaspersky Lab. All Rights Reserved.\nRegistered trademarks and service marks are the property of their respective owners.The hottest research right in your inboxΔ"
   },
   {
      "time": "2022-07-29",
      "title": "Top White House cyber official says Congress should push for digital security mandates",
      "text": " A senior White House official on Thursday said Congress could do more to set basic cybersecurity standards for critical infrastructure sectors to better protect them against digital threats.“We are behind other countries in setting cybersecurity requirements for the critical elements of infrastructure, the most significant — water, power, pipeline, hospitals in the country, as well as the technology that crosses all of them,” Anne Neuberger, deputy national security adviser for cyber and emerging technology, said during an event at the Center for a New American Security.\"When we drive a car, the car comes with the seatbelt, comes with airbags. It comes with standards for what's the speed you can drive on the road. And what happens if there's a major accident?\" Neuberger said at the Washington-based think tank. \"We need the same with cyber.\"She noted that the administration has taken various actions — most notably through last year’s sweeping executive order — to push the private sector to voluntarily boost security, but that lawmakers could prod operators to do more to bolster digital defenses.\"We really need the Hill to put in place those mandatory standards,\" Neuberger said.Neuberger said the White House will host a group of railroad executives next week for a classified briefing about the cyber threats posed by nation states like Russia and China. She also said the Environmental Protection Agency would “shortly” issue a rule to extend its water system sanitation reviews to include cybersecurity considerations.But even there, she added, \"we need the Hill to ensure that those authorities are clear.”Momentum is growing on Capitol Hill to protect crucial U.S. digital assets from hackers.The Senate draft of the massive policy bill does not contain such a provision. Once the chamber votes on its version, legislators will hash out their differences in a conference committee.Neuberger said Congress is a “major partner” in looking at sectors that lack authorities or “where there's hesitancy by agencies to move without real Hill backing to do so.”She said she has received “a lot of interest and excellent feedback\" from lawmakers about the “right path\" to enacting clear cyber regulatory authority for more sectors.“We're really looking forward to, over the next few months, continuing that engagement, hearing the input of members of the Hill and staffers as well, and crafting that together,” according to Neuberger.Martin Matishak is a senior cybersecurity reporter for The Record. He spent the last five years at Politico, where he covered Congress, the Pentagon and the U.S. intelligence community and was a driving force behind the publication's cybersecurity newsletter.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-29",
      "title": "Microsoft SQL servers hacked to steal bandwidth for proxy services",
      "text": " Threat actors are generating revenue by using adware bundles, malware, or even hacking into Microsoft SQL servers, to convert devices into proxies that are rented through online proxy services.To steal a device's bandwidth, the threat actors install software called 'proxyware' that allocates a device's available internet bandwidth as a proxy server that remote users can use for various tasks, like testing, intelligence collection, content distribution, or market research. Botters also love these proxy services as they gain access to residential IP addresses that have not been blacklisted from online retailers.In return for sharing their bandwidth, the device's owner gets a revenue share of the fees charged to customers. For example, the Peer2Profit service shows users making as much as $6,000 per month by installing the company's software on thousands of devices.The attackers receive compensation for the bandwidth by setting their email address for the user, while the victims might only notice some connectivity slowdowns and hiccups.Ahnlab observed the installation of proxyware software for services, such as Peer2Profit and IPRoyal, via adware bundles and other malware strains.The malware checks if the proxy client is running on the host, and it can use the “p2p_start()” function to launch it if it’s deactivated.In the case of IPRoyal’s Pawns, the malware prefers to install the CLI version of the client instead of the GUI one, as the goal is to have the process run stealthily in the background.In more recent observations, attackers used Pawns in DLL form and provided their emails and passwords in encoded string form, launching it with the functions \"Initialize()\" and \"startMainRoutine().\"Once the proxyware is installed on a device, the software adds it as an available proxy that remote users can use for whatever task they want on the Internet.Unfortunately, this also means that other threat actors can use these proxies for illegal activities without the victim being aware.According to Ahnlab's report, malware operators using this scheme to generate revenue also target vulnerable MS-SQL servers to installPeer2Profit clients.This has been going on since early June 2022, with most logs retrieved from infected systems revealing the existence of a UPX-packed database file named “sdk.mdf.”The reason behind using proxyware clients is likely an increased chance of remaining undetected for extended periods, which translates into more significant profits. It is unclear how much money actors generate via this method, though.Furthermore, Microsoft SQL servers are usually located in corporate networks or data centers with abundant Internet bandwidth that proxy services can sell for illegal purposes."
   },
   {
      "time": "2022-07-29",
      "title": "CISA signs agreement with Ukraine to expand cybersecurity cooperation",
      "text": " The meetings and memorandum signal deepening ties between Ukraine and the U.S. as the two nations increasingly face cyberthreats from Russia amid its ongoing war with Ukraine.The memorandum outlines new priorities, including sharing cyber incident response best practices and critical infrastructure security protection data, as well as conducting cybersecurity training and joint exercises.In Ukraine, six government agencies are responsible for information security: the State Security Service, for example, fights against cyberterrorism; the Cyberpolice protects against cybercrime and violation of personal data laws; and the National Security and Defense Council helps them coordinate.Another priority for Ukraine is joint training. For many years, Ukrainian state cybersecurity agencies were underfinanced and couldn’t recruit talented specialists. When the war began, thousands of Ukrainian hacktivists organized their efforts and launched the IT Army that countered Russian cyberattacks without the support of government agencies.The new agreement with CISA “is an important step for the integration of Ukrainian cyber defenders into the global professional cyber environment,” according to SSSCIP.During the war, Ukraine and the U.S. have already participated in joint cyber exercises. In April, for example, they took part in the Locked Shields competition — an international real-time cyberdefense exercise organized by NATO.Although Ukraine is not a NATO member, it was accepted this year into NATO's cyber defense center, based in Tallinn. During the Locked Shields exercise, some Ukrainians teamed up with Americans, according to competition organizers.“Being a testing ground for the use of cyber-tools for malicious purposes, Ukraine has the unique practical experience in neutralizing cyberattacks that may be useful to partner countries,” Ukrainian ambassador to Estonia Mariana Betsa said at the time.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-29",
      "title": "Akamai blocked largest DDoS in Europe against one of its customers",
      "text": " The largest distributed denial-of-service (DDoS) attack that Europe has ever seen occurred earlier this month and hit an organization in Eastern Europe.The target, a customer of cybersecurity and cloud service company Akamai, has been under constant assault, facing dozens of DDoS rounds over the past 30 days.DDoS incidents have become more frequent since the start of the year as attackers try to deny access to the victim's digital services by flooding them with requests and traffic to overwhelm resources and render them unavailable.The company did not disclose any details about its customer but said that it was able to mitigate the attack and said that it targeted several IP addresses and that its client was the target of 75 DDoS incidents over the past 30 days.UDP (user datagram protocol) flood was the most popular vector and also the one observed in both record spikes.However, other methods were used, including UDP fragmentation, ICMP flood, RESET flood, SYN requests flood, TCP anomaly, TCP fragment, PSH ACK flood, FIN push flood, and PUSH flood.Akamai says that the DDoS attacks originated from a \"highly-sophisticated global botnet\" of infected devices. Powerful botnets capable of record-breaking DDoS attacks have been in the news recently."
   }
]