[
   {
      "time": "2022-07-07",
      "title": "Bitter APT continues to target Bangladesh | SECUINFRA Falcon Team",
      "text": " InhaltThis report builds on the findings published by Talos and covers an attack presumabily conducted in mid May 2022.Figure 1: Visible contents of the Excel documentWithout alerting the user in any way the Equation Editor is started in the background and used to download the next malware stage and execute it. By tracing the Process Tree with ProcMon we can see that the downloaded binary is written to C:\\$Drw\\fsutil.exe and executed by the Windows Explorer.Figure 2: Process Tree of Equation EditorFigure 3: Registering a debugger for Equation EditorSince Excel is waiting on the Equation Editor to exit, our debugging session will unfortunately be ended after a fixed amount of time with the error message below, so we will have to approach it differently.Figure 4: Error dialog while debugging Equation EditorFigure 5: Viewing the contents of the Excel file with oledumpBy specifying the stream and the -d parameter we can dump it to analyze it further.Figure 6: Dumping the Equation streamOpening the dumped file in a hex editor we can visually identify two different segments of data. Highlighted in green we see data that is likely the shellcode required for the Equation Editor exploit. Since there are next to no readable ASCII strings in there (looking closely we can spot fragments that look like “URL” or “http”) this data is likely encoded or encrypted in some way. Below that we can see data in a repeating pattern which is used as padding for the memory corruption exploit CVE-2018-0798.Figure 7: Analyzing the shellcode in a Hex editorFigure 8: Running frequency analysis on the shellcodeUsing Cyberchef with the presumed shellcode section and XOR key does yield readable strings. From here we can extract important information about the executed shellcode and indicators like the URL for the next malware stage.Figure 9: Decoding the XOR-ed shellcodeThe visualization below shows the most important API calls made in the shellcode:Figure 10: Graph showing the functionality of the maldoc shellcodeBy debugging the Equation Editor exploit again and manually placing a breakpoint on e.g. URLDownloadToFileA we can confirm these findings.Figure 11: Manually loading urlmon.dll to place a breakpoint on URLDownloadToFileAThe download query to emshedulersvc[.]com/vc/vc returns a sample of Bitters second stage Downloader, which we will investigate next.Figure 12: Breaking on URLDownloadToFileFigure 13: Detect it Easy parsing the PE file, Entropy graphComparing this fingerprinting function to the one documented by Cisco Talos we can see that Bitter abandoned the ZxxZ value separator (that gave the Downloader its name) in exchange for a simple underscore. This was possibly done to avoid detection through IDS/IPS systems based on this very specific separator. Looking back at older Bitter Research we can see that the threat group likes to change up these patterns from time to time to avoid detection.Figure 14: ZxxZ gathering system informationThe check-in with an attacker-controlled staging server contains the user account and hostname of the system. The function below manually assembles the HTTP GET request and sends it via a socket connection to the C2 server.Figure 15: ZxxZ sending a GET request with the host fingerprint to the C2We verified this network communication using packet captures. Another common indicator across Bitter infrastructure is the use of the LiteSpeed web server, which has been documented in older reports as well.Figure 16: Packet capture of the GET request aboveAfter retrieving the next malware stage from a staging server ZxxZ writes the binary to the disk and tries to execute it. In the screenshot below we can see that the Bitter group altered the C2 opcode strings that Talos had previously documented as DN-S (download success) and RN_E (run error) to just S and F, presumably short for Success and Failure. This is likely another measure to evade older detection rules. The payload execution was also changed to use CreateProcessA instead of ShellExecuteA like in the older version of ZxxZ.Figure 17: ZxxZ retrieving and executing the next stageUnfortunately the actual payload could not be retrieved from the staging server as it only returned an empty file named CAPT.msi.Figure 18: Request made to another staging server for the third stageFigure 19: Detect it Easy parsing the Almond RAT PE fileFigure 20: Main function, setting a MutexAlmond RAT employs string encryption to hinder detection and reverse engineering. Important / revealing strings like the Command&Control (C2) IP address below are therefore wrapped in the ciphertext.Decrypt function.Figure 21: StartClient fuction, showing the AES string encryption The decryption function implements a default AES-256-CBC encryption scheme where the IV and key are derived from the given plaintext password via PDKDF2. Since it is trivial to reimplement this in e.g. Python we decrypted all of the encrypted strings in the binary and modified the .NET assembly to increase code readability for this report. The file hashes of the unaltered and modified binaries can be found in the IoC section at the end of the post.Figure 22: String decryption function using AES CBCThe StartClient function implements the socket-based C2 communication interface for Almond RAT. In the samples we observed there were no domains or dynamic DNS services but only IPv4 addresses used to connect back to the threat actors. A characteristic property of the RAT is the usage of the tcp port  33638 . When first contacting the C2 server Almond RAT transmits gathered system information like hostname, OS version, internal IP address and MAC address and storage identifiers (disk info is not transmitted) to fingerprint the infected system. A 1024 byte buffer is used for the C2 communication.Figure 23: StartClient functionNext well will further investigate the functionality of Almond RAT.  At the beginning of the StartCommWithServer function the RAT sets a random receive timeout between 20 and 30 seconds for the socket. The analyzed sample accepts seven different commands in total. The REFRESH command is used as a heartbeat signal, letting the C2 server know that the RAT is still active and will reply with a simple OK.The DRIVE command returns a list of connected storage devices.With the DELETE* command the attackers can delete accessible files by supplying a path. In case of e.g. insufficient permissions it will return the exception. The * in the command string is used as a separator between the command and the file path.Figure 24: Basic C2 functionalityAlmond RAT allows for the execution of arbitrary commands via a wrapped cmd.exe instance. It has its own implementation for directory changes via cd and directory listings via OK. The CMD command uses a tilde instead of an asterisk to separate the parts of the command.Figure 25: Command executionIn addition to the functionality of listing directories and files via the command prompt the RAT also supports a quite involved DIR* command. It is capable of verifying file accessibility and displaying meta data like the last file write-time.Figure 26: Directory and File listingsSince Bitters main objective is espionage they need a way to exfiltrate data to the C2 server from the system, which is done via the DOWNLOAD* command.To drop more malware or other files onto the system it also supports the UPLOAD* command which uses the following file naming scheme: yyyyMMdd-hhmmss_filenameFigure 27: DOWNLOAD* and UPLOAD* functionsIn case the RAT receives an unknown command from the operator it will return the message XXX to indicate the error.Figure 28: Exception handling in case of an unknown commandAlmond RATs main purposes seem to be file system discovery, data exfiltration and a way to load more tools/establish persistence. The design of the tools seems to be layed out in way that it can be quickly modified and adapted to the current attack scenario.The staging server for the Downloader and the staging server for the RAT are hosted with Host Sailor. The Command&Control server for the Downloader is hosted with Namecheap and the one for Almond RAT is hosted with Nexeon Technologies. Except for the samples analysed in this report there was no other significant malware activity detected with these four domains.Staging server ZxxZ downloaderC2 server ZxxZ downloaderStaging server third stageAlmond RAT C2 serverWhile investigating these DNS entries we also noticed that on the 30.05.2022 a new record for spurshipbroker[.]com on 194.36.191[.]196 was created. This domain seems to be a so-called “typosquat” (impersonation) of spurshipbrokers[.]com, an Indian Marine Shipping and Transport company. This record stood out between seemingly legitimate webhosting and typosquats for banking sites on this Webhost/IP used by Bitter. While we do not have further evidence at this point in time that this is related to the Bitter activity it certainly does fit the approach of the group and the Naval-themed lure./*\nYara Rule Set\nAuthor: SECUINFRA Falcon Team\nDate: 2022-06-23\nIdentifier: 0x03-yara_win-Bitter_T-APT-17\nReference: “https://www.secuinfra.com/en/techtalk/whatever-floats-your-boat-bitter-apt-continues-to-target-bangladesh”\n*//* Rule Set —————————————————————– */rule APT_Bitter_Maldoc_Verify {meta:\ndescription = “Detects Bitter (T-APT-17) shellcode in oleObject (CVE-2018-0798)”\nauthor = “SECUINFRA Falcon Team (@SI_FalconTeam)”\ntlp = “WHITE”\nreference = “https://www.secuinfra.com/en/techtalk/whatever-floats-your-boat-bitter-apt-continues-to-target-bangladesh”\ndate = “2022-06-01”\nhash0 = “0c7158f9fc2093caf5ea1e34d8b8fffce0780ffd25191fac9c9b52c3208bc450”\nhash1 = “bd0d25194634b2c74188cfa3be6668590e564e6fe26a6fe3335f95cbc943ce1d”\nhash2 = “3992d5a725126952f61b27d43bd4e03afa5fa4a694dca7cf8bbf555448795cd6”strings:\n// This rule is meant to be used for verification of a Bitter Maldoc\n// rather than a hunting rule since the oleObject it is matching is\n// compressed in the doc zip$xor_string0 = “LoadLibraryA” xor\n$xor_string1 = “urlmon.dll” xor\n$xor_string2 = “Shell32.dll” xor\n$xor_string3 = “ShellExecuteA” xor\n$xor_string4 = “MoveFileA” xor\n$xor_string5 = “CreateDirectoryA” xor\n$xor_string6 = “C:\\\\Windows\\\\explorer” xor\n$padding = {000001128341000001128341000001128342000001128342}condition:\n3 of ($xor_string*)\nand $padding\n}rule APT_Bitter_ZxxZ_Downloader {meta:\ndescription = “Detects Bitter (T-APT-17) ZxxZ Downloader”\nauthor = “SECUINFRA Falcon Team (@SI_FalconTeam)”\ntlp = “WHITE”\nreference = ” https://www.secuinfra.com/en/techtalk/whatever-floats-your-boat-bitter-apt-continues-to-target-bangladesh”\ndate = “2022-06-01”\nhash0 = “91ddbe011f1129c186849cd4c84cf7848f20f74bf512362b3283d1ad93be3e42”\nhash1 = “90fd32f8f7b494331ab1429712b1735c3d864c8c8a2461a5ab67b05023821787”\nhash2 = “69b397400043ec7036e23c225d8d562fdcd3be887f0d076b93f6fcaae8f3dd61”\nhash3 = “3fdf291e39e93305ebc9df19ba480ebd60845053b0b606a620bf482d0f09f4d3”\nhash4 = “fa0ed2faa3da831976fee90860ac39d50484b20bee692ce7f0ec35a15670fa92”strings:\n// old ZxxZ samples / decrypted strings\n$old0 = “MsMp” ascii\n$old1 = “SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion” ascii\n$old2 = “&&user=” ascii\n$old3 = “DN-S” ascii\n$old4 = “RN_E” ascii// new ZxxZ samples\n$c2comm0 = “GET /” ascii\n$c2comm1 = “profile” ascii\n$c2comm2 = “.php?” ascii\n$c2comm3 = “data=” ascii\n$c2comm4 = “Update” ascii\n$c2comm5 = “TTT” asciicondition:\nuint16(0) == 0x5a4d\nand filesize > 39KB // Size on Disk/1.5\nand filesize < 2MB // Size of Image*1.5and (all of ($old*)) or (all of ($c2comm*))}import “pe”\nimport “dotnet”rule APT_Bitter_Almond_RAT {meta:\ndescription = “Detects Bitter (T-APT-17) Almond RAT (.NET)”\nauthor = “SECUINFRA Falcon Team (@SI_FalconTeam)”\ntlp = “WHITE” reference = ” https://www.secuinfra.com/en/techtalk/whatever-floats-your-boat-bitter-apt-continues-to-target-bangladesh”\ndate = “2022-06-01” hash = “55901c2d5489d6ac5a0671971d29a31f4cdfa2e03d56e18c1585d78547a26396”strings:\n$function0 = “GetMacid” ascii\n$function1 = “StartCommWithServer” ascii\n$function2 = “sendingSysInfo” ascii\n$dbg0 = “*|END|*” wide\n$dbg1 = “FILE>” wide\n$dbg2 = “[Command Executed Successfully]” widecondition:\nuint16(0) == 0x5a4d\nand dotnet.version == “v4.0.30319”\nand filesize > 12KB // Size on Disk/1.5\nand filesize < 68KB // Size of Image*1.5\nand any of ($function*)\nand any of ($dbg*)\n}rule APT_Bitter_PDB_Paths {meta:\ndescription = “Detects Bitter (T-APT-17) PDB Paths”\nauthor = “SECUINFRA Falcon Team (@SI_FalconTeam)”\ntlp = “WHITE”\nreference = “https://www.secuinfra.com/en/techtalk/whatever-floats-your-boat-bitter-apt-continues-to-target-bangladesh”\ndate = “2022-06-22”\nhash0 = “55901c2d5489d6ac5a0671971d29a31f4cdfa2e03d56e18c1585d78547a26396”strings:\n// Almond RAT\n$pdbPath0 = “C:\\\\Users\\\\Window 10 C\\\\Desktop\\\\COMPLETED WORK\\\\” ascii\n$pdbPath1 = “stdrcl\\\\stdrcl\\\\obj\\\\Release\\\\stdrcl.pdb”// found by Qi Anxin Threat Intellingence Center\n// reference: https://mp.weixin.qq.com/s/8j_rHA7gdMxY1_X8alj8Zg\n$pdbPath2 = “g:\\\\Projects\\\\cn_stinker_34318\\\\”\n$pdbPath3 = “renewedstink\\\\renewedstink\\\\obj\\\\Release\\\\stimulies.pdb”condition:\nuint16(0) == 0x5a4d\nand any of ($pdbPath*)\n}All of the samples mentioned in this report have been made available through the public Malware repositories MalwareBazaar and Malshare for verification and further research.Filename: Repair of different csoc cstc, china supplied system – BNS BIJOY.xlsx\nMD5: 1bf615946ad9ea7b5a282a8529641bf6\nSHA1: 358867f105b517624806c3315c5426803f7c42a7\nSHA256: bc03923e3cc2895893571068fd20dd0bc626764d06a009b91dac27982e40a085Extracted oleObject:MD5: a1d9e1dccfbba118d52f95ec6cc7c943\nSHA1: 8efa4d5574a0c80733e9824ec146521385a68424\nSHA256: 0c7158f9fc2093caf5ea1e34d8b8fffce0780ffd25191fac9c9b52c3208bc450Filename: vc\nMD5: 6e4b4eb701f3410ebfb5925db32b25dc\nSHA1: c330ef43bbee001296c6c120cf68e4c90d078d9c\nSHA256: 91ddbe011f1129c186849cd4c84cf7848f20f74bf512362b3283d1ad93be3e42Filename: stdrcl.exe\nMD5: 71e1cfb5e5a515cea2c3537b78325abf\nSHA1: bcc9e35c28430264575831e851182eca7219116f\nSHA256: 55901c2d5489d6ac5a0671971d29a31f4cdfa2e03d56e18c1585d78547a26396Modified assembly with decrypted strings:MD5: d58e6f93bd1eb81eacc965d530709246\nSHA1: a47aec515f303ae7f427d98fc69fe828fa9c6ec6\nSHA256: d83cb82be250604b2089a1198cedd553aaa5e8838b82011d6999bc6431935691# File paths associated with the Downloader\nC:\\$Drw\\dsw\nC:\\$Drw\\fsutil.exe# Almond RAT Mutex\nsaebamini.com SingletonAppemshedulersvc[.]com/vc/vc\nm.huandocimama[.]com\ndiyefosterfeeds[.]com91.195.240[.]103\n194.36.191[.]196\n162.0.232[.]109\n64.44.131[.]109  fazitanfangThe Bitter threat group is continues to use their exploitation approach in Asia with themed lures and internal changes to avoid existing detections. To protect from such attacks network and endpoint detection and response measures should be put into place and commonly exploited software like Microsoft Office should be patched regularly. We will continue to monitor this threat group and report on changes in their Tactics, Techniques and Procedures. fazitendeDigital Forensics & Incident Response ExpertenNeben den Tätigkeiten, die im Rahmen von Kundenaufträgen zu verantworten sind, kümmert sich das Falcon Team um den Betrieb, die Weiterentwicklung und die Forschung zu diversen Projekten und Themen im DF/IR Bereich.Digital Forensics & Incident Response expertsIn addition to the activities that are the responsibility of customer orders, the Falcon team takes care of the operation, further development and research of various projects and topics in the DF/IR area.SECUINFRA GmbHHeadquartersStefan-Heym-Platz 110367 BerlinFrankfurt OfficeMünchener Straße 3660329 Frankfurt/Main"
   },
   {
      "time": "2022-07-07",
      "title": "NFT scammers see an opportunity in Ukraine donations",
      "text": " The Ukrainian government and celebrities have been promoting non-fungible tokens (NFTs) and cryptocurrencies to raise funds for the country's military during its ongoing war with Russia.The co-founders of ZelenskiyNFT dismissed the accusations, calling the investigation “absurd.” The Record reached out to the organization through the Telegram messaging app — an advisor using the pseudonym “Twain” for security reasons said that “all proceeds from the NFT sale were transferred to charities.” “We are very transparent,” he added, but provided no additional details.Some of the charities look suspicious, according to Molfar: they were created between March and May of this year, they have a handful of followers on Facebook, and there is no information about their founders or total donations collected. Their social media accounts seem to be followed by bots, Molfar found.Other Ukrainian charities listed by ZelenskiyNFT told The Record they received no money from the group. Just one organization confirmed that it received 1.18 ETH (about $1,300) from ZelenskiyNFT.Behind the ZelenskiyNFT project is the little-known studio IamUkraine. Molfar investigators said they couldn’t find the firm in any existing company registers. Publicly, however, the project claims it’s working with leading startups and Fortune 500 companies.All that is known about the company’s employees and owners are names and digital avatars made with the free app ZEPETO.Molfar’s OSINT investigation found that Twain is a Russian citizen, and his co-founders — Dzmitry and Volodymyr — are Belarusian and Ukrainian, respectively. Most of the team now lives in the Czech Republic but were born in Russia, according to Molfar.“The team does have people from Russia,” Twain confirmed to The Record. “And the fact that there are those who care among Russians only deserves respect.” Twain did not say how much money the charities received from ZelenskiyNFT. The employees of Ukrainian Balu Charity and Tabletochki told The Record that they discussed a possible partnership with ZelenskiyNFT, but haven’t received any funds.A spokeswoman for Donor.ua told The Record that the organization received about $1,300 in Ethereum from ZelenskiyNFT, but the transaction wasn't straightforward.A representative for a charity called People's Coalition told The Record that his fund has received “hundreds of thousands of dollars” from ZelenskiyNFT since March 2022, even though NFTs from the group only started trading in June. The spokesman also asked The Record to write “only good things” about the project because “it gives a lot of money” to his organization. He refused to specify the number or what causes the charity supports.There are other signs that point to an alleged scam, according to Molfar. The company's Twitter account, for instance, has 17,000 followers, most of which seem to be bots. Its Instagram has only 13 followers. The company also paid for its advertising in Ukrainian and foreign media – there are no organic mentions of it on the internet, Molfar found.Additionally, ZelenskiyNFT doesn’t work with local authorities, such as the state-funded NFT Museum, which sells digital art to raise money for Ukraine. Its spokeswoman, Valeria Panina, told The Record that she “heard that this project is a scam.”“It’s easy to fall victim to crypto scams in Ukraine these days,” Artem Starosiek, CEO at Molfar, told The Record. “People are so eager to help their country that they rarely engage in critical thinking.”On July 6, Starosiek told The Record that Molfar had reported ZelenskiyNFT as fraudulent content on OpenSea and filed a complaint with the cyber police of the Czech Republic as well as Ukrainian law enforcement.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-07-07",
      "title": "IT services giant SHI hit by \"professional malware attack\"",
      "text": " SHI International, a New Jersey-based provider of Information Technology (IT) products and services, has confirmed that a malware attack hit its network over the weekend.SHI claims to be one of North America's largest IT solutions providers, with $12.3 billion in revenue in 2021 and 5,000 employees around the world in operations centers in the U.S., the United Kingdom, and the Netherlands.It also says it provides services to over 15,000 corporate, enterprise, public sector, and academic customer organizations worldwide.\"Over the Fourth of July holiday weekend, SHI was the target of a coordinated and professional malware attack,\" SHI said in a statement.\"Thanks to the quick reactions of the security and IT teams at SHI, the incident was swiftly identified and measures were enacted to minimize the impact on SHI's systems and operations.\"After the attack, SHI added a message to its website warning customers and visitors that its information systems were undergoing maintenance due to a \"sustained outage.\"While evaluating its systems' integrity and investigating the security incident, SHI was forced to take some of its systems offline, including the company's public websites and email.Starting Wednesday morning, SHI's staff brought all email servers shut down after the attack back online. Its IT experts are also working on restoring access to other affected systems on the network.\"While the investigation into the incident is ongoing – and SHI is liaising with federal bodies including the FBI and CISA – there is no evidence to suggest that customer data was exfiltrated during the attack,\" the company added.SHI also said that it will keep customers up to date throughout the process and that no third-party systems in its supply chain were affected during the malware attack.When BleepingComputer reached out earlier today with a request for more details, an SHI spokesperson replied with a link to the statement published on the company's official blog."
   },
   {
      "time": "2022-07-07",
      "title": "Apple’s new Lockdown Mode defends against government spyware",
      "text": " Apple announced that a new security feature known as Lockdown Mode will roll out with iOS 16, iPadOS 16, and macOS Ventura to protect high-risk individuals like human rights defenders, journalists, and dissidents against targeted spyware attacks.Once enabled, the Lockdown Mode will provide Apple customers with messaging, web browsing, and connectivity protections designed to block mercenary spyware (like NSO Group's Pegasus) used by government-backed hackers to monitor their Apple devices after infecting them with malware.Attackers' attempts to compromise Apple devices using zero-click exploits targeting messaging apps such as WhatsApp and Facetime or web browsers will get automatically blocked, seeing that vulnerable features like link previews will be disabled.\"Turning on Lockdown Mode in iOS 16, iPadOS 16, and macOS Ventura further hardens device defenses and strictly limits certain functionalities, sharply reducing the attack surface that potentially could be exploited by highly targeted mercenary spyware,\" Apple said.The first version of Lockdown Mode will include protections for multiple operating systems features exposed to attacks, including:\"To invite feedback and collaboration from the security research community, Apple has also established a new category within the Apple Security Bounty program to reward researchers who find Lockdown Mode bypasses and help improve its protections,\" Apple added.\"Bounties are doubled for qualifying findings in Lockdown Mode, up to a maximum of $2,000,000 — the highest maximum bounty payout in the industry.\"Today's announcement came after Apple sued Pegasus spyware-maker NSO Group in November 2021 for the targeting and and spying of Apple users using NSO's surveillance tech.Apple said at the time that state-sponsored attacks using NSO's spyware only targeted \"a very small number\" of individuals, across multiple platforms, including Android and Apple's iOS.The attackers deployed NSO's surveillance software on the compromised devices of high-profile targets, including government officials, diplomats, dissidents, academics, and journalists worldwide.\"While the vast majority of users will never be the victims of highly targeted cyberattacks, we will work tirelessly to protect the small number of users who are.\""
   },
   {
      "time": "2022-07-07",
      "title": "FBI, CISA, Treasury: North Korean hackers taking aim at health care with Maui ransomware | CyberScoop",
      "text": " \n\nJuly 6, 2022\n\nThree federal agencies said Wednesday that North Korean hackers have been attacking the health care sector with ransomware, and cautioned victims that paying up could run afoul of U.S. sanctions rules.“This malicious activity by North Korean state-sponsored cyber actors against the healthcare and public health sector poses a significant risk to organizations of all sizes,” said CISA’s executive director for cybersecurity, Eric Goldstein.“They’re pretty ruthless, as we have seen in the past. And the fact that there’s an urgency by the health care sector to continue the uninterrupted provision of health care is a reason why they’re targeting health care.”“They’re pretty ruthless, as we have seen in the past,” said John Riggi, national adviser for cybersecurity and risk at the American Hospital Association (AHA). “And the fact that there’s an urgency by the health care sector to continue the uninterrupted provision of health care is a reason why they’re targeting health care.”“Maui stood out to us because of a lack of several key features we commonly see with tooling from RaaS providers, such as an embedded ransom note to provide recovery instructions or automated means of transmitting encryption keys to attackers,” wrote Silas Cutler, principal reverse engineer. “Instead, we believe that Maui is manually operated, in which operators will specify which files to encrypt when executing it.” That setup makes sense, said Daniel dos Santos, head of security research for Forescout.“This is to be expected from a malware developed or used by a state-sponsored actor, which has different behavior and potentially different objectives than a cybercriminal group,” he said. “Maybe the actors are not looking immediately to scale this attack to hundreds of organizations, but instead looking into targeting some organizations that are more important for their objectives.”Riggi said his organization was “anecdotally” aware of some Maui victims. The Health Information Sharing and Analysis Center (H-ISAC) was unable to identify any victims, but it was clear that law enforcement had, said Errol Weiss, chief information security officer for the group. Both H-ISAC and AHA  were alerting members Wednesday, or planning to do so.“Since May 2021, the FBI has observed and responded to multiple Maui ransomware incidents at HPH Sector organizations,” the federal alert reads. “North Korean state-sponsored cyber actors used Maui ransomware in these incidents to encrypt servers responsible for healthcare services—including electronic health records services, diagnostics services, imaging services, and intranet services. In some cases, these incidents disrupted the services provided by the targeted HPH Sector organizations for prolonged periods. “Cyber firm Mandiant said that of late, the health care sector hasn’t seemed to be the top priority target for North Korea.“We have noted recently that North Korean actors have shifted focus away from healthcare targets to other traditional diplomatic and military organizations,” John Hultquist, vice president of Mandiant Intelligence, said in a written statement. “Unfortunately, healthcare organizations are also extraordinarily vulnerable to extortion of this type because of the serious consequences of a disruption.”Updated 7/6/22: to include comment from Forescout."
   },
   {
      "time": "2022-07-07",
      "title": "Ransomware, hacking groups move from Cobalt Strike to Brute Ratel",
      "text": " Hacking groups and ransomware operations are moving away from Cobalt Strike to the newer Brute Ratel post-exploitation toolkit to evade detection by EDR and antivirus solutions.Corporate cybersecurity teams commonly consist of employees who attempt to breach corporate networks (red team) and those who actively defend against them (blue team). Both teams then share notes after engagements to strengthen the cybersecurity defenses of a network.For years, one of the most popular tools in red team engagements has been Cobalt Strike, a toolkit allowing attackers to deploy \"beacons\" on compromised devices to perform remote network surveillance or execute commands.In 2020, Chetan Nayak, an ex-red teamer at Mandiant and CrowdStrike, released Brute Ratel Command and Control Center (BRc4) as an alternative to Cobalt Strike for red team penetration testing engagements.In a new report by Palo Alto Unit 42, researchers have spotted threat actors moving away from Cobalt Strike to using Brute Ratel as their post-exploitation toolkit of choice.This change in tactics is significant as BRc4 is designed to evade detection by EDR and antivirus solutions, with almost all security software not detecting it as malicious when first spotted in the wild.\"Instead, this tool is uniquely dangerous in that it was specifically designed to avoid detection by endpoint detection and response (EDR) and antivirus (AV) capabilities. Its effectiveness at doing so can clearly be witnessed by the aforementioned lack of detection across vendors on VirusTotal.\"In attacks suspected to be linked to the Russian state-sponsored hacking group APT29 (aka CozyBear and Dukes), threat actors distribute malicious ISOs that allegedly contain a submitted résumé (CV).However, the 'Roshan-Bandara_CV_Dialog' résumé file is actually a Windows shortcut that will launch the bundled OneDriveUpdater.exe file, as shown in the file's properties below.While OneDriveUpdater.exe is a legitimate Microsoft executable, the included version.dll that is loaded by the program has been modified to act as a loader for a Brute Ratel badger, which is loaded into the RuntimeBroker.exe process.Once the Brute Ratel badger is loaded, the threat actors can remotely access the compromised device to execute commands and spread further in the now-breached network.Brute Ratel currently costs $2,500 per user for a one-year license, with customers required to provide a business email address and be verified before a license is issued.As this is a manual verification process, it raises the question of how the threat actors receive software licenses.As payloads allow Nayak to see who they are licensed to, he was able to identify and revoke the license.\"The criminals behind the former Conti ransomware operations explored multiple penetration testing kits beyond usage of Cobalt Strike,\" Kremez told BleepingComputer in a conversation.\"In one particular case, they have gained access to the Brute Ratel kit that was used for post-exploitation in targeted attacks from BumbleBee loader. The ultimate goal of the Brute Ratel usage was post-exploitation framework for lateral movement and subsequent network encryption via ransomware payload.\"\"To get access to the Brute Ratel licenses, the threat actors create fake US companies which are used as part of the verification process.\"BleepingComputer reached out to Brute Ratel's creator, Chetan Nayak, with questions regarding the verification process but has not heard back."
   },
   {
      "time": "2022-07-07",
      "title": "\r\n\tAPT Hacker Group Bitter Continues to Attack Military Targets in Bangladesh - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistAn advanced persistent threat (APT) operating under the name of ‘Bitter’ continues to conduct cyber-attacks against military entities in Bangladesh.“Through malicious document files and intermediate malware stages, the threat actors conduct espionage by deploying Remote Access Trojans,” reads the document.Specifically, the attack would have originated from a weaponized Excel document likely distributed through a spear-phishing email.The malicious code would then be implemented in Visual C++ and work as a second-stage implant, allowing malicious actors to deploy additional malware.“Comparing this fingerprinting function to the one documented by Cisco Talos we can see that Bitter abandoned the ZxxZ value separator (that gave the Downloader its name) in exchange for a simple underscore.”According to SecuInfra, the APT did this to avoid detection through IDS/IPS systems based on this specific separator.“The Bitter threat group continues to use their exploitation approach in Asia with themed lures and internal changes to avoid existing detections,” SecuInfra explained.“We will continue to monitor this threat group and report on changes in their Tactics, Techniques and Procedures.”All of the samples mentioned in the SecuInfra advisory have been reportedly made available through the public Malware repositories MalwareBazaar and Malshare for verification and further research."
   },
   {
      "time": "2022-07-07",
      "title": "Fraudulent UK Visa Scams Circulate on WhatsApp - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-07-07",
      "title": "https://portswigger.net/daily-swig/atlassian-patches-full-read-ssrf-in-jira",
      "text": " "
   },
   {
      "time": "2022-07-07",
      "title": "Data Breach at PFC USA Impacts Patients of 650 Healthcare Providers - SecurityWeek",
      "text": " Hi, what are you looking for?Just ahead of the 4th of July weekend, accounts receivable management firm Professional Finance Company (PFC USA) started sending out data breach notification letters to patients of over 650 healthcare providers across the country.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   }
]