[
   {
      "time": "2022-10-05",
      "title": "Critical Packagist Vulnerability Opened Door for PHP Supply Chain Attack - SecurityWeek",
      "text": " Hi, what are you looking for?Code security company SonarSource today published details on a severe vulnerability impacting Packagist, which could have been abused to mount supply chain attacks targeting the PHP community.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-05",
      "title": "Netwalker ransomware affiliate sentenced to 20 years in prison",
      "text": " Former Netwalker ransomware affiliate Sebastien Vachon-Desjardins has been sentenced to 20 years in prison and demanded to forfeit $21.5 million for his attacks on a Tampa company and other entities.Vachon-Desjardins, a 34 Canadian man extradited from Quebec, was sentenced today in a Florida court after pleading guilty to 'Conspiracy to commit Computer Fraud', 'Conspiracy to Commit Wire Fraud', 'Intentional Damage to Protected Computer,' and 'Transmitting a Demand in Relation to Damaging a Protected Computer.'\"This term consists of a 60-month term as to Counts One and Four, 120-month term as to Count Three and a 240-month term as to Count Two. Counts One, Three, and Four are to run concurrently to Count Two.\"Vachon-Desjardins is also required to serve three years of supervised release after he gets out of prison. During this term, Vachon-Desjardins will not be allowed to have a job in information technology or use a computer capable of connecting to the Internet, including a smartphone, gaming device, or other electronic devices.The Judge ordered a forfeiture against the defendant of $21.5 million, of which 27.65 Bitcoin, already held by law enforcement, will be credited towards the amount.Vachon-Desjardins operated as an affiliate for the ransomware operation, where it is believed he conducted attacks on companies worldwide, including US companies and at least 17 Canadian entities.During these attacks, the ransomware operation would steal data from corporate systems and ultimately encrypt devices. To recover files and prevent data release, the threat actors extorted the victims to pay a ransom demand ranging from hundreds of thousands to millions of dollars.Vachon-Desjardins was extradited to the United States in March 2022."
   },
   {
      "time": "2022-10-05",
      "title": "XSS Bugs in Canon's Vitrea View Tool, Can Expose Patient Data - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " \"Canon Medical released a patch for these issues in version 7.7.6. We recommend all customers on version 7. x to update to the latest release. We always appreciate vendors like Canon Medical that approach the disclosure process with transparency and in the interest of the security of their products and users.\"A threat actor can activate the bugs to access/change patient details (i.e. stored scans and images) and get extra access to some features related to Vitrea View. The first problem is an unauthorized Reflected XSS that exists in an error message at /vitrea-view/error/, reflecting all input following the /error/ subdirectory back to the user, with minor limitations. How does the bug work?The researchers observed that space characters and single and double quotes can alter the reflection. The use of base 64 encoding and backticks (`) can allow to escape these restrictions, as well as importing remote scripts. The second problem is one more Reflected XSS within the Vitrea View Administrative panel. A threat actor can access the panel by luring the victims to click on a specially made link. The researchers found the search for 'limit', 'offset', and 'group' in the 'Group and Users' page of the admin panel all highlight their inputs back to the user, after the text is entered rather than anticipated numerical inputs. The report says :\"Like the previous finding, the reflected input is slightly restricted, as it does not allow spaces. Once an authenticated admin is coerced into visiting the affected URL, it is possible to create and modify the Python, JavaScript, and Groovy scripts used by the Vitrea View application.”The researchers also wrote a proof-of-concept for both these vulnerabilities. Canon Medical handled these two vulnerabilities by releasing Vitrea View version 7.7.6. your nameYour Emailyour message"
   },
   {
      "time": "2022-10-05",
      "title": "Seychelles, Seychelles, on the C(2) Shore",
      "text": " HomeProductsThreat VectorsCommunity ServicesResourcesCompanyMoreUpdated: Aug 1An overview of a bulletproof hosting provider named ELITETEAM.Bulletproof hosting (BPH) is a type of service offered by hosting providers that allows operators unrestricted and unregulated use of their paid infrastructure. Usually, these providers ignore abuse complaints, giving threat actors an ideal platform to conduct various malicious activities. BPH providers prefer to operate in jurisdictions that have lenient laws against such conduct. Due to the different laws in different countries, this creates a significant gray area that allows BPH providers to claim immunity to what their customers (threat actors) host.In addition to malicious activities, some of the other services enabled / hosted by BPH providers include online gambling, the sharing of copyrighted materials, misinformation, etc.ELITETEAM, a bulletproof hosting provider registered in the Republic of Seychelles, is associated with multiple malicious campaigns.Multiple distinct clusters of threat activity were noted, operating from IP addresses within a netblock associated with ELITETEAM.Each threat cluster had seemingly different “goals”, from directly stealing banking information to deploying ransomware and crypto miners. With a diverse range of targets, and notable differences in attacker TTPs.Evidence was identified, based on AS announcements, linking ELITETEAM to another known Russian bulletproof hosting provider.ELITETEAM owns four different ASNs as “1337TEAM LIMITED”: AS39770, AS60424, AS56873, and AS51381, but mainly operates from AS51381, which is associated with netblock 185.215.113.0/24.Looking at the WHOIS data related to this netblock, an address in Seychelles is provided:Figure 1: ELITETEAM WHOIS DataInfrastructure SummaryThe identified malicious infrastructure, hosted via ELITETEAM and discussed in this blog post, is divided into three different clusters, as follows:Cluster 1: Malvertising and info-stealingCluster 2: PhishingCluster 3: SkimmingCluster 1Figure 2: Malvertising CampaignFollowing the initial installation of Amadey, depending on the version number of the malware, (3.08 through to 3.21 was observed in this cluster) one of two payloads are then dropped; Redline stealer, or Smokeloader. It appears the initial goal of the threat actors is the theft of victim information / credentials, however further payloads were also observed being dropped, including Djvu ransomware and crypto miners.During this investigation, we focused our research on five Amadey C2 servers:Figure 3: Amadey C2 ServersNote: For reasons unknown, this cluster hosts multiple different versions of Amadey, all of which are currently in use in attacks.Pivoting on URL strings associated with the Amadey C2 servers (Figure 2), we were able to identify a list of tasks hosted on 185.215.113.92 (Amadey version 3.21).Figure 4: Tasks Hosted on 185.215.113.92The payloads associated with these tasks appeared to be hosted on a Bitbucket account named ‘USASoftwareDevelopment’.Figure 5: USASoftwareDevelopment Bitbucket AccountAnalysis of these payloads identify them as Redline stealer executables (botnet: IMHOTEP), which are likely loaded onto victim systems to facilitate data theft and systems reconnaissance. Data from victim systems is then exfiltrated to 185.215.113.217.Note: The number of downloads recorded against each payload provides a further indication to the scale of this activity.Figure 6: Data Exfiltration to 185.215.113.217Similar findings were also observed for 185.215.113.205, which was not initially identified as an Amadey C2 server.Figure 7: Tasks Hosted on 185.215.113.205In this case, the payloads were hosted on a different Bitbucket account (‘Alex’), but again all of the samples analyzed were identified as Redline stealer. Of note, data exfiltration for these payloads was to 65.21.133.231 (assigned to AS24940 - Hetzner Online GmbH).Figure 8: Data Exfiltration to 65.21.133.231Examining threat telemetry for 65.21.133.231:47430, it is apparent that this particular campaign became active on 20 August 2022, and to date has seen at least 500 victims. The observed victims were dispersed globally, with the highest concentrations in Brazil, India, and South Africa, based on IP geo-location data.Finally, a third Bitbucket account (named ‘mrssoprano666’) was identified, again associated with 185.215.113.92.Figure 9: ‘mrssoprano666’ Bitbucket AccountIn this case, we pay witness to a potential “career” change. We identified a user called ‘mrssoprano666’ on an underground Russian-language forum, offering ‘physical’ services associated with fraudulent activity. These services included answering telephone calls, making calls to victims (posing as a bank or shop), and the rerouting of parcels.Figure 10: Forum Post by ‘mrssoprano666’Based on the timeline of activity on this forum, it appears that the user ‘mrssoprano666’ disappeared in 2020 (having advertised their services since 2018) before subsequently re-appearing as a cybercrime affiliate this year.Cluster 2Figure 11: Phishing Landscape 2021 RankingsThree IPs are used to host phishing sites:185.215.113.100 Observed most recently in a campaign targeting Polish Credit-Agricole users.185.215.113.201Used as a Redline Stealer C2 until April 2022Switched to phishing purposes in June 2022185.215.113.206As noted previously, there is a financial flavor to this cluster, in one campaign we observed the targeting of Fidelity customers, in an attempt to steal credentials.Figure 12: Phishing Page Targeting FidelityInterestingly, there was also a second stage to this attack; usually attackers are simply seeking credentials, but in this case it appears the attackers wanted to double up on the opportunity. Once a user had entered their credentials, they were directed to download a file called ‘Fidelity Protect Services’. This is a completely fictitious product offering from Fidelity, but continues to be a highly convincing part of the scam.Figure 13: Fidelity Protect ServicesThe file (hosted at cv19alert[.]com/fidelityprotect.exe) was not available for download at the time of our investigation. However, a copy was uploaded to Virustotal on 28 June 2022 by a user in the United States (MD5: 4532b0d0ca6330bf73e0d6f76f8cf35b).In the first stage, the malware pushes the ‘machineId’ and username to the C2 server, along with the ‘configId’ (RC4 key).Figure 14: Initial POST RequestThe RC4 key is used to decrypt the location of the C2 server, in this case 104.193.255.48 (AS14576 - HOSTING SOLUTIONS).Figure 15: Decrypted C2 ServerUnfortunately the C2 was offline at the time of our investigation, so we were not able to retrieve the full configuration of the malware.Cluster 3The third cluster is connected to credit and debit card skimming activity, with the earliest observations occurring in November 2021.Compromise of the victim website, with an attempt to load a malicious JavaScript file.Website visitors met with an unwarranted prompt for credit card information.Spoofing of the legitimate domain ‘api.jquery.com’; the attackers used a similar domain ‘apiujquery[.]com’.C2 server used to serve the secondary payload, allowing for JavaScript injections into pages when certain keywords were triggered, e.g., ‘checkout’, ‘my-account’, ‘order’. C2 server located at 51.178.8.230 (AS16276 - OVH).At some stage after the publication of this blog, the C2 server was moved to 185.215.113.5.Figure 16: Current Campaign C2 Details\nBased on our threat telemetry for 185.215.113.5, we have observed at least 50 unique victims connecting to the C2 server over the past three months.Reviewing the current campaign, it appears very similar to the one reported on nearly a year ago. The first JavaScript injection payload sends a unique hash to the C2 to register and identify the victim on the admin side.However, some updates to the second stage payload have been noted. Firstly, the ‘triggered words’ list has been updated to include several more keywords.Figure 17: Triggered Words ListSecondly, an additional C2 server was identified, hosted on 185.215.113.20. Both the initial and the ‘new’ C2 server share the same SSH Server Host Key value.Figure 18: SSH Server Host Key MatchThe current IOCs for this campaign are therefore as follows:apiujquery[.]com | 185.215.113.5C2: http://apiujquery[.]com/ajax/libs/jquery/3.5.1/jquery-3.12.0.min.js?iapigstatic[.]com | 185.215.113.20C2: https://apigstatic[.]com/ajax/libs/jquery/5.1.7/jquery-7.41.3.min.js?iBig Picture - Summary of InfrastructureFigure 19: Malicious Activity Cluster within AS51381Big Picture - AS DetailsIn late 2020, when the ASs were first allocated to ELITETEAM, they were initially declared as Russian before being updated to reflect their status as Seychellois, as is the case today.Figure 20: ASN Description Information for AS51381 and AS60424Digging deeper into the details surrounding the ASs assigned to ELITETEAM, looking at information such as netblock announcements and peering, we were able to establish further ties to Russia.Figure 21: ELITETEAM PeersIndeed, all ASs connected to the ELITETEAM infrastructure are owned by Russian entities:AS3555 | Crex Fex Pex Internet System Solutions LLC | Announcing AS51381 until January 2021AS203804 | AS Infolika | Peer until February 2021AS213254 | OOO RAIT TELECOM | Peer until August 2022AS49612 | DDOS-GUARD LTD | Current peer as of September 2022AS3175 | Filanco LLC | Owned by Datahouse.ru, another Russian BPH provider for which ELITETEAM is an upstream peerAS213254 (OOO RAIT TELECOM) was seized by US law enforcement (ICE - Homeland Security Investigations) in early September 2022 and is currently no longer visible on the routing table.Figure 22: US Law Enforcement Takedown of AS213254It is possible that at some stage in the chain the operators were aware of the law enforcement action, as there was a migration observed in August 2022, where for a period both AS213254 and AS49612 were observed as peers for AS51381.As outlined throughout this blog, ELITETEAM enables malicious activity on a significant scale, allowing threat actors to operate with impunity against global targets, who in some cases appear to be individuals with surplus funds with which to invest or experiment with digital currencies, and in others just your average Joe Public. We have observed varying campaigns and TTPs, indicating diverse usage of ELITETEAM’s services by threat actors of varying skill sets. It is not often sound advice to say, ”block all connections to a /24”, but in respect of the infrastructure assigned to ELITETEAM, overwhelming evidence compels us to suggest this to be the case. All the data and information we have researched points to ELITETEAM being Russian / Russian-speaking, operating behind a shell organization in Seychelles. We have reason to believe that Datahouse, RU is connected to ELITETEAM and worthy of further investigation.Figure 23: Obi Wan Kenobi Encountering ELITETEAMNetblock:​185.215.113[.]0/24Amadey C2s on 2022/09/21:​185.215.113[.]15 185.215.113[.]92 185.215.113[.]204 185.215.113[.]35 185.215.113[.]114 185.215.113[.]205Phishing IPs:​185.215.113[.]100185.215.113[.]201185.215.113[.]206Phishing domains:​agricole-sms[.]orgermac[.]icubonus-agricole[.]plreleyfi-login.comebien[.]appreleyfi-login.flipflop[.]apprelayfi-login.zenquickcash[.]netscipost-xmeta[.]orggeekgirlacademy[.]comicepapers[.]comhoamelgar[.]comwilliamsaraujo[.]comzspacelab[.]netcv19alert[.]comSkimmer IPs:​185.215.113[.]5 185.215.113[.]20Skimmer domains:​apiujquery[.]comapigstatic[.]comFile sharing websites used to drop payloads:​uploadgram[.]memediafire[.]compu-file[.]comhero-files[.]comRedLine Stealer payloads:​00580a4220102211f07bb54041d6f49c6995b86948fbfaf98c720e7fdfd4214c0258c677f58e13433e8aea350caa1f4643ce4fe24be6d28278915176572af3ca 02b0b5d59068e9f00daa7ee2d4c3027e902c32038868f5de00b710ab7c7e9182 0e29a97e3bb46d462f39ffdaa95e8cd439afbc28c8827a755563e7a0f8c980b9 016da58a917c5aad423db3c50cc75e351e62926c0e0c8e00a5c1de0ec6fc84af 00649bad6081d82108bbde63efaab243b0d5f5f95dc99f9c46fa5ecd74c584b4 02f1627f1a3e2f8531e2217ed28e420b717355ef15ca42bd9734b356f2bb2285 76f4e8c50ece719c504376db8e131a8afcf8307e21ec864439452ac66f1da7ff 09de0dca1123d58508f85013bfd94c764b9d0ba45bd556b7e5b9f81df471eed8 3b4140faaa3828375888ca2ff1152fdf46529175ee49931ad8a20f52e0cdb058 13f672297f1efe6a3eb73b8d3d7f2fa89117feef14a61054ccbde74a07ae2ef0 4f3d55a6d73b630dfae91b89f98643462862a2b0264867752b802d0c1a8729e4 Amadey payloads:​e49833410fea53f166523cc960fc7d60ddfcf60d0fc2024e68dbabab27ce8313232a7888f79f09c47258df130cbf4e854c7a5e0af0a534e5d918bbe7b4a9cd5a 53463b214577f4ea17e629a8516b21584ceaef323880a7660b2ec6015a0da617 7bc6a9edc592553dcb9250d70816f511d43a998f95f4e0b2a347dc2b66f897c4 b9fa703b80c7d124148f64ae3474f1f2b01a42cd1ed6871be2bb6c9d15ecf871 134ed27da9f9e727a3e6b4c551655d93f4e18969836ae94f0d59ddae09bbd0d1 f6740bc4e0f17e6642dcb7343e768b0ff357c4b62508de0db21553014c3fb231 IDS Rules:MALWARE-CNC Win.Trojan.Redline variant outbound request detectedET DROP Spamhaus DROP Listed Traffic Inbound group 22ET DROP Spamhaus DROP Listed Traffic Inbound group 21ET MALWARE Amadey CnC Check-InET INFO Executable Retrieved With Minimal HTTP Headers - Potential Second Stage DownloadMALWARE-CNC Win.Trojan.Amadey botnet outbound connectionOther Considerations:Monitor external assets and endpoints for connections to the netblock assigned to ELITETEAM, in addition to the phishing and C2 IPs provided above.FOLLOW US0900-1700 ET1400-2200 UTCEmergencies: +1 847-378-3301© 2023 Team Cymru. All Rights Reserved."
   },
   {
      "time": "2022-10-05",
      "title": "Hackers are breaching scam sites to hijack crypto transactions",
      "text": " In a perfect example of there being no honor among thieves, a threat actor named 'Water Labbu' is hacking into cryptocurrency scam sites to inject malicious JavaScript that steals funds from the scammer's victims.Liquidity mining is when an investor lends their crypto to a decentralized exchange in exchange for high rewards, commonly generated through trading fees.However, instead of creating their own scam sites, Water Labbu hacks into these types of fake dApp sites and injects JavaScript code into site's HTML.The hackers do not engage with the victims and instead leave all the social engineering work to the scammers.When an investor connects to their wallet to the dApp, Water Labbu's script will detect if it contains a lot of crypto holdings, and if so, attempts to steal it using multiple methods described below.According to the analysts, Water Labbu has compromised at least 45 scam websites, most following the “lossless mining liquidity pledge” theme.Trend Micro says the profit made by Water Labbu is estimated to be at least $316,728 based on transaction records from nine identified victims.The parasitic threat actor locates cryptocurrency scam websites and injects the “dapps” with malicious scripts that easily blend with the website’s systems.“The injected payload then creates another script element that loads another script from the delivery server tmpmeta[.]com.”The script monitors newly connected wallets on the scam sites and retrieves the address and balances of TetherUSD and Ethereum wallets.If the balance is above 0.005 ETH or 22,000 USDT, the target is valid for Water Labbu, and the script then determines if the victim is using Windows or a mobile OS (Android, iOS).If the victim is on a mobile device, Water Labbu's malicious script sends a transaction approval request via the dApp site, so it appears as if it comes from the scam website.If the recipient agrees to the transaction, the malicious script will drain the wallet of its funds and send them to an address owned by Water Labbu.For Windows users, the hacked sites will show a fake Flash Player update notice overlayed on the scam site instead. The Flash installer is, in reality, a backdoor fetched directly from GitHub.The threat actors then use this backdoor to steal cryptocurrency wallets and cookies from the device.For victims, the result is the same; they lose all of their cryptocurrency.The only thing that has changed with this attack is that the victim's digital assets are diverted from the original scammer to the Water Labbu hacking group.To avoid these types of scams, always research dApp sites, especially liquidity mining platforms, to determine if they are legitimate before you connect your wallet to them.Also, periodically review your wallet's allowed sites to make sure you did not inadvertently add a scam site."
   },
   {
      "time": "2022-10-05",
      "title": "Cheerscrypt ransomware linked to a Chinese hacking group",
      "text": " The Cheerscrypt ransomware has been linked to a Chinese hacking group named 'Emperor Dragonfly,' known to frequently switch between ransomware families to evade attribution.The ransomware gang is tracked under different names, such as Bronze Starlight (Secureworks) and DEV-0401 (Microsoft), and has been seen using a wide variety of ransomware families since 2021.While the hacking group appears to operate as a ransomware operation, previous research indicates that many of their victims are targets of interest for the Chinese government.This has led researchers to believe that the ransomware activities of the hacking group could be a cover for Chinese government-sponsored cyber espionage campaigns.Next, the intruders dropped a Cobalt Strike beacon connected to a C2 address previously associated with Night Sky operations.The attackers deployed three Go tools rarely seen in the ransomware space: a modified Aliyun OSS keylogger, a customized version of the 'IOX' port-forwarding and proxy tool, and a customized version of the 'NPS' tunneling tool.After reconnaissance and lateral movement, following in the footsteps of past Night Sky attacks, the ransomware strain deployed was not Night Sky but Cheerscrypt, encrypting Windows and Linux ESXi machines.Like other enterprise-targeting ransomware groups, the hackers breach networks, steal data, and encrypt devices. The data is then used in double-extortion tactics to pressure a victim into paying a ransom. If a ransom is not paid, the stolen data is published on a data leak site, shown below.The ransomware group isn't operating as a RaaS (Ransomware-as-a-Service) platform for affiliates but rather as a \"lone wolf\" isolated from the rest of the cybercrime community.\"Differing from the other RaaS developers, affiliates, and access brokers profiled here, DEV-0401 appears to be an activity group involved in all stages of their attack lifecycle, from initial access to ransomware development,\" explained the Microsoft threat intelligence researchers.\"Despite this, they seem to take some inspiration from successful RaaS operations with the frequent rebranding of their ransomware payloads.\"Like Secureworks, Microsoft also found them constantly switching between ransomware brands, including additional strains, such as LockFile and LockBit 2.0.No matter what the real goal of 'Emperor Dragonfly' is, as the group commonly targets vulnerabilities in Internet-exposed servers, it is essential to apply security updates to your devices as soon as possible.As the group is known to target the Log4j vulnerability in VMware Horizon servers, applying patches to these devices should be a priority for all organizations."
   },
   {
      "time": "2022-10-05",
      "title": "NetWalker affiliate sentenced to 20 years in prison",
      "text": " A Canadian affiliate of the NetWalker ransomware group was sentenced to 20 years in prison Tuesday for his role in a hacking campaign targeting a Florida company.“You have one of the worst cases I’ve ever seen,” the judge told the defendant. “This is Jesse James meets the 21st century.”The charges against Vachon-Desjardins — related to computer fraud, wire fraud, and damaging computers — carried a combined maximum prison sentence of 40 years, but he agreed to cooperate in exchange for leniency. Jude Jung suggested he would have sentenced Vachon-Desjardins to life in prison if he had gone to trial, the Tampa Bay Times reported.Although NetWalker at the time of Vachon-Desjardins’ attacks was one of the most prolific ransomware groups, law enforcement authorities in the U.S., Canada, and Bulgaria managed to take over the group’s servers in January 2021 — the same time they unsealed the indictment against Vachon-Desjardins.As part of his sentencing on Tuesday, Vachon-Desjardins was ordered to serve three years of supervised release after he leaves prison, and is prohibited from owning a computer — including a smartphone or electronic device capable of connecting to the internet — or holding information technology jobs. Prosecutors said Vachon-Desjardins was working in IT for the Canadian government while conducting ransomware attacks.Adam Janofsky is the founding editor-in-chief of The Record by Recorded Future. He previously was the cybersecurity and privacy reporter for Protocol, and prior to that covered cybersecurity, AI, and other emerging technology for The Wall Street Journal.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-05",
      "title": "Hacker returns nearly $19 million stolen on Transit Swap DeFi platform",
      "text": " Transit Swap — a cryptocurrency platform that calls itself a “decentralized exchange” — said a hacker has returned most of nearly $30 million that was stolen over the weekend. All of the refunds were provided by the same hacker. Transit Swap said it is still investigating the incident in an effort to recover all of the stolen user funds. “We hope that other hackers who participated in this incident will return the users' assets as soon as possible to avoid escalating the situation,” the company said, although it was unclear if other perpetrators are suspected. “The project team is rushing to collect the specific data of the users and formulate a specific return plan,” the spokesperson said. The company warned of fraudsters who may use the incident to steal more data or private keys to crypto wallets. In a message on Saturday night, the company explained that the hacker took advantage of a vulnerability in their code to kickstart the attack. 2/2 We and the security company are tracking the relevant data on-chain, and we will make further announcements about this event later!On the blockchain, several messages are attached to the stolen funds being transferred away from — and then back to — Transit. The hacker appeared to be angered by a bug bounty offer, which is effectively a ransom price for the disclosure of the vulnerability and the return of the stolen funds. “If I attack other chains like FTM, TRON, POLYGON, I believe I can get $100 million. With reference to past Nomad and Wintermute events, I should get a higher bounty than what I get now. It's hard not to suspect that this is your official backdoor, and you should be happy that the exploit was done by me and no one else,” the hacker said in one message shared by PeckShield.In a message hours later, the hacker changed their tune, thanking Transit and pledging to be better about communicating with victims during the next hack. “Based on the principle of improving the code security of the web3 world, I spent a lot of time and energy to audit the code of the project and successfully exploit this vulnerability,” the hacker said. “In the future, I will conduct friendly communication in advance based on the principle of bug bounty. Thanks!”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-05",
      "title": "Hackers stole data from US defense org using Impacket, CovalentStealer",
      "text": " The U.S. Government today released an alert about state-backed hackers using a custom CovalentStealer malware and the Impacket framework to steal sensitive data from a U.S. organization in the Defense Industrial Base (DIB) sector.The compromise lasted for about ten months and it is likely that multiple advanced persistent threat (APT) groups likely compromised the organization, some of them gaining initial access through the victim’s Microsoft Exchange Server in January last year.Entities in the Defense Industrial Base Sector provide products and services that enable support and deployment of military operations.They are engaged in the research, development, design, production, delivery, and maintenance of military weapons systems, including all necessary components and parts.A joint report from the Cybersecurity and Infrastructure Agency (CISA), the Federal Bureau of Investigation (FBI), and the National Security Agency (NSA) provides technical details collected during incident response activity that lasted between November 2021 and January 2022.The hackers combined custom malware called CovalentStealer, the open-source Impacket collection of Python classes, the HyperBro remote access trojan (RAT), and well over a dozen ChinaChopper web shell samples.At the time, Microsoft had detected the ProxyLogon exploit chain when the vulnerabilities were zero days (unknown to the vendor), in attacks attributed to a Chinese state-sponsored hacking group they call Hafnium.While the initial access vector is unknown, the current advisory notes that the hackers gained access to the organization’s Exchange Server in mid-January 2021.Within four hours, the threat actor started mailbox searches and used a compromised administrator account belonging to a former employee to access the Exchange Web Services (EWS) API, which is used for sending and receiving web service messages from client applications.Less than a month later, in early February 2021, the attackers accessed the network again using the same admin credentials through a virtual private network (VPN) connection.After four days, the hackers engaged in reconnaissance activity using command shell. They learned about the victim’s environment and manually archived (WinRAR) sensitive data, e.g. contract-related information stored on shared drives, preparing it for exfiltration.At the beginning of March, the hackers exploited the ProxyLogon vulnerabilities to install no less than 17 China Chopper web shells on the Exchange Server.China Chopper carries powerful capabilities in a very small package (just 4 kilobytes). It was initially used by Chinese threat actors but it became so popular that other groups adopted it.Activity to establish persistence on the network and to move laterally started in April 2021 and was possible Impacket, which allows working with network protocols.CISA says that the attacker used Impacket with the compromised credentials to obtain a service account with higher privileges, which enabled remote access from multiple external IP addresses to the organization’s Exchange server through Outlook Web Access (OWA).Accessing the remote Exchange Server was done through services from two VPN and virtual private server providers, M247 and SurfShark, a common tactic to hide the interaction with the victim network.Burrowed deeply in the victim network, the hackers relied on the custom-built CovalentStealer to upload additional sensitive files to a Microsoft OneDrive location between late July and mid-October 2022.CovalentStealer also contains resources for encrypting and decrypting the uploaded data, and configuration files, and to secure communications.The U.S. government at this time does not provide an indication about the origin of the threat actors but notes that “CISA uncovered that likely multiple APT groups compromised the organization’s network.”A set of recommendations are available in the joint report for detecting persistent, long-term access threat activity, one of them being to monitor logs for connections from unusual VPSs and VPNs.Defenders should also examine connections from unexpected ranges and, for this particular attacker, check for machines hosted by SurfShark and M247.Monitoring for suspicious account use, such as inappropriate or unauthorized use of administrator accounts, service accounts, or third-party accounts, is also on the list.The use of compromised credentials with a VPS may also indicate a potential breach that could be uncovered by:"
   }
]