[
   {
      "time": "2022-12-17",
      "title": "Digging into the numbers one year after Log4Shell | SC Media",
      "text": "  One year after the Log4Shell vulnerability was discovered, researchers tell SC Media that widespread exposure remains rampant as the sky-high costs of detection and remediation start to come into focus. (Image credit: style-photography via Getty)A year ago, when the Log4Shell vulnerability was first disclosed, perhaps no sector responded as quickly and decisively as the federal government.Within days of the bug’s disclosure, the Cybersecurity and Infrastructure Security Agency at the Department of Homeland Security issued an emergency directive ordering civilian federal agencies to identify all software solution stacks accepting data input from the internet, map them to a government-run GitHub repository of known software assets using the vulnerable code, patch known affected instances and request additional scrutiny for internet connected solutions that were not on the list. Agencies were given less than week to patch their affected systems or pull them from the internet. On top of all that, CISA led a frenetic national coordination effort to remediate the bug, pulling in cybersecurity experts, members of industry, major software and hardware providers and other stakeholders to spread awareness, identify affected assets and reduce the nation’s overall attack surface by patching as many systems as possible.  If any organization was going to be able to quickly find and inoculate themselves from Log4j, it should have been the federal government.  From the time it was introduced, researchers warned that Log4Shell would remain in the digital ecosystem for years. The Iranian incident underscores just how difficult it has been even for motivated and well-resourced organizations to stay on top of the threat and remove it from their networks. In a statement sent to SC Media, CISA executive director Eric Goldstein did not directly answer questions about why the compromise was not found until months after agencies were ordered to scour their internal software but noted that discovery efforts would be an ongoing effort and that “while organizations across government and the private sector acted with urgency to mitigate assets running vulnerable versions of Log4j, we know that malicious cyber actors moved quickly to exploit vulnerable assets and continue to do so.” SC Media spoke with security researchers and vendors who have been tracking similar failures across the private sector, with alarming numbers of known internet-connected assets still vulnerable to Log4j today. According to Sonatype, the software supply-chain firm that runs Apache Maven Central (the largest Java package repository), one out of every four Log4j instances downloaded from the repository are still vulnerable today. More disturbingly, researchers from Tenable found that 72% of organizations worldwide remain vulnerable to the Log4Shell, highlighting its sticking power and remediation challenges. “These earth-shattering data is a lesson to the security community, and we clearly have a long way to go,” Brian Fox, cofounder and chief technology officer at Sonatype, said in an interview.  Log4Shell is hard to eradicate due to the sheer size of its attack surface and how easy it is to exploit.  Bugs in an operating system or a popular browser typically only affect the users of that system or browser, and the problem will be fixed once the security team patches the issue. Log4Shell is different. By targeting the logging systems that countless developers have relied on, it has a much larger attack surface and compromised millions of vulnerable Java applications and services worldwide, including Cloudflare, iCloud, Minecraft servers, Steam, TencentQQ, and Twitter.  In addition, attackers can easily exploit the vulnerability as it does not require any privileged access or special configuration. All they have to do is to locate an input field that gets logged and write a simple string of code, said Yotam Perkal, director of vulnerability research at Rezilion.  In response to the ubiquitous nature of Log4Shell, security teams in the private sector have spent days and nights to detect and patch vulnerable versions in a timely manner. However, hunting Log4Shell is easier said than done.  Software projects are usually built on top of a mountain of dependencies where developers incorporate external software libraries into the projects and add additional functionality. While some developers knowingly and directly use log4j in their software, others may have code that relies on other open source programs in order function – and those programs could also be vulnerable. This weakness, known as transitive dependency, means undocumented pieces of code may bury the vulnerable versions of Log4Shell multiple levels deep in data, said Stephen Magill, vice president of product innovation at Sonatype.  According to Magill, approximately 70,000 open-source projects use log4j as a direct dependency, while nearly 174,000 projects use it as a transitive dependency.  “70,000 is already a substantial number showing that many projects are directly vulnerable. But if you add on transitive dependency, the number of affected projects is more than doubled, making hunting and remediation even more difficult,” Magill said.  To fully detect the vulnerable versions in all dependencies, organizations need to be more patient with running their test, said Jason Kent, hacker in residence at Cequence Security.  “We found that a lot of organizations do not wait long enough [with their tests]. They only wait for five minutes after they send the test in, and then they move on to the next test. The vulnerable versions can be deep in multiple layers, and we have seen 24 or 48 hours before something triggers and sends it back to us,” Kent explained.  However, Kent said that even if organizations fully detect the vulnerable versions and patch them quickly, they still should not drop their guard as Log4Shell can be reintroduced to the applications anytime developers add new systems or assets to their environments.  Indeed, recent research by Tenable shows that among the vulnerable assets identified during the initial disclosure, nearly one-third (29%) of them had recurrences of Log4Shell after full remediation was achieved.  “The addition of new systems and assets is the most frequent action that inadvertently reintroduces Log4Shell. If organizations do not address the issue on the left side — in the build pipeline — they will continue to deploy vulnerable code,” said Bob Huber, chief security officer and head of research at Tenable. “As it stands, many organizations address the issue on the right side — in their runtime environment — only to be replaced with another insecure build. Identifying every instance of insecure code in use is nontrivial for most organizations, including third parties.” Besides the Iranian government-sponsored attack disclosed last month, multiple other nation-state-backed actors have been reported using Log4Shell to compromise target networks. In March, for example, Chinese threat actor Deep Panda has been observed to use an identical vector to deploy a backdoor and attack mainly US-based government entities, while the North Korea’s Lazarus group has been found using the same technique to conduct cyber espionage and ransomware attacks.“[Just because] people don’t see headlines does not mean the attacks are not happening,” Fox said.When it comes to evaluating the impact of Log4Shell, organizations should not only look at the number of publicly disclosed attacks but also consider the economic cost of detection and remediation, said Dan Lorenc, founder and CEO of Chainguard.  “Hunting and patching Log4Shell is very costly. Over the past year, it has cost companies billions of dollars to get through the mitigations, along with a lot of security folks sacrificing their weekends and holiday breaks to handle the issues,” Lorenc said.  To quantify the cost and draw a more comprehensive picture of Log4Shell, Arctic Wolf noted that the average cost of a Log4j incident response over the past year has amounted to $90,000, while GuidePoint Security suggested that the cost for a single Log4j hunt can also reach to $33,000. “[The high cost] was due to numerous factors, including the breadth of Log4j across various software and solutions, as well as the client’s inability to easily identify where it was running, whether it was vulnerable, and even potentially exploited. Therefore, we seem to receive more requests for assistance in helping clients perform these tasks, which obviously has supplemental costs to their typical vulnerability management processes,” said Mark Lance, vice president of DFIR and Threat Intelligence at GuidePoint Security.  “Also, given that the vulnerability took almost the whole IT department, security teams, and application owners, and even many non-security-oriented teams’ effort in the first month of its disclosure, I would estimate the mitigation of Log4j took up 10% to 12% budget from each team (including incident response) over the past year,” Alex Kozodoy, cyber research manager at Deep Instinct, added.  Security researchers said that organizations should take those losses as lessons that could help them better balance the prevention and mitigation of vulnerabilities in the upcoming year.  “I figured all organizations knew about their network vulnerabilities. But what I have learned [from Log4Shell] is that is not the case. Most organizations, no matter how large or small they are, are truly blind to what they have exposed to the internet,” said Justin Fier, VP of Tactical Risk and Response at Darktrace.  “Be sure to get your organizational bill of materials under control. If I told you about a new vulnerability right now, and you cannot answer me if you are using that component anywhere in your portfolio, you should better get started because the next Log4Shell may be right around the corner,” Fox said.  Menghan Xiao is a cybersecurity reporter at SC Media, covering software supply chain security, workforce/business, and threat intelligence. Before SC Media, Xiao studied journalism at Northwestern University, where she received a merit-based scholarship from Medill and Jack Modzelewski Scholarship Fund.Okta had 4,961 current and former employees' data, including names, health insurance plan numbers, and Social Security numbers, compromised following a breach at its third-party vendor Rightway Healthcare, reports The Register.The SEC alleges SolarWinds and CISO Tim Brown defrauded investors by not disclosing security risks ahead of the 2020 Orion Sunburst attacks.Five Ontario, Canada-based hospitals had their operations disrupted following a cyberattack against their shared service provider TransForm, which was co-founded by the impacted health providers for IT and supply chain management, reports BleepingComputer.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-12-17",
      "title": "Researcher Bypasses Akamai WAF",
      "text": " Akamai's Web application firewall (WAF) is intended to fend off potential attacks like distributed denial-of-service (DDoS), but a researcher discovered a way to bypass its protections by using complex payloads to confuse its rules. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-17",
      "title": "GitHub rolls out free secret scanning for all public repositories",
      "text": " GitHub is rolling out support for the free scanning of exposed secrets (such as credentials and auth tokens) to all public repositories on its code hosting platform.Secret scanning is a security option that organizations can enable for additional repository scanning to detect accidental exposure of known types of secrets.It works by matching patterns provided by partners and service providers or defined by the organization. Each match is reported as a security alert in the repos' Security tab or to partners if a partner pattern triggers the match.Previously, the secret scanning service was only available to orgs using GitHub Enterprise Cloud with a GitHub Advanced Security license.Since the start of this year alone, the company said it issued over 1.7 million alerts of potential secrets exposed in public repositories.\"Today, we're starting to roll out secret scanning to all free public repositories in the GitHub community, for free,\" GitHub's Mariam Sulakian and Zain Malik said on Thursday.\"We'll begin our gradual public beta rollout of secret scanning for public repositories today and expect all users to have the feature by the end of January 2023.\"Once enabled on a repository, GitHub will automatically notify developers of leaked secrets in code, thus allowing organizations to easily track alerts, identify a leak's source, and quickly take action to prevent the fraudulent use of any secrets committed to a public repo by accident.To toggle on secret scanning alerts for free public repositories, you have to go through the following steps:Enabling secrets scanning is an easy way for organizations using GitHub to increase supply-chain security and safeguard themselves from accidental leaks."
   },
   {
      "time": "2022-12-17",
      "title": "Cuban Ransomware Gang Hacked Devices via Microsoft Drivers - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-12-17",
      "title": "Australian fire service operating 85 stations shuts down network after cyberattack",
      "text": " A cyberattack caused “a widespread IT outage” affecting Fire Rescue Victoria’s (FRV) emails, phones and emergency dispatch systems that automate firefighters' work — for example, opening station doors as soon as firefighters receive an emergency call.FRV operates 85 stations across the state, which includes Melbourne and is home to about 6.5 million people. It was established in 2020 as part of reform efforts aimed at modernizing the state’s fire and rescue response efforts.Victoria’s fire crew continues to operate as usual but has to use manning radios, pagers and mobile phones to respond to triple-zero calls. The system shutdown may last for up to four days while the incident is under investigation, according to the department’s acting commissioner Gavin Freeman.The department’s network outage was first discovered early on Thursday, but officials didn't attribute it to a cyberattack at the time. Although the cyberattack mostly affected the emergency dispatch system, the fire service had to shut down its entire network as a precaution. There were no ransomware demands at the early stage of the investigation, according to Freeman.FRV said it is “working around the clock” with local cybersecurity firms and the government to get its systems back up and running and find the cause of the incident.“We’ll put everything in place to mitigate it and ensure that it doesn’t happen again,” Freeman said.FRV did not respond to a request for comment at the time of publication.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-12-17",
      "title": "HHS reports third-party vendor incident compromised health data of 254K | SC Media",
      "text": "  The investigation is ongoing, but the initial information suggests that Healthcare Management Solutions, a subcontractor of ASRC Federal Data Solutions, “acted in violation of its obligations to CMS.” The notice does not provide further details into what those actions may have been. On the whole, the sector relies on a massive amount of third-party vendors and business associates to maintain daily operations. But each additional contract further expands the threat landscape, which has been compounded in recent years by the uptick in outsourced services and the spate of critical infrastructure attacks.The CMS incident should serve as a warning for provider organizations that these types of breaches can affect anyone in healthcare.The new notice does not detail the specific threat behind the breach, just that the subcontractor notified CMS on Oct.9 that a cybersecurity incident hit its systems. About a week later, CMS confirmed “with high confidence” that protected health information and personally identifiable information for some Medicare enrollees was affected by the incident.In response, CMS worked with the contractor to determine just what information was involved and confirmed no CMS systems were breached, nor any Medicare claims data.Under its contract with ASRC, the vendor provides CMS with services for resolving system errors tied to Medicare beneficiary entitlement and premium payment records and support the collection of Medicare premiums from the direct-paying beneficiary population.As such, the compromised data could include names, dates of birth, Social Security numbers, contact details, Medicare beneficiary identifiers, banking information, Medicare entitlement information, enrollment, and premiums. All impacted patients will receive an updated Medicare card with a new beneficiary identifier and free credit monitoring services.CMS is continuing to assess the impact of the incident, while supporting the impacted individuals. CMS Administrator Chiquita Brooks-LaSure explained in a statement that they’ll “take all necessary actions needed to safeguard the information entrusted to CMS.”The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Okta had 4,961 current and former employees' data, including names, health insurance plan numbers, and Social Security numbers, compromised following a breach at its third-party vendor Rightway Healthcare, reports The Register.The SEC alleges SolarWinds and CISO Tim Brown defrauded investors by not disclosing security risks ahead of the 2020 Orion Sunburst attacks.Five Ontario, Canada-based hospitals had their operations disrupted following a cyberattack against their shared service provider TransForm, which was co-founded by the impacted health providers for IT and supply chain management, reports BleepingComputer.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-12-17",
      "title": "Phishing attack uses Facebook posts to evade email security",
      "text": " A new phishing campaign uses Facebook posts as part of its attack chain to trick users into giving away their account credentials and personally identifiable information (PII).The emails sent to targets pretend to be a copyright infringement issue on one of the recipient's Facebook posts, warning that their account will be deleted within 48 hours if no appeal is filed.The link to appeal the account deletion is an actual Facebook post on facebook.com, helping threat actors bypass email security solutions and ensure their phishing messages land in the target's inbox.The Facebook post pretends to be \"Page Support,\" using a Facebook logo to appear as if the company manages it.However, this post includes a link to an external phishing site named after Meta, Facebook’s owner company, to slightly reduce the chances of victims realizing the scam.Trustwave's analysts who discovered the phishing campaign found the following three URLs, which remain online when writing this.The phishing sites are crafted with care to make them appear like Facebook's actual copyright appeal page, containing a form where victims are requested to enter their full name, email address, phone number, and Facebook username.Upon submission of this data, the page also collects the victim’s IP address and geolocation information and exfiltrates everything to a Telegram account under the threat actor’s control.The threat actors might collect the extra information to bypass fingerprinting protections or security questions while taking over the victim's Facebook account.Meanwhile, a redirection takes the victim to the next phishing page, which displays  a fake 6-digit one-time password (OTP) request with a timer.Whatever code the victim enters will result in an error, and if the 'Need another way to authenticate?' is clicked, the site redirects to the actual Facebook site.Trustwave’s analysts also discovered that the threat actors use Google Analytics on their phishing pages to help them track the efficiency of their campaigns.Trustwave reports it has found numerous Facebook accounts using phony posts made to appear as support pages that lead victims to phishing websites.These posts use URL shorteners for linking to phishing sites to evade getting flagged and removed by the social media platform.Victims may land on these posts via phishing emails, like in the campaign presented in this report, or via instant messages received on Facebook."
   },
   {
      "time": "2022-12-17",
      "title": "Microsoft warns of new Minecraft DDoS malware infecting Windows, Linux",
      "text": " A new cross-platform malware botnet named 'MCCrash' is infecting Windows, Linux, and IoT devices to conduct distributed denial of service attacks on Minecraft servers.The botnet was discovered by Microsoft's Threat Intelligence team, who report that once it infects a device, it can self-spread to other systems on the network by brute-forcing SSH credentials.\"Our analysis of the DDoS botnet revealed functionalities specifically designed to target private Minecraft Java servers using crafted packets, most likely as a service sold on forums or darknet sites,\" explains the new report by Microsoft.Currently, most of the devices infected by MCCrash are located in Russia, but there are also victims in Mexico, Italy, India, Kazakhstan, and Singapore.Microsoft says that devices are initially infected with MCCrash after users install fake Windows product activator tools and trojanized Microsoft Office license activators (KMS tools).The cracking tools contain malicious PowerShell code that downloads a file named 'svchosts.exe,' which launches 'malicious.py,' the primary botnet payload.MCCrash then attempts to spread to other devices on the network by performing brute-force SSH attacks on IoT and Linux devices. \"The botnet spreads by enumerating default credentials on internet-exposed Secure Shell (SSH)-enabled devices.Because IoT devices are commonly enabled for remote configuration with potentially insecure settings, these devices could be at risk to attacks like this botnet.The botnet’s spreading mechanism makes it a unique threat, because while the malware can be removed from the infected source PC, it could persist on unmanaged IoT devices in the network and continue to operate as part of the botnet.\" - Microsoft.The malicious Python file can run on both Windows and Linux environments. Upon the first launch, it establishes a TCP communication channel with the C2 over port 4676 and sends basic host information, like what system it’s running on.On Windows, MCCrash establishes persistence by adding a Registry value to the \"Software\\Microsoft\\Windows\\CurrentVersion\\Run\" key, with the executable as its value.The botnet receives encrypted commands from the C2 server based on the OS type identified in the initial communication.The C2 will then send one of the following commands back to the infected MCCrash device to execute:Most of the above commands specialize in DDoS attacks on Minecraft servers, with ‘ATTACK_MCCRASH’ being the most notable due to using a novel method to crash the target server.According to Microsoft, threat actors created the botnet to target Minecraft server version 1.12.2, but all server versions from 1.7.2 and up to 1.18.2 are also vulnerable to attacks.Version 1.19, released in 2022, isn’t impacted by the current implementation of the ATTACK_MCCRASH, ATTACK_[MCBOT|MINE], and ATTACK_MCDATA commands.Still, a considerable number of Minecraft servers are running on older versions, most of them located in the United States, Germany, and France.To protect your IoT devices from botnets, keep their firmware up to date, change default credentials with a strong (long) password, and disable SSH connections if they’re not needed."
   },
   {
      "time": "2022-12-17",
      "title": "vx-underground",
      "text": " (if nothing happens, make sure javascript is enabled and allowed to execute, or try another browser)Your information could go here"
   }
]