[
   {
      "time": "2022-08-02",
      "title": "Movie torrents hijacked to send tips on bypassing Russian censorship",
      "text": "  A team of Ukrainian cyber-activists has thought of a simple yet potentially effective way to spread uncensored information in Russia: bundling torrents with text and video files pretending to include installation instructions.Named “Torrents of Truth,” the initiative is similar to “Call Russia,” a project to help break through Russian propaganda and open people’s eyes to what’s happening in Ukraine.The initiative creates torrents that contain a text file with a list of credible news sources that Russians can trust and instructions on downloading and installing a VPN to secure anonymity from ISPs.Enclosed videos show a graphic representation of the situation in Ukraine, highlighting examples of physical catastrophe and human suffering, the results of a military operation that Russian media present as a liberating intervention.Call Russia was eventually partially mapped and blocked by the Russian state, but torrents are a field that’s currently exploding in the country as a method of obtaining content presently unavailable in the country.The situation has created a fertile ground for Torrents of Truth to reach a sizable userbase without the Russian state having an easy way to stop it.At this time, Torrents of Truth has bundled 21 torrents with its text and video, selecting just-released movies, the latest episodes of popular shows, and pro-grade software tools.The actual content promised by the title appears to be included in the torrent file, so the activists simply sneak in the information they want to push to Russians with it. This also ensures that their torrents won’t be reported as fakes and removed from trackers.The torrents are uploaded to popular torrent tracking platforms that pirates use for searching, and thanks to volunteers who seed them aggressively, they rise in popularity and rank high in tracker results.Bleeping Computer advises against participating in P2P swarms sharing pirated content no matter how noble the purpose may appear, as the action still violates copyright laws.If you would like to help the project in some way while staying within legal limits, you could selectively download and seed the video and text files only."
   },
   {
      "time": "2022-08-02",
      "title": "Over 3,200 apps leak Twitter API keys, some allowing account hijacks",
      "text": " Cybersecurity researchers have uncovered a set of 3,207 mobile apps that are exposing Twitter API keys to the public, potentially enabling a threat actor to take over users' Twitter accounts that are associated with the app.When integrating mobile apps with Twitter, developers will be given special authentication keys, or tokens, that allow their mobile apps to interact with the Twitter API. When a user associates their Twitter account with this mobile app, the keys also will enable the app to act on behalf of the user, such as logging them in via Twitter, creating tweets, sending DMs, etc.As having access to these authentication keys could allow anyone to perform actions as associated Twitter users, it is never recommended to store keys directly in a mobile app where threat actors can find them.CloudSEK explains that the leak of API keys is commonly the result of mistakes by app developers who embed their authentication keys in the Twitter API but forget to remove them when the mobile is released.In these cases, an intruder exploiting the flaw could potential perform the following actions:One of the most prominent scenarios of abuse of this access, according to CloudSEK, would be for a threat actor to use these exposed tokens to create a Twitter army of verified (trustworthy) accounts with large numbers of followers to promote fake news, malware campaigns, cryptocurrency scams, etc.CloudSEK explains that the leak of API keys is commonly the result of mistakes by app developers who embed their authentication keys in the Twitter API, but forget to remove them when the mobile is released.In these cases, the credentials are stored within mobile applications at the following locations:CloudSEK recommends developers use API key rotation to protect authentication keys, which would invalidate the exposed keys after a few months.CloudSEK shared a list of impacted applications with BleepingComputer, with apps between 50,000 and 5,000,000 downloads, including city transportation companions, radio tuners, book readers, event loggers, newspapers, e-banking apps, cycling GPS apps, and more.Most applications publicly exposing their API keys haven't even acknowledged receiving CloudSEK's notices after a month since the cybersecurity firm alerted them, and most haven't addressed the issues.As such, BleepingComputer will not disclose the list of apps as they are still vulnerable to exploitation and Twitter account takeover.One notable exception was Ford Motors, which responded and deployed a fix on the 'Ford Events' app that was also leaking Twitter API keys."
   },
   {
      "time": "2022-08-02",
      "title": "Luxembourg energy companies struggling with alleged ransomware attack, data breach",
      "text": " Two companies based in Luxembourg are grappling with an alleged ransomware attack that began last week, the latest in a string of incidents involving European energy companies. Encevo Group said its Luxembourg entities Creos – an energy network operator – and the supplier Enovos were “victims of a cyberattack on the night of July 22.”Encevo is owned by the government of Luxembourg and several other companies, including China Southern Power Grid International. Creos helps run the country's electricity and gas network infrastructure, while Enovos is Luxembourg's main supplier. Creos confirmed in a statement last week that its phone lines were down but the company declined to elaborate further on Monday.“The group is currently making every effort to analyze the hacked data. For the moment, the Encevo Group does not yet have all the information necessary to personally inform each person potentially concerned,” the company said. On the website, Encevo said it filed a complaint with the Grand Ducal Police, and had notified Luxembourg’s National Commission for Data Protection, as well as the Luxembourg Institute of Regulation and other “competent ministries.”The group claims to have stolen 150 GB of data that they said includes contracts, passports, bills and emails. They threatened to leak the data on Monday but as of the afternoon, no data had been released. “Let’s just say: ‘We [have] borrowed their advantages and eliminated their disadvantages,’” the representative said, referring to Alphv's relationship with other incarnations of the gang.Callow noted that while neither the gas nor electricity supply was disrupted by this attack on Creos and Enovos, they could have been.“Colonial Pipeline, for example, didn’t stop moving oil because its pumps didn’t work in the attack, but because its billing system was knocked out,” Callow said. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-02",
      "title": "Eavesdropping Probe Finds Israeli Police Exceeded Authority - SecurityWeek",
      "text": " Hi, what are you looking for?An Israeli government investigation into the use of powerful eavesdropping technology by the police found that they only used it after securing a judicial warrant but that the flood of information exceeded the limits of their authority.ByFlipboardRedditWhatsappWhatsappEmailNSO says it sells the product only to government entities to fight crime and terrorism, with all sales regulated by the Israeli government. The company does not identify its clients and says it has no knowledge of who is targeted. Although it says it has safeguards in place to prevent abuse, it says it ultimately does not control how its clients use the software.\nThe Association for Civil Rights in Israel said the latest findings show “major failures” that raise concerns about privacy and the rights of suspects. It called on authorities to bar police from employing such technology until detailed legislation is implemented to govern its use.\nThe Association for Civil Rights in Israel said the latest findings show “major failures” that raise concerns about privacy and the rights of suspects. It called on authorities to bar police from employing such technology until detailed legislation is implemented to govern its use.\nSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailInfonetics Research has shared excerpts from its Mobile Device Security Client Software market size and forecasts report, which tracks enterprise and consumer security client...No one combatting cybercrime knows everything, but everyone in the battle has some intelligence to contribute to the larger knowledge base.Daniel Kelley was just 18 years old when he was arrested and charged on thirty counts – most infamously for the 2015 hack of...Apple rolled out iOS 16.3 and macOS Ventura 13.2 to cover serious security vulnerabilities.Critical security flaws expose Samsung’s Exynos modems to “Internet-to-baseband remote code execution” attacks with no user interaction. Project Zero says an attacker only needs...Samsung smartphone users warned about CVE-2023-21492, an ASLR bypass vulnerability exploited in the wild, likely by a spyware vendor.The FBI dismantled the network of the prolific Hive ransomware gang and seized infrastructure in Los Angeles that was used for the operation.The Hive ransomware website has been seized as part of an operation that involved law enforcement in 10 countries.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-08-02",
      "title": "Report: Pro-Russia groups raise $2.2 million in cryptocurrency to fund war",
      "text": " Both Ukraine and Russia have tapped into cryptocurrency markets to raise money for their military efforts. According to Chainalysis, the funds were sent to 54 pro-Russian groups that primarily used the donations to finance pro-Russian propaganda websites and purchase military equipment, including drones, weapons, bulletproof vests and communication devices.This equipment was allegedly delivered to Russian troops located in Ukraine’s Donbas region, where active fighting is taking place.Those groups have spent more than $14 million on drones, more than $5 million on military clothing and armor vests, about $4 million on an anti-war media campaign and $1 million to buy lethal weapons.Although the amount of digital currency donations collected by pro-Russia groups is much smaller, those funds could still make “a significant contribution” to its troops' effectiveness, according to Chainalysis.Russian-national Alexander Zhuchkovsky, for instance, promoted cryptocurrency donations on social media to finance the Russian ultranationalist organization Russian Imperial Movement, which has been designated as a terrorist group by the U.S. Another group that promoted crypto donations, Rusich, has been associated with the Wagner Group, a Russian private military company, also sanctioned by the U.S. One of Russia’s cryptocurrency fundraising campaigns, Project Terricon, received roughly 11% of its funds from mixing services that allow users to hide their activity on the Ethereum blockchain. Project Terricon sent nearly 30% of its funds to Bitzlato – a Moscow-based exchange that has facilitated approximately $1 billion worth of cryptocurrency money laundering since 2019, according to Chainalysis.While cryptocurrency donations allow countries to raise money quickly, they also have problems. Cryptocurrencies are rapidly losing value as the price of Bitcoin, the world’s most popular virtual currency, continues to fall. The price of Bitcoin has nearly been cut in half over the last year.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-02",
      "title": "Steam, PayPal blocked as Indonesia enforces new Internet regulation",
      "text": " The Indonesian Ministry of Communication and Information Technology, Kominfo, is now blocking access to internet service and content providers who had not registered on the country's new licensing platform by July 27th, 2022, as the country begins to restrict access to online content providers and services.The blocks appear to result from a coordinated action between Kominfo and all major ISPs (internet service providers) in the country. However, some smaller ones still stray from the new regulations.According to multiple user reports, VPNs can bypass the imposed blocks for now, but when using them with electronic payment services or gaming portals, there might be problems with network speed and account fingerprint mismatches.Due to the blocks, many PayPal users in Indonesia have been locked out of their accounts and funds. However, a spokesperson stated that the government might temporarily unblock payment platforms this week to allow withdrawals.The regulation orders the mandatory registration of all internet service providers into a new licensing platform allowing them to legally operate in the country. Those who fail to register are considered illegal entities and will be blocked from the Indonesian internet.The law requires all registered entities to assign a local representative and office that responds to censorship requests and unlimited information disclosure demands from the state.Any information published on registered service providers' platforms is subject to state scrutiny, as is any information about user accounts, communication on these sites, and all other forms of data exchange."
   },
   {
      "time": "2022-08-02",
      "title": "Watch Out For This Raccoon Stealer 2.0 With New Capabilities  - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-08-02",
      "title": "\r\n\tAustrian Investigation Reveals Spyware Targeting Law Firms, Finance Institutions - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe Austrian government said on Friday it was investigating a company based within the nation’s territory for allegedly developing spyware targeting law firms, banks, and consultancies across at least three countries.According to the tech giant, Subzero was developed by Vienna-based company DSIRF (tracked by Microsoft under the codename KNOTWEED), and deployed through a variety of methods, including 0-day exploits in Windows and Adobe Reader.For context, DSIRF operates under the guise of helping multinational corporations conduct risk analysis and collect business intelligence.However, Microsoft’s advisory has linked the company to the sale of spyware used for unauthorized surveillance.“It’s important to note that the identification of targets in a country doesn’t necessarily mean that a DSIRF customer resides in the same country, as international targeting is common.”Microsoft said it found multiple links between DSIRF and the exploits and malware used in these attacks. “These include command-and-control infrastructure used by the malware directly linking to DSIRF, a DSIRF-associated GitHub account being used in one attack, a code signing certificate issued to DSIRF being used to sign an exploit, and other open-source news reports attributing Subzero to DSIRF.”Additionally, the security researchers explained that, while exploiting CVE-2022-22047 requires attackers to be able to write a DLL to disk, in the threat model of sandboxes (like Adobe Reader and Chromium), the ability to write out files where the attacker cannot control the path isn’t considered dangerous. “Hence, these sandboxes aren’t a barrier to the exploitation of CVE-2022-22047.”“Microsoft Defender Antivirus detects the malware tools and implants used by KNOTWEED starting with signature build 1.371.503.0.” Despite the advisory, Austria's interior ministry said it had not recently received reports of any incidents. DSIRF also refuted the claims in an article by Austria's Kurier newspaper."
   },
   {
      "time": "2022-08-02",
      "title": "BlackCat ransomware claims attack on European gas pipeline",
      "text": " The ALPHV ransomware gang, aka BlackCat, claimed responsibility for a cyberattack against Creos Luxembourg S.A. last week, a natural gas pipeline and electricity network operator in the central European country.While the cyberattack had resulted in the customer portals of Encevo and Creos becoming unavailable, there was no interruption in the provided services.At that time, Encevo wasn’t in a position to estimate the scope of the impact and kindly asked customers to be patient until the investigations were concluded, at which time everyone would receive a personalized notice.For now, all customers are recommended to reset their online account credentials, which they used for interacting with Encevo and Creos services. Furthermore, if those passwords are the same at other sites, customers should change their passwords on those sites as well.Bleeping Computer has contacted Creos to request more information about the impact of the cyberattack, but a spokesperson of the firm declined to give any comment at this stage.While no exact time was announced for the fulfillment of this threat, the hackers vowed the disclosure to occur later today (Monday).While BlackCat continues to innovate data extortion, they never seem to learn from their mistakes and continue to target high-profile companies that will likely land them in the cross-hairs of international law enforcement agencies.After shutting down DarkSide, they rebranded as BlackMatter to evade law enforcement, but the pressure continued with the gang shutting down again."
   },
   {
      "time": "2022-08-02",
      "title": "\r\n\tGiant Investment Scam Network Targets Victims with Phone Calls - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineSecurity researchers have uncovered a massive investment fraud campaign targeting European victims via online and phone channels.The “gigantic network infrastructure” seen by Group-IB covers over 10,000 rogue websites localized for users in the UK, Belgium, the Netherlands, Germany, Poland, Portugal, Norway, Sweden and the Czech Republic.Victims are first lured by posts about fake investment schemes on compromised social media accounts like Facebook and YouTube.Often images of local or global celebrities are used to make the scam seem more legitimate.Clicking on the post will take them to a fake broker site, which will have a high quality design.The victim will then be required to fill out a contact form. Once they do, they will receive a call from a scammer masquerading as a broker.“After filling out the form, the victim receives a call from scammers who provide a link to the final fraudulent invest-project with a personal account. To start trading, the victim needs to replenish the balance,” said Group-IB.Once they make the card payment, they’ll get a login to a fake investment dashboard.“In the fake dashboard profit will be shown, while literally there is no profit as all is fake,” Group-IB continued.“The scammers do this to be able to ask the victim for more money, as the victim believes good profits are being made. No actual trading is taking place on the platform.”However, if the victim decides not to deposit any more money and wants to cash out, they will be required to put more money in to meet a ‘pay out threshold.’ Even if they do this, they’ll be asked for more money.Of the 11,197 domains involved in the campaign, over 5000 remained active at the time of writing."
   }
]