[
   {
      "time": "2022-07-25",
      "title": "T-Mobile Settles to Pay $350M to Customers in Data Breach - SecurityWeek",
      "text": " Hi, what are you looking for?ByFlipboardRedditWhatsappWhatsappEmailSubscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-25",
      "title": "Hacker Offers 5.4 million Twitter Account Details for $30,000 - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-07-25",
      "title": "Microsoft Hit by Huge Service Outage - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-07-25",
      "title": "Amadey malware pushed via software cracks in SmokeLoader campaign",
      "text": " A new version of the Amadey Bot malware is distributed through the SmokeLoader malware, using software cracks and keygen sites as lures.Amadey Bot is a malware strain discovered four years ago, capable of performing system reconnaissance, stealing information, and loading additional payloads.SmokeLoader is downloaded and executed voluntarily by the victims, masked as a software crack or keygen. As it is common for cracks and key generators to trigger antivirus warnings, it is common for users to disable antivirus programs before running the programs, making them an ideal method of distributing malware.Upon execution, it injects \"Main Bot\" into the currently running (explorer.exe) process, so the OS trusts it and downloads Amadey on the system.Once Amadey is fetched and executed, it copies itself to a TEMP folder under the name 'bguuwe.exe' and creates a scheduled task to maintain persistence using a cmd.exe command.Next, Amadey establishes C2 communication and sends a system profile to the threat actor's server, including the OS version, architecture type, list of installed antivirus tools, etc.In its latest version, number 3.21, Amadey can discover 14 antivirus products and, presumably based on the results, fetch payloads that can evade those in use.The server responds with instructions on downloading additional plugins in the form of DLLs, as well as copies of additional info-stealers, most notably, RedLine ('yuri.exe').The payloads are fetched and installed with UAC bypassing and privilege escalation. Amadey uses a program named 'FXSUNATD.exe' for this purpose and performs elevation to admin via DLL hijacking.Also, the appropriate exclusions on Windows Defender are added using PowerShell before downloading the payloads.Moreover, Amadey captures screenshots periodically and saves them in the TEMP path to be sent to the C2 with the next POST request.One of the downloaded DLL plugins, 'cred.dll,' which is run through 'rundll32.exe,' attempts to steal information from the following software:To stay clear from the danger of Amadey Bot and RedLine, avoid downloading cracked files, software product activators, or illegitimate key generators that promise free access to premium products.Update 8/17/22: RealVNC head of security, Ben May, shared the following comment with Bleeping Computer:Once Amadey gained Administrator privileges on a machine, the malware will extract config/credentials from various software it detects (including RealVNC). As is often the case, something with Administrator level access can view/modify most things on a computer.By default, unlike our competitors, RealVNC’s VNC Server uses Windows credentials as the authentication mechanism, which means there are no credentials stored in the Registry for the Amadey malware to extract. However, this only applies to paid subscriptions."
   },
   {
      "time": "2022-07-25",
      "title": "QBot phishing uses Windows Calculator DLL hijacking to infect devices",
      "text": " The operators of the QBot malware have been using a DLL hijacking flaw in Windows Calculator to infect computers, which also helps evade detection by security software.DLL hijacking is a common attack method that takes advantage of how Dynamic Link Libraries (DLLs) are handled in Windows. It consists of creating a malicious version of a legitimate DLL required by the program, and placing it early in the search order used to find a required DLL.  This folder is commonly the same folder as the executable.When the executable is launched, it will find the malicious version with the same name in the same folder, loading that instead and infecting the computer.The emails used in the latest campaign carry an HTML file attachment that downloads a password-protected ZIP archive with an ISO file inside.The password for opening the ZIP file is shown in the HTML file, and the reason for locking the archive is to evade antivirus detection.The ISO contains a .LNK file, a copy of 'calc.exe' (Windows Calculator), and two DLL files, namely WindowsCodecs.dll and a payload named 7533.dll.When the user mounts the ISO file, it only displays the .LNK file, which is masqueraded to look like a PDF holding important information or a file that opens with Microsoft Edge browser.However, the shortcut points to the Calculator app in Windows, as seen in the properties dialog for the files.Clicking the shortcut triggers the infection by executing the Calc.exe through the Command Prompt.When loaded, the Windows 7 Calculator automatically searches for and attempts to load the legitimate WindowsCodecs DLL file. However, it does not check for the DLL in certain hard coded paths, and will load any DLL with the same name if placed in the same folder as the Calc.exe executable.The threat actors take advantage of this flaw by creating their own malicious WindowsCodecs.dll file that launches the other [numbered].dll file, which is the QBot malware.By installing QBot through a trusted program like the Windows Calculator, some security software may not detect the malware when it is loaded, allowing the threat actors to evade detection.It should be noted, that this DLL hijacking flaw no longer works in Windows 10 Calc.exe and later, which is why the threat actors bundle the Windows 7 version."
   },
   {
      "time": "2022-07-25",
      "title": "North Korean hackers attack EU targets with Konni RAT malware",
      "text": " Threat analysts have uncovered a new campaign attributed to APT37, a North Korean group of hackers, targeting high-value organizations in the Czech Republic, Poland, and other European countries.In this campaign, the hackers use malware known as Konni, a remote access trojan (RAT) capable of establishing persistence and performing privilege escalation on the host.The attack begins with the arrival of a phishing email with an archive attachment containing a Word document (missile.docx) and a Windows Shortcut file (_weapons.doc.lnk.lnk).When the LNK file is opened, code runs to find a base64-encoded PowerShell script in the DOCX file to establish C2 communication and download two additional files, 'weapons.doc' and 'wp.vbs'.The downloaded document is a decoy, supposedly a report from Olga Bozheva, a Russian war correspondent. At the same time, the VBS file runs silently in the background to create a scheduled task on the host.At this phase of the attack, the actor has already loaded the RAT and established a data exchange link, and is capable of performing the following actions:In the fourth stage of the attack, as shown in the diagram below, the hackers download additional files that support the function of the modified Konni sample, fetching them as compressed “.cab” archives.These include DLLs that replace legitimate Windows service libraries like the “wpcsvc” in System32, which is leveraged for executing commands in the OS with higher user privileges.While the tactics and toolset point to APT37, Securonix underscores the possibility of APT28 (aka FancyBear) being behind the STIFF#BIZON campaign.“There seems to be a direct correlation between IP addresses, hosting provider, and hostnames between this attack and historical data we’ve previously seen from FancyBear/APT28,” concludes the report.State-sponsored threat groups often attempt to mimic the TTPs of other skillful APTs to obscure their trace and mislead threat analysts, so the chances of misattribution, in this case, are significant."
   },
   {
      "time": "2022-07-25",
      "title": "SonicWall Issues Patch for Critical Bug Affecting its Analytics and GMS Products",
      "text": " Network security company SonicWall on Friday rolled out fixes to mitigate a critical SQL injection (SQLi) vulnerability affecting its Analytics On-Prem and Global Management System (GMS) products.\"This can be used to alter query logic to bypass security checks, or to insert additional statements that modify the back-end database, possibly including execution of system commands.\"Organizations relying on vulnerable appliances are recommended to upgrade to Analytics 2.5.0.3-2520-Hotfix1 and GMS 9.3.1-SP2-Hotfix-2.\"There is no workaround available for this vulnerability,\" SonicWall said. \"However, the likelihood of exploitation may be significantly reduced by incorporating a Web Application Firewall (WAF) to block SQLi attempts.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-07-25",
      "title": "Chrome Flaw Exploited by Israeli Spyware Firm Also Impacts Edge, Safari - SecurityWeek",
      "text": " Hi, what are you looking for?A recently patched Chrome vulnerability that appears to have been exploited by an Israeli spyware company also impacts Microsoft’s Edge and Apple’s Safari web browsers.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...WASHINGTON - Cyberattacks are the most serious threat facing the United States, even more so than terrorism, according to American defense experts. Almost half...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-07-25",
      "title": "https://medium.com/dfrlab/how-russia-promoted-the-claim-that-ukraine-re-sold-french-howitzers-for-profit-fd51f71a9362",
      "text": " "
   }
]