[
   {
      "time": "2022-12-19",
      "title": "BrasDex: A new Brazilian ATS Android Banker with ties to Desktop malware",
      "text": " 15 December 2022In fact, ThreatFabric analysts discovered an ongoing multi-platform malware campaign, targeting both mobile and desktop Brazilian users, with thousands of infections and with an estimated loss of hundreds of thousands of Brazilian Reals (R$), which corresponds to tens of thousands of USD.This campaign involves a highly flexible novel Android malware dubbed BrasDex by ThreatFabric, featuring a complex keylogging system designed to abuse Accessibility Services to extract credentials specifically from a set of Brazilian targeted apps, as well as a highly capable Automated Transfer System (ATS) engine.The malware has been active for more than a year, initially posing as Android settings applications and targeting Brazilian banking applications. In its latest campaign, it started posing as one specific Banking application (Banco Santander BR), but continuing to target the same subset of applications as its previous versions.BrasDex abuses accessibility services to keylog the information that is input in the target application, veering away from the traditional overlay attack mechanism that we have observed for years now, towards what seems to be the next standard in Android banking malware.This follows a trend that we have started to see in the past year, where different malware families have started abandoning the use of overlays, which require continuous update and additional downloaded data, in favour of more lean and flexible solutions. For example, in the case of Vultur this solution was to perform screen-recording and subsequently accessibility logging, in the case of Cabassous it was to load the real target login page in a browser controlled by the malware, with JavaScript enabled.However, in most cases, malware families are starting to rely heavily on accessibility logging to exfiltrate logging credentials and other PII from infected victims. This is also the case for BrasDex. This malware family is able to log not only credentials, but also other important information, like account balance, and then use it to perform a DTO (Device TakeOver), which allows criminals to perform fraudulent transactions using the infected device.What sets BrasDex apart from many other malware families is its ATS (Automated Transfer System) capabilities. ATS allows malware to programmatically use the information stolen from the victim to initiate fraudulent transactions in an automated way, making the whole infection and fraud chain more flexible and scalable.ThreatFabric has mentioned ATS before in our blogs, as one of the most dangerous features present in modern day malware, specifically when speaking about Bankers such as Gustuff, the first Banker to implement this technique in 2018, and more recently SharkBot.BrasDex is a malware family strictly focused on the Brazilian market. The malware contains checks to make sure it only operates on devices from Brazil. To do so, it programmatically checks that the SIM used by the device is operating in Brazil, and only then it properly completes its operations and configurations. If the device has a SIM card from anywhere else, the malware shuts down and never contacts its C2 server.NOTE: ThreatFabric wants to point out that the Pix system is not vulnerable. Actors are not exploiting any vulnerabilities in the Pix System, but rather abusing the fast payments system and Android known issues to make fraudulent transfersBloomberg referred to the Pix app as “ubiquitous” in Brazil in October 2021, a year after Pix’s release. As of November 2022, Pix has been reported to perform an average of more than 2 million monthly transactions, with a user base of more than 120 million people. Only in November 2022, Pix was used to perform transactions corresponding to a volume of more than one billion Brazilian Reals (R$), which equals to more than 180 million USD ($).For each targeted bank, the step in the ATS script which is responsible for the actual fraudulent transfer performs it through the Pix technology, not the traditional bank transfer that many other malware families use.The script will find the UI element corresponding to Pix payments within the banking application, use it to start the transfer procedure, and then navigate through the different screens, selecting the beneficiary and the amount, authenticating with the stolen credentials. This kind of instant payment does not require Multi Factor Authentication, as it can be authorized directly through the banking application itself, making it the perfect target for an Android Banking Malware. We will later cover in detail an example of a transfer procedure with such technology.The keylogging technique used by BrasDex abuses the accessibility services privileges, and is able to detect and log a large quantity of information from the Operating System. With this technique, BrasDex is able to log and send to its C2 all the information that is shown on the device’s UI, including both credentials typed by the user, as well as other information that is displayed by the application itself, like account balance.If the application on the foreground is one of the banking applications included in the target list, BrasDex also notifies its C2 of events such as opening the application, inserting passwords, or if the malware is incapable of extracting the required information. The malware notifies the C2 whenever one of the following events is detected, with the indicated codes:The logged message is formed in the following way (in case of no parameters, the message ends with the event code):The information that is collected by the keylogging module is stored locally and sent to the C2, and is automatically fed as parameters into the ATS scripts downloaded with the malware configuration when the malware is first launched.What really sets apart this newly discovered malware family from its competition, is its advanced and flexible ATS framework. First abused by Gustuff, enhanced and diffused with SharkBot, Automated System Transfer allows the malware to programmatically use the stolen credentials, detect the amount of funds that are available in the account, and then initiate and approve a transaction, all from the infected device itself.In the case of BrasDex, the infected device receives multiple scripts, one per targeted application, and each containing all the necessary steps to login and perform fraud. Each script is made of multiple actions, which contain the following fields:Here is an example of a real action implemented by one of the scripts:BrasDex is able to check for values and type of data contained in all the different fields of the UI (for example if an account contains any funds). It is also able to understand and check if UI elements can be clicked, and if they contain specific strings used to identify useful information (like finding the “Continue” or “Cancel” button).If the conditions for an action are satisfied, it also able to navigate within the UI to highlight and focus the wanted elements, wait a set amount of time, assign specific values to password fields or beneficiary fields, click buttons within the app.As previously mentioned, BrasDex targets the Pix payment system to perform its fraud.In the image below you can see a few of the different screens that the malware needs to navigate and interact with to successfully perform a successful transaction using Pix.We report here a subset of the actions described in the ATS script, which interact with the UI elements highlighted in red in the above image:As you can see from the above JSON objects, BrasDex in this case transfers funds to an account identified by a CPF code (“Cadastro de Pessoas Físicas”, a unique individual taxpayer identifier in Brazil).This is another peculiarity of Pix: it allows to perform transactions to accounts which can be identified by CPF, but also phone numbers, emails, or simple unique identifiers. The ATS scripts uses the following codes to identify which kind of mule it will be using for the transaction (which is communicated by the C2 during its initial config):All kinds of accounts identifiers have been observed being used by BrasDex mules.Once the malware finally inputs the necessary passwords to finalize the transaction, funds are transferred to the destination mule account.While investigating this malware family, ThreatFabric also managed to get certain visibility of the Panel hosted on the C2 server. Based on the information displayed on the panel, the malware seems to be quite successful, more than a thousand of reported infections. The panel contains multiple pages, e.g. the list of infected devices with extensive information, which includes the service providers, the device model, and the Android version. In another page, actors can access logs obtained from the infected devices, with the exfiltrated information, as well as reports of successful transactions.However, what really caught our attention was the main landing page. Here, we found a dashboard reporting extensive information about a different malware campaign, only this time targeting Desktop devices.This discovery lead to another investigation, which allowed us to connect this malware family to another malware family: Casbaneiro.The analysis of the drop points used to distribute BrasDex lead us to a campaign of desktop samples distributed through similar links in Q1 2022. We analyzed those samples and identified Casbaneiro, infamous Windows banking Trojan discovered in 2018, as the partner of BrasDex.Since the campaign is quite old, it could be just a coincidence, but our analysis showed clear similarity between BrasDex and Casbaneiro in regards to the communication with their C2 (namely the common use of a specific header).However, to put an end to the debate, while writing our blog we discovered an ongoing campaign of BrasDex and Casbaneiro distributed through the same drop point, thus allowing us to conclude that Casbaneiro is the a desktop malware operated by same actors behind BrasDex.The latest desktop campaign is the same in MO as previous ones, and we will briefly highlight the most notable parts of the desktop campaign.It was delivered through phishing e-mails about a failed delivery, pretending to be from the Brazilian postal service and containing a link to a form to be filled in.When the victim clicked the link, a ZIP archive was downloaded. This archive contained a Microsoft Software Installer package (MSI). When analyzing the file, we discovered that it contains an obfuscated script that will download the next stage of the malware.The downloaded file is an archive containing AutoIt interpreter and obfuscated AutoIt script. When launched it will download another archive containing another AutoIt script. The new script is bigger as in contains binary data encoded in hex strings. This is the final payload that is decoded and executed by the script. Thus, this multi-staged process results in the a Delphi payload running on the Windows machine:When analyzing the final payload, our analysts identified it as Casbaneiro, based on the same communication protocol, strings and obfuscation mechanisms used. The sample analyzed uses the same decryption algorithms for string and payload decryption as in previously described campaigns. The latest sample analyzed has a compilation date of December 5th, 2022.Casbaneiro is a Windows banking Trojan written in Delphi that targets users of online banking as well as users of desktop banking applications. It is able to collect the data about the infected device, take screenshots and perform keylogging, hijack clipboard data, etc.The following Bitcoin wallet is hardcoded in Casbaneiro to be used to replace a cryptocurrency wallet copied by victim in clipboard:When running, Casbaneiro monitors the launched processes and opened URLs to find those related to banking applications. It also downloads bank-specific pictures from Google Drive, and uses them to steal 2FA codes from victim. This last step is done to authenticate to banking application on the actors’ device. For one of the banks such pictures contain QR-codes generated by the actors; the victim is tricked into scanning them with the mobile banking application and as a result, a new desktop device (controlled by cyber-criminals) will be authenticated and will have access to victim’s banking account.Being independent and full-fledged malware families, BrasDex and Casbaneiro form a very dangerous pair, allowing the actor behind them to target both Android and Windows users on a large scale.Moreover, the appearance of convenient payment systems not only makes payments comfortable for customers but also opens an opportunity for cyber-criminals to use it for fraudulent operations. The BrasDex case shows the necessity of fraud detection and prevention mechanisms in place on customers devices: fraudulent payments made automatically with the help of ATS engines appear legitimate to bank backends and fraud scoring engines, as they are made through the same device that is usually used by customer. Thus, a proper solution is needed on the very first border to identify suspicious behavior during the transaction combined with visibility of threats present on customer’s devices.ThreatFabric’s Fraud Risk Suite enables safe & frictionless online customer journeys by integrating industry-leading mobile threat intel, behavioral analytics, advanced device fingerprinting and over 10.000 adaptive fraud indicators. This will give you and your customers peace of mind in an age of ever-changing fraud."
   },
   {
      "time": "2022-12-19",
      "title": "Agenda Ransomware Uses Rust to Target More Vital Industries",
      "text": " Business공격 표면 관리를 통한 위험 태세 개선비즈니스 성과를 실현해 주는 보안보안을 통해 가시성 확보 및 비즈니스 요구사항 충족어디서나 어떤 장치에서나 자신 있게 연결전체 환경에서 사용자와 핵심 운영 활동을 보호강력한 전용 XDR, 공격 표면 위험 관리 및 제로 트러스트 기능으로 공격자보다 더 빠르게 움직입니다.선제적 위험 감소와 관리형 서비스로 효율성 극대화단일 콘솔에서 공격 표면 이해, 위험 실시간 분석, 그리고 네트워크, 워크로드 및 장치 전반에서 정책 조정측정 가능한 사이버 보안 성과로 비즈니스 가치 향상더 많은 위협에 빠르게 대응보안을 강화해 위협을 빠르고 효과적으로 완화코드가 의도대로 실행되는지 확인클라우드 환경용 보안으로 가시성과 제어력 확보의료 서비스 규정을 준수하면서 환자 데이터, 장치 및 네트워크 보호기존 장치에서 최첨단 인프라에 이르기까지 공장 환경 보호석유 및 가스 설비 산업을 위한 ICS/OT 보안전기 유틸리티를 위한 ICS/OT 보안위협 방지와 사이버 위험 관리를 연결하여 보안 성과를 강화하십시오제로 트러스트 전략 운영위협을 더 빠르게 추적하고, 탐지하고, 조사 및 대응하기 위해 더 폭넓은 관점 및 더 나은 컨텍스트를 확보하십시오.공격의 모든 단계에서 엔드포인트 방어엔드포인트, 서버 및 클라우드 워크로드에 대한 최적화된 보호, 탐지 및 대응개발자, 보안 팀, 기업을 위한 가장 신뢰할 수 있는 클라우드 보안 플랫폼CNAPP 기능을 지원하는 클라우드 보안 플랫폼을 활용하여 성능 손상 없이 데이터 센터, 클라우드 및 컨테이너를 보호합니다.완전한 가시성과 신속한 문제 해결 활용고급 컨테이너 이미지 스캔, 정책 기반 승인 제어, 컨테이너 런타임 보호를 통해 클라우드 네이티브 애플리케이션의 보안을 단순화합니다.클라우드 네이티브 애플리케이션 아키텍처를 활용하는 클라우드 파일/개체 스토리지 서비스를 위한 보안단일 및 다중 클라우드 환경을 위한 고급 클라우드 기반 네트워크 보안 탐지, 보호 및 사이버 위협 중단.SecOps의 오픈소스 취약점에 대한 가시성 및 모니터링조직이 계속해서 데이터와 앱을 클라우드로 마이그레이션하고 IT 인프라를 혁신하면서 비즈니스 속도 저하 없이 위험을 완화하는 것은 매우 중요합니다.네트워크 탐지 및 대응으로 XDR 성능 확장알려지거나 알려지지 않거나, 또는 공개되지 않은 취약점으로부터 네트워크를 보호합니다인바운드, 아웃바운드 및 측면으로 이동하는 표적 공격을 탐지하고 이에 대응합니다.지속적인 위험 평가를 통해 신뢰할 수 있고 안전한 디지털 혁신을 새롭게 재정립피싱, 멀웨어, 랜섬웨어, 사기 및 표적형 공격이 기업에 침투하는 것을 방지합니다.멀웨어, 악성 애플리케이션 및 기타 모바일 위협에 대한 온프레미스 및 클라우드 보호지속적인 위협 예방 및 분석을 통해 최신 위협보다 한발 앞서나가고 중요 데이터를 보호하십시오.종합적인 보호 기능으로 위협 차단연중무휴 관리형 탐지 및 대응, 지원을 통해 보안 팀의 역량을 강화하십시오이메일, 엔드포인트, 서버, 클라우드 워크로드 및 네트워크를 위한 전문 관리형 탐지 및 대응(MDR)으로 팀을 확장합니다.귀사가 위반을 경험하고 있거나 IR 계획을 선제적으로 개선하고자 하는 경우 신뢰할 수 있는 전문가가 대기하고 있습니다.업계 최고의 탐지 및 대응 기술로 위협을 차단하고 고객의 청구 비용 및 다운 타임을 줄이십시오.업계 최고의 완벽한 다계층 보안을 통해 비즈니스를 성장 시키고 고객을 보호하십시오.업계 최고의 XDR로 최신 보안 운영 서비스 제공클라우드 보안 글로벌 마켓을 리드하는 트렌드마이크로 Deep Security사용하는 플랫폼에 관계없이 클라우드 서비스 오퍼링에 시장을 선도하는 보안을 추가하십시오.업계 최고의 보안 파트너를 통한 매출 증대가능성 알아보기트렌드마이크로는 성과와 가치를 높이기 위해 최선의 노력을 다하고 있습니다.Content has been added to your FolioRansomwareThis year, various ransomware-as-a-service groups have developed versions of their ransomware in Rust, including Agenda. Agenda's Rust variant has targeted vital industries like its Go counterpart. In this blog, we will discuss how the Rust variant works.By: Nathaniel Morales, Ivan Nicole Chavez, Nathaniel Gregory Ragasa, Don Ovid Ladores, Jeffrey Francis Bonaobra, Monte de Jesus\n\t\t\n\t\t\tDecember 16, 2022\nRead time:  ( words)\n\tSave to FolioBlackbox analysisWhen executed, the Rust binary prompts the following error requiring a password to be passed as an argument. This command-line feature is similar to the Agenda ransomware binaries written in Golang.Upon execution of the sample with “—password” as its parameter in conjunction with a dummy password “AgendaPass,” the ransomware sample runs its malicious routine starting with the termination of various processes and services.Specific to the sample we analyzed, the ransomware appends the extension \"MmXReVIxLV” to encrypted files. It also displays activity logs on the command prompt, including the file it has encrypted and the elapsed time.The ransomware will then proceed to drop its ransom note on every directory it encrypts. As observed in its ransom note, the password used to execute the ransomware will also be used as the password for logging in to the support chat site of the ransomware group.Agenda ransomware analysisTable 1. Arguments used by the Agenda ransomware’s Rust variantThe Rust variant also contains hard-coded configuration inside its binaries like the earlier samples compiled in Golang.It also added the -n, -p, fast, skip, and step flags on its configurations, which are not present in the Golang variant configuration and only used via command-line argument. Upon further analysis, we have learned that these flags are used for intermittent encryption. This tactic enables the ransomware to encrypt the victim’s files faster by partially encrypting the files depending on the values of the flags. This tactic is becoming more popular among ransomware actors as it lets them encrypt faster and avoid detections that heavily rely on read/write file operations.Table 2. Flags used for intermittent encryptionWe tried to mimic its encryption behavior using some of the flags present on its configuration. For this simulation, we used a dummy file filled with “A” as its content.For fast mode:Value: 1Encrypted bytes: 1 * 0x200000h, where 1 is the value set in the fast flagFor N-P mode:Total size = 88,082,336 bytesBytes encrypted = 1 * 0x200000,h where 1 is the value set in the n flagBytes skipped = 880,818 bytes (1% of the whole file), where 1 is the value set in the p flagAside from the additional flags used for different encryption modes, the Rust variant has included AppInfo to its roster of services to terminate. It disables User Account Control (UAC), a Windows feature that helps prevent malware from executing with administrative rights, resulting in the inability to run other applications with administrative privileges.The Agenda ransomware is also known to deploy customized ransomware for each victim, and we have seen that its Rust variants have an allocated space for adding accounts in their configuration to be used mostly for privilege escalation.The file extension to be appended on the encrypted files is hard-coded in its configuration.Unlike the previous Golang variant, however, the threat actors did not include the credentials of the victim in the configuration of the Rust variant. This feature of the latter prevents other researchers not only from visiting the ransomware’s chat support site but also accessing the threat actors’ conversations when a sample becomes available externally. It also prevents unsolicited messages from other people besides the victim.ConclusionAn emerging ransomware family, Agenda has recently been targeting critical sectors such as healthcare and education industries. At present, its threat actors appear to be migrating their ransomware code to Rust as recent samples still lack some features seen in the original binaries written in the Golang variant of the ransomware. Rust language is becoming more popular among threat actors as it is more difficult to analyze and has a lower detection rate by antivirus engines.Indicators of Compromise (IOCs)Nathaniel MoralesThreat AnalystIvan Nicole ChavezThreat AnalystNathaniel Gregory RagasaThreat AnalystDon Ovid LadoresThreats AnalystJeffrey Francis BonaobraThreat Research EngineerMonte de JesusThreats Analyst30일간 트렌드마이크로 서비스 무료로 사용해 보기국가 / 지역 선택Copyright ©2023 Trend Micro Incorporated. All rights reserved."
   },
   {
      "time": "2022-12-19",
      "title": "Restaurant CRM platform ‘SevenRooms’ confirms breach after data for sale",
      "text": " Restaurant customer management platform SevenRooms has confirmed it suffered a data breach after a threat actor began selling stolen data on a hacking forum.SevenRooms is a restaurant customer relationship management (CRM) platform used by international restaurant chains and hospitality service providers, such as MGM Resorts, Bloomin' Brands, Mandarin Oriental, Wolfgang Puck, and many more.On December 15, a threat actor posted data samples on the Breached hacking forum, claiming to have stolen a 427 GB backup database with thousands of files containing information about SevenRooms customers.The samples provided by the seller include folders named after big restaurant chains, clients of SevenRooms, API keys, promo codes, payment reports, reservation lists, and more.After BleepingComptuer contacted SevenRooms about the data being sold online, they confirmed that it was their data was caused by unauthorized access to the systems of one of its vendors.\"SevenRooms recently learned that a file transfer interface of a third-party vendor was accessed without authorization,\" a SevenRooms spokesperson told BleepingComputer.The company clarified that guests' credit card information, bank account data, social security numbers, or any other similarly highly sensitive information was not stored on compromised servers, so it was not exposed in the attack.Furthermore, SevenRooms claims that there has been no direct breach of its systems, which remain secure against unauthorized external access.\"We immediately disabled access to the interface, launched an internal investigation, and we currently have no evidence that any of SevenRooms' proprietary databases were affected,\" stated the spokesperson.\"We have retained independent cybersecurity experts to assist with this investigation and will provide additional updates as appropriate.\"SevenRooms states that they have hired an independent cybersecurity company to aid in the investigation of the incident and will provide further updates as more information becomes available.While it is unclear what restaurants and customers were affected by this breach, we will likely see further data breach notifications released by restaurants whose customers' data was exposed."
   },
   {
      "time": "2022-12-19",
      "title": " Microsoft to Roll Out “Data Boundary” for its EU Customers from Jan 1 - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " This phased rollout of its “EU data boundary” will apparently be applied to all of its core cloud services - Azure, Microsoft 365, Dynamics 365 and Power BI platform. Since the introduction of General Data Protection Regulation (GDPR) by the EU IN 2018, that protects user privacy, business giants have grown increasingly anxious of the international flow of consumer data. The European Commission, which serves as the executive arm of the EU, is developing ideas in order to safeguard the privacy of the European customers whose data is being transferred to the United States. \"As we dived deeper into this project, we learned that we needed to be taken more phased approach,\" says Microsoft’s Chief Privacy Officer Julie Brill. “The first phase will be customer data. And then as we move into the next phases, we will be moving logging data, service data and other kind of data into the boundary.” The second phase will reportedly be completed by the end of 2023, while the third in year 2024, she added. Microsoft runs more than a dozen datacenters throughout the European countries, like France, Germany, Spain and Switzerland. Data storage, for large corporation, have become so vast and is distributed across so many different countries that it has now become a challenge to understand where their data is stored and whether it complies with regulations like GDPR. \"We are creating this solution to make our customers feel more confident and to be able to have clear conversations with their regulators on where their data is being processed as well as stored,\" says Brill. Moreover, Microsoft has previously mentioned how it would eventually challenge government request for customer data, and that it would compensate financially to any customer, whose data it shared in breach of GDPR.  your nameYour Emailyour message"
   },
   {
      "time": "2022-12-19",
      "title": "Cloud flaws brought to the fore as bug bounty vulnerabilities hit 65k in 2022 – HackerOne | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondImpact of cloud migration and shift to remote work evident in new reportBug bounty hunters are increasingly unearthing cloud-based vulnerabilities as organizations undergo ‘digital transformation’, a new report has found.Now on its sixth instalment, the report also explores the continued impact of digital transformation on attack surfaces.Meanwhile, companies running bug bounty programs should take note that slow response times (51%), limited scopes (50%), and poor communication (49%) were the most significant deterrents to engaging with a program.HackerOne, which polled 5,000 hackers between September and October 2022, also found that 38% of bug hunters cited in-house expertise as the biggest cybersecurity challenge facing organizations. This finding reflects the intertwined trends of growing attack surfaces and the cybersecurity skills gap.Nevertheless, 92% still back themselves to find vulnerabilities missed by scanners, with tools often proving useful for reconnaissance, according to the report.“I use automated tools in my reconnaissance flow to find opportunities where to focus my efforts,” US hacker Jon Colston told HackerOne.“While it can send immediate notification of a quick win, I’m more interested in collecting as much information as possible from various data repositories to analyze trends.“Specifically, I’m identifying where an organization will likely store specific files or documentation which I can leverage into more advanced attacks. Performing recon with a purpose helps me develop a better picture of the landscape and quickly narrow down my list of targets from 5000 to 500.”While bug hunting only turns a select few into millionaires, 41% earned enough to consider it a career in itself, while 25% believed their freelance exploits had helped them get a promotion in their salaried position or otherwise progress their career.Burp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2022-12-19",
      "title": "T-Mobile hacker gets 10 years for $25 million phone unlock scheme",
      "text": " Argishti Khudaverdyan, the former owner of a T-Mobile retail store, was sentenced to 10 years in prison for a $25 million scheme where he unlocked and unblocked cellphones by hacking into T-Mobile's internal systems.Between August 2014 and June 2019, the 44-year-old man behind the scheme, who was also ordered to pay $28,473,535 in restitution, \"cleaned\" hundreds of thousands of cellphones for his \"customers.\"Khudaverdyan's contract as the owner of the Top Tier Solutions T-Mobile retail store in California was terminated by the wireless carrier in June 2017 due to his suspicious computer behavior and association with unauthorized unlocking of cellphones.\"Removing the unlock allowed the phones to be sold on the black market and enabled T-Mobile customers to stop using T-Mobile's services and thereby deprive T-Mobile of revenue generated from customers' service contracts and equipment installment plans.\"With co-defendant Alen Gharehbagloo, his former business partner and the co-owner of the mobile store, Khudaverdyan gained access to T-Mobile's internal computer systems using credentials stolen in phishing attacks from more than 50 different T-Mobile employees.The stolen credentials were used to access T-Mobile's internal computer systems, and, in many cases, for password resets which locked the account owners out of the system.​Using the stolen credentials and the IMEI numbers sent by customers through the websites they controlled, the two men unlocked hundreds of thousands of Android and iOS devices using T-Mobile's dedicated Mobile Device Unlock (MDU) and MCare Unlock (MCare) tools.While the MDU tool could only be used by authorized T-Mobile employees, MCare didn't require authentication as it was based on IP address blocks assigned to T-Mobile/Metro locations.On at least one occasion, on March 29, 2017, the defendant used his own T-Mobile credential (akhudav1) to log into a T-Mobile Wi-Fi access point from Texas and access the unlockitall.com website, directly linking himself to the illegal cellphone unlock scheme.\"We've been unlocking cell phones for years, and our specialty is in providing competitive, iCloud unlocking services and Clean/Financed T-Mobile iPhone services.\"Unlike other companies that use' hacking unlock' with the possibility of your iPhone being re-locked in the future, our T-mobile unlock is Official and directly through Apple and T-mobile.\"Alen Gharehbagloo, his former business partner and the co-owner of the mobile store, also pleaded guilty on July 5 to conspiracy to commit wire fraud, accessing a protected computer with intent to defraud, and conspiracy to commit money laundering.Gharehbagloo's sentencing hearing is scheduled to take place in two months, on February 23, 2023.Update December 22, 02:12 EST: Revised article to say Khudaverdyan did not plead guilty."
   },
   {
      "time": "2022-12-19",
      "title": "Cloud security automation is key to reducing MTTR | SC Media",
      "text": "  Companies are shifting applications and workloads to the cloud -- and the benefits are clear. Cloud services offer faster services, better collaboration, and are more cost-efficient. Switching to the cloud also gives organizations more flexibility and greater scalability for the future. Perhaps most importantly, however, is automation's ability to help security teams reduce the mean time to remediate (MTTR) vulnerabilitiesWithout a proper automation framework in place, however, the odds are stacked against cloud security teams to remediate vulnerabilities quickly before attackers can exploit them. While automation is no panacea on its own, there’s proof that – when done correctly – it can deliver major benefits to efficiency, accuracy, and staff morale. Automated cloud security software can help organizations address skills shortages by reducing the number of new employees necessary to manage effective security protocols. Modern automated security platforms are able to process large volumes of data quickly and produce accurate, consistent outputs. Patch deployment can also be managed quite effectively with an automated tool.When automation does much of the legwork, security teams are able to focus on critical needs of the organization's infrastructure. For example, some vulnerabilities may not have an immediate resolution, and instead require a workaround. With an automated tool taking care of simple (but time-consuming) tasks, security employees can ensure that a workaround gets put into place before a threat actor wins an exploit. In this manner, automation reduces MTTR on two fronts: by deploying accessible patches as they are released, and by giving security professionals more time to focus on more complicated tasks.For organizations exploring automation as an option, it’s worth considering how it could impact existing processes and personnel – and what it takes to introduce it effectively. Here are a few pointers to keep in mind: #1: Assess the SOC to identify suitable areas for automation. Organizations should think strategically about what should and shouldn’t be automated. For example, cloud security posture management (CSPM) and cloud workload protection (CWP) are sensible targets for automation because their operation hinges on defining and enforcing security rules and configurations for different cloud environments and workloads. Threat hunting or penetration testing, on the other hand, are less suitable for automation as they emphasize investigative skills and hypothesis testing that humans are uniquely suited for.  #2: Leadership should position automation as an enabler. The last thing security teams want is another distraction or, worse, the suspicion that their job might be on the chopping block. CISOs should make communication a priority as they introduce automation, framing it as an enabler that can eliminate the drudge work while granting staff more time to focus on critical vulnerabilities.#4: Platform approach is recommended. It’s recommended that organizations integrate automation using a platform approach. The cloud is a powerful tool for scaling operations to meet business demands, but that can introduce unnecessary complexity if organizations pursue cloud initiatives in piecemeal fashion. Instead, consider integrating cloud security automation tools into a single platform so that SOC staff have shared visibility and context for interpreting any and all network activity.Daniel Thomas is a technology writer, researcher, and content producer for CyberRisk Alliance. He has over a decade of experience writing on the most critical topics of interest for the cybersecurity community, including cloud computing, artificial intelligence and machine learning, data analytics, threat hunting, automation, IAM, and digital security policies. He previously served as a senior editor for Defense News, and as the director of research for GovExec News in Washington, D.C.. U.S. cloud data analytics and log analysis firm Sumo Logic has confirmed discovering a potential security incident after its Amazon Web Services account was accessed using stolen credentials, reports TechCrunch.Transitioning to cloud-native environments has brought along security risks for companies, according to TechRadar.Vulnerabilities in API authorization have been named by Wallarm as the second greatest security risk facing APIs, emphasizing the ease of leveraging authorizations as backdoors as well as the urgent need to ensure authorization maintenance, reports SiliconAngle.Tue Apr 23Wed Dec 6On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-12-19",
      "title": "FBI: Criminals Using BEC Attacks to Scavenge Food Shipments",
      "text": " Threat actors have typically used business email compromise (BEC) attacks to steal money from unwary organizations in recent years. But in a new twist, cybercriminals are using them to steal food shipments and ingredients from suppliers and distributors around the country.The FBI and the Food and Drug Administration Office of Criminal Investigations (FDA OCI) on Dec. 16 issued an alert warning that the attacks have been going on since at least the beginning of this year and have cost several organizations hundreds of thousands of dollars in losses so far.\"While BEC is most commonly used to steal money, in cases like this, criminals spoof emails and domains to impersonate employees of legitimate companies to order food products,\" the two agencies said in the joint cybersecurity advisory.While the behavior has a certain rat-like scavenging quality to it, the goal behind these thefts often is to repackage and resell the stolen food items without regard for safety and sanitation regulations, they said.Also in February, a food manufacturer experienced more than $600,000 in losses after receiving and shipping orders for whole milk powder and nonfat dry milk from four different fraudulent companies. In each instance, the attackers used real employee names and emails with slight variations of domain names belonging to legitimate companies to place the orders.In another incident in April, an ingredient supplier received a request — purportedly from the president of another large food manufacturer — for pricing information for whole milk powder via the company's Web portal. In this instance, the supplier ran a credit check on the spoofed food manufacturer, extended a line of credit to the company, and made the first of two $100,000 shipments to the criminals, before realizing something was amiss. The FBI and FDA OCI alert mentioned other incidents as well where criminals attempted to pull off similar heists but were not successful. In each of these attacks, the criminals have created email accounts and websites that look nearly identical to those of a legitimate company but contain nearly indiscernible differences — for example, an extra letter or substitute character such as a \"1\" instead of a lowercase \"l.\" Their tactics have often included gaining access to a legitimate company's email system and using that to send fraudulent emails to targeted victims.To add further legitimacy to their fraudulent communications, the attackers have used the actual names of executives and employees at legitimate businesses and used copied company logos in their emails and other documents. The attackers have also used the actual business information of legitimate companies to pass credit checks and obtain lines of credit for fraudulently purchasing food supplies and ingredients from victim companies.The takeaway from these attacks is that threat actors can be clever and will adapt their techniques to find ways around an organization's defenses, says Mike Parkin, senior technical engineer at Vulcan Cyber. \"While using the BEC vector to steal finished food shipments or raw materials seems like a lot more work than simply fooling the victim into sending cash, that may have been the point,\" he says. \"The threat actors here went for a novel scheme in order to slip under the radar and, possibly, steal more than they might have gotten from a single faked invoice.\"The FBI and FDA OCI urged organizations in the food sector to play closer attention to vetting new customers and vendors, especially to things like the new company's name and branding. \"Carefully check hyperlinks and email addresses for slight variations that can make fraudulent addresses appear legitimate and resemble the names of actual business partners,\" they noted. Organizations should look for additional punctuation, changes in the top-level domains, misspellings, and added prefixes or suffixes. They should also conduct periodic Web scans to ensure that attackers are not spoofing their domain and brands, the advisory said.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-19",
      "title": "Wi-Peep: locating Wi-Fi devices | Kaspersky official blog",
      "text": " Solutions for:Researchers find a new reliable way to track the location of wireless Wi-Fi devices. \nDecember 16, 2022\nBefore looking at the report in detail, let’s consider a real-life attack. Attackers fly a mini-quadcopter with the most inexpensive microcomputer on board around a target building, collecting data to obtain a map of wireless devices inside with reasonable accuracy (±1.5 meters under ideal conditions). But why would they? Well, let’s imagine it’s a bank or a top-secret laboratory whose security systems are equipped with Wi-Fi modules. And there’s your “why”: their location could be of huge practical interest to attackers planning physical penetration.So how do researchers imitate something like that?…The Wi-Peep attack exploits two important features of absolutely any Wi-Fi device, from ancient wireless modules from 20 years ago to the most modern. The first is the power-saving mechanism in Wi-Fi devices. The Wi-Fi module, say, in a smartphone can preserve battery by shutting down the wireless receiver for short periods of time. A wireless access point needs to consider this mode of operation: your router can accumulate data packets for a specific device, then transmit them all at once when it signals it’s ready again to receive a transmission.For a successful attack, a potential spy would need to obtain a list of MAC addresses — unique device IDs whose locations would be determined later. Devices in the same home, office, or hotel are usually connected to a shared Wi-Fi network, the name of which is no secret. It turned out that it’s possible to send a fake data packet, ostensibly from this shared wireless network, informing all connected devices that the access-point buffer has accumulated some data destined for them. In reply to this signal, the devices send responses which, when analyzed, reveal the unique MAC addresses of all network devices almost instantly. But there’s a simpler way: eavesdrop on wireless radio traffic; however, this takes more time: according to the researchers you need to accumulate data in passive mode for 12 hours.What does that give? Moving around a stationary wireless device, we can determine its coordinates with a fairly high degree of accuracy, knowing our own location and the distance to the object of interest. Much of the research is devoted to overcoming the many difficulties of this method. The signal from the Wi-Fi radio transmitter is constantly reflected by walls and other obstacles, making it difficult to calculate the distance. In fact, that standardized response time should be 10 microseconds, but it actually varies from device to device — ranging from 8 to 13 microseconds. The geolocation accuracy of the attackers’ Wi-Fi module itself also has an effect: it turns out that even the precision of geopositioning systems (GPS, GLONASS, etc.) isn’t always enough. Although the resulting data contains a lot of noise, if enough measurements are made, relatively high accuracy can be achieved. That means if you make tens of thousands of readings, you get a positioning accuracy with an error in the range of 1.26 to 2.30 meters — on the horizontal plane. On the vertical, the researchers were able to determine the exact floor in 91% of cases, but nothing more.Although the system for determining the coordinates of wireless devices turned out to be not very accurate, it’s still of interest — not least because the equipment used by the researchers is dirt-cheap. Theoretically, an attack can be carried out by a potential spy in person, simply by slowly walking around the target object. For added convenience, the researchers used a cheap quadcopter fitted with a microcomputer based on the ESP32 chipset and a wireless module. The total cost of this reconnaissance kit (excluding the cost of the quadcopter) is less than US$20! What’s more, the attack is virtually impossible to trace on the victim’s device. It uses the standard capabilities of Wi-Fi modules, which cannot be disabled or at least modified in terms of behavior. If communication between the victim’s device and the attackers’ microcomputer is possible in principle, the attack will work. The practical range of data transmission over Wi-Fi is tens of meters, which in most cases will suffice.If we assume the attack is doable in real life, is the data obtained of any use? The researchers propose several scenarios. First and most obviously, if we know the MAC address of the smartphone of a specific individual, we can roughly track their movements in public places. This is possible even if their smartphone is not connected to any wireless networks at the time of the attack. Second, creating a map of wireless devices in a secure building (a competitor’s office, bank premises) for a subsequent physical attack is an entirely realistic scenario. For example, attackers can determine the approximate location of surveillance cameras if these use Wi-Fi for data transmission.There are also less obvious benefits from collecting such data. You could, for instance, collect information about the number of Wi-Fi devices in a hotel to estimate how many guests there are. Such data may be of interest to competitors. Or, knowing the number of wireless devices could help determine if potential victims are at home. Even the MAC addresses themselves — without coordinates — are of some use: for collecting statistics about smartphone usage in a public place. In addition to spying and burglary, such methods are a threat to people’s privacy.However, the immediate risk of such a method being deployed in practice is still quite low. This applies to all potential attacks and data collection methods for which you have to get close to the target object. It’s quite labor-intensive for one thing, meaning that few would do it on a mass scale, and for targeted attacks — other methods may be more effective. At the same time, scientific research helps to understand how minor features of complex technologies can be harnessed for malicious purposes. The researchers themselves note that the real benefit of their work will be if this small security and privacy risk is eliminated in future versions of wireless data transmission technologies.Why you shouldn’t trust a random period-tracking app, and what to look out for when choosing one.\nWhy you shouldn’t trust a random period-tracking app, and what to look out for when choosing one.\nDecember 15, 2022\nFour handy ways to lock your screen on Windows and macOS.\nFour handy ways to lock your screen on Windows and macOS.\nNovember 10, 2023\nMistakes commonly found in almost every large organization. What should the inforsec team look out for, and what protective measures should they take?\nMistakes commonly found in almost every large organization. What should the inforsec team look out for, and what protective measures should they take?\nNovember 8, 2023\nEverything you wanted to know about Google account passkeys: how they work, why they’re needed, where to enable them, how to configure them, and what storage options are available.\nEverything you wanted to know about Google account passkeys: how they work, why they’re needed, where to enable them, how to configure them, and what storage options are available.\nNovember 3, 2023\nReady, set, tech: preparing for your kids’ first device.\nReady, set, tech: preparing for your kids’ first device.\nOctober 31, 2023\nCopyright © 2023 AO Kaspersky Lab. All Rights Reserved.Global"
   }
]