[
   {
      "time": "2022-10-03",
      "title": "/blog/2022/09/customer-guidance-for-reported-zero-day-vulnerabilities-in-microsoft-exchange-server/",
      "text": " "
   },
   {
      "time": "2022-10-03",
      "title": "Canon Medical Product Vulnerabilities Expose Patient Information - SecurityWeek",
      "text": " Hi, what are you looking for?Trustwave is warning healthcare organizations of two cross-site scripting (XSS) vulnerabilities in Canon Medical’s popular medical imaging sharing tool Vitrea View.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-03",
      "title": "Cisco Patches High-Severity Vulnerabilities in Networking Software - SecurityWeek",
      "text": " Hi, what are you looking for?Cisco this week announced IOS and IOS XE software updates that address 12 vulnerabilities, including 10 high-severity security flaws.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-03",
      "title": "CISA: Hackers exploit critical Bitbucket Server flaw in attacks",
      "text": " The Cybersecurity and Infrastructure Security Agency (CISA) has added three more security flaws to its list of bugs exploited in attacks, including a Bitbucket Server RCE and two Microsoft Exchange zero-days.\"Microsoft is also monitoring these already deployed detections for malicious activity and will take necessary response actions to protect customers. [..] We are working on an accelerated timeline to release a fix,\" Microsoft said earlier today.Attackers can gain remote code execution by exploiting the flaw via malicious HTTP requests. Still, they must have access to a public repository or read permissions to a private one.This RCE vulnerability impacts all Bitbucket Server and Data Center versions after 6.10.17, including 7.0.0 and up to 8.3.0.The federal agencies were given three weeks, until October 21st, to ensure that exploitation attempts would be blocked.The U.S. cybersecurity agency also strongly urged all private and public sector organizations worldwide to prioritize patching these vulnerabilities, although BOD 22-01 only applies to U.S. FCEB agencies.Applying patches ASAP will help them decrease the attack surface potential attackers could target in breach attempts.Since the BOD 22-01 binding directive was issued last year, CISA has added more than 800 security flaws to its catalog of bugs exploited in attacks while requiring federal agencies to address them on a tighter schedule."
   },
   {
      "time": "2022-10-03",
      "title": "Fake US govt job offers push Cobalt Strike in phishing attacks",
      "text": " A new phishing campaign targets US and New Zealand job seekers with malicious documents installing Cobalt Strike beacons for remote access to victims' devices.The attack is modularized and multi-staged, with most steps relying on executing obfuscated scripts from the host's memory and abusing the Bitbucket code hosting service to evade detection.However, the threat actors keep copies of Amadey and RedLine stealer handy in the dropping repository, so the malware delivery may vary depending on the target.Both attacks begin with a malicious email that presents the recipient with a lucrative job offer in the US federal government, supposedly sent from the US Office of Personnel Management (OPM).In another case, the malicious document impersonates the New Zealand Public Service Association (PSA), the country's prominent union for federal employees.The exploit is triggered upon opening the document, leading to downloading of a Word document template hosted on a Bitbucket repository.The first attack method executes a series of Virtual Basic scripts in the downloaded DOTM template, starting from decoding a data blob, writing it into an HTA file, and loading the next script using ShellExecuted.The succeeding script decodes the data into a PowerShell script loaded on the host's memory and executed without touching the disk.The encrypted PowerShell generates a second PowerShell downloader script, which connects to the Bitbucket repository to download a DLL file (\"newmodeler.dll\") on the compromised machine and sideload it through \"rundll32.exe\".In the cases seen by the Talos researchers, that DLL is Cobalt Strike, a widely abused penetration testing and offensive security suite.The second attack chain is less sophisticated because it uses a downloader executable fetched from Bitbucket, running as a process on the victim’s computer and risking detection.The executable launches a PowerShell command that downloads the Cobalt Strike DLL to the %UserProfile%\\AppData\\Local\\Temp directory and then deletes itself.The Cobalt Strike beacon allows the threat actors to execute commands remotely on the infected device, allowing threat actors to steal data or spread laterally through the compromised network.As for the C2, the beacons communicate with (\"185[.]225[.]73[.]238\"), a Netherlands-based, Alibaba-hosted Ubuntu server containing two self-signed and valid SSL certificates.Cisco's researchers didn't provide any attribution details this time, and the methods used in the attacks match the tactics of various perpetrators, from espionage groups to ransomware gangs.With Cobalt Strike being one of the most widely used tools to gain initial access to corporate networks and spread laterally within one, we have seen an increase in phishing attacks distributing beacons over the past few years."
   },
   {
      "time": "2022-10-03",
      "title": "Telegram: Contact @bl00dy_Ransomware_Gang",
      "text": " "
   },
   {
      "time": "2022-10-03",
      "title": "Vulnerability in tarfile module | Kaspersky official blog",
      "text": " Solutions for:The developers of a run-of-the-mill Python module recently found out why old unpatched vulnerabilities can be dangerous.\nSeptember 30, 2022\nThe danger here is that the user of a program that employs the tarfile module doesn’t know how the normal unpacking of a regular archive ends. There may be nothing, or some files may appear in an unexpected place. Or some user files might get overwritten. The author of the bug report mentions this very problem in the tar archiver itself, which got fixed back in 2001 – more than 20 years ago. But in tarfile the vulnerability was never closed.This assessment was proven false in 2022, when Trellix showed that exploitation in practice is more than possible. And not only for writing data wherever you like, but also for running arbitrary code. Recall that this is a library for programmers; that is, the possibility of an attack depends on the specific software in which the tarfile module is used. Trellix gave two examples.This story of the 15-year bug illustrates once again that you should never underestimate vulnerabilities that allow writing data anywhere – even if it’s done by the book and the exploitation paths aren’t obvious.Tarfile is part of the standard Python library and can be found in almost any Linux-based system (among others). However, the danger is in the use of a specific vulnerable function. Generally speaking, any project developed in Python that employs a tarfile module is a vulnerability. From the end user’s point of view, it’s a tricky situation: they may be running a potentially vulnerable program and not even know that it uses tar. Kaspersky experts recommend to:For developers, this problem is a reason to audit their own code to find calls to a vulnerable function, and to amend accordingly.Episode 269 looks at dodgy NFTs, Rockstar and Uber hacker arrested, and much more!\nEpisode 269 looks at dodgy NFTs, Rockstar and Uber hacker arrested, and much more!\nSeptember 30, 2022\nFour handy ways to lock your screen on Windows and macOS.\nFour handy ways to lock your screen on Windows and macOS.\nNovember 10, 2023\nMistakes commonly found in almost every large organization. What should the inforsec team look out for, and what protective measures should they take?\nMistakes commonly found in almost every large organization. What should the inforsec team look out for, and what protective measures should they take?\nNovember 8, 2023\nEverything you wanted to know about Google account passkeys: how they work, why they’re needed, where to enable them, how to configure them, and what storage options are available.\nEverything you wanted to know about Google account passkeys: how they work, why they’re needed, where to enable them, how to configure them, and what storage options are available.\nNovember 3, 2023\nReady, set, tech: preparing for your kids’ first device.\nReady, set, tech: preparing for your kids’ first device.\nOctober 31, 2023\nCopyright © 2023 AO Kaspersky Lab. All Rights Reserved.Global"
   },
   {
      "time": "2022-10-03",
      "title": "Researchers Crowdsourcing Effort to Identify Mysterious Metador APT - SecurityWeek",
      "text": " Hi, what are you looking for?Cybersecurity sleuths at SentinelLabs are calling on the wider threat hunting community to help decipher a new mysterious malware campaign hitting telcos, ISPs and universities in the Middle East and Africa.ByFlipboardRedditWhatsappWhatsappEmail“Attributing Metador remains a garbled mystery. We encountered multiple languages, with diverse idiosyncrasies indicative of multiple  developers.  There are indications of a  separation between developers and operators. And despite a lack of samples,  the version history for at least one of the platforms suggests a history of development that extends far beyond the intrusions we’ve uncovered. \n\nAn interesting divergence in build times suggests a possible working timezone of UTC+1. And cultural references include a Latin American cartoon popular throughout the hispanic diaspora since the 1950s, as well as a quote from a popular 80’s British Pop Punk band. While the targets suggest state interests, we vaguely suspect a contractor arrangement.”Advertisement. Scroll to continue reading.\n\n\n\nAn interesting divergence in build times suggests a possible working timezone of UTC+1. And cultural references include a Latin American cartoon popular throughout the hispanic diaspora since the 1950s, as well as a quote from a popular 80’s British Pop Punk band. While the targets suggest state interests, we vaguely suspect a contractor arrangement.”Advertisement. Scroll to continue reading.\n\n\nAn interesting divergence in build times suggests a possible working timezone of UTC+1. And cultural references include a Latin American cartoon popular throughout the hispanic diaspora since the 1950s, as well as a quote from a popular 80’s British Pop Punk band. While the targets suggest state interests, we vaguely suspect a contractor arrangement.”Advertisement. Scroll to continue reading.\n\n\nRyan Naraine is Editor-at-Large at SecurityWeek and host of the popular Security Conversations podcast series. He is a security community engagement expert who has built programs at major global brands, including Intel Corp., Bishop Fox and GReAT. Ryan is a founding-director of the Security Tinkerers non-profit, an advisor to early-stage entrepreneurs, and a regular speaker at security conferences around the world.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.The changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...Zero trust is not a replacement for identity and access management (IAM), but is the extension of IAM principles from people to everyone and...A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The CRYSTALS-Kyber public-key encryption and key encapsulation mechanism recommended by NIST for post-quantum cryptography has been broken using AI combined with side channel attacks.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-10-03",
      "title": "Nord Stream pipeline disinformation fits pattern of Russian information warfare | CyberScoop",
      "text": " \n\nSeptember 30, 2022\n\nWithin hours of this week’s Nord Stream pipeline explosion, Russian officials, Twitter users and Tucker Carlson began circulating disinformation suggesting that the Biden administration was responsible for the apparent act of sabotage.While there is not yet evidence to say exactly who is responsible for the Nord Stream attack there are, however, plenty of officials pointing at Russia. State Department spokesman Ned Price and several European officials all blamed Moscow, alternately calling them culpable for the sabotage itself or at a minimum guilty of leveraging the incident to smear the U.S.The episode fits perfectly into the Russian playbook for weaponizing information, experts say, and is also a textbook example for how quickly disinformation can be ginned up in the wake of major geopolitical events. The Nord Stream pipeline has long been a lightning rod in Europe, with Germany blocking part of it from going into service, and Russia later turning part of it off, spurring a desperate European effort to heat homes.The director of the Alperovitch Institute for Cybersecurity Studies at Johns Hopkins University’s School of Advanced International Studies, Rid said he is making the “working assumption” that Russia is behind the operation in part because they are “trying to play the disinformation card and [are] blaming others for it so quickly, before evidence has even emerged.” Jamil Jaffer, executive director of the National Security Institute at George Mason University’s Scalia Law School, said the Nord Stream sabotage is a “classic example of Russian active measures: conduct a covert operation to gain a political or military advantage and then assert that others are responsible both through overt and covert channels.”“If Russia invades, that means tanks or troops crossing the border of Ukraine again, then there will be no longer a Nord Stream 2 ,” Biden told reporters. “We will bring an end to it.” One journalist wondered how Biden could make that promise since Germany controls the project. The president replied: “I promise you: We will be able to do it.”“The idea that the United States was in any way involved in the apparent sabotage of these pipelines is preposterous. It is nothing more than a function of Russian disinformation and should be treated as such.”It’s unclear exactly what Biden meant, but days after his press conference the German government shut down the pipeline in response to Russia formally recognizing two breakaway regions of Eastern Ukraine.“Biden spoke so ambiguously — this  is a powerful piece of disinformation,” Aleksejeva said.If Russia is found to be responsible for the physical attack, then the Nord Stream sabotage would be a trademark example for how the Russian government leverages information campaigns to complement cyber operations, experts said.Additionally, she said, Russians recently hijacked the Facebook accounts of military leaders in Ukraine to send messages to troops asking them to surrender. Hacked Ukrainian radio stations have also been used to spread similar propaganda.Glenn Gerstell, who worked extensively on Russian disinformation efforts when he was the general counsel of the National Security Agency, called the disinformation swirling around Nord Stream in keeping with “a longstanding pattern for Russia — they use disinformation as a direct tool of their statecraft.”Gerstell, now a senior adviser at the Center for Strategic and International Studies, said Russia has weaponized disinformation “going back literally to czarist days where the government felt perfectly free to lie to its own population as well as to foreign audiences.” He cited Russia’s pretense for invading Finland in 1939 as one example of the historic Russian use of propaganda to bolster military aggression.The operation Meta discovered leveraged artificial intelligence to create hundreds of fake social media accounts and more than 60 phony news sites to spread Russia’s narrative supporting the Ukraine invasion."
   }
]