[
   {
      "time": "2022-12-24",
      "title": "Hackers exploit bug in WordPress gift card plugin with 50K installs",
      "text": " Hackers are actively targeting a critical flaw in YITH WooCommerce Gift Cards Premium, a WordPress plugin used on over 50,000 websites.YITH WooCommerce Gift Cards Premium is a plugin that website operators to sell gift cards in their online stores.CVE-2022-45359 was disclosed to the public on November 22, 2022, impacting all plugin versions up to 3.19.0. The security update that addressed the problem was version 3.20.0, while the vendor has already released 3.21.0 by now, which is the recommended upgrade target.Unfortunately, many sites still use the older, vulnerable version, and hackers have already devised a working exploit to attack them.According to WordPress security experts at Wordfence, the exploitation effort is well underway, with hackers leveraging the vulnerability to upload backdoors on the sites, obtain remote code execution, and perform takeover attacks.Wordfence reverse-engineered an exploit hackers are using in attacks, finding that the issue lies in the plugin’s “import_actions_from_settings_panel” function that runs on the “admin_init” hook.Moreover, this function does not perform CSRF or capability checks in vulnerable versions.These two issues make it possible for unauthenticated attackers to send POST requests to “/wp-admin/admin-post.php” using the appropriate parameters to upload a malicious PHP executable on the site.The malicious requests appear on logs as unexpected POST requests from unknown IP addresses, which should be a sign for site admins they are under attack.The uploaded files spotted by Wordfence are the following:The analysts report that most attacks occurred in November before admins could patch the flaw, but a second peak was observed on December 14, 2022.IP address 103.138.108.15 was a significant source of attacks, launching 19,604 exploitation attempts against 10,936 websites. The next largest IP address is 188.66.0.135, which conducted 1,220 attacks against 928 WordPress sites.The exploitation attempts are still ongoing, so users of the YITH WooCommerce Gift Cards Premium plugin are recommended to upgrade to version 3.21 as soon as possible."
   },
   {
      "time": "2022-12-24",
      "title": "France Fines Microsoft 60 Million Euros Over Advertising Cookies - SecurityWeek",
      "text": " Hi, what are you looking for?France’s privacy watchdog said Thursday it has fined US tech giant Microsoft 60 million euros ($64 million) for foisting advertising cookies on users.ByFlipboardRedditWhatsappWhatsappEmailAFP 2023Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.SecurityWeek spoke with more than 300 cybersecurity experts to see what is bubbling beneath the surface, and examine how those evolving threats will present...Joanna Burkey, CISO at HP, and Kevin Cross, CISO at Dell, discuss how the role of a CISO is different for a multinational corporation...In this issue of CISO Conversations we talk to two CISOs about solving the CISO/CIO conflict by combining the roles under one person.Security professionals understand the need for resilience in their company’s security posture, but often fail to build their own psychological resilience to stress.SecurityWeek examines how a layoff-induced influx of experienced professionals into the job seeker market is affecting or might affect, the skills gap and recruitment...The three primary drivers for cyber regulations are voter privacy, the economy, and national security – with the complication that the first is often...2022 Cybersecurity Year in Review: Top news headlines and trends that impacted the security ecosystemGot a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-24",
      "title": "HHS alert warns KillNet hacktivist group targeted US healthcare entity | SC Media",
      "text": "  The headquarters building of the U.S. Department of Health and Human Services is the Hubert H. Humphrey Building, located at the foot of Capitol Hill. (Photo credit: Library of Congress).HC3 has been closely tracking hacktivist groups given their broad global targeting across a range of sectors, including healthcare. These groups are known to launch DDoS attacks with “thousands of connection requests and packets to be sent to the target server or website per minute, slowing down or even stopping vulnerable systems.”KillNet is one of these hacktivist groups with unconfirmed ties to official Russian government organizations like the Russian Federal Security Service (FSB) or the Russian Foreign Intelligence Service (SVR). The group previously targeted primarily European countries perceived to be hostile to Russia.But the war in Ukraine has shifted those tactics to include countries that are part of NATO. “While KillNet’s DDoS attacks usually do not cause major damage, they can cause service outages lasting several hours or even days,” according to the alert. “The group should be considered a threat to government and critical infrastructure organizations, including healthcare.”Particularly as the group recently targeted a U.S. organization in the healthcare sector.KillNet has previously targeted or threatened to target healthcare and public health organizations. The HC3 alert stressed that a senior member of the group previously threatened Congress “with the sale of the health and personal data of the American people because of the Ukraine policy of the U.S. Congress.”Just this month, the group claimed to have compromised a “U.S.-based healthcare organization that supports members of the U.S. military and claimed to possess a large amount of user data from that organization,” according to the alert. And after the arrest of a KillNet member earlier this year, the group demanded his release and threatened to target life-saving ventilators in British hospitals if their demands were not met. The same member also threatened to target the UK Ministry of Health.But “it’s worth taking any claims KillNet makes about its attacks or operations with a grain of salt given the group’s tendency to exaggerate. It’s possible some of these announced operations and developments may only be to garner attention, both publicly and across the cybercrime underground,” according to the alert.HC3 also noted that it’s likely the group’s senior members have extensive experience with deploying DDoS attacks, but KillNet has been using publicly available DDoS scripts and IP stressors for most of its operations. And federal efforts have shut down dozens of internet domains tied to leading DDoS-for-hire services, while taking other enforcement actions.But despite successful efforts, it’s unknown how much the law enforcement actions will impact KillNet. It’s also possible that “pro-Russian ransomware groups or operators, such as those from the defunct Conti group, will heed KillNet’s call and provide support.”“This likely will result in entities KillNet targeted also being hit with ransomware or DDoS attacks as a means of extortion, a tactic several ransomware groups have used,” HC3 warned.While it’s not possible to completely eliminate the risk of a DDoS attack, providers should take note of the recommended measures for preparing to respond to a possible attack. This should include prioritizing services, understanding defense measures, upstream defenses, and having a well-practiced response plan. The alert contains links to Killnet insights, as well as recommended DDoS measures provided by the Cybersecurity and Infrastructure Security Agency.“Increased vigilance is especially important currently as foreign cyber gangs and spies continue to test our resiliency through use of remote access tools, exploitation of technical vulnerabilities and use of new ransomware strains — all in an attempt to steal patient data and disrupt health care delivery,” Riggi said in a statement.Riggi stressed that it’s important to review the multiple ransomware alerts provided by HC3 and other federal defense agencies in the last month and apply the recommended remediation measures.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Ukraine had experienced a less than a day-long power outage in October 2022 following an attack by Russian state-sponsored hacking operation Sandworm targeted at an electrical substation amid the ongoing Russia-Ukraine war, marking the first cyberattack-related power interruption in the country since 2017, CyberScoop reports.Attacks deployed by Iranian state-backed threat operation MuddyWater against Israel saw the utilization of the new MuddyC2Go command-and-control framework, which replaced the PhonyC2 custom platform following the exposure of its source code, reports The Hacker News.Israel had its technology, logistics, and transportation industries targeted by Iranian advanced persistent threat operation Charming Kitten, also known as APT35 and Imperial Kitten, last month amid its ongoing war with Palestinian militant group Hamas, according to The Record, a news site by cybersecurity firm Recorded Future.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-12-24",
      "title": "Researchers Warn of Kavach 2FA Phishing Attacks Targeting Indian Govt. Officials",
      "text": " A new targeted phishing campaign has zoomed in on a two-factor authentication solution called Kavach that's used by Indian government officials.Cybersecurity firm Securonix dubbed the activity STEPPY#KAVACH, attributing it to a threat actor known as SideCopy based on tactical overlaps with prior attacks.The HTML application, the company said, \"was discovered being hosted on a likely compromised website, nested inside an obscure 'gallery' directory designed to store some of the site's images.\"The compromised website in question is incometaxdelhi[.]org, the official website for India's Income Tax department pertaining to the Delhi region. The malicious file is no longer available on the portal.The JavaScript code further downloads an executable from a remote server, establishes persistence via Windows Registry modifications, and reboots the machine to automatically launch the binary post startup.The binary file, for its part, functions as a backdoor that enables the threat actor to execute commands sent from an attacker-controlled domain, fetch and run additional payloads, take screenshots, and exfiltrate files.The exfiltration component also includes an option to specifically search for a database file (\"kavach.db\") created by the Kavach app on the system to store the credentials.\"Based on correlated data from the binary samples obtained of the RAT used by the threat actors, this campaign has been going on against Indian targets undetected for the last year,\" the researchers said.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-24",
      "title": "Massive Twitter data leak investigated by EU privacy watchdog",
      "text": " Source: DALL-EThe Irish Data Protection Commission (DPC) has launched an inquiry following last month's news reports of a massive Twitter data leak.In a statement on Friday, the Irish privacy regulator said, \"the DPC corresponded with Twitter International Unlimited Company ('TIC') in relation to a notified personal data breach that TIC claims to be the source vulnerability used to generate the datasets and raised queries in relation to GDPR compliance.\"It also added that it believes \"one or more provisions of the GDPR and/or the Act may have been, and/or are being, infringed in relation to Twitter Users' personal data.\"The DPC, which serves as Twitter's lead EU watchdog, wants to determine if the social media giant has fulfilled its obligations as a data controller regarding the processing of user data and whether it has violated any provisions of the General Data Protection Regulation (EU GDPR) or the Data Protection Act 2018.The Facebook user data was also shared on a well-known hacking forum, allowing threat actors to use it for targeted attacks.While most of the data was publicly available, such as Twitter IDs, names, login names, locations, and verified status, the leaked database also included non-public information, such as email addresses and phone numbers.BleepingComputer found that the bug was exploited by Pompompurin, the owner of the Breached hacking forum, who also harvested the information of an additional 1.4 million suspended Twitter users using a different API. This brought the total number of Twitter profiles scraped for private information to almost 7 million.During September and November, the same database containing 5,485,635 Twitter user records was also shared for free on a hacking forum.The records contain a wealth of public and private user data, including personal email addresses or phone numbers, as well as publicly scraped data, such as the Twitter ID, name, screen name, verified status, location, URL, description, follower count, account creation date, friends count, favorites count, statuses count, and profile image URLs.\"I have just received evidence of a massive Twitter data breach affecting millions of Twitter accounts in EU and US,\" Loder said.\"I have contacted a sample of the affected accounts and they confirmed that the breached data is accurate. This breach occurred no earlier than 2021.\"BleepingComputer has verified with multiple affected users that the phone numbers in this data breach are valid.It is worth noting that none of the phone numbers in this leaked database were present in the original data sold in August 2002, demonstrating the significant exchange of Twitter user data among threat actors and the extent of the data breach beyond what was previously known.​We were also told that the second leaked database contains more than 17 million records, though this information has not been independently confirmed.BleepingComputer has reached out to Twitter about this additional data dump of private user information but has not yet received a response."
   },
   {
      "time": "2022-12-24",
      "title": "Facebook Agrees to Pay $725 Million to Settle Privacy Suit - SecurityWeek",
      "text": " Hi, what are you looking for?Facebook parent Meta has agreed to pay $725 million to settle a long-running lawsuit that accused the social network of allowing third parties, including Cambridge Analytica, to access users’ private data.The amount was disclosed in a court filing late on Thursday.ByFlipboardRedditWhatsappWhatsappEmailAFP 2023Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe three primary drivers for cyber regulations are voter privacy, the economy, and national security – with the complication that the first is often...Two of humanity’s greatest drivers, greed and curiosity, will push AI development forward. Our only hope is that we can control it.Los Gatos, Calif-based data protection and privacy firm Titaniam has raised $6 million seed funding from Refinery Ventures, with participation from Fusion Fund, Shasta...Many in the United States see TikTok, the highly popular video-sharing app owned by Beijing-based ByteDance, as a threat to national security.The following is...Employees of Chinese tech giant ByteDance improperly accessed data from social media platform TikTok to track journalists in a bid to identify the source...As smartphone manufacturers are improving the ear speakers in their devices, it can become easier for malicious actors to leverage a particular side-channel for...The proposed UK Online Safety Bill is the enactment of two long held government desires: the removal of harmful internet content, and visibility into...AWS has announced that server-side encryption (SSE-S3) is now enabled by default for all Simple Storage Service (S3) buckets.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-24",
      "title": "Ransomware Attack Causes Disruption at British Newspaper The Guardian - SecurityWeek",
      "text": " Hi, what are you looking for?British news organization The Guardian on Wednesday announced that a ransomware attack has been causing disruption to behind-the-scenes services.ByFlipboardRedditWhatsappWhatsappEmail“There has been a serious incident which has affected our IT network and systems. We believe this to be a ransomware attack but are continuing to consider all possibilities.\n\nWe are continuing to publish globally to our website and apps and although some of our internal systems are affected, we expect to keep publishing in print. Our technology teams are working to deal with all aspects of this incident, with the vast majority of our staff able to work from home as we did during the pandemic.\n\nWe will continue to keep our staff and anyone else affected informed.”\n\nWe are continuing to publish globally to our website and apps and although some of our internal systems are affected, we expect to keep publishing in print. Our technology teams are working to deal with all aspects of this incident, with the vast majority of our staff able to work from home as we did during the pandemic.\n\nWe will continue to keep our staff and anyone else affected informed.”\nWe are continuing to publish globally to our website and apps and although some of our internal systems are affected, we expect to keep publishing in print. Our technology teams are working to deal with all aspects of this incident, with the vast majority of our staff able to work from home as we did during the pandemic.\n\nWe will continue to keep our staff and anyone else affected informed.”\n\nWe will continue to keep our staff and anyone else affected informed.”\nWe will continue to keep our staff and anyone else affected informed.”\nIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-24",
      "title": "Over 50 New CVE Numbering Authorities Announced in 2022 - SecurityWeek",
      "text": " Hi, what are you looking for?More than 50 organizations have been added as a CVE Numbering Authority (CNA) in 2022, bringing the total to 260 CNAs across 35 countries.Most CNAs can assign CVE identifiers to vulnerabilities found in their own products, but some can also assign CVEs to flaws found by their researchers in third-party software that is not in another CNA’s scope.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...SecurityWeek spoke with more than 300 cybersecurity experts to see what is bubbling beneath the surface, and examine how those evolving threats will present...Joanna Burkey, CISO at HP, and Kevin Cross, CISO at Dell, discuss how the role of a CISO is different for a multinational corporation...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...In this issue of CISO Conversations we talk to two CISOs about solving the CISO/CIO conflict by combining the roles under one person.The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...Security professionals understand the need for resilience in their company’s security posture, but often fail to build their own psychological resilience to stress.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-24",
      "title": "After ransomware hits Colombian energy firm, Moody’s says low patch rate suggests inadequacies in cyber practices | SC Media",
      "text": "  A ransomware attack at top Colombian energy company Empresas Publicas de Medellin (EPM) may damage its credit quality, setting an alarm clock for the critical infrastructure industry to develop efficient mitigation practices and vulnerability management programs, Moody’s said.   “These companies [in critical infrastructure sectors] have a significant systemic role within the broader economy, rapidly adopt digital technologies across all of their services, and yet practice only average cyber defense compared to other highly attractive sectors such as banking and telecommunications,” Moody’s said in the report.According to Moody’s, one of the critical measures of sound cyber defense practices is patching cadence — the rate at which an issuer remediates exposure to known vulnerabilities during security incidents like ransomware.  In terms of EPM’s defense practices, BitSight most recently scored it a “C,” which indicates that the company is nearly seven times more likely to fall victim to those organizations graded an “A.”  “While the attackers’ method for infiltrating EPM’s network is still unknown, and attackers may not have exploited unpatched systems, a low score in patching cadence does suggest some inadequacies in terms of prevailing cyber practices,” Moody’s noted.  Moody’s has not yet taken any rating action against EPM due to the ransomware attack.  Moody’s always looks at the long-term impacts of cyber risk and may downgrade an organization if the risk produces sustained pressure on business operations, Gerry Granovsky, senior vice president at Moody’s, told SC Media in an interview. Menghan Xiao is a cybersecurity reporter at SC Media, covering software supply chain security, workforce/business, and threat intelligence. Before SC Media, Xiao studied journalism at Northwestern University, where she received a merit-based scholarship from Medill and Jack Modzelewski Scholarship Fund.After admitting responsibility for compromising Sony, a Colonial Pipeline supplier, and a Hawai'i government site, the RansomedVC group has claimed that it will be ending operations due to the arrests of six of its affiliates, reports The Record, a news site by cybersecurity firm Recorded Future.U.S. advanced electronic components manufacturer Kyocera AVX Components Corporation has disclosed that 39,111 individuals around the world had their data compromised following a ransomware attack earlier this year, which has been claimed by the LockBit ransomware operation, reports BleepingComputer.Attack on the U.S. subsidiary of the Industrial & Commercial Bank of China disrupted Treasury trading in New York earlier this week.  Tue Jun 25Thu Dec 14Thu Nov 16   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-12-24",
      "title": "Container Verification Bug Allows Malicious Images to Cloud Up Kubernetes",
      "text": " A high-severity security vulnerability in the Kyverno admission controller for container images could allow malicious actors to import a raft of nefarious code into cloud production environments.\"The vulnerability enables a complete bypass of image signature verification. In the case of a Kubernetes cluster, this gives an attack a wide range of targets. Any workload can mount cluster secrets and data volumes,\" Ben Hirschberg, CTO and co-founder of ARMO, tells Dark Reading. \"This means the attacker can inject code that can steal data and credentials from the Kubernetes cluster of the victim. This also enables the attacker to inject his/her own code and use the CPU of the victim for things like cryptocurrency mining.\"If they check out, the image gets the green light, and the container runtime starts a new workload based on said image.The vulnerability arises because the controller's signature validation process downloads the image manifest twice — but only verifies a signature for one of the downloads, according to the advisory.Thus, the attack looks like this: An administrator is social-engineered into pulling a container image from a malicious registry or proxy. When the image is first imported, the malicious registry returns a valid, benign, signed image to the admission controller. So far, so good.The vulnerability was introduced in version 1.8.3 and was fixed in version 1.8.5; Kyverno users should update as soon as possible. The patch ensures that the same image hash is used to change the workload specification as was used to verify the signature.This specific vulnerability affects only Kubernetes with Kyverno, but other image signature verification tools need to take care not to be vulnerable to the same method, Hirschberg warned.To carry out a real-world attack, threat actors can use either compromised accounts on existing registries to host malicious images, or they can establish their own private container registry and then set about convincing an admin to trust it.From a practical standpoint, \"creating a malicious registry for an experienced attacker is not a challenge,\" Hirschberg says. \"An attacker can take any open source registry software, make some minor modifications to make the attack work, and run it in the cloud under a custom domain.\"Hirschberg notes that only a fraction of Kubernetes users have strictures on where they can pull container workloads from, so cloud admins are not likely to be immediately on their guard when it comes to using third-party registries — particularly if they have image signature verification in place.\"The attacker could go phishing and publish in multiple forums a notification that there is a new version of software XYZ, and here are the Kubernetes YAML or Helm to run it,\" he explains. \"Since some people feel protected by image signature verification, their guard would be down and would not be afraid to run the image.\"Containers are a good target for cybercriminals because they mostly run in the cloud with access to plenty of computational resources, which are precious and expensive, Hirschberg points out — so, this enables attackers to steal computational resources and data, while also going unnoticed for a relatively long period of time.\"We don’t have exact statistics, but it is very clear that with the wide adoption of containers, this is becoming a more prevalent issue,\" he says. \"Security teams are learning how to handle them, and Kubernetes in general. I don't think that it is a true 'blind spot,' but container security teams are still learning the whole environment with many neglected areas.\"With the adoption of image signature verification still in its early stages, admission controllers represent one of those potentially neglected areas. But they're also part of a broader conversation about supply chain software security, that should be put in the spotlight.\"The SolarWinds attack showed the world how sensitive this issue is when it comes to trusting the security of external code,\" Hirschberg says. \"Kyverno is among the first security tools to implement signature validation, and with new features can come new bugs. Hopefully, this finding makes this a more secure mechanism and will help the industry to overcome the problem of verifying software in Kubernetes.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   }
]