[
   {
      "time": "2022-12-06",
      "title": "Microsoft warns of Russian cyberattacks throughout the winter",
      "text": " Microsoft has warned of Russian-sponsored cyberattacks continuing to target Ukrainian infrastructure and NATO allies in Europe throughout the winter.Redmond said in a report published over the weekend that it observed a pattern of targeted attacks on infrastructure in Ukraine by the Russian military intelligence threat group Sandworm in association with missile strikes.The attacks have been accompanied by a propaganda campaign to undermine Western support (from the U.S., EU, and NATO) for Ukraine.Russian propaganda has also sought to undermine European support for Ukraine and sow discord, with the end goal of disrupting the supply of aid and weaponry to Ukraine.These attacks are expected to continue and could extend beyond Ukraine's borders to target countries and companies providing the country with vital supplies.Microsoft says that Europe should be prepared for \"several lines of potential Russian attack in the digital domain over the course of this winter.\"\"Russia will seek to exploit cracks in popular support for Ukraine to undermine coalitions essential to Ukraine's resilience, hoping to impair the humanitarian and military aid flowing to the region.\"We should also be prepared for cyber-enabled influence operations that target Europe to be conducted in parallel with cyberthreat activity.\"The vast majority of the attacks were primarily focused on obtaining sensitive info from governments of countries playing crucial roles in NATO's and the West's response to Russia's war.Slovak software company ESET who first spotted the wave of attacks, said at the time the ransomware they named RansomBoggs had been found on the networks of multiple Ukrainian organizations."
   },
   {
      "time": "2022-12-06",
      "title": "Wiper, Disguised as Fake Ransomware, Targets Russian Orgs",
      "text": " Companies infected with purported ransomware may no longer have an option to pay a ransom.A new malicious program acts exactly like crypto-ransomware — overwriting and renaming files, then dropping a text file with a ransom note and a Bitcoin address for payment — but the program instead deletes the contents of a victim's files. The program, CryWiper, currently targets Russian organizations but could easily be used against companies and organizations in other nations, according to cybersecurity firm Kaspersky, which analyzed the program.The camouflaged wiper program continues a trend in ransomware being used — intentionally or inadvertently — as a wiper, the company's researchers stated in the analysis.\"In the past, we've seen some malware strains that became wipers by accident — due to mistakes of their creators who poorly implemented encryption algorithms,\" the researchers wrote. \"However, this time it’s not the case: our experts are confident that the main goal of the attackers is not financial gain, but destroying data. The files are not really encrypted; instead, the Trojan overwrites them with pseudo-randomly generated data.\"The latest attack targeted a Russian organization, the Kaspersky researchers stated in their analysis, suggesting that it could be retribution by Ukrainian forces or partisan hackers.\"Given the blanket cover that is used — pretending to be ransomware — and the limited time it takes to write a simple wiper, it seems like anyone can be behind this attack,\" Max Kersten, a malware researcher at cybersecurity firm Trellix. \"Kaspersky indicates the victims are Russian, meaning anti-Russian activists, pro-Ukrainian activists, Ukraine as a state, or states supporting Ukraine, could be behind it, as I see it.\"\"After examining a sample of malware, we found out that this Trojan, although it masquerades as a ransomware and extorts money from the victim for 'decrypting' data, does not actually encrypt, but purposefully destroys data in the affected system,\" Kaspersky stated. \"Moreover, an analysis of the Trojan's program code showed that this was not a developer's mistake, but his original intention.\"CryWiper is not the first ransomware program to overwrite data without allowing for its decryption. Another recently discovered program, W32/Filecoder.KY!tr, also overwrites files, but in this case, because of poor programming, the data cannot be recovered.CryWiper appears to be an original piece of malware, but the destructive malware uses the same pseudo-random number generator (PRNG) algorithm as IsaacWiper, a program used to attack public-sector organizations in Ukraine, while CryWiper appears to have attacked a group in the Russian Federation, Kaspersky stated the Russian analysis.Several variants of the Xorist ransomware family and the Trojan-Ransom.MSIL.Agent family used the same email address in the note left behind by the CryWiper following its corruption of data, but Trellix's Kersten believes that could have intended to cause confusion.\"The re-use of the email address in the ransom note in different samples could be done to throw off analysts who are looking to connect the dots, or it could be an actual mistake,\" he says. \"The latter, I think, is less likely as the malware's code contains some mistakes showing it hasn't been tested thoroughly, which makes me think the creator [or creators] were under the pressure of time.\"In the past, companies targeted with ransomware have agonized over the decision of whether to pay ransomware groups to use backups and offline copies to recover from a crypto-ransomware event.\"CryWiper positions itself as a ransomware program, that is, it claims that the victim's files are encrypted and, if a ransom is paid, they can be restored. However, this is a hoax: in fact, the data is destroyed and cannot be returned,\" Kaspersky stated. \"The activity of CryWiper once again shows that the payment of the ransom does not guarantee the recovery of files.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-06",
      "title": "CISA orders agencies to patch exploited Google Chrome bug by Dec 26th",
      "text": " The Cybersecurity and Infrastructure Security Agency (CISA) has added one more security vulnerability to its list of bugs known to be exploited in attacks.The flaw (tracked as CVE-2022-4262) was patched as an actively exploited zero-day bug in the Google Chrome web browser on Friday for Windows, Mac, and Linux users.This is the ninth Chrome zero-day exploited in the wild that Google has patched since the start of the year.The bug is caused by a high-severity type confusion weakness in the Chromium V8 JavaScript engine reported by Clement Lecigne of Google's Threat Analysis Group.Although type confusion flaws would generally lead to browser crashes following successful exploitation by reading or writing memory out of buffer bounds, attackers can also exploit them for arbitrary code execution.While the company said it detected attacks exploiting this zero-day, it is yet to share technical details or information regarding these incidents likely to allow the security update to roll out to all impacted systems and provide users with enough time to upgrade their browsers before more attackers develop their own CVE-2022-4262 exploits.They were given three weeks, until December 26th, to patch all vulnerable Chrome installations on their systems to ensure that ongoing exploitation attempts would be blocked.Taking this advice to heart would help decrease the attack surface threat actors can exploit in attempts to breach the agencies' networks."
   },
   {
      "time": "2022-12-06",
      "title": "Ransomware attack forces French hospital to transfer patients",
      "text": " The André-Mignot teaching hospital in the suburbs of Paris had to shut down its phone and computer systems because of a ransomware attack that occurred on Saturday evening.According to Richard Delepierre, the co-chairman of the hospital's supervisory board, the attackers behind this ransomware incident have already demanded a ransom.Currently, the hospital only accepts walk-ins and consultations as it had to partially cancel operations. It was also forced to transfer six patients from its neonatal and intensive care units to other healthcare facilities, according to France's Minister of Health and Prevention François Braun.\"All our means are deployed alongside the professionals mobilized to ensure the care of patients.\"The cyberattack is now being investigated by ANSSI and the Paris prosecutor's office, which has also opened a preliminary investigation into hacking state data and attempted extortion after the André-Mignot hospital filed a formal complaint on Sunday.\"To date, no other health facility in the region has been impacted by this cyberattack on which investigations are continuing by the National Authority for Security and Defense of Information Systems (ANSSI),\" ARS added.While the ransomware operation behind the attack on the André-Mignot hospital remains unknown, multiple gangs are known for targeting healthcare organizations."
   },
   {
      "time": "2022-12-06",
      "title": "SiriusXM Vulnerability Lets Hackers Remotely Unlock and Start Connected Cars",
      "text": " Cybersecurity researchers have discovered a security vulnerability that exposes cars from Honda, Nissan, Infiniti, and Acura to remote attacks through a connected vehicle service provided by SiriusXM.The vulnerability relates to an authorization flaw in a telematics program that made it possible to retrieve a victim's personal details as well as execute commands on the vehicles by sending a specially crafted HTTP request containing the VIN number to a SiriusXM endpoint (\"telematics.net\").Through reverse engineering the MyHyundai and MyGenesis apps and inspecting the API traffic, the researchers found a way to get around the email validation step and seize control of a target car's functions remotely.SiriusXM and Hyundai have since rolled out patches to address the flaws.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-06",
      "title": "Hackers hijack Linux devices using PRoot isolated filesystems",
      "text": " Hackers are abusing the open-source Linux PRoot utility in BYOF (Bring Your Own Filesystem) attacks to provide a consistent repository of malicious tools that work on many Linux distributions.A Bring Your Own Filesystem attack is when threat actors create a malicious filesystem on their own devices that contain a standard set of tools used to conduct attacks. This file system is then downloaded and mounted on compromised machines, providing a preconfigured toolkit that can be used to compromise a Linux system further.\"First, threat actors build a malicious filesystem which will be deployed. This malicious filesystem includes everything that the operation needs to succeed,\" explains a new report by Sysdig.\"Doing this preparation at this early stage allows all of the tools to be downloaded, configured, or installed on the attacker's own system far from the prying eyes of detection tools.\"Sysdig says the attacks typically lead to cryptocurrency mining, although more harmful scenarios are possible.The researchers also warn about how easy this novel technique could make scaling malicious operations against Linux endpoints of all kinds.PRoot is an open-source utility that combines the 'chroot', 'mount --bind', and 'binfmt_misc' commands, allowing users to set up an isolated root filesystem within Linux.By default, the PRoot processes are confined within the guest filesystem; however, QEMU emulation can be used to mix host and guest programs execution.Additionally, programs from within the guest filesystem can use the built-in mount/bind mechanism to access files and directories from the host system.The filesystem contains everything required for the attack, neatly packaged in a Gzip-compressed tar file with all the necessary dependencies, dropped directly from trusted cloud hosting services like DropBox.As PRoot is statically compiled and doesn't require any dependencies, threat actors simply download the precompiled binary from GitLab, and execute it against the attacker's downloaded and extracted filesystem to mount it.In most cases seen by Sysdig, the attackers unpacked the filesystem on '/tmp/Proot/' and then activated the XMRig cryptominer.\"Any dependencies or configurations are also included in the filesystem, so the attacker does not need to run any additional setup commands,\" explains Sysdig\"The attacker launches PRoot, points it at the unpacked malicious filesystem, and specifies the XMRig binary to execute.\"As Sysdig highlights in the report, the threat actors could easily use PRoot to download other payloads besides XMRig, potentially causing more severe damage to the breached system.The presence of \"mascan\" on the malicious filesystem implies an aggressive stance by the attackers, likely indicating they plan on breaching other systems from the compromised machine.The abuse of PRoot by hackers makes these post-exploitation attacks platform and distribution-agnostic, increasing the chances of success and the threat actors' stealthiness.Moreover, pre-configured PRoot filesystems allow attackers to use a toolkit across many OS configurations without having to port their malware to the targeted architecture or include dependencies and build tools.\"Using PRoot, there is little regard or concern for the target’s architecture or distribution since the tool smoothes out the attack struggles often associated with executable compatibility, environment setup, and malware and/or miner execution,\" explains Sysdig.\"It allows attackers to get closer to the philosophy of “write once, run everywhere,” which is a long sought-after goal.\"Attacks backed by PRoot make the environment setup irrelevant for the hackers, enabling them to scale up their malicious operations quickly."
   },
   {
      "time": "2022-12-06",
      "title": "Severe AMI MegaRAC flaws impact servers from AMD, ARM, HPE, Dell, others",
      "text": " Three vulnerabilities in the American Megatrends MegaRAC Baseboard Management Controller (BMC) software impact server equipment used in many cloud service and data center providers.The flaws were discovered by Eclypsium in August 2022 and could enable attackers, under certain conditions, to execute code, bypass authentication, and perform user enumeration.The researchers discovered the flaws after examining leaked proprietary code of American Megatrends, specifically, the MegaRAC BMC firmware.MegaRAC BMC is a solution for complete “out-of-band” and “lights-out” remote system management, allowing admins to troubleshoot servers remotely as if standing in front of the device.MegaRAC BMC firmware is used by at least 15 server manufacturers, including AMD, Ampere Computing, ASRock, Asus, ARM, Dell EMC, Gigabyte, Hewlett-Packard Enterprise, Huawei, Inspur, Lenovo, Nvidia, Qualcomm, Quanta, and Tyan.The three vulnerabilities discovered by Eclypsium and reported to American Megatrends and impacted vendors are the following:The most severe of the three flaws, CVE-2022-40259, requires prior access to at least a low-privileged account to perform the API callback.“The only complication is the attack sits in the path parameter, but it is not URLdecoded by the framework, so the exploit needs to be crafted specially to both be valid per URL and valid per bash shell command,” says Eclypisum.For the exploitation of CVE-2022-40242, the only prerequisite for the attacker is to have remote access to the device.The first two flaws are very severe due to giving attackers access to an administrative shell without requiring further escalation.The vulnerabilities could cause data manipulation, data breaches, service outage, business interruption, and more if successfully leveraged.The third flaw doesn’t have a significant direct security impact, as knowing what accounts exist on the target isn’t enough to cause any damage.However, it would open the way to brute-forcing passwords or performing credential-stuffing attacks.“Standardization of hosting & cloud providers on server components means these vulnerabilities can easily impact hundreds of thousands, possibly millions of systems.”System admins are recommended to disable remote administration options and add remote authentication steps where possible.Additionally, admins should minimize the external exposure of server management interfaces like Redfish and ensure that the latest available firmware updates are installed on all systems."
   },
   {
      "time": "2022-12-06",
      "title": "North Korean Hackers Spread AppleJeus Malware Disguised as Cryptocurrency Apps",
      "text": " The Lazarus Group threat actor has been observed leveraging fake cryptocurrency apps as a lure to deliver a previously undocumented version of the AppleJeus malware, according to new findings from Volexity.\"North Korea has conducted cyber theft against financial institutions and cryptocurrency exchanges worldwide, potentially stealing hundreds of millions of dollars, probably to fund government priorities, such as its nuclear and missile programs,\" per the 2021 Annual Threat Assessment released by U.S. intelligence agencies.The attack chain is said to have undergone a slight deviation in October 2022, with the adversary shifting from MSI installer files to a booby-trapped Microsoft Excel document that uses macros to download a remotely hosted payload, a PNG image, from OpenDrive.The idea behind the switch is likely to reduce static detection by security products, Volexy said, adding it couldn't obtain the image file (\"Background.png\") from the OpenDrive link but noted it embeds three files, including an encoded payload that's subsequently extracted and launched on the compromised host.\"The Lazarus Group continues its effort to target cryptocurrency users, despite ongoing attention to their campaigns and tactics,\" the researchers concluded.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-06",
      "title": "Critical Vulnerabilities Force Twitter Alternative Hive Social Offline - SecurityWeek",
      "text": " Hi, what are you looking for?Social media platform Hive Social has taken its servers offline after security researchers identified and reported critical vulnerabilities in its code.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-06",
      "title": "Critical Ping Vulnerability Allows Remote Attackers to Take Over FreeBSD Systems",
      "text": " The maintainers of the FreeBSD operating system have released updates to remediate a security vulnerability impacting the ping module that could be potentially exploited to crash the program or trigger remote code execution.As a consequence, the destination buffer could be overflowed by up to 40 bytes when the IP option headers are present.Snaps are self-contained application packages that can be distributed by upstream developers to users.Since the multipathd daemon runs by default as root, a successful exploitation of the flaws could enable an unprivileged threat actor to obtain the highest permissions on the vulnerable host and execute arbitrary code.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]