[
   {
      "time": "2022-11-28",
      "title": "5.4 million Twitter users' stolen data leaked online — more shared privately",
      "text": " Over 5.4 million Twitter user records containing non-public information stolen using an API vulnerability fixed in January have been shared for free on a hacker forum.Another massive, potentially more significant, data dump of millions of Twitter records has also been disclosed by a security researcher, demonstrating how widely abused this bug was by threat actors.The data consists of scraped public information as well as private phone numbers and email addresses that are not meant to be public.While most of the data consisted of public information, such as Twitter IDs, names, login names, locations, and verified status, it also included private information, such as phone numbers and email addresses.Using this ID, the threat actors could then scrape public information about the account to create a user record containing both private and public information, as shown below.It is unclear if the HackerOne disclosure was leaked, but BleepingComputer was told that multiple threat actors were utilizing the bug to steal private information from Twitter.Pompompurin, the owner of the Breached hacking forum, told BleepingComputer this weekend that they were responsible for exploiting the bug and creating the massive dump of Twitter user records after another threat actor known as 'Devil' shared the vulnerability with them.In addition to the 5.4 million records for sale, there were also an additional 1.4 million Twitter profiles for suspended users collected using a different API, bringing the total to almost 7 million Twitter profiles containing private information.Pompompurin said that this second data dump was not sold and was only shared privately among a few people.In September, and now more recently, on November 24th, the 5.4 million Twitter records have now been shared for free on a hacking forum.Pompompurin has confirmed to BleepingComputer that this is the same data that was for sale in August, and includes 5,485,635 Twitter user records.These records contain either a private email address or phone number, and public scraped data, including the account's Twitter ID, name, screen name, verified status, location, URL, description, follower count, account creation date, friends count, favorites count, statuses count, and profile image URLs. While it is concerning that threat actors released the 5.4 million records for free, an even larger data dump was allegedly created using the same vulnerability.This data dump potentially contains tens of millions of Twitter records consisting of personal phone numbers collected using the same API bug, and public information, including verified status, account names, Twitter ID, bio, and screen name.\"I have just received evidence of a massive Twitter data breach affecting millions of Twitter accounts in EU and US. I have contacted a sample of the affected accounts and they confirmed that the breached data is accurate. This breach occurred no earlier than 2021,\" Loder shared on Twitter.BleepingComputer has obtained a sample file of this previously unknown Twitter data dump, which contains 1,377,132 phone numbers for users in France.We have since confirmed with numerous users in this leak that the phone numbers are valid, verifying this additional data breach is real.Furthermore, none of these phone numbers are present in the original data sold in August, illustrating how much larger Twitter's data breach was than previously disclosed and the large amount of user data circulating among threat actors.Pompompurin also confirmed with BleepingComputer that they were not responsible and did not know who created this newly discovered data dump, indicating that other people were using this API vulnerability.BleepingComputer has learned that this newly discovered data dump consists of numerous files broken up by country and area codes, including Europe, Israel, and the USA.We were told that it consists of over 17 million records but could not independently confirm this.As this data can be potentially used for targeted phishing attacks to gain access to login credentials, it is essential to scrutinize any email that claims to come from Twitter.If you receive an email claiming your account was suspended, there are log in issues, or you are about to lose your verified status, and it prompts you to login on to a non-Twitter domain, ignore the emails and delete them as they are likely phishing attempts.BleepingComputer reached out to Twitter on Thursday about this additional data dump of private information but has yet to receive a response."
   },
   {
      "time": "2022-11-28",
      "title": "Cyber-enabled financial crime: USD 130 million intercepted in global INTERPOL police operation",
      "text": " LYON, France – An INTERPOL police operation to tackle online fraud has seen almost 1000 suspects arrested and the seizure of USD 129,975,440 worth of virtual assets.Fraud investigators around the world worked together over five months (28 June – 23 November) to intercept money and virtual assets linked to a wide range of cyber-enabled financial crimes and money laundering, assisting countries to recover and return illicitly obtained funds to victims.Specifically targeting voice phishing, romance scams, sextortion, investment fraud and money laundering associated with illegal online gambling, Operation HAECHI III was coordinated by INTERPOL’s Financial Crime and Anti-Corruption Centre (IFCACC) which supported 30 countries via their respective INTERPOL National Central Bureaus (NCBs).In total, the operation resulted in the arrest of 975 individuals and allowed investigators to resolve more than 1,600 cases. In addition almost 2,800 bank and virtual-asset accounts linked to the illicit proceeds of online financial crime were blocked.Operation HAECHI III investigations generated the publication of 95 INTERPOL Notices and diffusions, and the detection of 16 new crime trends.Operation HAECHI III brought together law enforcement agencies, Financial Intelligence Units, asset recovery offices, prosecutors and private sector financial experts to identify illicit funds and money mules, detect money laundering activities and deactivate associated bank accounts.International police cooperation during Operation HAECHI III unveiled several emerging online financial crime trends, particularly variations on impersonation scams, romance frauds, sextortion and investment frauds.Investigators also reported a surge in fraudulent investment schemes committed through the use of instant messaging apps where encrypted information is exchanged promoting the use of cryptocurrency wallets for payment.In one investigation, two Red Notice fugitives wanted by Korea for suspected involvement in a global Ponzi scheme were arrested in Greece and Italy after embezzling EUR 28 million from 2,000 Korean victims.In another case, the Austrian and Indian NCBs identified a group of online criminals who had been impersonating INTERPOL officers, persuading victims to transfer some USD 159,000 through financial institutions, cryptocurrency exchanges and online gift cards. Indian authorities raided the call centre, seizing four cryptocurrency wallets and other crucial crime evidence.\"As we look to the future, we recognize the importance for decisive and concerted law enforcement action across borders.  This year’s leg of Operation HAECHI III speaks volumes of IFCACC’s dedicated coordination and the strong commitment of participating countries, all of which foretell of new law enforcement victories ahead,\" said Hyung Se Lee, Head of NCB Seoul.After several months of pilot testing, Operation HAECHI III saw investigators launch INTERPOL’s new global stop-payment mechanism, known as the Anti-Money Laundering Rapid Response Protocol (ARRP), which  enables countries to work together to submit and handle requests to restrain criminal proceeds.Among many ARRP successes during the operation, NCBs Manchester and Dublin worked together to trace and seize some EUR 1.2 million lost to business email scams perpetrated in Ireland.  The funds were returned in full to the victim’s Irish bank account, and investigations continue.Since January 2022, in total the ARRP has helped member countries recover more than USD 120 million in criminal proceeds from cyber-enabled fraud.HAECHI III participating countries : Australia, Austria, Brunei, Cambodia, Cote d’Ivoire, France, Ghana, Hong Kong (China), India, Indonesia, Ireland, Japan, Korea, Kyrgyzstan, Laos, Malaysia, Maldives, Nigeria, Philippines, Poland, Romania, Singapore, Slovenia, South Africa, Spain, Sweden, Thailand, United Arab Emirates, United Kingdom, United States.The HAECHI III Operation is global in scope, conducted under the aegis of a three-year project to tackle cyber-enabled financial crime supported by the Republic of Korea, with the participation of INTERPOL member countries on every continent."
   },
   {
      "time": "2022-11-28",
      "title": "Malicious Chrome Extension Discovered Siphoning Private Data of Roblox Players - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-11-28",
      "title": "Experts Look into WhatsApp Data Leak: 500M User Records for Sale - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-11-28",
      "title": "Microsoft Announces the Microsoft Supply Chain Platform - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-11-28",
      "title": "Ransomware gang targets Belgian municipality, hits police instead",
      "text": " The Ragnar Locker ransomware gang has published stolen data from what they thought was the municipality of Zwijndrecht, but turned out to be stolen from Zwijndrecht police, a local police unit in Antwerp, Belgium.The leaked data reportedly exposed thousands of car number plates, fines, crime report files, personnel details, investigation reports, and more.This type of data can potentially expose people who reported crimes or abuse and could compromise ongoing law enforcement operations and investigations.Belgian media outlets call this data leak one of the biggest of this kind that has impacted a public service in the country, exposing all data kept by Zwijndrecht police from 2006 until September 2022.Zwijndrecht police responded to the local media coverage via a post on Facebook, downplaying the impact of the incident and saying that the hackers only accessed a part of the network where the police held administrative data.The police say that the threat actors could only access data on the administrative network, therefore primarily affecting personnel.Chief of police at Zwijndrecht, Marc Snels, told the VRT news network that the data leak resulted from human error, and they are now contacting all exposed individuals to inform them about the incident.\"But it is true that there is sometimes sensitive information on that network, even though we always try to put it only on the professional network. Those are human errors. For example, fines and PVs have also been leaked. Also, photos of child abuse. That is very painful, of course.\" - Chief of Zwijndrecht Police.Although this incident has not impacted the national police network in Belgium, the breach on the local Zwijndrecht network is still significant for thousands of people.Dée's investigation of the data revealed telecom service subscriber metadata and SMS of people under covert police investigation.Moreover, the leaked files contain footage from traffic cameras, exposing the whereabouts of individuals at specific dates and times.\"This is the largest law-enforcement leak in the history of Belgium and probably the most impactful leak we have ever seen in our country,\" Dée told Bleeping Computer.\"It should be a wakeup call for local police and the way they handle citizens' data, and hopefully, it will set things in motion towards changes on that front.\"\"You can't easily change where you live, but even if you change all documents, the repercussions of this security incident could be for a lifetime, and theft identity is no joke,\" says Dobbelaere-Welvaert.\"It’s my opinion that as long as not all police network systems are adequately protected, no smart camera should be allowed to turn on.\""
   },
   {
      "time": "2022-11-28",
      "title": "These Android Smartphones Are Vulnerable To Hack Coz Of ‘Patch Gap",
      "text": " Several Android smartphones from manufacturers including Google, Samsung, Xiaomi, Oppo, and others are vulnerable to a set of five exploitable vulnerabilities in ARM’s Mali GPU driver.These flaws despite being fixed by the chip maker months ago still remain unpatched by the Android device manufacturers.All the above issues were fixed “promptly” by ARM in July and August 2022, who disclosed them as security issues on their Arm Mali Driver Vulnerabilities page (assigning CVE-2022-36449). They also published the patched driver source on their public developer website.Another Mali GPU bug ARM that was fixed is tracked as CVE-2022-33917, which allows a non-privileged user to make improper GPU processing operations to gain access to already freed memory. The vulnerability affects Arm Mali GPU kernel drivers, Valhall r29p0 to r38p0.Project Zero’s researcher Ian Beer refers to both the bugs in his report as the “patch gap” by Android smartphone vendors, which normally takes several months for firmware security updates to trickle downstream to affected Android devices.“Minimizing the ‘patch gap’ as a vendor in these scenarios is arguably more important, as end users (or other vendors downstream) are blocking on this action before they can receive the security benefits of the patch.“Companies need to remain vigilant, follow upstream sources closely, and do their best to provide complete patches to users as soon as possible.”Since the fixes are not applied by the Android smartphone vendor to their Android builds, smartphone users too cannot apply the patch released by ARM for the ARM Mali GPU driver.As a result, many Android smartphones are still vulnerable to the five exploits. Thankfully, as of this week, Google’s Pixel team and Android team are working to resolve the issue."
   },
   {
      "time": "2022-11-28",
      "title": "U.S. Bans Chinese Telecom Equipment and Surveillance Cameras Over National Security Risk",
      "text": " The U.S. Federal Communications Commission (FCC) formally announced it will no longer authorize electronic equipment from Huawei, ZTE, Hytera, Hikvision, and Dahua, deeming them an \"unacceptable\" national security threat.\"These new rules are an important part of our ongoing actions to protect the American people from national security threats involving telecommunications.\"Pursuant to the ban, Hytera, Hikvision, and Dahua are required to document the safeguards the firms are putting in place on the sale of their devices for government use and surveillance of critical infrastructure facilities.It's not just the U.S. The U.K., in a similar move, has banned the installation of visual surveillance systems procured from China on \"sensitive\" government sites.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-28",
      "title": "Russia-based RansomBoggs Ransomware Targeted Several Ukrainian Organizations",
      "text": " Ukraine has come under a fresh onslaught of ransomware attacks that mirror previous intrusions attributed to the Russia-based Sandworm nation-state group.Slovak cybersecurity company ESET, which dubbed the new ransomware strain RansomBoggs, said the attacks against several Ukrainian entities were first detected on November 21, 2022.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-28",
      "title": "Update Chrome Browser Now to Patch New Actively Exploited Zero-Day Flaw",
      "text": " Google on Thursday released software updates to address yet another zero-day flaw in its Chrome web browser.Tracked as CVE-2022-4135, the high-severity vulnerability has been described as a heap buffer overflow in the GPU component. Clement Lecigne of Google's Threat Analysis Group (TAG) has been credited with reporting the flaw on November 22, 2022.But like other actively exploited issues, technical specifics have been withheld until a majority of the users are updated with a fix and to prevent further abuse.With the latest update, Google has resolved eight zero-day vulnerabilities in Chrome since the start of the year -Users are recommended to upgrade to version 107.0.5304.121 for macOS and Linux and 107.0.5304.121/.122 for Windows to mitigate potential threats.Users of Chromium-based browsers such as Microsoft Edge, Brave, Opera, and Vivaldi are also advised to apply the fixes as and when they become available.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]