[
   {
      "time": "2022-12-16",
      "title": "Email Hack Hits 15,000 Business Customers of Australian Telecoms Firm TPG - SecurityWeek",
      "text": " Hi, what are you looking for?Australia’s TPG Telecom this week announced that a threat actor has gained unauthorized access to a service hosting the email accounts of 15,000 customers.ByFlipboardRedditWhatsappWhatsappEmailThis has impacted up to 15,000 iiNet and Westnet business customers. This incident does not affect any home or personal (residential) iiNet or Westnet products, such as broadband or mobile.\n\nWe are continuing our investigations and a forensic analysis of the incident to determine the scope and impact of this unauthorised access and so are not in a position to discuss details at this stage. We will directly communicate with affected customers as more information becomes available.\n\nWe are continuing our investigations and a forensic analysis of the incident to determine the scope and impact of this unauthorised access and so are not in a position to discuss details at this stage. We will directly communicate with affected customers as more information becomes available.\nWe are continuing our investigations and a forensic analysis of the incident to determine the scope and impact of this unauthorised access and so are not in a position to discuss details at this stage. We will directly communicate with affected customers as more information becomes available.\nIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Satellite TV giant Dish Network confirmed that a recent outage was the result of a cyberattack and admitted that data was stolen.The release of OpenAI’s ChatGPT in late 2022 has demonstrated the potential of AI for both good and bad.A new study by McAfee and the Center for Strategic and International Studies (CSIS) named a staggering figure as the true annual cost of...Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-12-16",
      "title": "FuboTV says World Cup streaming outage caused by a cyberattack",
      "text": " FuboTV has confirmed that a streaming outage preventing subscribers from watching the World Cup Qatar 2022 semifinal match between France and Morocco was caused by a cyberattack.At approximately 2 PM ET, as users were getting ready to watch the World Cup semifinal, FuboTV subscribers found that they could not log in to the streaming service.Instead, they were greeted with a CB_ERR_OPEN error, stating \"ff: downstream not available,\" when attempting to log in.Subscribers could not contact support to report the problem, as it requires a user to first log in to the FuboTV site, which could no longer be done.However, FuboTV soon tweeted that they were working on the issue and recommended subscribers stream the game through FOX.The outage led to a flood of tweets from FuboTV subscribers complaining about the outage and how they could not watch the game.Today, FuboTV confirmed that a cyberattack was the cause of the outage and that they are continuing to investigate and respond to the incident.\"The incident was not related to any bandwidth constraints on Fubo’s part. We were instead the target of a criminal cyber attack.\"The statement goes on to say that once they detected the attack, they worked to restore service for subscribers and could do so in the evening.FuboTV also says that they engaged with cybersecurity firm Mandiant to investigate and respond to the attack and reported the incident to law enforcement.FuboTV has not provided any details on the attack but did state that a lack of bandwidth did not cause the outage, indicating that this was not a distributed denial-of-service (DDoS) attack.As they engaged with Mandiant, the attack was likely a breach of their network or servers. These types of breaches commonly lead to the immediate shutdown of IT services to contain the attack.Cyberattacks can often lead to days, if not weeks, of disruption as the attack is investigated and devices restored.However, FuboTV was able to recover its services in a relatively short period.When BleepingComputer reached out to FuboTV with questions about the cyberattack, they referred us back to the original statement and said they will provide an update when they have more information to share."
   },
   {
      "time": "2022-12-16",
      "title": "Hackers leak personal info allegedly stolen from 5.7M Gemini users",
      "text": " Gemini crypto exchange announced this week that customers were targeted in phishing campaigns after a threat actor collected their personal information from a third-party vendor.The notification comes after multiple posts on hacker forums seen by BleepingComputer offered to sell a database allegedly from Gemini containing phone numbers and email addresses of 5.7 million users.As a result of the breach, customers of the crypto exchange received phishing emails. The goal of the attacker has not been disclosed but such access to accounts and financial information is typically what threat actors are after.In its short report, Gemini underlines that account information and its systems have not been impacted and that funds and customer accounts \"remain secure.\"The notification comes after multiple posts on a hacker forum offered to sell a database allegedly from Gemini containing phone numbers and email addresses of 5.7 million users.An early attempt to monetize the database was in September. The author did not mention how fresh the info was but asked for 30 bitcoins (about $520,000 at the current exchange rate).In October, another post was published from a different alias claiming that the data was from September.Yet another post under a different username (now banned on the forum) appeared in mid-November, offering databases from multiple crypto exchanges, including one from Gemini that supposedly had the same type of information for 5.7 million users.It appears that none of the attempts to monetize the database worked as yet another announcement appeared on a different forum offering the information for free.The author of the post shared the format of the phone numbers, specifying that the three digits in the middle are missing.The company also provides the steps necessary for changing the email address associated with the Gemini account."
   },
   {
      "time": "2022-12-16",
      "title": "MCCrash: Cross-platform DDoS botnet targets private Minecraft servers | Microsoft Security Blog",
      "text": " April 2023 update – Microsoft Threat Intelligence has shifted to a new threat actor naming taxonomy aligned around the theme of weather. DEV-1028 is now tracked as Storm-1028. Malware operations continue to rapidly evolve as threat actors add new capabilities to existing botnets, increasingly targeting and recruiting new types of devices. Attackers update malware to target additional operating systems, ranging from PCs to IoT devices, growing their infrastructure rapidly. The Microsoft Defender for IoT research team recently analyzed a cross-platform botnet that originates from malicious software downloads on Windows devices and succeeds in propagating to a variety of Linux-based devices.The botnet spreads by enumerating default credentials on internet-exposed Secure Shell (SSH)-enabled devices. Because IoT devices are commonly enabled for remote configuration with potentially insecure settings, these devices could be at risk to attacks like this botnet. The botnet’s spreading mechanism makes it a unique threat, because while the malware can be removed from the infected source PC, it could persist on unmanaged IoT devices in the network and continue to operate as part of the botnet.Microsoft tracks this cluster of activity as DEV-1028, a cross-platform botnet that infects Windows devices, Linux devices, and IoT devices. The DEV-1028 botnet is known to launch distributed denial of service (DDoS) attacks against private Minecraft servers.Our analysis of the DDoS botnet revealed functionalities specifically designed to target private Minecraft Java servers using crafted packets, most likely as a service sold on forums or darknet sites. A breakdown of the systems affected by the botnet over the three months from the time of this analysis also revealed that most of the devices were in Russia:This type of threat stresses the importance of ensuring that organizations manage, keep up to date, and monitor not just traditional endpoints but also IoT devices that are often less secure. In this blog post, we share details on how this botnet affects multiple platforms, its DDoS capabilities, and recommendations for organizations to prevent their devices from becoming part of a botnet. We also share Minecraft server version information for owners of private servers to update and ensure they are protected from this threat.Microsoft researchers observed that the initial infection points related to the botnet were devices infected through the installation of malicious cracking tools that purport to acquire illegal Windows licenses.The cracking tools contain additional code that downloads and launches a fake version of svchost.exe through a PowerShell command. In some cases, the downloaded file is named svchosts.exe.Next, svchost.exe launches malicious.py, the main Python script that contains all the logic of the botnet, whichthen scans the internet for SSH-enabled Linux-based devices (Debian, Ubuntu, CentOS, and IoT workloads such as Raspbian, which are commonly enabled for remote configuration) and launches a dictionary attack to propagate. Once a device is found, it downloads the file Updater.zip from repo[.]ark—event[.]net onto the device, which creates the file fuse. The fuse file then downloads a copy of malicious.py onto the device. Both svchost.exe and fuse are compiled using PyInstaller, which bundles all the Python runtime and libraries necessary to initiate malicious.py.While malicious.py has specific functionalities depending on whether the file launches on a Windows or Linux-based device (for Windows, the file establishes persistency by adding the registry key Software\\Microsoft\\Windows\\CurrentVersion\\Run with the executable as the value), the executable is compiled to operate on both Windows and Linux-based devices. The file communicates with its command-and-control (C2) server to launch the following commands:Based on our analysis, the botnet is primarily used to launch DDoS attacks against private Minecraft servers using known server DDoS commands and unique Minecraft commands. Below is the list of commands established in the code:While most of the commands are methods of DDoS, the most notable command run by the botnet is ATTACK_MCCRASH. The command sends ${env:random payload of specific size:-a} as the username in order to exhaust the resources of the server and make it crash.TCP payloads on port 25565 have the following binary structure:The usage of the env variable triggers the use of Log4j 2 library, which causes abnormal consumption of system resources (not related to Log4Shell vulnerability), demonstrating a specific and highly efficient DDoS method.While testing the impact of the malware, researchers found that the malware itself was hardcoded to target a specific version of Minecraft server, 1.12.2. However, all versions between 1.7.2 and 1.18.2 can be affected by this method of attack. There is a slight modification in the Minecraft protocol in server version 1.19, which was released earlier in 2022, that prevents the use of the Minecraft specific commands, the ATTACK_MCCRASH, ATTACK_[MCBOT|MINE] and ATTACK_MCDATA, without modification of the attack code.The wide range of at-risk Minecraft servers highlights the impact this malware could have had if it was specifically coded to affect versions beyond 1.12.2. The unique ability of this threat to utilize IoT devices that are often not monitored as part of the botnet substantially increases its impact and reduces its chances of being detected.To harden devices networks against threats like MCCrash, organizations must implement the basics to secure identities and their devices, including access limitation. Solutions must detect downloads of malicious programs and malicious attempts to gain access to SSH-enabled devices and generate alerts on anomalous network behavior. Below are some of our recommendations for organizations:Microsoft Defender AntivirusMicrosoft Defender Antivirus detects the malware used in this attack as the following:Microsoft Defender for EndpointMicrosoft Defender for Endpoint alerts with the following titles can indicate threat activity on your network:Microsoft Defender for IoTMCCrash-related activity on IoT devices would raise the following alerts in Microsoft Defender for IoT:Microsoft Defender for CloudMicrosoft Defender for Cloud raises the following alert for related activity:Microsoft 365 DefenderRun the following queries to search for related files in your environment:Microsoft SentinelTo supplement this indicator matching, customers can use the following queries against data ingested into their workspaces to help find devices with exposed SSH endpoints, and devices that might be under SSH brute force attempts.David Atch, Maayan Shaul, Mae Dotan, Yuval Gordon, Microsoft Defender for IoT Research TeamRoss Bevington, Microsoft Threat Intelligence Center (MSTIC)\n\t\t\tA set of memory corruption vulnerabilities in the ncurses library could have allowed attackers to chain the vulnerabilities to elevate privileges and run code in the targeted program's context or perform other malicious actions. \t\t\n\t\t\tThe threat actor that Microsoft tracks as Storm-0324 is a financially motivated group known to gain initial access using email-based initial infection vectors and then hand off access to compromised networks to other threat actors. These handoffs frequently lead to ransomware deployment. Beginning in July 2023, Storm-0324 was observed distributing payloads using an open-source tool […]\t\t\n\t\t\tAnalysis of the techniques used by the threat actor tracked as Storm-0558 for obtaining unauthorized access to email data, tools, and unique infrastructure characteristics. \t\t\n\t\t\tMicrosoft has identified a phishing campaign conducted by the threat actor tracked as Storm-0978 targeting defense and government entities in Europe and North America. The campaign involved the abuse of CVE-2023-36884, which included a zero-day remote code execution vulnerability exploited via Microsoft Word documents.\t\tMicrosoft is a leader in cybersecurity, and we embrace our responsibility to make the world a safer place."
   },
   {
      "time": "2022-12-16",
      "title": "Blackmailing MoneyMonger Malware Hides in Flutter Mobile Apps",
      "text": " An Android malware campaign dubbed MoneyMonger has been found hidden in money-lending apps developed using Flutter. It's emblematic of a rising tide of blackmailing cybercriminals targeting consumers — and their employers stand to feel the effects, too.According to research from the Zimperium zLabs team, the malware uses multiple layers of social engineering to take advantage of its victims and allows malicious actors to steal private information from personal devices, then use that information to blackmail individuals.The MoneyMonger malware, distributed through third-party app stores and sideloaded onto victims' Android devices, was built from the ground up to be malicious, targeting those in need of quick cash, according to Zimperium researchers. It uses multiple layers of social engineering to take advantage of its victims, beginning with a predatory loan scheme and promising quick money to those who follow a few simple instructions.In the process of setting up the app, the victim is told that permissions are needed on the mobile endpoint to ensure they are in good standing to receive a loan. These permissions are then used to collect and exfiltrate data, including from the contact list, GPS location data, a list of installed apps, sound recordings, call logs, SMS lists, and storage and file lists. It also gains camera access.This stolen information is used to blackmail and threaten victims into paying excessively high-interest rates. If the victim fails to pay on time, and in some cases even after the loan is repaid, the malicious actors threaten to reveal information, call people from the contact list, and even send photos from the device.One of the new and interesting things about this malware is how it uses the Flutter software development kit to hide malicious code.While the open source user interface (UI) software kit Flutter has been a game changer for application developers, malicious actors have also taken advantage of its capabilities and framework, deploying apps with critical security and privacy risks to unsuspecting victims.Richard Melick, director of mobile threat intelligence at Zimperium, tells Dark Reading that consumers using money lending apps are most at risk, but by the nature of this threat and how attackers steal sensitive information for blackmail, they are also putting their employers or any organization they work with at risk, too.\"It’s very easy for the attackers behind MoneyMonger to steal information from corporate email, downloaded files, personal emails, phone numbers, or other enterprise apps on the phone, using it to extort their victims,\" he says.Melick says MoneyMonger is a risk to individuals and enterprises because it collects a wide range of data from the victim’s device, including potentially sensitive enterprise-related material and proprietary information.\"Any device connected to enterprise data poses a risk to the enterprise if an employee falls victim to the MoneyMonger predatory loan scam on that device,\" he says. \"Victims of this predatory loan might be compelled to steal to pay the blackmail or not report the theft of critical enterprise data by the malicious actors behind the campaign.\"Melick says that personal mobile devices represent a significant, unaddressed attack surface for enterprises. He points out that malware against mobile only continues to get more advanced, and without the threat telemetry and critical defense in place to stand up against this growing subset of malicious activity, enterprises and their employees are left at risk.\"No matter if they are corporate-owned or part of a BYOD strategy, the need for security is critical to stay ahead of MoneyMonger and other advanced threats,\" he says. \"Education is only part of the key here and technology can fill in the gaps, minimizing the risk and attack surface presented by MoneyMonger and other threats.\"It's also important to remember to avoid downloading apps from unofficial app stores; official stores, like Google Play, do have protections for users, a Google spokesperson emphasized to Dark Reading.\"None of the identified malicious apps in the report are on Google Play,\" he said. \"Google Play Protect checks Android devices with Google Play Services for potentially harmful apps from other sources. Google Play Protect will warn users that attempt to install or launch apps that have been identified to be malicious.\"Melick points out blackmail is not new to malicious actors, as has been seen in ransomware attacks and data breaches on a global scale.\"The use of blackmail on such a personal level, targeting individual victims, though, is a bit of a novel approach that takes an investment of personnel and time,\" he says. \"But it is paying off and based on the number of reviews and complaints around MoneyMonger and other predatory loan scams similar to this, it is only going to continue.\"He predicts market and financial conditions will leave some people desperate for ways to pay bills or get extra cash.\"Just as we saw predatory loan scams rise up in the last recession,\" he says, \"it is almost guaranteed we will see this model of theft and blackmail continue into 2023.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-12-16",
      "title": "Number of command-and-control servers spiked in 2022: report",
      "text": " The number of unique command-and-control servers (C2) increased 30% in 2022, an indication that cybercriminals and nation-state hackers are increasingly using the machines to carry out attacks.A command-and-control server is a computer that sends orders to devices that have been infected with malware or other tools. The servers are typically used to create networks of infected devices that can launch attacks, encrypt data and more.The report notes that the largest hosting providers, especially Shenzhen Tencent Computer Systems in China and DigitalOcean in the United States, continue to have the most C2 server observations. For the first time, China overtook the U.S. as the top country based on volume for C2 server hosting.In total, Recorded Future found C2 infrastructure on 1,419 hosting providers across 116 different countries.China had more than 4,000 C2 servers, while the U.S. was second with 3,928 and Hong Kong third with 1,451. These three countries alone accounted for 55% of all detected C2 servers.Most server infrastructure is acquired either through compromise or through legitimate purchases before it can be used maliciously. Popular tools like Cobalt Strike — which Recorded Future said was \"clearly the preferred offensive security tool for an array of actors\" — can be used legitimately by red teams trying to test corporate networks, but can be abused by criminal and nation-state hackers.\"Cobalt Strike is so prevalent because it is easy to use, has a wide range of capabilities, is pretty flexible, people (both threat actors and red teamers) have just gotten used to it, and is still somehow difficult to detect and remove,\" said Recorded Future researcher Julian-Ferdinand Vögele.PlugX, meanwhile, has been the tool of choice for China-based threat actors over the past decade, with a builder for an earlier PlugX variant leaked publicly in 2015, Recorded Future said. “This indicates that PlugX usage is likely less-closely controlled compared to ShadowPad, which is likely privately sold to a limited set of Chinese state-sponsored threat actors.”Researchers also noted that while they are not as prevalent as they were in 2021, multiple botnets are active including Emotet, IcedID, QakBot, Dridex, and TrickBot – all of which were in the C2 top 20 list. There was a major spike in May 2022, with Emotet C2s growing to over 1,200. They noted that multiple security companies have attributed the spike to the increased spread of the Emotet malware through malicious Microsoft Office documents. Proofpoint said Emotet is distributing “hundreds of thousands” of phishing emails a day in November.Recorded Future predicted that for 2023, Cobalt Strike and botnets will continue to dominate the C2 lists.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-12-16",
      "title": "Social Blade confirms breach after hacker posts stolen user data",
      "text": " Social media analytics platform Social Blade has confirmed they suffered a data breach after its database was breached and put up for sale on a hacking forum.Social Blade is an analytics platform that provides statistical graphs for YouTube, Twitter, Twitch, Daily Motion, Mixer, and Instagram accounts, allowing customers to see estimated earnings and projects.The company offers an API allowing customers to integrate the Social Blade data directly into their own platforms.After BleepingComputer contacted Social Blade about the sale of their data, the company confirmed that they suffered a breach and began sending data breach notifications to customers.\"On December 14th we were notified of a potential data breach whereby an individual had acquired exports our users database and were attempting to sell it on a hacker forum,\" reads a data breach notification sent to customers.\"Samples were posted and we verified that they were indeed real. It appears this individual made use of of a vulnerability on our website to gain access to our database.\"This data breach notification states that customers that a hacker managed to access the company’s database and steal the following information:The notice clarifies that no credit card information has been exposed due to this security incident.While Social Blade states that the user passwords were hashed using the bcrypt algorithm and cannot be easily deciphered, the company still suggests that all users reset their passwords. However, there won’t be a platform-wide reset of credentials.The authorization tokens for Business users and connected social media accounts have also been cycled, preventing threat actors from continuing to use the ones listed in the stolen database.In response to further questions about whether auth tokens were abused in this attack, SocialBlade sent BleepingComputer the following statement:\"As far as we know, no auth tokens were abused. For third party tokens they'd have become invalid typically within an hour after they're created in the first place and not be useable.Part of the leak included social blade business api users client id and tokens. These could have been used, but we have no indication that any were. The vast majority of them had no credits attached to them so trying to use them wouldn't work. For users who had paid for credits we informed them to let us know if they believe anyone has used their credits. So far no one has reported any issues. If a report does come in we'll investigate and credit them back any tokens used by an attacker.\" - SocialBlade.BleepingComputer first learned of the data breach when a threat actor began selling the company's data on Monday, December 12th.In a forum post to the Breached hacking forum, a threat actor claimed that the data was stolen in September 2022 and was willing to sell it to a maximum of one to two people.The hacker claimed the stolen database held 5.6 million records and shared samples of the exfiltrated data, including IP addresses, emails, database structure, etc.BleepingComputer contacted Social Blade at the time to request a comment on the validity of the samples and got a confirmation that the data appeared authentic.The company says it has now addressed the security gap the intruder exploited to gain access to its systems and now performs additional checks to ensure that all systems are adequately hardened to prevent similar incidents in the future.“We are too aware that bad actors will continue to attempt to infiltrate IT infrastructure around the world, and rest assured we at Social Blade will never be complacent in hardening our security and defenses,” reads the notice.Social Blade urges users to remain vigilant against phishing attempts that typically accompany large-scale data breaches, impersonating the breached company to steal passwords and credit card numbers.Update 12/16/22: Added SocialBlade's response regarding authorization token."
   },
   {
      "time": "2022-12-16",
      "title": "Microsoft Reclassifies SPNEGO Extended Negotiation Security Vulnerability as 'Critical'",
      "text": " SPNEGO, short for Simple and Protected GSSAPI Negotiation Mechanism (SPNEGO), is a scheme that allows a client and remote server to arrive at a consensus on the choice of the protocol to be used (e.g., Kerberos or NTLM) for authentication.Specially, the shortcoming could enable remote code execution via any Windows application protocol that authenticates, including HTTP, SMB, and RDP. Given the criticality of the issue, IBM said it's withholding technical details until Q2 2023 to give organizations enough time to apply the fixes.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-12-16",
      "title": "LEGO BrickLink bugs let hackers hijack accounts, breach servers",
      "text": " Security analysts have discovered two API security vulnerabilities in BrickLink.com, LEGO Group’s official second-hand and vintage marketplace for LEGO bricks.BrickLink is the world’s largest online community of  LEGO fans, with over a million registered members.Two API security issues discovered by Salt Security could have allowed an attacker to take over members' accounts, access and steal personally identifiable information (PII) stored on the platform, or even gain access to internal production data and compromise internal servers.Salt Security’s analysts discovered the vulnerabilities while experimenting with user input fields on the BrickLink website.The first one is a cross-site scripting (XSS) flaw in the “Find Username” dialog box of the coupon search section, which allowed an attacker to inject and execute code on the target’s machine using a specially crafted link.Using the target’s Session ID exposed on a different page, an attacker could leverage the XSS flaw to hijack the session and take over the target’s account.Accessing the account means exposing all data stored on the platform, including personal details, email address, shipping address, order history, coupons, received feedback, wanted items, and message history.The second flaw was located on the “Upload to Wanted List” page, where users can upload XML lists containing LEGO parts they wish to find and purchase.By exploiting a flaw in endpoint parsing mechanism, Salt Security’s analysts launched a successful XML External Entity (XXE) injection attack, adding a reference to an external entity on their file.The XXE attack enabled them to read files on the web server and execute a server-side request forgery (SSRF) attack, which could lead to exfiltrating the AWS EC2 tokens for the server.The security researchers reported the discovered vulnerabilities to LEGO, and the company took action to fix all issues.Cyberattacks are growing during shopping seasons and the retail sector is a more attractive target as the focus is on the commercial aspect of the business and less on improving security.Shoppers are advised to use strong account credentials and enable two-factor authentication where available. When placing orders, a good recommendation is to use guest accounts or virtual/temporary payment cards, if that is possible."
   },
   {
      "time": "2022-12-16",
      "title": "CISA Warns Veeam Backup & Replication Vulnerabilities Exploited in Attacks - SecurityWeek",
      "text": " Hi, what are you looking for?The US Cybersecurity and Infrastructure Security Agency (CISA) has added two flaws affecting Veeam’s Backup & Replication product to its Known Exploited Vulnerabilities Catalog.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...The changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.As it evolves, web3 will contain and increase all the security issues of web2 – and perhaps add a few more.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...Luxury retailer Neiman Marcus Group informed some customers last week that their online accounts had been breached by hackers.OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...Zendesk is informing customers about a data breach that started with an SMS phishing campaign targeting the company’s employees.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   }
]