[
   {
      "time": "2023-02-10",
      "title": "Graphiron: New Russian Information Stealing Malware Deployed Against Ukraine | Symantec Enterprise Blogs",
      "text": " The Nodaria espionage group (aka UAC-0056) is using a new piece of information stealing malware against targets in Ukraine. The malware (Infostealer.Graphiron) is written in Go and is designed to harvest a wide range of information from the infected computer, including system information, credentials, screenshots, and files.The earliest evidence of Graphiron dates from October 2022. It continued to be used until at least mid-January 2023 and it is reasonable to assume that it remains part of the Nodaria toolkit.Graphiron is a two-stage threat consisting of a downloader (Downloader.Graphiron) and a payload (Infostealer.Graphiron).The downloader contains hardcoded command-and-control (C&C) server addresses. When executed, it will check against a blacklist of malware analysis tools by checking for running processes with the names listed in Table 1.If no blacklisted processes are found, it will connect to a C&C server and download and decrypt the payload before adding it to autorun.The downloader is configured to run just once. If it fails to download and install the payload it won’t make further attempts nor send a heartbeat.Graphiron uses AES encryption with hardcoded keys. It creates temporary files with the \".lock\" and \".trash\" extensions. It uses hardcoded file names designed to masquerade as Microsoft office executables: OfficeTemplate.exe and MicrosoftOfficeDashboard.exeThe payload is capable of carrying out the following tasks:Password theft is carried out using the following PowerShell command:[void][Windows.Security.Credentials.PasswordVault,Windows.Security.Credentials,ContentType=WindowsRuntime];$vault = New-Object Windows.Security.Credentials.PasswordVault;$vault.RetrieveAll() | % { $_.RetrievePassword();$_} | Select UserName, Resource, Password | Format-Table –HideTableHeadersThe following command was used to export the list of PuTTY sessions:\"CSIDL_SYSTEM\\reg.exe\" query HKCU\\Software\\SimonTatham\\Putty\\SessionsIn addition to this, as with earlier malware, Graphiron communicates with the C&C server using port 443 and communications are encrypted using the AES cipher.Nodaria has been active since at least March 2021 and appears to be mainly involved in targeting organizations in Ukraine. There is also limited evidence to suggest that the group has been involved in attacks on targets in Kyrgyzstan. Third-party reporting has also linked the group to attacks on Georgia.The group sprang to public attention when it was linked to the WhisperGate wiper attacks that hit multiple Ukrainian government computers and websites in January 2022. When WhisperGate was initially loaded onto a system, the malware would overwrite the portion of the hard drive responsible for launching the operating system when the machine is booted up with a ransom note demanding $10,000 in Bitcoin. However, this was just a decoy as the WhisperGate malware destroys data on an infected machine and it cannot be recovered, even if a ransom is paid.The group’s usual infection vector is spear-phishing emails, which are then used to deliver a range of payloads to targets. Custom tools used by the group to date include:Like Graphiron, many of Nodaria’s earlier tools were written in Go. Graphiron appears to be the latest piece of malware authored by the same developers, likely in response to a need for additional functionality. While GraphSteel and GrimPlant used Go version 1.16, Graphiron uses version 1.18, confirming it is a more recent development.While Nodaria was relatively unknown prior to the Russian invasion of Ukraine, the group’s high-level activity over the past year suggests that it is now one of the key players in Russia’s ongoing cyber campaigns against Ukraine.If an IOC is malicious and the file available to us, Symantec Endpoint products will detect and block that file.SHA-256:0d0a675516f1ff9247f74df31e90f06b0fea160953e5e3bada5d1c8304cfbe63 — Downloader.Graphiron878450da2e44f5c89ce1af91479b9a9491fe45211fee312354dfe69e967622db — Downloader.Graphiron80e6a9079deffd6837363709f230f6ab3b2fe80af5ad30e46f6470a0c73e75a7 — Infostealer.Graphironeee1d29a425231d981efbc25b6d87fdb9ca9c0e4e3eb393472d5967f7649a1e6 — Infostealer.Graphironf0fd55b743a2e8f995820884e6e684f1150e7a6369712afe9edb57ffd09ad4c1 — Infostealer.Graphironf86db0c0880bb81dbfe5ea0b087c2d17fab7b8eefb6841d15916ae9442dd0cce — Infostealer.GraphironNetwork:208.67.104[.]95 — C&C serverThe Threat Hunter Team is a group of security experts within Symantec whose mission is to investigate targeted attacks, drive enhanced protection in Symantec products, and offer analysis that helps customers respond to attacks.We encourage you to share your thoughts on your favorite social platform."
   },
   {
      "time": "2023-02-10",
      "title": "Phishing Surges Ahead, as ChatGPT & AI Loom",
      "text": " Phishing is having a moment, with a massive spike in campaign volumes in the latter half of 2022. In fact, total phishing emails increased by 61% in the second half, according to an analysis this week. That could also be set to accelerate, as the rise of ChatGPT and other new tools are making their mark on the sector too. Malware volumes overall also increased, 12% quarter for quarter, with Vade detecting 58.9 million emails in the fourth quarter of 2022 that included malware, the researchers found.Email remains the top channel for distributing phishing and malware, giving hackers a convenient, scalable, and efficient vehicle for exploiting users and compromising accounts, Todd Stansfield, content marketing manager, noted in the report.\"Email threat activity continues to increase, creating the need for organizations of all sizes to fortify their cybersecurity,\" he wrote.Breaking down the numbers by the month, phishing volumes remained relatively stable through the first half of the fourth quarter, with 62.3 million phishing emails tracked in October and 47 million in November, according to the report.In terms of who they target and how they do it, phishing threat actors aren't getting especially creative given the current way enterprise users work and collaborate.Facebook remained the top brand in terms of impersonation for the second consecutive quarter, with researchers observing 6,700 unique phishing URLs impersonating the social networking giant in the fourth quarter of 2022, they reported. The company was followed by Microsoft, PayPal, Google, and Netflix in descending order as the brands that threat actors prefer to impersonate.\"With the growing popularity of productivity suites, users are increasingly using email to access and use productivity apps such as file sharing and instant messaging,\" Stansfield wrote, adding that threat actors have taken notice and are crafting phishing campaigns to target the specific behavior of corporate productivity-suite users.\"By purchasing a phishing kit, novice hackers can deploy highly convincing and effective schemes against their targets,\" Stansfield acknowledged.One recent enhancement to these kits is the ability to automatically localize phishing pages based on a victim's native language, a handy tool that allows threat actors to target various regions quickly without being multilingual themselves, the researchers said.The feature works by identifying the language settings of the targeted user's browser and leveraging it to update and display the phishing page accordingly. While improving the contextual accuracy of each phishing attack, the new feature also enables hackers to target users across multiple languages using a single kit, thus increasing the reach of their campaigns, according to Vade.Moreover, the problem with phishing is that it doesn't just end with an attacker giving up credentials, but ultimately, they can use these credentials as a way into corporate networks to steal data, distribute ransomware and other malware, and engage in other nefarious activity.Enterprises need to move beyond traditional email security solutions and adopt ones that can respond to the more sophisticated tactics of attackers, the researchers said. Specifically, collaborative and AI-enhanced solutions that can provide \"predictive defense against known and unknown threats using the latest threat intelligence and a core set of AI technologies,\" are the way forward, Stansfield said.\"On the flip side, we use AI to detect anomalies in email, from the content itself to the behavior of files that might be included in those emails,\" he says. \"There will be a battle between what you might call good and bad AI.\"If phishing emails do slip through an organization's security protections, training employees to identify phishing emails before they click on them can also be a reliable way to prevent credential or malware compromise before it occurs, Scott Caveza, senior research manager at cyber exposure management firm Tenable, tells Dark Reading.\"Phishing attacks continue to be successful as they target our weakest link in security, humans,\" he says. \"Regardless of the author of the email, be it AI or an actual human, organizations need to invest in and develop mature security programs where security awareness training, including specific training on spotting phishing attacks, are priorities for the organization.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-10",
      "title": "NIST Picks IoT Standard for Small Electronics Cybersecurity",
      "text": " After a search that took several years, the National Institute of Standards and Technology (NIST) has chosen Ascon to be the standard to protect data generated by exploding ranks of lightweight electronics that make up the Internet of Things (IoT). NIST will publish the full standard later in 2023, the organization says. Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-10",
      "title": "7 Critical Cloud Threats Facing the Enterprise in 2023",
      "text": " Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-10",
      "title": "Hackers use fake crypto job offers to push info-stealing malware",
      "text": " A campaign operated by Russian threat actors uses fake job offers to target Eastern Europeans working in the cryptocurrency industry, aiming to infect them with a modified version of the Stealerium malware named 'Enigma.'The attacks start with an email pretending to be a job offer with fake cryptocurrency interviews to lure their targets. The emails have a RAR archive attachment which contains a TXT (\"interview questions.txt\") and an executable (\"interview conditions.word.exe\").The text file contains interview questions written in Cyrillic, which follow a standard format and are made to appear legitimate.If the victim is tricked into launching the executable, a chain of payloads is executed that eventually downloads the Enigma information-stealing malware from Telegram.The first-stage downloader is a C++ tool that uses techniques like API hashing, string encryption, and irrelevant code to evade detection while downloading and launching the second-stage payload, \"UpdateTask.dll.\"The second-stage payload, also written in C++, uses the \"Bring Your own Vulnerable Driver\" (BYOVD) technique to exploit the CVE-2015-2291 Intel vulnerability. This Intel driver flaw allows commands to be executed with Kernel privileges.The threat actors abuse this vulnerability to disable Microsoft Defender before the malware downloads the third payload.The third-stage downloads the final payload, Enigma Stealer, from a private Telegram channel, which Trend Micro says is a modified version of Stealerium, an open-source information-stealing malware.Enigma targets system information, tokens, and passwords stored in web browsers like Google Chrome, Microsoft Edge, Opera, and more. Additionally, it targets data stored in Microsoft Outlook, Telegram, Signal, OpenVPN, and other apps.Enigma can also capture screenshots from the compromised system and extract clipboard content or VPN configurations.Finally, all stolen data is compressed in a ZIP archive (\"Data.zip\") and sent back to the threat actors via Telegram.Some of Enigma's strings, such as web browser paths and Geolocation API services URLs, are encrypted with the AES algorithm in cipher-block chaining (CBC) mode, likely to conceal the data and prevent unauthorized access or tampering.Trend Micro has not assigned attribution with strong confidence but discovered several elements that may indicate a Russian threat actor is behind the attacks.The first clue is that one of the logging servers used in this campaign to track the execution flow of active infections hosts an Amadey C2 panel, which is quite popular in Russian cybercrime forums.Second, the server runs \"Deniska,\" a special-purpose Linux system only referenced in Russian-speaking forums.Finally, the server's default time zone is set to Moscow, another indicator that the threat actors are Russian."
   },
   {
      "time": "2023-02-10",
      "title": "Gootloader malware, SEO poisoning targets healthcare in ‘aggressive’ campaign | SC Media",
      "text": "  “The threat actor displayed fast-moving behaviors, quickly heading to control the network it infected, and getting elevated privileges in less than 4 hours,” researchers wrote.The attack analysis confirmed multiple layers of obfuscation and the “existence of multiple JavaScript loops that makes the execution longer, probably acting as an anti-sandbox mechanism.” “The actors create websites or populate web forums or similar websites with specific keywords and links, leading to a website hosting the infected file,” researchers wrote. As noted, the threat actors leverage SEO poisoning tactics to bring its infected pages to the top of internet browser search results to appear as legitimate sites.“SEO poisoning and Google service abuse, in general, have been documented a lot recently, which indicates this infection vector is becoming common for threat actors,” they added.The team “observed the deployment of Gootloader through heavily obfuscated JavaScript files with a file size of more than 40 Megabytes,” as well as the use of fake search engine ads linked to the infected piece of malware.The infections follow a similar flow: tricking a user into downloading the malware using the above tactics, prompting a ZIP file decompression that leads to the first- and second-stage payloads, and leading to a massive file meant to throw off security tools.Researchers note that most of the domains in the Gootloader PowerShell second stage script had one item in common: “/xmlrpc.php\" was displayed in relation to VirusTotal. The actors behind the variant commonly use compromised WordPress websites to use as C2 servers.After a Gootloader infection, the threat actor used “hands-on keyboard activities” that led to further deployment of attack frameworks, Cobalt Strike and SystemBC, “a proxy malware leveraging SOCKS5 and often used during the exfiltration phase of an attack.”The attacks have also used DLL Hijacking “on top of a VLC MediaPlayer executable.” These frameworks are used in both the infection and lateral movement stages of attacks.A successful infection would give a threat actor the ability to remotely control the victim’s device and gather system information, before launching into a “discovery process” to select the most interesting targets. Gootloader also enables attackers to maintain persistence through scheduled task, gather data, and maintain remote control.Given the spate of targeted ransomware and DDoS attacks on healthcare, provider organizations should be on high alert.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Malicious Python packages spread BlazeStealer malware Eight new Python packages masquerading as obfuscation tools have been used to facilitate the distribution of the BlazeStealer malware since January, The Hacker News reports.Hackread reports that Microsoft Azure's Automation Service has been leveraged to create the first cryptocurrency miner that could not be detected by security systems.Indian government organizations had their Windows and Linux systems subjected to two new attack campaigns by Pakistan-linked advanced persistent threat operation SideCopy, one of which involved the exploitation of a WinRAR security vulnerability, aimed at facilitating the deployment of various remote access trojans, The Hacker News reports.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-10",
      "title": "US and South Korea accuse North Korea of using hospital ransoms to fund more hacking",
      "text": " North Korean state hackers are using a variety of ransomware strains to attack healthcare organizations and other targets globally, with the goal of pulling in money to fund other operations, the U.S. and South Korea said Thursday. Specific targets for those cyber operations include U.S. defense information networks and military contractors, according to joint advisory from the Cybersecurity and Infrastructure Security Agency (CISA), the FBI, the NSA and several South Korean defense and intelligence agencies.North Korean hackers have used both internally developed ransomware like Maui and H0lyGh0st, the agencies said, as well as other extortion malware attained by other means — such as Deadbolt, ech0raix, GonnaCry, Hidden Tear, Jigsaw, LockBit 2.0, My Little Ransomware, NxRansomware, Ryuk, and YourRansom.The agencies also said North Korean hackers have attempted to portray themselves as members of other ransomware groups like the now-shuttered REvil.They have generated multiple web domains, personas and accounts to obscure their actions, according to the agencies, which noted that the hackers are able to “procure infrastructure, IP addresses, and domains with cryptocurrency generated through illicit cybercrime, such as ransomware and cryptocurrency theft.”They also use VPNs to make it appear attacks are coming from more innocuous locations outside of North Korea. The hackers use a range of exploits for common vulnerabilities like Log4Shell and others. The agencies named three specific vulnerabilities – CVE-2021-44228, CVE-2021-20038 and CVE-2022-24990 – as ones typically used by North Korean actors. In addition to ransomware, the hackers use other customized malware to exfiltrate data, perform reconnaissance operations and steal files. “DPRK cyber actors have been observed setting ransoms in bitcoin. Actors are known to communicate with victims via Proton Mail email accounts,” the advisory said. “For private companies in the healthcare sector, actors may threaten to expose a company’s proprietary data to competitors if ransoms are not paid.”The advisory highlights a startling trend across the world as nation-states have begun deploying ransomware for a variety of reasons and purposes. Allan Liska, a ransomware expert at cybersecurity company Recorded Future, said more than 50 national governments or national government agencies have been hit by ransomware in 2022. The Record is an editorially independent unit of Recorded Future.“We’ve seen what appear to be government-backed ransomware attacks from Russia, China, Iran and North Korea. Now, North Korea has always used ransomware attacks, dating back to 2017, but they seem to have really stepped up their attacks this year, making them even more dangerous as an adversary,” he said. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-10",
      "title": "Hackers breach Reddit to steal source code and internal data",
      "text": " Reddit suffered a cyberattack Sunday evening, allowing hackers to access internal business systems and steal internal documents and source code.The company says the hackers used a phishing lure targeting Reddit employees with a landing page impersonating its intranet site. This site attempted to steal employees' credentials and two-factor authentication tokens.After one employee fell victim to the phishing attack, the threat actor was able to breach internal Reddit systems to steal data and source code.\"We show no indications of breach of our primary production systems (the parts of our stack that run Reddit and store the majority of our data).\"Reddit says they learned of the breach after the employee self-reported the incident to the company's security team.After investigating the incident, Reddit says the stolen data includes limited contact information for company contacts and current and former employees.The data also included some details about the company's advertisers but credit card information, passwords, and ad performance was not accessed.Reddit also says that there are no indications that the threat actors were able to breach production systems used to run the website.In that attack, threat actors breached Riot Games and stole source code for League of Legends (LoL) multiplayer online battle arena, the Teamfight Tactics (TFT) auto battler game, and a legacy anti-cheat platform.BleepingComputer has contacted Reddit with further questions but a reply was not immediately available."
   },
   {
      "time": "2023-02-10",
      "title": "Hacker develops new 'Screenshotter' malware to find high-value targets",
      "text": " A new threat actor tracked as TA866 targets organizations in the United States and Germany with new custom malware to perform surveillance and data theft on infected systems.The threat actor appears to have financial motivations, performing a preliminary evaluation of breached systems to determine if the target is valuable enough for further intrusion.The threat actor targets victims using phishing emails that include Microsoft Publisher (.pub) attachments with malicious macros, URLs linking to .pub files with macros, or PDFs containing URLs that download dangerous JavaScript files.Proofpoint says the number of emails sent in TA866 increased exponentially in December 2022 and continued upward in January 2023, with the emails written in English or German, depending on the target.If the recipients of these emails click on the URLs, a multi-step attack chain is triggered, resulting in the download and execution of \"Screenshotter,\" one of TA866's custom malware tools.This tool takes JPG screenshots from the victim'svictim's machine and sends them back to the threat actor'sactor's server for review.The attackers then manually examine these screenshots and decide whether the victim is of value. This evaluation may include having the Screenshotter malware snap more screenshots or dropping additional custom payloads like:Its capabilities include stealing cryptocurrency wallets, credentials, and cookies stored in web browsers, FTP clients, Steam accounts, Telegram and Discord accounts, VPN configurations, and email clients.Additionally, Rhadamanthys is also capable of stealing files from the breached system.Proofpoint says TA866 is actively involved in the attacks, checking the stolen data and sending commands to its malware during times that resemble a regular workday in the UTC+2 or UCT+3 time zone.When combined with the presence of Russian language variable names and comments in the code of the AHK Bot loader, the clues indicate that TA866 is very likely a Russian threat actor.Proofpoint has attempted to find overlaps and similarities with past reports describing similar TTPs (techniques, tactics, and procedures), but it could not make any definitive connections.However, there are signs of the AHK Bot tool being used in previous espionage campaigns.TA866 attacks are still underway, and Proofpoint warns that Active Directory profiling should be a cause of concern, as it could compromise all domain-joined hosts with information-stealing malware."
   },
   {
      "time": "2023-02-10",
      "title": "Malicious Google ads sneak AWS phishing sites into search results",
      "text": " A new phishing campaign targeting Amazon Web Services (AWS) logins is abusing Google ads to sneak phishing sites into Google Search to steal your login credentials.Initially, the threat actors linked the ad directly to the phishing page. However, at a later phase, they added a redirection step, likely to evade detection by Google’s ad fraud detection systems.The malicious Google ads take the victim to a blogger website (“us1-eat-a-w-s.blogspot[.]com”) under the attackers’ control, which is a copy of a legitimate vegan food blog. The site uses ‘window.location.replace’ to automatically redirect the victim to a new website that hosts the fake AWS login page, made to appear authentic.The victim is prompted to select if they are a root or IAM user and then enter their email address and password. This option helps the threat actors categorize the stolen data into two categories of value and utility.The phishing domains seen by Sentinel Labs are:An interesting feature of the phishing pages is that their author has included a JavaScript function to disable right clicks, middle mouse buttons, or keyboard shortcuts.Sentinel Labs says this is likely a mechanism to prevent users from navigating away from the page, either purposefully or by mistake.The security firm reports seeing Portuguese used as a language in the JavaScript code comments and variables, while the root page of the blogger domain mimics a Brazilian dessert business. Finally, the Whois details used for registering the domains point to a Brazilian person.Sentinel Labs reported the abuse to CloudFlare, which protected the phishing sites, and the internet company quickly shut down the account. However, the malicious Google Ads remain, even if the sites they link to are no longer online.Google Ads have been under massive abuse from cybercriminals of all kinds lately, serving as an alternative method to reach potential victims."
   }
]