[
   {
      "time": "2023-11-08",
      "title": "Iran-Linked Agrius APT Group Targets Israeli Education, Tech Sectors",
      "text": " A series of attacks has targeted the Israeli higher education and technology sectors throughout this year, stealing personal information and disabling endpoints.Typical attacks from Agonizing Serpens involve stealing sensitive information that includes PII and intellectual property, which is then published on social media or Telegram channels \"to sow fear or inflict reputational damage.\" In the recent string of Israeli attacks, the group stole ID numbers, passport scans, and email and postal addresses.The researchers from Unit 42 did not specifically name any of the targets, but confirmed that only Israeli organizations were affected by the attacks.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-11-08",
      "title": "SideCopy Exploiting WinRAR Flaw in Attacks Targeting Indian Government Entities",
      "text": " The Pakistan-linked threat actor known as SideCopy has been observed leveraging the recent WinRAR security vulnerability in its attacks targeting Indian government entities to deliver various remote access trojans such as AllaKore RAT, Ares RAT, and DRat.Enterprise security firm SEQRITE described the campaign as multi-platform, with the attacks also designed to infiltrate Linux systems with a compatible version of Ares RAT.The new phishing campaigns detected by SEQRITE entail two different attack chains, each targeting Linux and Windows operating systems.\"[AllaKore RAT] has the functionality to steal system information, keylogging, take screenshots, upload & download files, and take the remote access of the victim machine to send commands and upload stolen data to the C2,\" Ram Prakki said.DRat is capable of parsing as many as 13 commands from the C2 server to gather system data, download and execute additional payloads, and perform other file operations.The targeting of Linux is not coincidental and is likely motivated by India's decision to replace Microsoft Windows with a Linux flavor called Maya OS across government and defense sectors.\"Expanding its arsenal with zero-day vulnerability, SideCopy consistently targets Indian defense organizations with various remote access trojans,\" Ram Prakki said.\"APT36 is expanding its Linux arsenal constantly, where sharing its Linux stagers with SideCopy is observed to deploy an open-source Python RAT called Ares.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-08",
      "title": "\r\n\tNew BlueNoroff Malware Variant Targets Cryptocurrency Exchanges - Infosecurity Magazine\r\n",
      "text": " Security researchers have uncovered a new malware variant believed to be associated with the BlueNoroff Advanced Persistent Threat (APT) group. BlueNoroff is known for its financially motivated campaigns, often targeting cryptocurrency exchanges, venture capital firms and banks. Writing in an advisory published today, Jamf Threat Labs said the discovery came during routine threat hunting, where the team found a Mach-O universal binary communicating with a previously identified malicious domain.The standalone binary, named “ProcessRequest,” has drawn attention due to its interaction with a previously flagged domain. Notably, a legitimate cryptocurrency exchange operates under a similar domain, further increasing concerns. Jamf researcher Ferdous Saljooki said the activity aligns with BlueNoroff’s Rustbucket campaign, where the APT group disguises itself as an investor or headhunter to gain access to its targets.The malicious domain was registered in May 2023 and resolved to a specific IP address. While various URLs were used for malware communication, the command-and-control (C2) server remained unresponsive, ultimately going offline after their analysis.Though the initial access method remains unclear, it appears to be used in later stages to manually run commands after compromising a system. The malware, dubbed ObjCShellz, communicates with the C2 server using a POST message to a specific URL, gathering information about the infected macOS system and creating a user-agent for the communication.The malware’s ability to execute commands is noteworthy, as it allows the attacker to have remote control over compromised systems.“Although fairly simple, this malware is still very functional and will help attackers carry out their objectives. This seems to be a theme with the latest malware we’ve seen coming from this APT group,” Saljooki wrote.“Based on previous attacks performed by BlueNoroff, we suspect that this malware was a late stage within a multi-stage malware delivered via social engineering.”"
   },
   {
      "time": "2023-11-08",
      "title": "\r\n\tData Breach at Singapore’s Marina Bay Sands Affects 665,000 Customers - Infosecurity Magazine\r\n",
      "text": " Reporter, Infosecurity MagazineThe Singapore-based luxury complex Marina Bay Sands revealed it was hit by a security incident that exposed the personal data of 665,000 customers.According to a statement published by the resort, the incident occurred on October 19-20 and involved unauthorized third-party access to its non-casino customers’ loyalty program membership data.The leaked data included personally identifiable information (PII), such as customers’ names, email addresses, phone numbers, country of residence, membership numbers and tiers.This information could be used in phishing campaigns targeting some of the said customers.Data from the casino rewards program, Sands Rewards Club, was allegedly unaffected.“Upon discovery of the incident, our teams immediately took action to resolve it. [We] have been working with a leading external cybersecurity firm, and have taken action to further strengthen our systems and protect data. We have reported it to the relevant authorities in Singapore and other countries where applicable and are working with them in their inquiries into the issue,” said the resort.The Marina Bay Sands staff has started individually informing Sands LifeStyle loyalty program members about the incident."
   },
   {
      "time": "2023-11-08",
      "title": "New GootLoader Malware Variant Evades Detection and Spreads Rapidly",
      "text": " \"This new variant is a lightweight but effective malware allowing attackers to rapidly spread throughout the network and deploy further payloads.\"The use of GootBot points to a tactical shift, with the implant downloaded as a payload after a Gootloader infection in lieu of post-exploitation frameworks such as CobaltStrike.Described as an obfuscated PowerShell script, GootBot is designed to connect to a compromised WordPress site for command and control and receive further commands.Complicating matters further is the use of a unique hard-coded C2 server for each deposited GootBot sample, making it difficult to block malicious traffic.\"Currently observed campaigns leverage SEO-poisoned searches for themes such as contracts, legal forms, or other business-related documents, directing victims to compromised sites designed to look like legitimate forums where they are tricked into downloading the initial payload as an archive file,\" the researchers said.The archive file incorporates an obfuscated JavaScript file, which, upon execution, fetches another JavaScript file that's triggered via a scheduled task to achieve persistence.In the second stage, JavaScript is engineered to run a PowerShell script for gathering system information and exfiltrating it to a remote server, which, in turn, responds with a PowerShell script that's run in an infinite loop and grants the threat actor to distribute various payloads.This includes GootBot, which beacons out to its C2 server every 60 seconds to fetch PowerShell tasks for execution and transmit the results of the execution back to the server in the form of HTTP POST requests.Some of the other capabilities of GootBot range from reconnaissance to carrying out lateral movement across the environment, effectively expanding the scale of the attack.\"The discovery of the Gootbot variant highlights the lengths to which attackers will go to evade detection and operate in stealth,\" the researchers said. \"This shift in TTPs and tooling heightens the risk of successful post-exploitation stages, such as GootLoader-linked ransomware affiliate activity.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-08",
      "title": "TransForm says ransomware data breach affects 267,000 patients",
      "text": " Shared service provider TransForm has published an update on the cyberattack that recently impacted operations in multiple hospitals in Ontario, Canada, clarifying that it was a ransomware attack.The organization confirms that the attackers managed to steal a database containing information on 5.6 million patient visits, corresponding to approximately 267,000 unique individuals.TransForm is a not-for-profit, shared service organization founded by five hospitals in Erie St. Clair, Ontario, to manage their IT, supply chain, and accounts payable.The incident caused operational disruptions, forcing the healthcare providers to reschedule appointments and redirect non-emergency cases to other clinics in the area.BleepingComputer reached out to the organization at that time but did not receive any details about the type of attack TransForm faced.The threat actors stated they might stop the leak as they were more interested in selling it to data brokers.In an update yesterday, TransForm confirmed the ransomware attack and that the hackers exfiltrated from their systems. The organization also made it clear that it does not intend to pay the ransom.The organization explained that the attackers compromised an operations file server that hosted employee data, and also shared drive space used by the impacted hospitals.The shared drive has varying impact on the hospitals, as each opted to store different types and amounts of data in it. Based on the investigation so far, the impact for each hospital is the following:For Bluewater Health, which had the most data exposed, the statement clarifies that the information does not include clinical records. However, the exact contents of the stolen files are still subject to investigation.TransForm’s announcement concludes by asking for patience as the process of determining the scope of the impact and the types of data that have been exposed is time-consuming. The organization promised to provide regular updates on the matter."
   },
   {
      "time": "2023-11-08",
      "title": "Fake Ledger Live app in Microsoft Store steals $768,000 in crypto",
      "text": " Microsoft has recently removed from its store a fraudulent Ledger Live app for cryptocurrency management after multiple users lost at least $768,000 worth of cryptocurrency assets.Published with the name Ledger Live Web3, the fake application appears to have been present in the Microsoft Store since October 19 but the cryptocurrency theft started being reported just a couple of days ago.Microsoft reacted on the same day and removed the app from the store but the fraudster had already transferred more than $768,000 from victims.The fraudster did not spend much effort in making the fake Ledger Live app appear legitimate, though. Looking at the entry in the Microsoft Store, there are sufficient red flags to raise suspicion.It is unclear how many Windows users fell victim to the false version of Live Ledger on Microsoft Store but ZachXBT received messages from multiple victims who had lost cryptocurrency after installing the fake app.Downloaded a new Ledger app I found on Microsoft Store after reinstalling windows on my computer for about 1-2 hours ago. Had not accessed it through ledger live in a while and was prompted to input my 24 word seed recover phrase. Didn't think more about that since so much had happened with both reinstalling Microsoft OS and Ledger Live App, but... It took a few minutes before I saw all my crypto, $18,5k bitcoin and about $8k alt coins disappearWhoever is behind the scam also created a page for the app using the GitBook documentation management platform and hosting it at ladgerlivlugio[.]gitbook.io/us/Given all the signals that alert of a possible scam, it is uncertain how the fraudster managed to publish the app in the Microsoft Store. ZachXBT believes that the vetting process is not thorough enough.BleepingComputer reached out to Microsoft for a comment about the screening process for submitted apps and a spokesperson said that the company is “continually working to ensure malicious content is identified and taken down quickly.”"
   },
   {
      "time": "2023-11-08",
      "title": "Experts Warn of Ransomware Hackers Exploiting Atlassian and Apache Flaws",
      "text": " Multiple ransomware groups have begun to actively exploit recently disclosed flaws in Atlassian Confluence and Apache ActiveMQ.Both vulnerabilities are critical, allowing threat actors to create unauthorized Confluence administrator accounts and lead to a loss of confidentiality, integrity, and availability.The escalation, the Australian company said, is due to the change in the scope of the attack.Attack chains involve mass exploitation of vulnerable internet-facing Atlassian Confluence servers to fetch a malicious payload hosted on a remote server, leading to the execution of the ransomware payload on the compromised server.Huntress, which has also confirmed the active exploitation of the Atlassian flaw starting on November 3, said the attacks pave the way for Cerber ransomware infections.\"However, the speed at which this campaign unfolded, with only a few days between the release of a patch and active, in-the-wild exploitation, emphasizes how quickly such adversaries work to identify and take advantage of distribution mechanisms for their wares.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-08",
      "title": "Critical Flaws Discovered in Veeam ONE IT Monitoring Software – Patch Now",
      "text": " The list of vulnerabilities is as follows -While CVE-2023-38547, CVE-2023-38548, and CVE-2023-41723 impact Veeam ONE versions 11, 11a, 12, CVE-2023-38548 affects only Veeam ONE 12. Fixes for the issues are available in the below versions -Users running the affected versions are recommended to stop the Veeam ONE Monitoring and Reporting services, replace the existing files with the files provided in the hotfix, and restart the two services.Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-11-08",
      "title": "Attackers use Google Calendar RAT to abuse Calendar service as C2 infrastructure",
      "text": " Google Calendar RAT is a PoC of Command&Control (C2) over Google Calendar Events, it was developed red teaming activities. The abuse of the Google service makes it hard for defenders to uncover malicious activity.Google TAG has previously observed threat actors abusing Google services in their operations. In March 2023, TAG spotted an Iran-linked APT group using macro docs to infect users with a small .NET backdoor, BANANAMAIL that relies on Gmail as C2 infrastructure. The backdoor uses IMAP to connect to a webmail account used by the attackers and it parses emails for commands to execute. At the time, TAG experts disabled the attacker-controlled Gmail accounts used as C2 infrastructure.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-11-08",
      "title": "Arid Viper | APT’s Nest of SpyC23 Malware Continues to Target Android Devices - SentinelOne",
      "text": " SentinelLabs compared these newer versions of SpyC23 to the earlier 2020 version, as well as several older Android spyware families associated with Arid Viper: GnatSpy, FrozenCell, and VAMP. Many changes have been made in SpyC23’s development; however, there are notable overlaps with these older families and the taxonomy is less distinct.There is a non-weaponized version of Skipped Messenger (SHA-1: 6e1867bd841f4dc16bef21b5a958eec7a6497c4e) that shares the same Firebase service hostname skippedtestinapp[.]firebaseio[.]com as the malicious version. As the Talos report noted, Skipped was originally a legitimate dating app. The Google Play store version was last updated in August 2021.Like most malicious Android apps, these apps ask the user to enable permissions that facilitate spyware activities.The application permissions give a high degree of control over the device, including:The developer employed anti-decompilation and anti-virtualization techniques to complicate analysis. Each of these APKs contains application code that is obfuscated. On emulated Android devices, the apps flash and repeatedly cycle through prompts even after the requested permissions have been granted.Comparing these new versions with older SpyC23 variants, there is significant overlap in package names, which fortifies the relationship between the old and new versions. In the image below, the older version on the left houses malicious activity in the update.bbm package, and the version we discovered on the right houses similar subpackages in the apps.sklite.pacJava package.The overlaps continue in the class names. The actor frequently names classes after people’s names, as outlined in the rc_cola/tas_ran_rc_col package structure.These applications are quite large, making analysis of each class impractical. Instead, we will focus on several interesting classes and methods.This class handles some communications to the C2. Of note, the class contains code that pertains to the user uninstalling the application. The SendToServerTask subclass logs when the user is in a ‘dangerous’ menu and parses input containing the active menu name for the English words ‘apps’ or ‘applications’ as well as the Arabic word for ‘Applications’.This class is responsible for much of the app’s upload request handling, acting as an interface between the app and the C2 server. Brodie contains a method named isProbablyArabic, suggesting again that these apps are used against Arabic-speaking targets.This service enables the spyware’s call recording feature. The class is imported from an external library, libcallrecfix.so, and runs as a service. The Unix library is based on at least two open-source Android call recording projects, though neither are actively maintained. This was implemented in 2020 and has been a staple of SpyC23 iterations since. The library is a binary compiled for each of the app’s compatible architectures.This class is notable because it contains code that spans back to much earlier versions of Arid Viper’s Android spyware. We identified a 2017 GnatSpy sample from Trend Micro’s Arid Viper reporting that shares the same upload functionality through a subclass JsDirService.This class loads methods from external libraries libRoams.so and lib-uoil.so. The code imports several functions related to manufacturer-specific implementations, including Huawei, Oppo, and Xiaomi.Like older versions of SpyC23, this class has logic to parse and decode the C2 server details from strings stored inside the lib-uoil.so and related binaries. The strings are encoded partially in Base64 with an additional layer likely on top to parse the correct C2 server URIs. The previous technique of dropping the strings before and after the hyphen remain, and further substitution removes spaces and underscores, replacing them with hyphens.The C2 servers used by these apps continue the longstanding Arid Viper domain naming scheme of a hyphenated hostname that uses Western-sounding peoples’ names. The primary C2 servers are:We have included additional network indicators associated with app features that are unique to the APKs analyzed, including Google Cloud project hostnames and Firebase messaging hostnames.The discovery of these APKs demonstrates that Arid Viper continues to thrive in the mobile malware space. The dedication to anti-analysis and obfuscation suggests that the developers have an awareness of research analysis and they have applied measures to deter them and remain under the radar. The presence of code from other Arid Viper Android spyware families in SpyC23 fortifies the connection between this group’s various iterations of tools. The resulting bloat from carrying over older versions of the spyware aids attribution in the complex mobile malware landscape that pervades in the Middle East.Those who are at risk of being targeted by this group should avoid installing applications from outside of the Google Play Store. Everyone should remain wary when installing new apps from any source: does this app really need the permissions it requests? In the case of SpyC23 apps, there is a lengthy walkthrough with images guiding the user to accept an inordinate number of permissions.SentinelLabs would like to thank the research team at Cisco Talos for their collaboration on this research.Get notified when we post new content.Thanks! Keep an eye out for new content!In the era of interconnectivity, when markets, geographies, and jurisdictions merge in the melting pot of the digital domain, the perils of the threat ecosystem become unparalleled. Crimeware families achieve an unparalleled level of technical sophistication, APT groups are competing in fully-fledged cyber warfare, while once decentralized and scattered threat actors are forming adamant alliances of operating as elite corporate espionage teams.Get notified when we post new content.Thanks! Keep an eye out for new content!"
   }
]