[
   {
      "time": "2022-09-23",
      "title": "OpIran – Anonymous Hits Iranian State Sites, Hacks Over 300 CCTV Cameras",
      "text": " On the other hand, authorities claim Amini died of natural causes after suffering heart failure at the police station. However, Iranians have rejected the official explanation and have taken their protests (Mahsa Amini protests (aka September 2022 Iranian protests) to the streets.On Twitter, YourAnonNews, one of the largest social media representatives of the Anonymous movement, and several other popular Anonymous handles have confirmed their support for Iranian protesters. Thus the recent cyber attacks were carried out under the banner of OpIran.The first major Iranian government institution to suffer a cyberattack from Anonymous hackers is its Forensic Research Center. As seen by Hackread.com, Anonymous managed to successfully deface its domains and leak a database containing 100MB worth of data.According to Hackread.com’s analysis, the data contains names, email addresses, logs including IP addresses of the Center’s site visitors worldwide.In the latest, Anonymous has claimed to have compromised 300 security camera installations by exploiting a 5.4 severity score vulnerability.Since launching OpIran, Anonymous has carried out a series of DDoS attacks against Iranian state institutions. Some of these include the following:At the time of writing, all the above-mentioned domains were offline.Anonymous response to the article published by Hackread.comFor now, it remains to be seen how effective Anonymous’ latest operation will be. However, it is clear that the group is determined to continue its fight against what it sees as an oppressive regime.Super secure VPNMinimal data loggingFavorable privacy policy\n\tHackread.com is among the registered trademarks of Gray Dot Media Group Ltd. Company registration number 12903776 in regulation with the United Kingdom Companies House. The registered address is 85 Great Portland Street, London, England, W1W 7LT The display of third-party trademarks and trade names on the site do not necessarily indicate any affiliation or endorsement of Hackread.com. If you click an affiliate link and buy a product or service, we may be paid a fee by that merchant.\n\t\t\t\t"
   },
   {
      "time": "2022-09-23",
      "title": "CISA warns of critical ManageEngine RCE bug used in attacks",
      "text": " The Cybersecurity and Infrastructure Security Agency (CISA) has added a critical severity Java deserialization vulnerability affecting multiple Zoho ManageEngine products to its catalog of bugs exploited in the wild.This security flaw (CVE-2022-35405) can be exploited in low-complexity attacks, without requiring user interaction, to gain remote code execution on servers running unpatched Zoho ManageEngine PAM360 and Password Manager Pro (without authentication) or Access Manager Plus (with authentication) software.\"We strongly recommend our customers to upgrade the instances of Password Manager Pro, PAM360 and Access Manager Plus immediately.\"The federal agencies have three weeks, until October 13th, to ensure that their networks are protected from exploitation attempts.Even though BOD 22-01 applies to U.S. FCEB agencies only, the U.S. cybersecurity agency also strongly urged all organizations from private and public sectors worldwide to prioritize patching this bug.Following this advice and applying patches ASAP will decrease the attack surface attackers could use in attempts to breach their networks.Since this binding directive was issued, CISA has added more than 800 security vulnerabilities to its catalog of bugs exploited in attacks, requiring federal agencies to address them on a tighter schedule.All security professionals and admins are strongly recommended to review CISA's KEV catalog and patch listed bugs within their environment to block security breach attempts."
   },
   {
      "time": "2022-09-23",
      "title": "Microsoft: Exchange servers hacked via OAuth apps for phishing",
      "text": " Microsoft says a threat actor gained access to cloud tenants hosting Microsoft Exchange servers in credential stuffing attacks, with the end goal of deploying malicious OAuth applications and sending phishing emails.\"The investigation revealed that the threat actor launched credential stuffing attacks against high-risk accounts that didn't have multi-factor authentication (MFA) enabled and leveraged the unsecured administrator accounts to gain initial access,\" the Microsoft 365 Defender Research Team said.\"The unauthorized access to the cloud tenant enabled the actor to create a malicious OAuth application that added a malicious inbound connector in the email server.\"The attacker then used this inbound connector and transport rules designed to help evade detection to deliver phishing emails through the compromised Exchange servers.The threat actors deleted the malicious inbound connector and all the transport rules between spam campaigns as an additional defense evasion measure.In contrast, the OAuth application remained dormant for months between attacks until it was used again to add new connectors and rules before the next wave of attacks.These email campaigns were triggered from Amazon SES and Mail Chimp email infrastructure commonly used to send marketing emails in bulk.​The attacker used a network of single-tenant applications as an identity platform throughout the attack.After detecting the attack, Redmond took down all apps linked to this network, sent alerts, and recommended remediation measures to all affected customers.Microsoft says this threat actor was linked to campaigns pushing phishing emails for many years.The attacker was also seen sending high volumes of spam emails within short timeframes through other means \"such as connecting to mail servers from rogue IP addresses or sending directly from legitimate cloud-based bulk email sending infrastructure.\"\"While the scheme possibly led to unwanted charges for targets, there was no evidence of overt security threats such as credential phishing or malware distribution.\""
   },
   {
      "time": "2022-09-23",
      "title": "WhatsApp Message Fraud Dupes Automobile Firm of Rs.1 Crore - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-09-23",
      "title": " FDA Issues Cybersecurity Alert on Medtronic Insulin Pumps - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2022-09-23",
      "title": "Hackers stealing GitHub accounts using fake CircleCI notifications",
      "text": " GitHub is warning of an ongoing phishing campaign that started on September 16 and is targeting its users with emails that impersonate the CircleCI continuous integration and delivery platform.The bogus messages inform recipients that the user terms and privacy policy have changed and they need to sign into their GitHub account to accept the modifications and keep using the services.The threat actors' goal is to steal GitHub account credentials and two-factor authentication (2FA) codes by relaying them through reverse proxies.Accounts protected with hardware security keys for multi-factor authentication (MFA) are not vulnerable to this attack.“While GitHub itself was not affected, the campaign has impacted many victim organizations,” GitHub informs in an advisory on Wednesday.CircleCI has also posted a notice on its forums to raise awareness of the malicious campaign, explaining that the platform would never ask users to enter credentials to view changes in its terms of service.If you believe you or someone on your team may have accidentally clicked a link in this email, please immediately rotate your credentials for both GitHub and CircleCI, and audit your systems for any unauthorized activityThe phishing domains that distribute the phishing messages try to mimic those for the official CircleCI (circleci.com). So far, the following have been confirmed:After obtaining valid account credentials, the threat actors create personal access tokens (PATs), authorize OAuth apps, and sometimes add SSH keys to the account to persist even after a password reset.If the compromised account has organization management permissions, the hackers create new user accounts and add them to the organization to maintain persistence.GitHub has suspended accounts where signs of fraud could be identified. The platform has reset passwords for impacted users, who will see personalized notifications about the incident.If you haven’t received a notice from GitHub but have valid grounds to believe you may be a victim of the phishing campaign, the recommendation is to reset your account password and 2FA recovery codes, review your PATs, and, if possible, start using a hardware MFA key."
   },
   {
      "time": "2022-09-23",
      "title": "Optus notifies customers of cyberattack compromising  customer information",
      "text": " "
   },
   {
      "time": "2022-09-23",
      "title": "Researchers Disclose Critical Vulnerability in Oracle Cloud Infrastructure",
      "text": " Researchers have disclosed a new severe Oracle Cloud Infrastructure (OCI) vulnerability that could be exploited by users to access the virtual disks of other Oracle customers.\"Given the OCID of a victim's disk that is not currently attached to an active server or configured as shareable, an attacker could 'attach' to it and obtain read/write over it,\" Tamari added.At its core, the vulnerability is rooted in the fact that a disk could be attached to a compute instance in another account via the Oracle Cloud Identifier (OCID) without any explicit authorization.This meant that an attacker in possession of the OCID could have taken advantage of AttachMe to access any storage volume, resulting in data exposure, exfiltration, or worse, alter boot volumes to gain code execution.Besides knowing the OCID of the target volume, another prerequisite to pull off the attack is that the adversary's instance must be in the same Availability Domain (AD) as the target.\"Insufficient validation of user permissions is a common bug class among cloud service providers,\" Wiz researcher Elad Gabay said. \"The best way to identify such issues is by performing rigorous code reviews and comprehensive tests for each sensitive API in the development stage.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-09-23",
      "title": "BlackCat ransomware’s data exfiltration tool gets an upgrade",
      "text": " The BlackCat ransomware (aka ALPHV) isn't showing any signs of slowing down, and the latest example of its evolution is a new version of the gang's data exfiltration tool used for double-extortion attacks.Lately, the focus appears to have been on the tool used for exfiltrating data from compromised systems, an essential requirement for conducting double extortion attacks.Named \"Exmatter,\" the tool was used since BlackCat's launch in November 2021 and was heavily updated in August 2022, featuring the following changes:In addition to the expanded capabilities, the latest Exmatter version has gone through heavy code refactoring implementing existing features more stealthily to evade detection.Another recent addition to BlackCat's info-stealing capacity is the deployment of a new malware called \"Eamfo,\" which explicitly targets credentials stored in Veeam backups.This software is typically used for storing credentials to domain controllers and cloud services so that the ransomware actors can use them for deeper infiltration and lateral movement.Eamfo connects to the Veeam SQL database and steals the backup credentials with the following SQL query:Once the credentials are extracted, Eamfo decrypts them and displays them to the threat actor.Finally, Symantec has noticed that the BlackCat operation has been seen using an older anti-rootkit utility called to terminate antivirus processes.In June 2022, BlackCat introduced support for encrypting files on ARM architectures and a mode to encrypt in Windows safe mode with or without networking.It's evident that BlackCat constantly evolves with new tools, improvements, and extortion strategies to make the RaaS operation more effective and efficient.Symantec reports that BlackCat's operators expel affiliates who aren't as prolific as they would like, suggesting they seek collaboration with lower-tier RaaS programs.This shutdown has led to an influx of experienced attackers who were quickly able to launch new attacks under the new operation."
   }
]