[
   {
      "time": "2023-08-17",
      "title": "Major U.S. energy org targeted in QR code phishing attack",
      "text": " A phishing campaign was observed predominantly targeting a notable energy company in the US, employing QR codes to slip malicious emails into inboxes and bypass security.Roughly one-third (29%) of the 1,000 emails attributed to this campaign targeted a large US energy company, while the remaining attempts were made against firms in manufacturing (15%), insurance (9%), technology (7%), and financial services (6%).According to Cofense, who spotted this campaign, this is the first time that QR codes have been used at this scale, indicating that more phishing actors may be testing their effectiveness as an attack vector.Cofense did not name the energy company targeted in this campaign but categorized them as a \"major\" US-based company.The emails carry PNG or PDF attachments featuring a QR code the recipient is prompted to scan to verify their account. The emails also state that the target must complete this step in 2-3 days to add a sense of urgency.The threat actors use QR codes embedded in images to bypass email security tools that scan a message for known malicious links, allowing the phishing messages to reach the target’s inbox.To evade security, the QR codes in this campaign also use redirects in Bing, Salesforce, and Cloudflare’s Web3 services to redirect the targets to a Microsoft 365 phishing page.Hiding the redirection URL in the QR code, abusing legitimate services, and using base64 encoding for the phishing link all help evade detection and get through email protection filters.Despite their effectiveness in bypassing protections, QR codes still require the victim to take action to get compromised, which is a decisive mitigating factor working in favor of well-trained personnel.Also, most QR code scanners on modern smartphones will ask the user to verify the destination URL before launching the browser as a protective step.Apart from training, Cofense also suggests that organizations use image recognition tools as part of their phishing protection measures, although these are not guaranteed to catch all QR code threats."
   },
   {
      "time": "2023-08-17",
      "title": "Google released first quantum-resilient FIDO2 key implementation",
      "text": " Google has announced the first open-source quantum resilient FIDO2 security key implementation, which uses a unique ECC/Dilithium hybrid signature schema co-created with ETH Zurich.FIDO2 is the second major version of the Fast IDentity Online authentication standard, and FIDO2 keys are used for passwordless authentication and as a multi-factor authentication (MFA) element.Google explains that a quantum-resistant FIDO2 security key implementation is a crucial step towards ensuring safety and security as the advent of quantum computing approaches and developments in the field follow an accelerating trajectory.\"In particular, standard public key cryptography, which was designed to protect against traditional computers, will not be able to withstand quantum attacks.\"With quantum computers being actively developed, there is concern that they will soon be used to more efficiently and quickly crack encryption keys, making encrypted information accessible to governments, threat actors, and researchers.To protect against quantum computers, a new hybrid algorithm was created by combining the established ECDSA algorithm with the Dilithium algorithm.This hybrid signature approach that blends classic and quantum-resistant features wasn't simple to manifest, Google says. Designing a Dilithium implementation that's compact enough for security keys was incredibly challenging.Its engineers, however, managed to develop a Rust-based implementation that only needs 20KB of memory, making the endeavor practically possible, while they also noted its high-performance potential.The tech giant hopes that its proposal will be adopted by FIDO2 as a new standard and supported by major web browsers with large user bases.The firm calls the application of next-gen cryptography at the internet scale \"a massive undertaking\" and urges all stakeholders to move quickly to maintain good progress on that front.This move came in anticipation of the risk of future quantum computers having the capacity to decrypt today's data, addressing the \"Harvest Now, Decrypt Later\" threat."
   },
   {
      "time": "2023-08-17",
      "title": "Massive 400,000 proxy botnet built with stealthy malware infections",
      "text": " Researchers have uncovered a massive campaign that delivered proxy server apps to at least 400,000 Windows systems. The devices act as residential exit nodes without users' consent and a company is charging for the proxy traffic running through the machines..Some proxy companies sell access to residential proxies and offer monetary rewards to users who agree to share their bandwidth.In a report today, AT&T Alien Labs says that the 400,000-node proxy network was built by using malicious payloads that delivered the proxy application.Despite the company behind the botnet claiming that users gave their consent, the researchers discovered that the proxy installed silently on the devices.\"In addition, as the proxy application is signed, it has no anti-virus detection, going under the radar of security companies,\" the researchers added.In fact, the two Go-based binaries (for macOS and Windows) appear to originate from the same source code, however, the Windows proxy client evades antivirus detection due to using a valid digital signature.The infection starts with the execution of a loader hidden in cracked software and games, which downloads and installs the proxy application automatically in the background without user interaction.The malware authors use Inno Setup with specific parameters that hide any indicators of the installation process and all typical user prompts.During the installation of the proxy client, the malware sends specific parameters, which are also relayed to the command and control (C2) server so that the new client can be registered and incorporated into the botnet.The proxy client establishes persistence on the infected system by creating a registry key to activate it when the system boots and a by adding a scheduled task that to check for new client updates.\"The proxy then continuously gathers vital information from the machine to ensure optimal performance and responsiveness,\" explains the AT&T report.\"This includes everything from the process list and monitoring CPU to memory utilization and even tracking battery status.\"AT&T recommends looking for a \"Digital Pulse\" executable at \"%AppData%\\\" or a similarly named Registry key on \"HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\.\" If any are present, the researchers recommend removing them.The name of the scheduled task is \"DigitalPulseUpdateTask\" and should also be deleted to eliminate the chance of the client update mechanism re-introducing the infection.Finally, avoid downloading pirated software and running executables sourced from dubious locations like peer-to-peer networks or site offering premium software free of charge.Signs of proxyware infection include performance and internet speed degradation, unexpected network traffic patterns, frequent communication with unknown IPs or domains, and system alerts."
   },
   {
      "time": "2023-08-17",
      "title": "PowerShell Gallery Prone to Typosquatting, Other Supply Chain Attacks",
      "text": " [Editor's Note: This article was updated on 8/18/2023 with a response received from Microsoft]Microsoft's PowerShell Gallery presents a software supply chain risk because of its relatively weak protections against attackers who want to upload malicious packages to the online repository, according to researchers at Aqua Nautilus.They recently tested the repository's policies regarding package names and owners and found that a threat actor could easily abuse them to spoof legitimate packages and make it hard for users to identify the true owner of a package.\"If your organization uses PowerShell modules from the gallery, we suggest only using signed PowerShell modules, utilizing trusted private repositories, and exercising caution when downloading new modules/scripts from registries,\" says Yakir Kadkoda, lead security researcher at Aqua. \"Second, we advise similar platforms to the PowerShell Gallery to take necessary steps to enhance their security measures. For instance, they should implement a mechanism that prevents developers from uploading modules with names too similar to existing ones.\"Kadkoda says Microsoft acknowledged the issues when informed about them and claimed it had addressed two separate issues, once in February 2022 and a second time this past January. \"However, we've continued to check, and these issues still exist\" as of Aug. 16, he says.Microsoft said it added functions to find and eradicate malicious packages. \"We're aware of this report and have determined that it relies on social engineering to be successful. However we've implemented some changes to help identify and remove these packages,\" a Microsoft spokeswoman said in an emailed statement to Dark Reading after this story was published. \"We encourage users to report any packages they suspect are malicious via the \"Report\" link on the package module.\"Microsoft said it will continue to monitor for malicious activity on PowerShell Gallery and take defense-in-depth measures to keep customers protected.PowerShell Gallery is a widely used repository for finding, publishing, and sharing PowerShell code modules and so-called desired state configuration (DSC) resources. Many of the packages on the registry are from trusted entities, such as Microsoft, AWS, and VMware, while many others are from community members. There have been more than 1.6 billion package downloads from the repository so far this year alone.One issue that Aqua discovered was the lack of any kind of protection against typosquatting, a deception technique that threat actors have increasingly used in recent years to trick users into downloading malicious packages from public software repositories. Typosquatters typically use names that are phonetically similar to names of popular and legitimate packages on public repositories, such as npm, PyPI, and Maven. They then rely on users making typos when searching for these packages and downloading their malicious package instead. The technique has become a common software supply chain attack vector.Aqua found PowerShell Gallery's policies did little to protect against such deception. For instance, the names of most Azure packages on the repository followed a specific pattern, namely, \"Az.<package_name>.\" However, some other very popular Azure packages such as \"Aztable\" did not follow the pattern and did not have a dot in the name.  Aqua found that there are no restrictions on the prefixes that package developers can use when naming their packages. For example, when Aqua's researchers crafted a nearly perfect replica of Aztable and labeled it Az.Table, they had no problem uploading the proof-of-concept (PoC) code to PowerShell Gallery. Callback code that Aqua included in the PoC showed that several hosts across various cloud services had downloaded the package in the first few hours alone.\"In our opinion, other registries have more protective measures,\" Kadkoda says. \"For instance, npm, another registry platform by Microsoft, uses 'Moniker' rules specifically designed to combat typosquatting,\" he says. One example: Since a package named \"react-native\" already exists on npm, no one labels their module with variation such as \"reactnative,\" \"react_native,\" or \"react.native.\"Another problem that Aqua uncovered with PowerShell Gallery's policies is how they allowed a threat actor to make a malicious package appear legitimate by faking crucial details such as the Author(s), Description, and Copyright fields.  \"An attacker can freely choose any name when creating a user in the PowerShell Gallery,\" Aqua said in its blog post. \"Therefore, determining the actual author of a PowerShell module in the PowerShell Gallery poses a challenging task.\"Unsuspecting users who find these packages on PowerShell Gallery can easily be deceived into believing that the author of the malicious package is a legitimate entity, such as Microsoft, Aqua said.In addition, Aqua's analysis showed that one API in PowerShell Gallery's basically gave threat actors a way to find unlisted modules on the registry — and potentially any sensitive data associated with those modules. Typically, an unlisted module is private and should not be something that an attacker would be able to find via a search of the repository. Aqua researchers found they could not only pull up such modules, they also found one that contained sensitive secrets that belonged to a large technology company.Kadkoda says there is no evidence to suggested that threat actors have leveraged these weaknesses to sneak malicious package into PowerShell Gallery. However, the threat is real. \"It's important to note that, according to Microsoft, they scan PowerShell modules/scripts uploaded to the gallery,\" Kadkoda says. \"This is a good measure to block malicious uploads. However, it remains a cat-and-mouse game between Microsoft's solution and attackers.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-08-17",
      "title": "\r\n\tClorox Operations Disrupted By Cyber-Attack - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistCleaning product manufacturer Clorox has confirmed significant operational disruption caused by a recent cyber-attack. According to a notice published on the company’s website, the attack was detected on August 14, prompting Clorox’s IT team to take immediate action by halting suspicious activity and shutting down affected systems. As a precautionary measure, the compromised systems have remained offline until today to allow for enhanced security measures.“When it comes to ransomware, a common misconception is that organizations escape unscathed if criminals do not encrypt their data, but this is completely wrong. Even if data isn’t held hostage, organizations can still incur huge financial losses as a result of downtime and recovery,” Schroeder explained.The cyber-attack has disrupted Clorox’s manufacturing and distribution processes, affecting its ability to fulfil orders and maintain normal operations. The company has activated its business continuity plans to mitigate the impact and ensure its products remain available to consumers.“The Clorox Company recently identified unusual activity on our IT systems. Upon detection, we immediately took steps to stop the activity and took certain systems offline. While we are working diligently to respond to and address this issue, these systems will remain offline out of an abundance of caution, as we work to add additional protections and hardening measures to further secure them. As a result, some operations are temporarily impaired. We are following our business continuity plans and implementing workarounds where possible,” the company said in a statement received by Infosecurity.“The investigation into the nature and scope of the incident remains ongoing and is in its very early stages. Our team is working diligently to restore systems safely and quickly, and we will ensure all suppliers and customers are updated as appropriate.”Editorial image credit: calimedia / Shutterstock.com"
   },
   {
      "time": "2023-08-17",
      "title": "\r\n\tMass-Exploitation Campaign Targets Citrix NetScalers With Backdoors - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistA widespread cyber-attack targeting thousands of Citrix NetScalers has been unveiled by cybersecurity firm Fox-IT (part of NCC Group) in collaboration with the Dutch Institute of Vulnerability Disclosure (DIVD).The campaign involved exploiting a critical vulnerability, CVE-2023-3519, which allowed malicious actors to infiltrate and compromise vulnerable NetScalers, even after patches and reboots.Describing the threat in an advisory published on Tuesday, NCC Group said the scale of the attack became evident as over 1900 NetScalers were found to be still backdoored at the time of discovery.The attackers employed automated methods to place web shells onto compromised systems, granting them persistent access and the ability to execute arbitrary commands. Despite efforts to apply patches and updates, only half of the compromised NetScalers had been successfully updated to fix the vulnerability.The vulnerability itself was disclosed on July 18, following reports of limited exploitation by various security organizations. This prompted a joint effort by Fox-IT and DIVD to identify compromised systems and initiate responsible disclosure notifications. The incident highlights the ongoing challenge of securing edge devices such as NetScalers, as attackers exploit vulnerabilities before patches can be applied. "
   },
   {
      "time": "2023-08-17",
      "title": "\r\n\tA Third of UK University Students Targeted By Fraud - Infosecurity Magazine\r\n",
      "text": " UK / EMEA News Reporter, Infosecurity MagazineOne in three students at British universities encountered fraud attempts online last year, according to a new study from NatWest.The high street lender commissioned consulting firm RedBrick to poll over 3000 UK university students from 63 towns and cities back in May.Although a third of respondents said they’d encountered a scam over the previous 12 months, there were no statistics on how many were actually caught out.That said, the most common fraud attempts they came across over the period were delivery scams, which 14% of respondents said they’d seen.These are effectively phishing emails impersonating a well-known courier brand. They claim the recipient has a parcel waiting but needs to click through and enter their personal details, sometimes including financial information, to reschedule the delivery.Social media and HMRC tax scams were also frequently encountered by respondents, NatWest claimed. However, fraud relating to high street banks appeared to drop from 2022 figures, hitting just 10% of those polled for the study.NatWest said that women were “slightly more likely” to have encountered a scam in the past 12 months but over twice as likely to lose money than men. The average amount lost by victims of fraud was around £80 ($102).Students living in Bournemouth were most likely to have been hit by scams, with 44% of respondents living in the south coast city saying they had encountered fraud over the previous year. Next came Edinburgh and Oxford. Students in Bristol and Leicester were least likely to be on the receiving end of a fraud attempt (25%).“It is really important that students remain vigilant and are on their guard when they receive an unexpected text message, email or phone call asking for personal details,” explained head of NatWest student accounts, Jaimala Patel."
   },
   {
      "time": "2023-08-17",
      "title": "File sharing site Anonfiles shuts down due to overwhelming abuse",
      "text": " Anonfiles, a popular service for sharing files anonymously, has shut down after saying it can no longer deal with the overwhelming abuse by its users.Anonfiles is an anonymous file-sharing site that allows people to share files anonymously without their activity being logged.The statement shown on Anonfiles site is reproduced in its entirety below:\"After trying endlessly for two years to run a file sharing site with user anonymity we have been tired of handling the extreme volumes of people abusing it and the headaches it has created for us.\nMaybe it is hard to understand but after tens of million uploads and many petabytes later all work of handling abuse was automated through all available channels to be fast as possible.\nWe have auto banned contents of hundreds of thousands files.\nBanned file names and also banned specific usage patterns connected to abusive material to the point where we did not care if we accidental delete thousands of false positive in this process.\nEven after all this the high volume of abuse will not stop.\nThis is not the kind of work we imagine when acquiring it and recently our proxy provider shut us down.\nThis can not continue.\nDomain 4sale.\ndomain@anonfiles.com\"However, these ISO files contained various malware, including information-stealing malware, remote access trojans, and ad clickers.The Anonfiles operators are now looking for someone to purchase their domain, likely to launch their own file sharing service.However, in the interim, the shutdown will cause many files used by cybersecurity researchers and threat actors alike to no longer be available."
   },
   {
      "time": "2023-08-17",
      "title": "CISA warns of critical Citrix ShareFile flaw exploited in the wild",
      "text": " CISA is warning that a critical Citrix ShareFile secure file transfer vulnerability tracked as CVE-2023-24489 is being targeted by unknown actors and has added the flaw to its catalog of known security flaws exploited in the wild.Citrix ShareFile (also known as Citrix Content Collaboration) is a managed file transfer SaaS cloud storage solution that allows customers and employees to upload and download files securely.The service also offers a 'Storage zones controller' solution that allows enterprise customers to configure their private data storage to host files, whether on-premise or at supported cloud platforms, such as Amazon S3 and Windows Azure.On June 13th, 2023, ShareFile released a security advisory on a new ShareFile storage zones vulnerability tracked as CVE-2023-24489 with a critical severity score of 9.8/10, which could allow unauthenticated attackers to compromise customer-managed storage zones.However, ShareFile told BleepingComputer after publication that a fix for CVE-2023-24489 was released on May 11th, 2023 with version 5.11.24. This fix was released as a private advisory, allowing ShareFile customers to patch their devices before the flaw was made public. The company says that over 83% of these customers had patched their environments before the flaw was publicly disclosed.\"Through our research we were able to achieve unauthenticated arbitrary file upload and full remote code execution by exploiting a seemingly innocuous cryptographic bug,\" AssetNote researchers explain.Using this flaw, a threat actor could upload a web shell to a device to gain full access to the storage and all its files.While CISA shares this same warning on many advisories, flaws impacting managed file transfer (MFT) solutions are of particular concern, as threat actors have heavily exploited them to steal data from companies in extortion attacks.As part of AssetNote's technical writeup, the researchers shared enough information for threat actors to develop exploits for the Citrix ShareFile CVE-2023-24489 flaw. Soon after, other researchers released their own exploits on GitHub.On July 26th, GreyNoise began monitoring for attempts to exploit the vulnerability. After CISA warned about the flaw today, GreyNoise updated its report to say there had been a significant uptick in attempts by different IP addresses.At this time, GreyNoise has seen attempts to exploit or check if a ShareFile server is vulnerable from 72 IP addresses, with the majority from South Korea and others in Finland, the United Kingdom, and the United States.While no publicly known exploitation or data theft has been linked to this flaw, CISA now requires Federal Civilian Executive Branch (FCEB) agencies to apply patches for this bug by September 6th, 2023.However, due to the highly targeted nature of these bugs, it would be strongly advised that all organizations apply the updates as soon as possible.Citrix ShareFile told BleepingComputer that this vulnerability impacted less than 3% of their install base (2800 customers) and that there is no known data theft due to this vulnerability.Update 8/22/23: Added information from Citrix."
   },
   {
      "time": "2023-08-17",
      "title": "\r\n\tScammers Exploit Hacked Websites For Phishing - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistA recent study by cybersecurity firm Kaspersky has revealed the techniques utilized by phishers to evade detection and exploit compromised websites for phishing attacks.According to a technical write-up published by security researchers Tatyana Machneva and Olga Svistunova on Monday, one common strategy is the hacking of abandoned or poorly maintained websites. These sites become vulnerable due to outdated security patches, providing cyber-criminals an easy entry point. Phishers can then embed malicious content within these sites, often going unnoticed for extended periods.Even active but smaller websites are not immune to such attacks, Kaspersky explained. Financial constraints and lack of security expertise make them appealing targets. As links to scam pages are often shared via email or instant messaging, the popularity of a website becomes less relevant to phishers than its susceptibility to compromise.Additionally, the research highlights the prevalence of WordPress-powered websites in these attacks, with 43.1% of all websites on the internet relying on this content management system. Hackers frequently exploit vulnerabilities in plugins and the platform itself.“Otherwise, attackers may set up malicious domains long before launching phishing campaigns so as to trick systems that automatically flag messages from newly created domains. Breaching WordPress sites solves this issue because the domains are not newly registered, and hackers can avoid the risk and hassle of registering a domain they intend to use for their malicious purposes.”Kaspersky’s study also provides insights into the methods employed by these malicious actors to infiltrate and manipulate control panels of hacked websites."
   },
   {
      "time": "2023-08-16",
      "title": "\r\n\tUK Police Data Breach Exposes Victim Information - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThe Norfolk and Suffolk police in the UK have confirmed the accidental exposure of personal data belonging to more than 1000 individuals, including crime victims. The disclosure occurred within Freedom of Information (FOI) responses issued by law enforcement agencies. According to a joint statement from the East Anglian constabularies, a “technical issue” resulted in the inclusion of raw crime report data in a “very small percentage” of FOI responses distributed between April 2021 and March 2022.This occurrence marks the most recent data breach involving police responses to FOI requests in the UK, following the mishap on August 8, where the Police Service of Northern Ireland inadvertently unveiled sensitive information roughly 10,000 officers and staff members.The compromised data in the Norfolk and Suffolk breach encompassed information stored within a dedicated police system, including data on crime reports, details regarding victims, witnesses and suspects, and descriptions of the criminal acts. The spectrum of offenses encompassed domestic incidents, sexual offenses, assaults, thefts and instances of hate crime.In response to the breach, an exhaustive analysis was promptly conducted, and the affected individuals are in the process of being notified about the potential compromise of their data. The communication process is expected to conclude by the end of September.The incident has attracted the attention of the Information Commissioner’s Office (ICO), the regulatory authority responsible for overseeing data protection. “We are currently investigating this breach and a separate breach reported to us in November 2022,” stated Stephen Bonner, deputy commissioner at the ICO. “In the meantime, we’ll continue to support organisations to get data protection right so that people can feel confident that their information is secure.”Editorial image credit: Joe Kuis / Shutterstock.com"
   },
   {
      "time": "2023-08-16",
      "title": "QwixxRAT, a new Windows RAT appears in the threat landscape",
      "text": " The Uptycs Threat Research team discovered the QwixxRAT (aka Telegram RAT) in early August 2023 while it was advertised through Telegram and Discord platforms. The RAT is able to collect sensitive data and exfiltrate them by sending the info to the attacker’s Telegram bot.Threat actors remotely control the RAT and manage its operations through a Telegram bot.“To avoid detection by antivirus software, the RAT employs command and control functionality through a Telegram bot. This allows the attacker to remotely control the RAT and manage its operations.” According to the experts, QwixxRAT is meticulously designed to steal a broad range of information, including data from browser histories, credit card details, screenshots, and keystrokes.The cybersecurity company, which discovered the malware earlier this month, said it’s “meticulously designed” to harvest web browser histories, bookmarks, cookies, credit card information, keystrokes, screenshots, FTP credentials, messenger data, and data from the Steam platform.The RAT is available for 150 rubles for a weekly subscription and 500 rubles for a lifetime subscription, however, the researchers also noticed the availability of a limited free version.The QwixxRAT RAT is written in C# compiled binary, functioning as a 32-bit executable file designed for CPU operations. The malware supports 19 functions, each serving a unique purpose.The malware implements multiple anti-analysis features and evasion techniques. Experts noticed that the RAT uses a sleep function to introduce a delay and determined if it is being run under a debugger. The malicious code also runs checks to determine whether it’s running within a sandbox or virtual environment.The QwixxRAT also supports a self-destruction mechanism designed for a C# program.The malware includes a clipper code to capture data copied to the clipboard, a technique used to extract cryptocurrency wallet information from Monero, Ethereum, and Bitcoin.The researchers published YARA detection rule for this threat.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-08-16",
      "title": "Hacking ATMs by exploiting flaws in ScrutisWeb ATM fleet software",
      "text": " ScrutisWeb software is developed by Lagona, it allows to remotely manage ATMs fleets. Operators can use the software to send and receive files to a device, modifying data, reboot a device or shut down a terminal.The researchers discovered multiple vulnerabilities, including Absolute Path Traversal and Authorization Bypass Through User-Controlled Key issues, Hardcoded Cryptographic Key, and Unrestricted Upload of File with Dangerous Type.Lagona addressed the vulnerabilities in July 2023 with the release of ScrutisWeb version 2.1.38. The CVE-2023-33871 is an Absolute Path Traversal that an allow to download configurations, logs and databases from the server.The CVE-2023-35189 is a Remote Code Execution that could be chained with the other issues to gain user access to the ATM controller.The CVE-2023-38257 is an Insecure Direct Object Reference that can be exploited to retrieve information about all users on the system.ì, including administrators.The CVE-2023-35763 is Hardcoded encryption key that can allow to retrieve Plaintext administrator credentials.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-08-16",
      "title": "Almost 2,000 Citrix NetScaler servers backdoored in hacking campaign",
      "text": " A threat actor has compromised close to 2,000 thousand Citrix NetScaler servers in a massive campaign exploiting the critical-severity remote code execution tracked as CVE-2023-3519.More than 1,200 servers were backdoored before administrators installed the patch for the vulnerability and continue to be compromised because they have not been checked for signs of successful exploitation, the researchers say.Security researchers at cybersecurity company Fox-IT (part of the NCC Group) and the Dutch Institute of Vulnerability Disclosure (DIVD) have discovered a large-scale campaign that planted webshells on Citrix Netscaler servers vulnerable to CVE-2023-3519.Over the past two months, Fox-IT responded to multiple incidents related to CVE-2023-3519 exploitation and discovered servers compromised with several web shells.Using the details about the backdoors, Fox-IT and DIVD were able to scan the internet for devices that had the web shells installed. Administrators can recognize their scans by checking the Citrix HTTP Access logs for the user-agent: DIVD-2023-00033.Initially, the scans considered only vulnerable systems but later expanded to Citrix instances that received the update to address CVE-2023-3519.This revealed 1,952 NetScaler servers backdoored with the same web shells Fox-IT found during the incident response engagements, indicating that the adversary used an automated method to exploit the vulnerability at a large scale.In a larger context, the 1,952 backdoored servers represent more than 6% of the 31,127 Citrix NetScaler instances vulnerable to CVE-2023-3519 at a global level when the campaign was active.On August 10, Fox-IT and DIVD started to reach out to organizations, either directly or through national CERTs, about compromised NetScaler instances on their network.Yesterday, the largest number of compromised Citrix NetScaler servers, both patched and unpatched, was in Germany, followed by France and Switzerland.Fox-IT says that Europe is the most affected, highlighting that of the top 10 affected countries, only two are from a different region of the world.Another detail the researchers observed is that while Canada, Russia, and the U.S. had thousands of vulnerable NetScaler servers on July 21, they found compromising web shells on almost none of them.Fox-IT says that the number of affected Citrix NetScaler servers is declining but there are still plenty of compromised instances.The researchers warn that a patched NetScaler server can still have a backdoor and recommend administrators perform basic triage on their systems."
   },
   {
      "time": "2023-08-16",
      "title": "New CVE-2023-3519 scanner detects hacked Citrix ADC, Gateway devices",
      "text": " Mandiant has released a scanner to check if a Citrix NetScaler Application Delivery Controller (ADC) or NetScaler Gateway Appliance was compromised in widespread attacks exploiting the CVE-2023-3519 vulnerability. However, even for organizations that installed the security updates, the risk of being compromised remains, as the patch does not remove malware, backdoors, and webshells planted by the attackers in the post-compromise phase.Today, Mandiant released a scanner that enables organizations to examine their Citrix ADC and Citrix Gateway devices for signs of compromise and post-exploitation activity.\"It will not identify a compromise 100% of the time, and it will not tell you if a device is vulnerable to exploitation.\"Mandian't Ctrix IOC Scanner must be run directly on a device or a mounted forensic image, as it will scan the local filesystem and configuration files for the presence of various IOCs.When finished, the scanner will display a summary detailing if it encountered any signs of compromise, as shown below.If it detects that the device was compromised, the scanner will display a detailed report listing the various indicators of compromise that were detected.If the scanner reveals signs of compromise, it is recommended to perform a complete forensic examination on the impacted appliances and network parts to evaluate the scope and extent of the breach, which requires a different set of tools.It is important to note that a negative result should not be taken as a guarantee that a system hasn't been compromised, as attackers still have many ways to hide their traces and, in many cases, had ample time to do so.It is recommended to run the scanner on all appliances exposed to the internet while running a vulnerable firmware version at any time.The scanner was designed to be used with Citrix ADC and Citrix Gateway versions 12.0, 12.1, 13.0, and 13.1."
   },
   {
      "time": "2023-08-16",
      "title": "Credentials for cybercrime forums found on roughly 120K computers infected with info stealers",
      "text": " Threat intelligence firm Hudson Rock has discovered credentials associated with cybercrime forums on roughly 120,000 computers infected with various information stealer malware. The experts discovered that many of these computers, compromised between 2018 to 2023, belong to threat actors.The researchers were able to uncover the real identities of the hackers based on indicators such as additional credentials found on the computers (additional emails, usernames), auto-fill data containing personal information (names, addresses, phone numbers), and system information.The researchers discovered that the cybercrime forum with the highest number of infected users is “Nulled.to” (57,203), followed by “Cracked.io” (19,062) and “Hackforums.net” (13,366).The analysis of the passwords of users revealed that forum with the strongest user passwords is “Breached.to.”The expers noticed that the passwords from Cybercrime forums are stronger than passwords used for Government websites.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-08-16",
      "title": "Monti Ransomware gang launched a new Linux encryptor",
      "text": " The Monti ransomware operators returned, after a two-month break, with a new Linux version of the encryptor. The variant was employed in attacks aimed at organizations in government and legal sectors.According to Trend Micro, this variant is quite different from the previous Linux-based version.The new Linux variant of the ecryptor doesn’t accept some arguments from its older variant and adds the –whitelist parameter, which is used to avoid encrypting virtual machines. The researchers observed that the developers also tampered with the /etc/motd and index.html files, replacing their contents with a ransom note.The new Linux variant uses AES-256-CTR encryption instead of Salsa20. The researchers also discovered that the new variant, unlike the previous version which utilized a –size argument to determine the percentage of the file to be encrypted, solely relies on the file size for its encryption process.“It’s likely that the threat actors behind Monti still employed parts of the Conti source code as the base for the new variant, as evidenced by some similar functions, but implemented significant changes to the code — especially to the encryption algorithm.” concludes the report. “Furthermore, by altering the code, Monti’s operators are enhancing its ability to evade detection, making their malicious activities even more challenging to identify and mitigate.”\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-08-16",
      "title": "AI Steals Passwords by Listening to Keystrokes With Scary Accuracy",
      "text": " Trained with keystrokes on a laptop transmitted over a smartphone, a new AI model was able to overhear typing and steal passwords with 95% accuracy.\"With recent developments in deep learning, the ubiquity of microphones and the rise in online services via personal devices, acoustic side channel attacks present a greater threat to keyboards than ever,\" the researchers explained. \"Our results prove the practicality of these side channel attacks via off-the-shelf equipment and algorithms.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-08-16",
      "title": "LinkedIn accounts hacked in widespread hijacking campaign",
      "text": " LinkedIn is being targeted in a wave of account hacks resulting in many accounts being locked out for security reasons or ultimately hijacked by attackers.\"Some have even been pressured into paying a ransom to regain control or faced with the permanent deletion of their accounts,\" reports Cyberint's researcher Coral Tayar.\"While LinkedIn has not yet issued an official announcement, it appears that their support response time has lengthened, with reports of a high volume of support requests.\"\"No response from them anywhere. It's pathetic. I tried reporting my hacked account, going through identity verification, and even DMing them on @linkedinhelp on twitter. No responses anywhere. What a joke of a company..\"Cyberint says there are also signs of a breakout reflected in Google Trends, where search terms about LinkedIn account hack or recovery record an increase of 5,000% over the past few months.The attackers appear to be using leaked credentials or brute-forcing to attempt to take control of a large number of LinkedIn accounts.For accounts that are appropriately protected by strong passwords and/or two-factor authentication, the multiple takeover attempts resulted in a temporary account lock imposed by the platform as a protection measure.Owners of these accounts are then prompted to verify ownership by providing additional information and also update their passwords before they're allowed to sign in again.When the hackers successfully take over poorly protected LinkedIn accounts, they quickly swap the associated email address with one from the \"rambler.ru\" service. After that, the hijackers change the account password, preventing the original holders from accessing their accounts. Many of the users also reported that the hackers turned on 2FA after hijacking the account, making the account recovery process even more difficult.In some cases observed by Cyberint, the attackers demanded a small ransom to give the accounts back to the original owners or outright deleted the accounts without asking for anything.If you maintain a LinkedIn account, now would be a good time to review the security measures you've activated, enable 2FA, and switch to a unique and long password.BleepingComputer has contacted LinkedIn requesting a comment on the reported situation, but we have not received a response by publication time."
   },
   {
      "time": "2023-08-16",
      "title": "Ivanti Avalanche impacted by critical pre-auth stack buffer overflows",
      "text": " Two stack-based buffer overflows collectively tracked as CVE-2023-32560 impact Ivanti Avalanche, an enterprise mobility management (EMM) solution designed to manage, monitor, and secure a wide range of mobile devices.The flaws are rated critical (CVSS v3: 9.8) and are remotely exploitable without user authentication, potentially allowing attackers to execute arbitrary code on the target system.The vulnerability impacts WLAvalancheService.exe version 6.4.0.0 and older, which receives communications over TCP port 1777.An attacker sending specially crafted data packets containing hex strings (type 3) or a list of decimal strings separated by “;” (type 9) can cause a buffer overflow due to a fixed-size stack-based buffer used to store the converted data.Buffer overflow is a type of security problem where a program writes more data to an adjacent memory block (buffer) than it can hold, overwriting those locations and causing program crashes or arbitrary code execution.Stack-based buffer overflows concern the overwrite of regions allocated on the stack, a memory region that stores the program’s local variables and return addresses, making it possible to direct the program to execute malicious code.Along with CVE-2023-32560, Avalanche version 6.4.1 also fixes CVE-2023-32561, CVE-2023-32562, CVE-2023-32563, CVE-2023-32564, CVE-2023-32565, and CVE-2023-32566, concerning various authentication bypass and remote code execution flaws.Ivanti software is used in critical systems and settings, so threat actors are constantly looking for critical-severity vulnerabilities that constitute potential gateways for attacks."
   },
   {
      "time": "2023-08-15",
      "title": "\r\n\tMicrosoft: Critical CODESYS Flaws Could Shut Down Power Plants - Infosecurity Magazine\r\n",
      "text": " Deputy Editor, Infosecurity MagazineMicrosoft researchers have identified multiple high-severity vulnerabilities that could enable threat actors to shut down power plants.The flaws were discovered within the CODESYS software development kit (SDK), which is widely used to program and engineer programmable logic controllers in industrial operational technology (OT) systems in sectors like manufacturing and energy.The Microsoft’s cyberphysical systems research team said that exploitation of the discovered vulnerabilities could put critical infrastructure organizations at risk of attacks such as remote code execution (RCE) and denial of service (DoS).A DoS attack against a device using a vulnerable version of CODESYS could enable attackers to shut down a power plant, according to the researchers. In addition, threat actors could tamper with operations, cause a PLC to run in an unusual way, or steal critical information by deploying a backdoor via an RCE.The researchers acknowledged that exploitation is difficult, with attackers requiring user authentication alongside “deep knowledge of the proprietary protocol of CODESYS V3 and the structure of the different services that the protocol uses.”Microsoft said it reported the latest discovery to CODESYS in September 2022 and worked with the firm to develop patches.CODESYS customers have been urged to apply these fixes as soon as possible. Microsoft recommended that they first identify the devices using CODESYS in their network before checking with device manufacturers to determine which version of the CODESYS SDK is used and whether a patch is available."
   },
   {
      "time": "2023-08-15",
      "title": "Colorado warns 4 million of data stolen in IBM MOVEit breach",
      "text": " The Colorado Department of Health Care Policy & Financing (HCPF) is alerting more than four million individuals of a data breach that impacted their personal and health information.Colorado HCPF is a state government agency that manages the Health First Colorado (Medicaid) and Child Health Plan Plus programs, and provides support for low-income families, the elderly, and citizens with disabilities.HCPF clarifies that while their systems weren't directly compromised, the data exposure occurred through IBM, their contractor, which utilized the MOVEit software.\"While HCPF confirmed that no other HCPF systems or databases were impacted, on June 13, 2023, the investigation identified that certain HCPF files on the MOVEit application used by IBM were accessed by the unauthorized actor on or about May 28, 2023\" - Colorado Department of Health Care Policy & FinancingThe investigation revealed that the threat actors managed to access and likely exfiltrated files that contained certain Health First Colorado and CHP+ members' information, including:The above data can be utilized to launch effective phishing or social engineering attacks, and can help with identity or bank fraud activity.In total, data of 4,091,794 people has been exposed. For all individuals that received the data breach notification, HPCF provides two years of credit monitoring services via Experian to help counteract fraud attempts.This disclosure comes only a week after another large state organization in Colorado, the Department of Higher Education (CDHE), disclosed that a massive data breach caused by a ransomware attack had impacted a large number of students and teachers."
   },
   {
      "time": "2023-08-15",
      "title": "Over 100K hacking forums accounts exposed by info-stealing malware",
      "text": " Researchers discovered 120,000 infected systems that contained credentials for cybercrime forums. Many of the computers belong to hackers, the researchers say.Analyzing the data, threat researchers found that the passwords used for logging into hacking forums were generally stronger than those for government websites.Hudson Rock says that 100,000 of the compromised computers belonged to hackers and the number of credentials for cybercrime forums was in excess of 140,000.The researchers collected the information from publicly available leaks as well as info-stealer logs sourced directly from threat actors.Info-stealers are a type of malware that search specific locations on the computer for login information. A common target is web browsers, because of their autofill and password storage features. Alon Gal, chief technology officer at Hudson Rock, told BleepingComputer that “hackers around the world infect computers opportunistically by promoting results for fake software or through YouTube tutorials directing victims to download infected software.”Among those that fell for the lure were other hackers, likely less skilled ones, so they got infected just like any other gullible user trying to take a shortcut.Identifying the owners of those compromised computers as hackers, or at least hacker enthusiasts, was possible by looking at the data from the info-stealer logs, which also exposed the individual’s real identity:Looking at the collected data, Hudson Rock determined that more than 57,000 compromised users had accounts to the Nulled[.]to community of budding cybercriminals.However, hackers also used very weak passwords like a string of consecutive numbers. This could be explained by their lack of interest in getting involved in the community.They could be using the account just to keep up with the discussions, check what data was for sale, or just to have access to the forum whenever something more important occurred.The researchers also discovered that the credentials for cybercrime forums were generally stronger than the logins for government websites, although the difference is not large.According to Hudson Rock, most of the infections were from just three info-stealers, which also happen to be popular choices with many hackers: RedLine, Raccoon, and Azorult.At the moment, a large number of initial access compromises start with an info-stealer, which collects all the data a threat actor needs to impersonate a legitimate user, typically called a system fingerprint."
   },
   {
      "time": "2023-08-15",
      "title": "What's New in the NIST Cybersecurity Framework 2.0",
      "text": " First introduced nearly a decade ago as technical cybersecurity guidance for critical infrastructure interests like energy, banking, and hospitals, the National Institute for Standards and Technology (NIST)'s Cybersecurity Framework just got an update — and it's now aimed at organizations of all sizes.The new version 2.0 of the popular NIST Cybersecurity Framework has expanded beyond the original framework's five functions of an effective cybersecurity program — identify, protect, detect, respond, and recover — and added a sixth, govern.\"It emphasizes that cybersecurity is a major source of enterprise risk, ranking alongside legal, financial and other risks as considerations for senior leadership,\" NIST's new guidelines — still in the draft phase — said.The new framework is also intended to help support organizations of all sizes, the agency said.In a statement sent to Dark Reading, Bud Broomhead, CEO at Viakoo, explained that the new NIST update doesn't just help organizations with basic cybersecurity functions — it expands to other areas of the enterprise as well.The update is something that Joseph Carson, chief security scientist and advisory CISO with Delinea, praised as an \"excellent refresh.\"NIST is gathering comments on the draft CSF 2.0 until Nov. 4.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-08-15",
      "title": "Interpol Shuts Down Phishing Service '16shops'",
      "text": " Law enforcement from Indonesia, Japan, and the US, as well as the Cyber Defense Institute, Group-IB, Palo Alto Networks Unit 42, Trend Micro, and Cybertoolbelt, teamed up in the takedown operation.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-08-15",
      "title": "Phishing Operators Make Ready Use of Abandoned Websites for Bait",
      "text": " Attackers are increasingly targeting abandoned and barely maintained websites for hosting phishing pages, according to a new study from Kaspersky.In many cases, phishers' focus is on WordPress sites because of the sheer number of known vulnerabilities in the widely used content management system and its numerous plug-ins.Researchers at Kaspersky recently counted 22,400 unique WordPress websites that threat actors had compromised between mid-May and the end of July to host phishing pages. The number included websites that attackers were literally able to walk into because they provided open access to the control panel, as well as sites that attackers had to break into via vulnerability exploits, credential theft, and other means. Kaspersky detected 200,213 attempts by users to visit phishing pages that threat actors had hosted on these websites.Phishing continues to be one of the most popular initial access vectors for attackers because of just how successful they have been with it. Fundamental to that success is their ability to create convincing websites and pages that users are likely to trust enough to share their credentials and other sensitive information.Kaspersky researchers found that to improve the con, phishing operators sometimes leave a compromised website's main functionality untouched even as they publish phishing pages on the site. \"A visitor would never guess the site has been hacked: every section is where it is supposed to be, and only relevant information can be seen,\" Kaspersky said. Instead, the attackers hide their phishing pages inside new directories that are not accessible on the website's menu, the security vendor said.Kaspersky found that typically, when an attacker breaks into a WordPress site via a vulnerability, they upload a WSO Web shell, which is a malicious shell script that allows attackers complete remote control over the website. The attackers then use the Web shell to break into the compromised website's admin panel and start putting fake pages on it. They also use the control panel to store credentials, bank card data, and other sensitive information that a user might be tricked into entering on the website. When an attacker leaves access to the control panel open, anyone on the Internet can then get access to the data, Kaspersky said.\"Seasoned cybercriminals hack legitimate websites as a way of setting phishing traps,\" Kaspersky said. \"Both long-neglected and actively maintained websites may be targeted this way,\" especially when the websites are small, and the operators are ill-equipped to detect malicious activity.Kaspersky's blog offered tips on how WordPress website operators can detect if an attacker has hacked their website and is using it to host phishing pages.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-08-15",
      "title": "FBI warns of increasing cryptocurrency recovery scams",
      "text": " The FBI is warning of an increase in scammers pretending to be recovery companies that can help victims of cryptocurrency investment scams recover lost assets.The bulletin mentions that the money lost to cryptocurrency investment fraud surpassed $2.5 billion in 2022, and this only concerns cases reported to the authorities. Furthermore, many people lose cryptocurrency through information-stealing malware or phishing attacks that steal wallets, likely making this number far larger.This situation creates an opportunity for recovery scheme scammers who tap into this vast pool of victims, taking advantage of their desperation to recover their funds while only deceiving them a second time.\"Victims may also encounter advertisements for fraudulent cryptocurrency recovery services in the comment sections of online news articles and videos about cryptocurrency; among online search results for cryptocurrency; or on social media.\"BleepingComputer has seen these types of scams posted to our own news stories, in other sites' comment sections, and on Medium.While social media, especially Twitter, has been attempting to crack down on these scams, they are still plagued by cryptocurrency support and recovery scams. The FBI explains that recovery schemes aim to deceive individuals into bearing the expenses of the purported recovery, often asking for an advance fee or some form of deposit.Once the payment is made, the scammers either cut off communication with the victims or try to solicit additional funds by presenting an incomplete tracing report, suggesting they need more resources to finalize it.In many cases observed by the FBI, the scammers claim they're affiliated with law enforcement agencies or other legitimate organizations to instill a sense of trustworthiness in their targets.However, as the FBI highlights, no private sector entity can issue seizure orders to recover stolen digital assets, so all claims of that kind are false, and those making them should be treated as highly suspicious.To protect yourself against these fraudulent companies or individual scammers, do not trust cryptocurrency recovery services promoted via internet ads, comments, and social media. Furthermore, never share any personal or financial details with unknown individuals online.Victims of these scams can also pursue civil litigation to recover the lost assets, so keeping all records, transaction details, and interactions with suspicious individuals is essential.However, as many of these recovery companies are operating under fake names, it will likely not be possible to litigate this type of theft in court."
   },
   {
      "time": "2023-08-15",
      "title": "Ongoing Xurum attacks target Magento 2 e-stores",
      "text": " Akamai researchers warn of ongoing attacks, dubbed Xurum, targeting e-commerce websites running the Magento 2 CMS.The name Xurum comes from the domain name of the attacker’s command and control (C2) server. The campaign is active since at least January 2023, threat actors seem to be interested in payment stats from the orders in the victim’s Magento store placed in the past 10 days. In some cases, the attackers also deployed a software skimmer to capture credit card information and transmit it to a remote server.Evidence gathered by the researchers suggests the attacks were carried out by a Russian threat actor.The server xurum.com is physically located in the Netherlands and hosted by the Russian hosting company called VDSina.ru.The attackers were observed attempting to execute two distinct payloads from a total of four IP addresses associated with the infrastructure of Hetzner and Shock Hosting hosting providers.The first variant of the payload executes the “file_get_contents” PHP function to send a request to the C2 (xurum.com) to determine whether the server is vulnerable to CVE-2022-24086.The second variant is the second-stage PHP payload that is downloaded and executed by the attackers, it is hosted on the same xurum.com server. The researchers reported that the attackers register a new Magento component and mask it as “GoogleShoppingAds.” The threat actors were observed using an advanced web shell named “wso-ng” that is activated only when the attacker sends the cookie “magemojo000” to the backdoor “GoogleShoppingAds” component. According to the author, wso-ng is a new version of the WSO webshell.The web shell login page masquerades as an error page containing a hidden login form that attempts to siphon victim credentials.The attackers were observed creating a backdoor admin user in Magento, named “mageplaza” or “mageworx.” These attackers used these two names because they are also the names of the popular Magento extensions stores.“The attackers have shown a meticulous approach, targeting specific Magento 2 instances rather than indiscriminately spraying their exploits across the internet. They demonstrate a high level of expertise in Magento and invest considerable time in understanding its internals, setting up attack infrastructure, and testing their exploits on real targets.” concludes the report. “This campaign serves as a practical example of how older vulnerabilities continue to be exploited years after disclosure, as businesses struggle to keep up with patches and security measures.”The report also includes indicators of compromise (IOCs).\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-08-15",
      "title": "Discord.io confirms breach after hacker steals data of 760K users",
      "text": " Updated: Added further information from Akihirah about the sale of the database.The Discord.io custom invite service has temporarily shut down after suffering a data breach exposing the information of 760,000 members.Discord.io is not an official Discord site but a third-party service allowing server owners to create custom invites to their channels. Most of the community was built around the service's Discord server, with over 14,000 members.Yesterday, a person known as 'Akhirah' began offering the Discord.io database for sale on the new Breached hacking forums. As proof of the theft, the threat actor shared four user records from the database.For those unfamiliar with the new Breached, it is the rebirth of a popular cybercrime forum known for the sale and leaking of data stolen in data breaches.According to the threat actor, the database contains the information for 760,000 Discord.io users and includes the following types of information:The most sensitive information in the breach is a member's username, email address, billing address (small number of people), salted and hashed password (small number of people), and Discord ID.\"This information is not private and can be obtained by anyone sharing a server with you. Its inclusion in the breach does, however, mean that other people might be able to link your Discord account to a given email address,\" Discord.io explained about the leaking of Discord IDs.\"Discord.io has suffered a data breach. We are stopping all operations for the foreseeable future,\" reads a message on the service's Discord server.\"For more information, please refer to our #breah-notification channel. We'll be updating our website soon with a copy of this message.\"The website for Discord.io contains a timeline explaining that they first learned of the data breach after seeing the post on the hacking forum.Soon after, they confirmed the authenticity of the leaked data and began shutting down its services and canceling all paid memberships.Discord.io says they have not been contacted by the individual behind the breach and have not shared any information on how they were breached.BleepingComputer spoke to the seller of the Discord.io database, Akhirah, who confirmed that they had not spoken to the Discord.io operators.The Discord.io site acts as a directory where visitors can search for Discord servers matching specific content and obtain an invite to access it. In some cases, it is required to purchase and spend the site's virtual currency, Discord.io Coins, to gain access to an invite.From the limited archived pages of the site, BleepingComputer has seen Discord servers in the directory for a wide variety of interests, including anime, gaming, adult content, and more.However, when BleepingComputer asked Akhirah about the sale of the database, they said it was not only about making money but about how Discord.io allegedly links to illegal and harmful content.\"It's not just about money, some of the servers they overlook I talking about pedophilia and similar things, they should blacklist them and not allow them,\" Akhirah told BleepingComputer.The hacker told BleepingComputer that there has been a lot of interest in the database but mostly from people who want to use it for \"doxing other people they have problems with.\"Instead, Akhirah says they would prefer to wait for the Discord.io operators to contact them about removing allegedly offensive material from the site in exchange for not selling or leaking the stolen database.While the hacker says they have not sold the database, all members should treat the situation as if their data will be abused.The passwords in this breach are hashed using bcrypt, making them hardware-intensive and slow to crack.However, email addresses can be valuable to other threat actors as they could be used for targeted phishing attacks to steal more sensitive information.Therefore, if you are a member of Discord.io, you should be on the lookout for unusual emails with links to pages asking you to enter your password or other information.Update 8/14/23: Added information from Akhirah."
   },
   {
      "time": "2023-08-15",
      "title": "Threat actors use beta apps to bypass mobile app store security",
      "text": " The FBI is warning of a new tactic used by cybercriminals where they promote malicious \"beta\" versions of cryptocurrency investment apps on popular mobile app stores that are then used to steal crypto.The threat actors submit the malicious apps to the mobile app stores as \"betas,\" meaning that they are in an early development phase and are meant to be used by tech enthusiasts or fans to test and submit feedback to developers before the software is officially released.The benefit of this approach is that beta apps do not go through a standard, rigorous code review process but are instead superficially scrutinized for their safety.\"The apps may appear legitimate by using names, images, or descriptions similar to popular apps.\"Usually, the apps mimic cryptocurrency investment and digital asset management tools, asking the user to enter their legitimate account details, deposit money for investments, etc.Victims are directed to these apps via social engineering using phishing or romance scams, and they look legitimate as they are hosted on reputable app stores.The threat actors initially upload what appears to be a legitimate app to the iOS app store for use on Test Flight. However, after the app is approved, the threat actors change the URL used by the app to point to a malicious server, introducing the malicious behavior into the app. Google's Play store also supports the submission of beta testing apps. However, Google told BleepingComputer that the apps in open beta testing and publicly available on Google Play go through the same review process as apps that are in production, so there's no difference there.FBI advised that you always confirm whether an app's publisher is reputable by reading user reviews on the app store and avoiding software with very few downloads or high download counts combined with very few or no user reviews.Users should also be cautious during the installation phase of a new app and examine the requested permissions for anything that appears to be unrelated to that software's core functionality.Some common signs of malware on your device include unusually high battery drain rate, elevated internet data consumption, sudden appearance of pop-up ads, performance degradation, and overheating.Update 8/15 - Updated story to include statement from Google about their beta app review process."
   },
   {
      "time": "2023-08-14",
      "title": "Gafgyt botnet is targeting EoL Zyxel routers",
      "text": " The flaw is a command injection vulnerability that resides in the Remote System Log forwarding function, which is accessible by an unauthenticated user. The vulnerability is in the ViewLog.asp page and can be exploited through the remote_host parameter.The vulnerability impacts devices running firmware versions 7.3.15.0 v001/3.40(ULM.0)b31 or older.Now Fortinet published an outbreak alert to warn of a surge in attacks targeting the end-of-life routers in the wild.According the following chart, Fortinet is observing an average of 7,300 attacks per day attempting to exploit the flaw since July 2023.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-08-14",
      "title": "Power Generator in South Africa hit with DroxiDat and Cobalt Strike",
      "text": " In the attack discovered by Kaspersky, the proxy backdoor was deployed alongside Cobalt Strike beacons, the researchers believe that this incident was in the initial stages of a ransomware attack.The attack occurred in mid-March 2023, the researchers observed a small wave of attacks involving the DroxiDat. The malware is 8kb in size and was used as a system profiler and a simple SOCKS5-capable bot.Unlike previous variants, this Windows variant missed the following capabilities:The researchers noticed that C2 infrastructure used in this attack involved an energy-related domain “powersupportplan[.]com.” The domain resolved to an already suspicious IP host that was previously used several years prior as a part of an APT activity, a circumstance that suggests that the incident was the result of an attack from a nation-state actor.Kaspersky published Indicators of Compromise (IoCs) for this threat.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-08-14",
      "title": "UK govt contractor MPD FM leaks employee passport data",
      "text": " MPD FM, a facility management and security company providing services to various UK government departments, left an open instance that exposed employee passports, visas, and other sensitive data.MPD FM boasts of being the UK’s leading “facility management company.” Established in 2003, the company has expanded to house 500 staff. The company provides various guardian and facility management services throughout the United Kingdom.Sometimes, those who are meant to protect are left vulnerable themselves, as the latest findings from the Cybernews research team show. The now-closed Amazon Simple Storage Service (S3), a file vault for digital data, left over 16,000 sensitive documents open to anyone with the means to scan the open web.We have contacted MPD FM for comment but did not receive a reply before publishing this article.The exposed files included a trove of severely sensitive information, exposing MDP FM’s employees. The leaked information includes:“Threat actors could use employee data to devise targeted emails or launch social engineering attacks,” researchers said. “Information about people’s private and professional lives allows scammers to coax victims into disclosing additional sensitive information or performing actions that compromise the organization’s security.”The team advised MPD FM, or anyone else dealing with a similar issue, to immediately restrict public access to the exposed instance and to retrospectively check access logs for any unauthorized connections. Whoever’s in control of the Amazon S3 bucket ought to secure sensitive files using server-side encryption.If you want, you read recommendations for administrators give a look at the original post at\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-08-14",
      "title": "Python URL parsing function flaw can enable command execution",
      "text": " Successful exploitation of the vulnerability can lead to arbitrary file reads and command execution.The issue can be exploited by providing an URL that starts with blank characters.The vulnerability was discovered by researcher Yebo Cao in July 2022. The issue impacts all python versions before 3.11.The vulnerability has been fixed with the release of the following versions:The flaw should also be mitigated by adding strip() function before processing the URL.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-08-14",
      "title": "Police dismantled bulletproof hosting service provider Lolek Hosted",
      "text": " A joint operation conducted by European and U.S. law enforcement agencies dismantled Lolek Hosted and lead to the arrest of five administrators by Polish authorities.The suspects advertised the service using slogans such as “You can host anything here!” and “no-log policy,” they were accepting payments in cryptocurrencies.The Lolek Hosted service was used to target hundreds of thousands of private entities and public institutions, according to the Polish police the losses they incurred amount to millions of dollars.According to the press release published by DoJ, the founder of the service, Artur Karol Grabowski (36) provided “bulletproof” webhosting allegedly facilitating the criminal activities of LolekHosted clients by allowing clients to register accounts using false information, not maintaining Internet Protocol (IP) address logs of client servers, frequently changing the IP addresses of client servers, ignoring abuse complaints made by third parties against clients, and notifying clients of legal inquiries received from law enforcement. The domain “LolekHosted.net” was registered in 2014, he allowed clients to host “everything except child porn.”It has been estimated that LolekHosted clients used the services to execute approximately 50 NetWalker ransomware attacks.\nCopyright@securityaffairs 2023 "
   },
   {
      "time": "2023-08-14",
      "title": "Lapsus$ hackers took SIM-swapping attacks to the next level",
      "text": " The U.S. government released a report after analyzing simple techniques, e.g. SIM swapping, used by the Lapsus$ extortion group to breach dozens of organizations with a strong security posture.Lapsus$ is described as a loosely-organized group formed mainly of teenagers, with members in the U.K. and Brazil that acted between 2021 and 2022 for notoriety, financial gain, or for fun. However, they also combined techniques of various complexity with “flashes of creativity.”The Department of Homeland Security (DHS) Cyber Safety Review Board (CSRB) finalized its analysis and describes the group’s tactics and techniques in a report that also includes recommendations for the industry.“Lapsus$ employed low-cost techniques, well-known and available to other threat actors, revealing weak points in our cyber infrastructure that could be vulnerable to future attacks” - Department of Homeland Security Cyber Safety Review Board.The group used SIM swapping to gain access to a target company’s internal network and steal confidential information like source code, details about proprietary technology, or business and customer-related documents.In a SIM-swapping attack, the threat actor steals the victim’s phone number by porting it to a SIM card owned by the attacker. The trick relies on social engineering or an insider at the victim’s mobile carrier.With control over the victim’s phone number, the attacker can receive SMS-based ephemeral codes for two-factor authentication (2FA) required to log into various enterprise services or breach corporate networks.In the case of Lapsus$, some of the fraudulent SIM swaps were performed straight from the telecommunications provider’s customer management tools after hijacking accounts belonging to employees and contractors.An attacker can create a fake EDR by impersonating a legitimate requestor, such as a law enforcement agent, or by applying official logos to the request.Lapsus$ also relied on insiders at targeted companies, employees, or contractors, to obtain credentials, approve multi-factor authentication (MFA) requests, or use internal access to help the threat actor.“After executing the fraudulent SIM swaps, Lapsus$ took over online accounts via sign-in and account recovery workflows that sent one-time links or MFA passcodes via SMS or voice calls” - Department of Homeland Security Cyber Safety Review Board.In one case, Lapsus$ used their unauthorized access to a telco provider to try to compromise mobile phone accounts connected to FBI and Department of Defense personnel.The attempt was unsuccessful due to extra security implemented for those accounts.During the research, CSRB’s findings, the group paid as much as $20,000 per week to access a telecommunications provider’s platform and perform SIM swaps.Although the FBI was not aware of Lapsus$ selling the data they stole or found evidence of victims paying ransoms to the group, CSRB says that some security experts “observed Lapsus$ extorting organizations with some paying ransoms.”According to CSRB’s findings the group also exploited unpatched vulnerabilities in Microsoft Active Directory to increase their privileges on the victim network.It is estimated that Lapsus$ leveraged Active Directory security issues in up to 60% of their attacks, showing that members of the group had the technical skills to move inside a network.While Lapsus$ was characterized by effectiveness, speed, creativity, and boldness, the group was not always successful in its attacks. It failed in environments that implemented application or token-based multi-factor authentication (MFA).Despite security researchers and experts decrying for years the use of SMS-based authentication as insecure, DHS’ Cyber Safety Review Board highlights that “most organizations were not prepared to prevent” the attacks from Lapsus$ or other groups employing similar tactics.The Board’s recommendations to prevent other actors from gaining unauthorized access to an internal network include:Lapsus$ fell silent since September 2022, likely due to law enforcement investigations that led to the arrests of several members of the group."
   },
   {
      "time": "2023-08-14",
      "title": "LOLEKHosted admin arrested for aiding Netwalker ransomware gang",
      "text": " Update 8/11/23: Updated with information from DOJ about alleged Netwalker Ransomware involvement.Police have taken down the Lolek bulletproof hosting provider, arresting five individuals and seizing servers for allegedly facilitating Netwalker ransomware attacks and other malicious activities.A bulletproof hosting provider is a hosting company that turns a blind eye to reports of criminal activity or the hosting of copyrighted material on their servers.Cybercriminals prefer these types of hosting providers over traditional companies, as they can launch cybercrime campaigns without fear that they will be shut down after malicious activity is reported.On Tuesday, BleepingComputer learned that the platform's site at lolekhosted[.]net had been seized, now displaying a message stating that an international law enforcement operation between Poland and the US seized the site.\"This domain has been seized by the Federal Bureau of Investigation and Internal Revenue Service - Criminal Investigation as part of a coordinated law enforcement action taken against LOLEK HOSTED,\" reads the Lolek seizure message.Lolek promoted itself as a \"100% privacy hosting\" service with a no-log policy, meaning they do not log any activity on its servers or routers that could be used to incriminate customers.Customer reviews of the service seen by BleepingComputer said that almost any activity was allowed at the hosting provider, and the platform accepted PayPal and cryptocurrency for payments.While the FBI and IRS declined to comment earlier this week on the investigation, Europol and the DOJ announced today the seizure of Lolek and the arrest of five administrators in Poland.\"Five of its administrators were arrested, and all of its servers seized, rendering LolekHosted.net no longer available.\"Europol says that Lolek was seized as cybercriminals used its servers to launch DDoS attacks, distribute information-stealing malware, host command and control servers, host fake online shops, and conduct spam campaigns.However, an announcement by the US Department of Justice sheds more light on the police operation, stating that a Polish national named Artur Karol Grabowski was charged yesterday for the operation of LolekHosted.While it is unclear if Grabowski was one of the administrators arrested in Poland, the DOJ says he facilitated cybercrime by allowing customers to register under fake names, frequently changing IP address of servers, and notifying customers of legal inquiries.\"Specifically, clients used the servers of LolekHosted as intermediaries when gaining unauthorized access to victim networks, and to store hacking tools and data stolen from victims.\" Law enforcement seized the bulletproof hosting provider's servers on August 8th in an operation led by the FBI and IRS, with Europol providing support linking available data to various criminal cases within and outside the EU, as well as tracing cryptocurrency transactions.Grabowski now faces charges of computer fraud conspiracy, wire fraud conspiracy, and international money laundering, and if convicted of all, could receive 45 years of jail time.As bulletproof hosting providers have become a significant component in malware distribution and cybercrime, law enforcement has been actively targeting these platforms."
   },
   {
      "time": "2023-08-14",
      "title": "Ford says cars with WiFi vulnerability still safe to drive",
      "text": " Ford is warning of a buffer overflow vulnerability in its SYNC3 infotainment system used in many Ford and Lincoln vehicles, which could allow remote code execution, but says that vehicle driving safety isn't impacted.SYNC3 is a modern infotainment system that supports in-vehicle WiFi hotspots, phone connectivity, voice commands, third-party applications, and more.The particular system is used in the following car models:The vulnerability is tracked as CVE-2023-29468 and is in the WL18xx MCP driver for the WiFi subsystem incorporated in the car's infotainment system, which allows an attacker in WiFi range to trigger buffer overflow using a specially crafted frame.Ford was informed by the supplier about the discovery of the WiFi flaw and took immediate action to validate it, estimate the impact, and develop mitigation measures.In a statement released on Ford's media portal, the carmaker promises to make a software patch available soon, which customers will be able to load on a USB stick and install on their vehicles.\"In the interim, customers who are concerned about the vulnerability can simply turn off the WiFi functionality through the SYNC 3 infotainment system's Settings menu.\"To further appease any concerns, the American carmaker has also stated that the flaw isn't easy to exploit, and even in that unlikely scenario, it wouldn't put the safety of targeted vehicles at risk.\"To date, we've seen no evidence that this vulnerability has been exploited, which would likely require significant expertise and would also include being physically near an individual vehicle that has its ignition and WiFi setting on,\" explains Ford.\"Our investigation also found that if this vulnerability was exploited, however unlikely, it would not affect the safety of vehicle occupants, since the infotainment system is firewalled from controls like steering, throttling and braking.\""
   },
   {
      "time": "2023-08-14",
      "title": "Knight ransomware distributed in fake Tripadvisor complaint emails",
      "text": " The Knight ransomware is being distributed in an ongoing spam campaign that pretends to be TripAdvisor complaints.Knight ransomware is a recent rebrand of the Cyclop Ransomware-as-a-Service, which switched its name at the end of July 2023.The Cyclops ransomware operation launched in May 2023 when the operators began recruiting affiliates for the new ransomware-as-a-service (RaaS) on the RAMP hacking forum.In addition to their normal encryptors, the operation offers a 'lite' version for use in spam and pray-and-spray mass distribution campaigns targeting large numbers of targeted users. This version appears to utilize a fixed ransom amount rather than negotiating with victims.At the end of July, Cyclops rebranded as Knight, also stating they updated the lite encryptor to support 'batch distribution' and launched a new data leak site.\"We've updated our new panel and officially changed our name to Knight.We are looking for partners (of any kind) that!!!,\" reads an announcement on the old Cyclops and new Knight data leak sites.\"We have also updated the lite version to support batch distribution.\"There are currently no victims or stolen files leaked on the Knight data leak site.This week, Sophos researcher Felix spotted a new spam campaign pretending to be TripAdvisor complaints but distribute the Knight ransomware instead.When you open the XLL, Microsoft Excel will detect the Mark of the Web (MoTW), added to files downloaded from the Internet, including email. If it detects the MoTW, it will not enable the .NET add-in built into the Excel document, nullifying the attack unless a user unblocks the file.However, if there is no MoTW flag on the file, Excel will prompt the user as to whether they want to enable the add-in, as shown below.Enabling the add-in will cause the Knight Lite ransomware encryptor to be injected into a new explorer.exe process and begin to encrypt the files on your computer.When encrypting files, it will append the .knight_l extension to encrypted files' names, where the 'l' portion likely stands for 'lite.'The ransomware will also create a ransom note named How To Restore Your Files.txt in each folder on the computer. The ransom note in this campaign demands $5,000 be sent to a listed Bitcoin address and also contains a link to the Knight Tor site.However, every ransom note in this campaign seen by BleepingComputer utilizes the same Bitcoin address of '14JJfrWQbud8c8KECHyc9jM6dammyjUb3Z,' which would make it impossible for the threat actor to determine which victim paid a ransom.As this is a Knight Lite campaign, visiting the site does not display a negotiation panel. Instead, it shows a message stating that victims should have paid the ransom demand already and to contact the affiliate at brahma2023@onionmail.org then.At this time, it is not known if paying a ransom will result in receiving a decryptor from the Knight affiliate.Furthermore, all the ransom notes seen by BleepingComputer utilize the same Bitcoin address, making it possible for someone else to claim a payment as theirs, essentially stealing your payment.Therefore, it is strongly advised to refrain from paying a ransom in this campaign, as there is a good chance you will not receive a decryptor."
   },
   {
      "time": "2023-08-14",
      "title": "MaginotDNS attacks exploit weak checks for DNS cache poisoning",
      "text": " A team of researchers from UC Irvine and Tsinghua University has developed a new powerful cache poisoning attack named 'MaginotDNS,' that targets Conditional DNS (CDNS) resolvers and can compromise entire TLDs top-level domains.The attack is made possible thanks to inconsistencies in implementing security checks in different DNS software and server modes (recursive resolvers and forwarders), leaving roughly one-third of all CDNS servers vulnerable.DNS (Domain Name System) is a hierarchical and distributed naming system for internet resources and networks, helping resolve human-readable domain names to numerical IP addresses so that a network connection can be made.The DNS resolution process uses UDP, TCP, and DNSSEC to perform queries and receive responses. It can be iterative and recursive, involving multiple steps and exchanges with root servers, TLD servers, authoritative servers, caching records along the way, etc.The concept of DNS cache poisoning is injecting forged answers into the DNS resolver cache, causing the server to direct users who enter a domain to incorrect IP addresses, potentially leading them to malicious websites without their knowledge.Many attacks of this type have been demonstrated in the past, like, for example, the Kashpureff Attack in 1997, which exploited a lack of data verification (bailiwick rules), and the Kaminsky Attack in 2008 that took advantage of the absence of a source port randomization system.These attacks have been mitigated by adding defenses into the resolvers' implementation, rendering off-path attacks challenging.However, the 'MaginotDNS' attack can overcome these defenses by attacking the forwarding mode of CDNS from either on-path or off-path.CDNS resolvers support both recursive and forwarding query modes, used by ISPs and the enterprise to reduce costs and better access control.The researchers found that bailiwick checks are adequately enforced in the recursive mode; however, the forwarder is vulnerable.Because the two share the same global DNS cache, an attack on the forwarder mode can open the path to breaching the recursive mode, essentially breaking the DNS cache protection boundary.In certain cases, they noted configurations that treated all records as if they were under the root domain, a highly vulnerable setup.The examples showcased by the researchers during their BlackHat presentation include both on-path and off-path attacks, with the latter being the more complicated but also far more valuable for threat actors.For these attacks, the threat actor needs to predict the source port and the transaction ID used by the target's recursive DNS servers when generating a request and then use a malicious DNS server to send forged responses with the correct parameters.Inferring the source port and guessing the transaction IDs can be done by brute forcing or using SADDNS (side-channel attacked DNS).For BIND9, both parameters can be successfully retrieved after 3,600 query rounds, while for Microsoft DNS, this drops to 720 rounds.To increase the chances of success, the attacker must control the reply time of the malicious DNS responses to ensure their forged response reaches the victim's server before the legitimate one.The researchers shared the following video demonstrating the MaginotDNS attack on Microsoft DNS.The researchers scanned the internet and found 1,200,000 DNS resolvers, of which 154,955 are CDNS servers.Next, using software fingerprints to identify vulnerable versions, they found 54,949 vulnerable CDNS servers, all of which are susceptible to on-path attacks, and 88.3% are impacted by off-path attacks.All the affected software vendors mentioned above have confirmed and fixed the flaws, and Microsoft has awarded a bounty to the researchers for their report.However, for the issues to be fully mitigated, CDNS administrators must apply the patches and follow the correct configuration guidelines provided by the vendors."
   },
   {
      "time": "2023-08-14",
      "title": "Bundesamt für Verfassungsschutz  -  Publikationen - BfV Cyber-Brief Nr. 01/2023",
      "text": " \nSpringe direkt zu:\n\nDatum\nAugust 2023\nDer BfV Cyber-Brief Nr. 01/2023 beschäftigt sich mit dem Thema „Warnhinweis zu Cyberspionage gegen Kritiker des iranischen Regimes in Deutschland“.Aus dem Inhalt:Indicators of Compromise (IOCs)\nSie sind Teil einer extremistischen Szene und möchten aussteigen? Hinweistelefon gegen Extremismus und Terrorismus.\n© 2023 Bundesamt für Verfassungsschutz\n"
   },
   {
      "time": "2023-08-14",
      "title": "German Embassy Lure: Likely Part of Campaign Against NATO Aligned Ministries of Foreign Affairs",
      "text": " Get the most out of your EclecticIQ cybersecurity solutions.Master the art of cyber threat intelligence and intelligence-led cyberdefense.Explore our world-class partners – or learn about our partner program.Power your CTI practice with analyst-centric threat intelligence solutions.Go beyond the IOC to augment your SOC in defense of your organization.Learn how EclecticIQ can help you address your specific challenges – by team and by need – and improve your overall security posture.Provide your CTI team with the automation, performance, flexibility, and integrations needed to supercharge their CTI operations with our range of analyst-centric products and services.Enable your SOC team to better operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.Improve your situational awareness and mitigate risk with our collection of analyst-centric threat intelligence products and services.Operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.An ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with collaborative partner programs delivering world-class joint solutions. Partner with EclecticIQ to bring valuable and innovative security solutions and services to end users. Open to all partner types, including technology developers, service providers, resellers, and community.We partner with the world's premier technology and solution providers to support all phases of your cybersecurity needs. Explore all our partners' solutions and offerings to build and extend your cyber defense ecosystem.We are committed to increasing the knowledge and capabilities of the cybersecurity community through our research & analysis efforts and open source projects.Learn more about our technology, solutions and services, and stay updated on the cyber threat landscape with our research reports, webinars and other information.We are proud to be an active member in the open source community and to help develop and advance progress of security technology. Learn more about contributions or go directly to our GitHub page.Get the most out of your EclecticIQ cybersecurity solutions.Master the art of cyber threat intelligence and intelligence-led cyberdefense.Explore our world-class partners – or learn about our partner program.Power your CTI practice with analyst-centric threat intelligence solutions.Go beyond the IOC to augment your SOC in defense of your organization.Learn how EclecticIQ can help you address your specific challenges – by team and by need – and improve your overall security posture.Provide your CTI team with the automation, performance, flexibility, and integrations needed to supercharge their CTI operations with our range of analyst-centric products and services.Enable your SOC team to better operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.Improve your situational awareness and mitigate risk with our collection of analyst-centric threat intelligence products and services.Operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.An ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with collaborative partner programs delivering world-class joint solutions. Partner with EclecticIQ to bring valuable and innovative security solutions and services to end users. Open to all partner types, including technology developers, service providers, resellers, and community.We partner with the world's premier technology and solution providers to support all phases of your cybersecurity needs. Explore all our partners' solutions and offerings to build and extend your cyber defense ecosystem.We are committed to increasing the knowledge and capabilities of the cybersecurity community through our research & analysis efforts and open source projects.Learn more about our technology, solutions and services, and stay updated on the cyber threat landscape with our research reports, webinars and other information.We are proud to be an active member in the open source community and to help develop and advance progress of security technology. Learn more about contributions or go directly to our GitHub page.Get the most out of your EclecticIQ cybersecurity solutions.Master the art of cyber threat intelligence and intelligence-led cyberdefense.Explore our world-class partners – or learn about our partner program.Power your CTI practice with analyst-centric threat intelligence solutions.Go beyond the IOC to augment your SOC in defense of your organization.Learn how EclecticIQ can help you address your specific challenges – by team and by need – and improve your overall security posture.Provide your CTI team with the automation, performance, flexibility, and integrations needed to supercharge their CTI operations with our range of analyst-centric products and services.Enable your SOC team to better operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.Improve your situational awareness and mitigate risk with our collection of analyst-centric threat intelligence products and services.Operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.An ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with collaborative partner programs delivering world-class joint solutions. Partner with EclecticIQ to bring valuable and innovative security solutions and services to end users. Open to all partner types, including technology developers, service providers, resellers, and community.We partner with the world's premier technology and solution providers to support all phases of your cybersecurity needs. Explore all our partners' solutions and offerings to build and extend your cyber defense ecosystem.We are committed to increasing the knowledge and capabilities of the cybersecurity community through our research & analysis efforts and open source projects.Learn more about our technology, solutions and services, and stay updated on the cyber threat landscape with our research reports, webinars and other information.We are proud to be an active member in the open source community and to help develop and advance progress of security technology. Learn more about contributions or go directly to our GitHub page.Get the most out of your EclecticIQ cybersecurity solutions.Master the art of cyber threat intelligence and intelligence-led cyberdefense.Explore our world-class partners – or learn about our partner program.Power your CTI practice with analyst-centric threat intelligence solutions.Go beyond the IOC to augment your SOC in defense of your organization.Learn how EclecticIQ can help you address your specific challenges – by team and by need – and improve your overall security posture.Provide your CTI team with the automation, performance, flexibility, and integrations needed to supercharge their CTI operations with our range of analyst-centric products and services.Enable your SOC team to better operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.Improve your situational awareness and mitigate risk with our collection of analyst-centric threat intelligence products and services.Operationalize threat intelligence for more effective and efficient incident response with our range of analyst-centric management products and services.An ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with collaborative partner programs delivering world-class joint solutions. Partner with EclecticIQ to bring valuable and innovative security solutions and services to end users. Open to all partner types, including technology developers, service providers, resellers, and community.We partner with the world's premier technology and solution providers to support all phases of your cybersecurity needs. Explore all our partners' solutions and offerings to build and extend your cyber defense ecosystem.We are committed to increasing the knowledge and capabilities of the cybersecurity community through our research & analysis efforts and open source projects.Learn more about our technology, solutions and services, and stay updated on the cyber threat landscape with our research reports, webinars and other information.We are proud to be an active member in the open source community and to help develop and advance progress of security technology. Learn more about contributions or go directly to our GitHub page.EclecticIQ analysts assess with high confidence that two observed PDF documents are part of an ongoing campaign targeting Ministries of Foreign Affairs of NATO aligned countries. The PDF files masquerade as coming from the German embassy and contained two diplomatic invitation lures.EclecticIQ analysts assess with high confidence that two observed PDF documents are part of an ongoing campaign targeting Ministries of Foreign Affairs of NATO aligned countries. The PDF files masquerade as coming from the German embassy and contained two diplomatic invitation lures. One of the PDFs delivered a variant of Duke - a malware that has been linked to Russian state-sponsored cyber espionage activities of APT29. The other file was very likely used for testing or reconnaissance, as it did not contain a payload, but notified the actor if a victim opened the email attachment.  Victimology, lure documents, malware delivery and the malware itself resemble with reports that have linked the campaign to APT29, an advanced persistent threat actor attributed to Russia's Foreign Intelligence Service (SVR).The threat actor used Zulip - an open-source chat application - for command-and-control, to evade and hide its activities behind legitimate web traffic. [1] EclecticIQ analysts identified two malicious PDF documents that masquerade as coming from the German embassy, and that targeted diplomatic entities with invitation lures. The documents used the following themes: “Farewell to Ambassador of Germany” and “Day of German Unity”. The first PDF contained embedded JavaScript code to deliver multi-staged payloads in HTML file format. PDF readers like Adobe Acrobat have a default setting that warns before execution of code inside a PDF document. Upon user execution the PDF document displays an “Open File” alert box (Figure 1). If a victim opens it, the code will launch the malicious HTML file called Invitation_Farewell_DE_EMB. Figure 1 - Open File alert box (click on image to open in separate tab).Analysts assess with high confidence that the PDF files impersonating the German embassy, were very likely created by the same threat actor, due to overlaps in the victimology, and phishing themes used.Figure 2 - German embassy invitation lure.Figure 3 shows the embedded JavaScript code inside the German embassy invitation lure PDF, which was generated by PyPDF2. [3]Invitation_Farewell_DE_EMB is an HTML file. Through HTML smuggling, the threat actor delivered a ZIP file that contained a malicious HTML Application (HTA). An HTA file is a widely used Living Off The Land Binary (LOLBIN) containing both HTML and scripting code to create a standalone malicious application that is executed by the Windows HTA engine mshta.exe [4]. The zipped HTA file eventually delivers a Duke malware variant (Figure 4).Figure 4 - Delivery stages of Duke malware variant.Figure 5 shows the JavaScript code inside the Invitation_Farewell_DE_EMB.html. The URL sgrhf[.]org[.]pk/wp-content/idx[.]php?n=ks&q='+btoa(p) was controlled by the threat actor to receive the execution file path by using window.location.pathname, which provides the username of the victim device and notifies the threat actor of possible successful attack.After execution, the HTA file will drop the three executables into the C:\\Windows\\Tasks directory for DLL Sideloading:•    AppVIsvSubsystems64.dll - A library loaded into msoev.exe to perform the execution without any failure.•    Mso.dll - Duke malware variant loaded into msoev.exe via DLL Sideloading.•    Msoev.exe - A legitimate signed Windows binary, automatically loading Mso.dll and AppVIsvSubsystems64.dll upon execution.EclecticIQ analysts examined the dropped Duke malware variant (mso.dll). Analysis showed that the malware used Windows API hashing to hide the names of the Windows API function calls. The actor used this technique to perform evasion against static malware scanners.Figure 7 shows the decoded Windows libraries from ROR13 hashing algorithm: •    Kernel32.dll: 6A4ABC5B•    Ntdll.dll: 3CFA685D•    User32.dll: 63C84283Figure 7 - ROR13 hashing algorithm inside disassembled Duke malware variant. Analysts observed that all string values are encrypted by generic XOR encryption routines that are decrypted at execution. Figure 8 shows an example of a decrypted function inside the mso.dll, which is used to open the lure Invitation.pdf. The malware uses ShellExecuteA Windows API to open the PDF lure document. String data such as Invitation.pdf is stored statically inside the malware as XOR encrypted stack string. Figure 9 - XOR decryption routine inside disassembled Duke malware variant. Figure 10 shows the manual decryption of XOR encrypted stack string with hex value key “F”:  Figure 10 – Manually decrypted stack string.Figure 11 - C2 communications from toyy[.]zulipchat[.]com. All of the API request headers such as URL, authorization token, and the request itself are stored encrypted inside the Duke malware variant. The decrypted contents can be seen in Appendix A below.Pivoting on parameters in the previously identified URL - sgrhf[.]org[.]pk/wp-content/idx[.]php?n=ks&q='+btoa(p)- analysts identified a second PDF file. The PDF (figure 12) used a “Day of German Unity” lure. Analysts assess with moderate confidence that the PDF document was very likely used by the threat actor for reconnaissance or for testing purposes. It did not contain a payload, but notified the actor if a victim opened the email attachment by receiving a notification through a compromised domain edenparkweddings[.]com.Figure 13 – Diamond Model of this campaign.APT29 also known as CozyBear, The Dukes, Cloaked Ursa, Nobelium, UNC2452 is an advanced persistent threat actor (APT) active since 2008. The US and UK governments attribute APT29 to Russia's Foreign Intelligence Service (SVR), which is responsible for the collection of political and economic intelligence from foreign countries. PDF Lure:Fc53c75289309ffb7f65a3513e7519eb50f57a4a4bf2c4b504954a36d48c99e7C2 Servers:toyy[.]zulipchat[.]comsgrhf[.]org[.]pkedenparkweddings[.]comDuke Malware Variant:0be11b4f34ede748892ea49e473d82db5e1389b494edc86e17ff1783ed6b9d37d817f36361f7ac80aba95f98fe5d337dSpearphishing Attachment - T1566.001DLL Side-Loading - T1574.002HTML Smuggling - T1027.006Embedded Payloads - T1027.009Dynamic API Resolution - T1027.007System Binary Proxy Execution: Mshta - T1218.005Application Layer Protocol: Web Protocols - T1071.001User Execution: Malicious File - T1204.002Compromise Infrastructure: Web Services - T1584.006List of decrypted strings.Ct`dtbeP'Ct`dtbePresultsuccesssubscriptions=[{name:%d}]&principals=[%d]POSTapi/v1/users/me/subscriptionsincipals=[%d]type=stream&to=%d&topic=stream events&content=hello?POSTapi/v1/messagestopic=stream events&content=hello?stream_idLdrLoadDllcurl/7.68.0api/v1/messages?anchor=newest&num_before=1&num_after=0&narrow=[{operator:has,operand:attachment},{operator:stream,operand:%d}]InternetOpenAContent-Type: application/x-www-form-urlencodedAuthorization: Basic Z2Ficy1ib3RAdG95eS56dWxpcGNoYXQuY29tOnhKWmY4amFxd1g1NEhXYWxpWGZtNHUyYk1XQ3pOb0x6Invitation.pdfapi/v1/messagesInternetReadFileHttpSendRequestAHttpOpenRequestAInternetConnectAtoyy.zulipchat.comapi/v1/messages/%dInternetCloseHandleapi/v1/users/me/subscriptionsapi/v1/get_stream_id?stream=%dsubscriptions=[{name:%d}]&principals=[%d]type=stream&to=%d&topic=stream events&content=%stype=stream&to=%d&topic=stream events&content=hello?POSTopenresultDELETEcontentsuccess APT29_Duke_Malware_Jul17 YARA rule. APT29_Embassy_Invitation_Lure YARA rule.  "
   },
   {
      "time": "2023-08-14",
      "title": "MoustachedBouncer: Espionage against foreign diplomats in Belarus",
      "text": " \n      Award-winning news, views, and insight from the ESET security community\n    \n        Award-winning news, views, and insight from the ESET security community\n      ESET ResearchLong-term espionage against diplomats, leveraging email-based C&C protocols, C++ modular backdoors, and adversary-in-the-middle (AitM) attacks… Sounds like the infamous Turla? Think again!\n10 Aug 2023\n • \n, \n29 min. read\nKey points of this report:The group's intricate tactics, techniques and procedures were also discussed on the ESET Research Podcast. Just press play to learn more from ESET's Director of Threat Research Jean-Ian Boutin and ESET Distinguished Researcher Aryeh Goretsky. According to ESET telemetry, the group targets foreign embassies in Belarus, and we have identified four different countries whose embassy staff have been targeted: two from Europe, one from South Asia, and one from Africa. The key dates are shown in Figure 1.MoustachedBouncer’s activity spans from 2014 to 2022 and the TTPs of the group have evolved over time. For example, we have first seen them use AitM attacks only in 2020. However, the targeted vertical has stayed the same.Table 1 shows the characteristics of each campaign. Given these elements, we assess with high confidence that they are all linked to MoustachedBouncer.\n\n\n\n\n \n\n\nVirusTotal(2014)\n\n\nVictim A (2017)\n\n\nVictim B (2020-2022)\n\n\nVictim C(2020-2022)\n\n\nVictim D(2021-2022)\n\n\n\n\nNightClub implant\n\n\nX\n\n\nX\n\n\n \n\n\nX\n\n\n \n\n\n\n\nNightClub plugins\n\n\n \n\n\nX\n\n\nX\n\n\nX\n\n\n \n\n\n\n\nDisco implant\n\n\n \n\n\n \n\n\nX\n\n\n \n\n\nX\n\n\n\n\nSharpDisco dropper\n\n\n \n\n\n \n\n\nX\n\n\n \n\n\n \n\n\n\n\nCompromise via AitM\n\n\n?\n\n\n?\n\n\n?\n\n\n?\n\n\nX\n\n\n\n\nMalware delivery via AitM on SMB shares\n\n\n \n\n\n \n\n\nX\n\n\n \n\n\nX\n\n\n\n\nVictims: foreign embassies in Belarus\n\n\n? \n\n\nX\n\n\nX\n\n\nX\n\n\nX\n\n\n\n\n VirusTotal(2014)Victim A (2017)Victim B (2020-2022)Victim C(2020-2022)Victim D(2021-2022)NightClub implantXX X NightClub plugins XXX Disco implant  X XSharpDisco dropper  X  Compromise via AitM????XMalware delivery via AitM on SMB shares  X XVictims: foreign embassies in Belarus? XXXXIn this section, we detail the initial access for Disco. We don’t yet know the initial access method MoustachedBouncer uses to install NightClub.Note that it is using unencrypted HTTP and not HTTPS, and that the updates.microsoft[.]com subdomain does not exist on Microsoft’s nameservers, so it does not resolve on the open internet. During the attack, this domain resolved to 5.45.121[.]106 on the target’s machine. This IP address is used for parking domains and is unrelated to Microsoft. Although this is an internet-routable IP address, traffic to this IP never reaches the internet while the AitM attack is ongoing. Both the DNS resolutions and the HTTP replies were injected in transit, probably at the ISP level.An important point is that the adversary-in-the-middle (AitM) technique only occurs against a few selected organizations (perhaps just embassies), not countrywide. It is not possible to reproduce the redirection by simply exiting from a random IP address in Belarus.The HTML page, shown in Figure 2, loads JavaScript code from http://updates.microsoft[.]com/jdrop.js. This script first calls setTimeout to execute the function jdrop one second after the page has loaded. That function (see Figure 3) displays a modal window with a button named Получить обновления (translation: Get updates).A click on the button executes the update function, shown in Figure 4.This function triggers the download of a fake Windows Update installer from the legitimate-seeming URL http://updates.microsoft[.]com/MicrosoftUpdate845255.zip. It also displays some instructions to install the update: Для установки обновлений, скачайте и запустите \"MicrosoftUpdate845255.msi\". (translation: To install updates, download and run \"MicrosoftUpdate845255.msi\").We were unable to retrieve the downloaded MicrosoftUpdate845255.zip file but our telemetry shows it contains a malicious executable named MicrosoftUpdate845255.exe.Written in Go, it creates a scheduled task that executes \\\\35.214.56[.]2\\OfficeBroker\\OfficeBroker.exe every minute. Like the path suggests, it fetches the executable via SMB from 35.214.56[.]2. This IP address belongs to a Google Cloud customer, but just like the HTTP server, we believe that SMB replies are injected on the fly via AitM and that the attackers don’t control the actual internet-routable IP address.We have also observed the following SMB servers, intercepted via AitM:We have observed this behavior in two separate ISP networks: Unitary Enterprise A1 and Beltelecom. This suggests that those ISPs may not provide full data confidentiality and integrity. We strongly recommend that foreign organizations in Belarus use an end-to-end encrypted VPN tunnel, ideally out-of-band (i.e., not from the endpoint), providing internet connectivity from a trusted network.Figure 5 depicts our hypothesis about the compromise vector and the traffic interception. The AitM scenario reminds us of the Turla and StrongPity threat actors who have trojanized software installers on the fly at the ISP level. Usually, this initial access method is used by threat actors operating in their own country because it requires significant access inside the internet service providers, or their upstream providers. In many countries, security services are allowed to perform so-called “lawful interception” using special devices installed on the ISPs’ premises.In 2018, the Citizen Lab revealed that DPI devices developed by the Canadian company Sandvine were used to modify HTTP traffic in Turkey and Egypt. In Turkey, the devices were allegedly used to redirect internet users to a malicious server when they tried to download certain Windows applications, which is in line with StrongPity activities. In Egypt, those devices were allegedly used to inject ads and cryptocurrency mining scripts in order to generate money.While the compromise of routers in order to conduct AitM on embassy networks cannot be fully discarded, the presence of lawful interception capabilities in Belarus suggests the traffic mangling is happening at the ISP level rather than on the targets’ routers.Since 2014, the malware families used by MoustachedBouncer have evolved, and a big change happened in 2020 when the group started to use AitM attacks. At the same time, it started to use much simpler tools developed in .NET and Go. In reference to NightClub, we named this new toolset Disco.MoustachedBouncer operates the two implant families in parallel, but on a given machine, only one is deployed at a time. We believe that Disco is used in conjunction with AitM attacks while NightClub is used for victims where traffic interception at the ISP level isn’t possible because of a mitigation such as the use of an end-to-end encrypted VPN where internet traffic is routed outside of Belarus.As mentioned in the previous section, a fake Windows Update page delivers the first stage (SHA-1: E65EB4467DDB1C99B09AE87BA0A964C36BAB4C30). This is a simple dropper written in Go that creates a scheduled task to execute \\\\35.214.56[.]2\\OfficeBroker\\OfficeBroker.exe every minute. OfficeBroker.exe is downloaded over the SMB protocol via AitM attack. The dropper’s main function is shown in Figure 6.Finally, the dropper does a DNS query for windows.system.update[.]com. This domain does not exist but the DNS request is probably intercepted via AitM, and is likely a beacon to notify the operators that the machine has been successfully compromised.We were unable to retrieve the OfficeBroker.exe file, but it is very likely that it acts as a downloader, since we have observed further plugins being executed from SMB shares. The plugins are developed in Go and are rather simple because they mostly rely on external Go libraries. Table 2 summarizes the different plugins. Download URL / Path on diskDescription\\\\209.19.37[.]184\\driverpack\\aact.exeC:\\Users\\Public\\driverpack\\driverpackUpdate.exeExecutes PowerShell scripts with powershell.exe -NoProfile -NonInteractive <command>, where <command> is read from the file .\\idata. The output is written in .\\odata.C:\\Users\\Public\\driverpack\\sdrive.exe\\\\209.19.37[.]184\\driverpack\\officetelemetry.exe\\\\38.9.8[.]78\\driverpack\\DPU.exeAnother sample of the PowerShell plugin.%userprofile%\\appdata\\nod32update\\nod32update.exeAnother sample of the reverse proxy plugin.\\\\59.6.8[.]25\\outlooksync\\outlooksync.exeTakes screenshots; it is similar to the first plugin. Images are saved in ./logs/${DATETIME}.dat.\\\\52.3.8[.]25\\oracle\\oracleTelemetry.exeInterestingly, the plugins also use SMB shares for data exfiltration. There is no C&C server outside the attackers’ premises to look at or to take down. There also seems to be no way to reach that C&C server from the internet. This gives high resiliency to the attackers’ network infrastructure.In January 2020 we observed a MoustachedBouncer dropper, which we named SharpDisco, being downloaded from https://mail.mfa.gov.<redacted>/EdgeUpdate.exe by a Microsoft Edge process. It is not clear how attackers were able to tamper with HTTPS traffic, but it is possible an invalid TLS certificate warning was shown to the victim. Another possibility is that MoustachedBouncer compromised this governmental website.SharpDisco is a dropper developed in C#. It displays a fake update window, shown in Figure 7, while creating two scheduled tasks in the background.These scheduled tasks are:WINCMDA.EXE and WINCMDB.EXE are probably just cmd.exe renamed. Every minute, the task reads what is in \\\\24.9.51[.]94\\EDGEUPDATE\\EDGEAIN (on the SMB share), pipes it to cmd.exe, and writes the output to \\\\24.9.51[.]94\\EDGEUPDATE\\EDGEAOUT. It is the same for the second task, but with the EDGEBIN and EDGEBOUT files. From a higher viewpoint, those tasks are reverse shells with a one-second latency.Then, as shown in Figure 8, the dropper sends a DNS request for an unregistered domain, edgeupdate-security-windows[.]com. This is similar to what the 2022 Disco dropper does.ESET telemetry shows that the reverse shell was used to drop a genuine Python interpreter in C:\\Users\\Public\\WinTN\\WinTN.exe. We then observed two plugins being dropped on disk by cmd.exe, which means they were likely dropped by the reverse shell as well. The two plugins are:It is interesting to note that those plugins share code with NightClub (described in the section NightClub – 2017 (SHA-1: F92FE4DD679903F75ADE64DC8A20D46DFBD3B277) below). This allowed us to link the Disco and NightClub toolsets.This plugin is a Windows executable named It11.exe. We believe it was executed via the reverse shell mentioned above. There is no persistence mechanism implemented in the plugin.It gets the files recently opened on the machine by reading the content of the folder %USERPROFILE%\\Recent (on Windows XP) or of %APPDATA%\\Microsoft\\Windows\\Recent (in newer Windows versions). Those folders contain LNK files, each pointing to a recently opened file.The plugin embeds its own LNK format parser in order to extract the path to the original file.We were unable to make this plugin work, but static analysis shows that the files are exfiltrated to the SMB share \\\\24.9.51[.]94\\EDGEUPDATE\\update\\. The plugin maintains a list of already exfiltrated files, and their CRC-32 checksum, in %TEMP%\\index.dat. This likely avoids retransmitting the same file more than once.This plugin is a Windows executable named It3.exe. As with the recent-files stealer, it doesn’t implement any persistence mechanism.The plugin calls GetLogicalDrives in a loop to get a list of all connected drives, including removable ones such as USB keys. Then, it does a raw copy of the NTFS volume of each removable drive and writes it in the current working directory, C:\\Users\\Public\\ in our example. The filename is a randomly generated string of six to eight alphanumeric characters, for example heNNYwmY.It maintains a log file in <working directory>\\index.dat with the CRC-32 checksums of the copied disks.The plugin doesn’t appear to have any exfiltration capabilities. It is likely that the staged drive dumps are later retrieved using the reverse shell.Since 2014, MoustachedBouncer has been using a malware framework we named NightClub because it contains a C++ class named nightclub. We found samples from 2014, 2017, 2020, and 2022. This section describes the evolution of NightClub from a simple backdoor to a fully modular C++ implant.In summary, NightClub is an implant family using emails for its C&C communications. Since 2016, additional modules could be delivered by email to extend its spying capabilities.This is the oldest known version of NightClub. We found a dropper and an orchestrator.The dropper (SHA-1: 0401EE7F3BC384734BF7E352C4C4BC372840C30D) is an executable named EsetUpdate-0117583943.exe, and it was uploaded to VirusTotal from Ukraine on 2014-11-19. We don’t know how it was distributed at that time.The main function, illustrated in Figure 9, loads the resource MEMORY and writes its content in %SystemRoot%\\System32\\creh.dll. It is stored in cleartext in the PE resource.Then, the dropper modifies the Creation, Access, and Write timestamps of creh.dll to those of the genuine Windows DLL user32.dll.Finally, it creates a Windows service named WmdmPmSp and sets, in the registry, its ServiceDll to %SystemRoot%\\System32\\creh.dll – see Figure 10.The previously dropped DLL, creh.dll (SHA-1: 5B55250CC0DA407201B5F042322CFDBF56041632) is the NightClub orchestrator. It has a single export named ServiceMain and its PDB path is D:\\Programming\\Projects\\Work\\SwampThing\\Release\\Win32\\WorkingDll.pdb.It is written in C++ and the names of some methods and classes are present in the RTTI data – see Figure 11. Some of the strings are encrypted using the following linear congruential generator (LCG): staten+1 = (690069 × staten + 1) mod 232. For each encrypted string, a seed (state0) between 0 and 255 is provided. To decrypt a string, the staten is subtracted from each encrypted byten. An example of an encrypted string structure is shown in Figure 12.A non-encrypted log file is present in C:\\Windows\\System32\\servdll.log. It contains very basic information about the initialization of the orchestrator – see Figure 13.NightClub has two main capabilities:• Monitoring files• Exfiltrating data via SMTP (email)Functionality implemented here is very close to that of the recent file monitor plugin seen in 2020 and described above. It also browses the directories %USERPROFILE%\\Recent on Windows XP, and in newer Windows versions %APPDATA%\\Microsoft\\Windows\\Recent, and implements the same LNK parser – see Figure 14 and Figure 15. The files retrieved from the LNK files are copied to %TEMP%\\<original filename>.bin. Note that unlike the 2020 variant, only files with extensions .doc, .docx, .xls, .xslx, or .pdf are copied.It also monitors removable drives in a loop, in order to steal files from them.• SMTP server: smtp.seznam.cz• Sender address: glen.morriss75@seznam[.]cz• Sender password: <redacted>• Recipient address: SunyaF@seznam[.]czseznam.cz is a Czech web portal offering a free webmail service. We believe the attackers created their own email accounts, instead of compromising legitimate ones.NightClub exfiltrates the files previously copied to %TEMP% by the file monitor functionality (FileMonitor in Figure 11). They’re encoded in base64 and added as an attachment. The attachment name is the original filename with the .bin extension.Figure 16 shows the exfiltration of a file via SMTP. NightClub authenticates using the credentials for the  glen.morriss75@seznam[.]cz account and sends an email to SunyaF@seznam[.]cz with the stolen file attached. Note that some headers that might look suspicious at first sight are the defaults from the CSmtp project, so they are probably not distinctive. These include:• X-Mailer: The Bat! (v3.02) Professional• Content-Type: multipart/mixed; boundary=\"__MESSAGE__ID__54yg6f6h6y456345\"The Bat! is an email client widely used in Eastern Europe. As such, the X-Mailer header likely blends in with email traffic in Belarus.In 2017, we found a more recent version of NightClub, which was compiled on 2017-06-05. On the victim’s machine, it was located at C:\\Windows\\System32\\metamn.dll. Its filename in the DLL export directory is DownloaderService.dll, and it has a single export named ServiceMain. It contains the PDB path D:\\AbcdMainProject\\Rootsrc\\Projects\\MainS\\Ink\\Release\\x64\\EtfFavoriteFinder.pdb. To persist, it creates a Windows service named WmdmPmSp, as in previous versions. Unfortunately, we have not been able to recover the dropper.This NightClub version also includes a few C++ class and method names, including nightclub, in the RTTI data – see Figure 17.As in previous versions, C&C communications use the SMTP protocol, via the CSmtp library, with hardcoded credentials. In the sample we analyzed, the mail configuration is:• SMTP server: smtp.mail.ru• Sender address: fhtgbbwi@mail[.]ru• Sender password: [redacted]• Recipient address: nvjfnvjfnjf@mail[.]ruThe main difference is that they switched the free email provider from Seznam.cz to Mail.ru.This NightClub version uses external plugins stored in the folder %APPDATA%\\NvmFilter\\. They are DLLs named <random>.cr (e.g., et2z7q0FREZ.cr) with a single export named Starts. We have identified two plugins: a keylogger and a file monitor.This plugin was stored in %APPDATA%\\NvmFilter\\et2z7q0FREZ.cr and is a DLL with one export, Starts. It contains the PDB path D:\\Programming\\Projects\\Autogen\\Kh\\AutogenAlg\\Release\\x64\\SearchIdxDll.pdb and was developed in C++. RTTI data shows a few class names – see Figure 18.The keylogger implementation is rather traditional, using the Windows GetKeyState API function – see Figure 19.The keylogger maintains a cleartext log file in %TEMP%\\uirtl.tmp. It contains the date, the title of the application, and the logged keystrokes for this specific application. An example, which we generated, is provided in Figure 20.This plugin was stored in %APPDATA%\\NvmFilter\\sTUlsWa1.cr and is a DLL with a single export named Starts. Its PDB path, D:\\Programming\\Projects\\Autogen\\Kh\\AutogenAlg\\Release\\x64\\FileMonitoringModule.pdb, has not been stripped, and it reuses code from the 2014 and 2020 file monitors, described above. It monitors drives and recent files, and copies files for exfiltration to %TEMP%\\AcmSym\\rm. Its log file is stored in %TEMP%\\indexwti.sxd.In 2020-11, we observed a new version of NightClub deployed in Belarus, on the computers of the diplomatic staff of a European country. In 2022-07, MoustachedBouncer again compromised some of the same computers. The 2020 and 2022 versions of NightClub are almost identical, and the compromise vector remains unknown.Its architecture is slightly different from the previous versions, as the orchestrator also implements networking functions. The second component, which its developers call the module agent, is only responsible for loading the plugins. All samples were found in the folder %APPDATA%\\microsoft\\def\\ and are written in C++ with statically linked libraries such as CSmtp or cpprestsdk. As a result, the executables are quite large – around 5MB.On the victims’ machines, both orchestrator variants (SHA-1: 92115E21E565440B1A26ECC20D2552A214155669 and D14D9118335C9BF6633CB2A41023486DACBEB052) were named svhvost.exe. We believe MoustachedBouncer tried to masquerade as the name of the legitimate executable svchost.exe. For persistence, it creates a service named vAwast.The config is formatted in JSON, as shown in Figure 22. The most important keys are transport and modules. The former contains information about the mailbox used for C&C communications, as in the previous versions. The latter contains the list of modules.The two variants of the module agent (SHA-1: DE0B38E12C0AF0FD63A67B03DD1F8C1BF7FA6128 and E6DE72516C1D4338D7E45E028340B54DCDC7A8AC) were named schvost.exe, which is another imitation of the svchost.exe filename.This component is responsible for starting the modules that are specified in the configuration. They are DLLs, each with an export named Start or Starts. They are stored on disk unencrypted with the .ini extension, but actually are DLLs.Over the course of our investigation, we found five different modules: an audio recorder, two almost identical screenshotters, a keylogger, and a DNS backdoor. For all of them: their configuration, which is formatted in JSON, is passed as an argument to the Start or Starts function.By default, the output of the plugin is written in %TEMP%\\tmp123.tmp. This can be changed using the config field file. Table 3 shows the different plugins.Table 3. NightClub pluginsDLL export nameConfigurationDescriptionNotifyLoggers.dll{    \"name\":\"<value>\",    \"enabled\":\"<value>\",    \"max_size\":\"<value>\",    \"file\":\"<value>\",    \"chk_t\":\"<value>\",    \"r_d\":\"<value>\",    \"f_hs\":\"<value>\",    \"t_hs\":\"<value>\"}MicroServiceRun.dll{    \"name\":\"<value>\",    \"enabled\":\"<value>\",    \"max_size\":\"<value>\",    \"file\":\"<value>\"    \"capture_on_key_press\":\"<value>\",    \"period_in_sec\":\"<value>\",    \"quality\":\"<value>\",    \"app_keywords\":\"<value>\"}A screenshotter that uses CreateCompatibleDC and GdipSaveImageToStream and writes captured images in file to disk. If app_keywords is not empty, it uses GetForegroundWindow to check the name of the active Window and capture it only if it matches app_keywords.JobTesterDll.dll{    \"name\":\"<value>\",    \"enabled\":\"<value>\",    \"max_size\":\"<value>\",    \"file\":\"<value>\"}A keylogger that uses the GetKeyState API. It writes the log in file to disk and the format is <Date><Title bar><content>.ParametersParserer.dll{    \"name\":\"<value>\",    \"enabled\":\"<value>\",    \"max_size\":\"<value>\",    \"file\":\"<value>\",    \"cc_server_address\":\"<value>\"}A DNS-tunneling backdoor. cc_server_address specifies the IP address of a DNS server to which requests are sent. More details follow.The DNS-tunneling backdoor (ParametersParserer.dll) uses a custom protocol to send and receive data from a malicious DNS server (cc_server_address). Figure 23 shows that the DNS request is sent to the IP address provided in the configuration, using the pExtra parameter of DnsQuery_A.The plugin adds the data to exfiltrate as part of the subdomain name of the domain that is used in the DNS request (pszName above). The domain is always 11.1.1.cid and the data is contained in the subdomain. It uses the following format, where x is the letter, not some variable:x + <modified base64(buffer)> + x.11.1.1.cidFor example, the first DNS request the plugin sends is xZW1wdHkx.11.1.1.cid, where ZW1wdHk decodes to empty. Note that the base64 function is not standard. It removes the =, if any, from the result of the base64 encoding, and also replaces / characters with -s and + characters with -p. This is to create valid subdomains, because standard base64 encoding output can include +, / and = characters, all of which are invalid in domain names and could be detected in network traffic.Figure 24. The plugin reads the TXT recordThe expected format of the reply is:x + <argument encoded with modified base64> + x.<cmd_id>.<unknown integer>.1.<cmd_name>This is similar to the format of the requests. The <argument encoded with modified base64> also uses the custom base64 encoding without = and with -p for + and -s for /. <cmd_name> is an arbitrary string that is not used by the backdoor; it’s likely used by the operators to keep track of the different commands. <cmd_id> is an integer that corresponds to a command in the backdoor switch statement. For example, if the operators wanted to execute calc.exe, the DNS C&C server would send the reply xYzpcd2luZG93c1xzeXN0ZW0zMlxjYWxjLmV4ZQx.27.2.1.calc, where Yzpcd2luZG93c1xzeXN0ZW0zMlxjYWxjLmV4ZQ decodes to c:\\windows\\system32\\calc.exe and 27 is the command ID to create a new process. All commands supported by this backdoor are detailed in Table 4.Table 4. Commands implemented by the DNS backdoor\n\n\n\nID\n\n\nDescription\n\n\n\n\n0x15 (21)\n\n\nCopy a directory (from a source to a destination)\n\n\n\n\n0x16 (22)\n\n\nMove a file (from a source to a destination)\n\n\n\n\n0x17 (23)\n\n\nRemove a file or a directory\n\n\n\n\n0x18 (24)\n\n\nSearch a file for a given pattern (Note: we are unsure about the exact behavior of this command)\n\n\n\n\n0x19 (25)\n\n\nWrite a buffer to a file\n\n\n\n\n0x1A (26)\n\n\nRead a file\n\n\n\n\n0x1B (27)\n\n\nCreate a process\n\n\n\nIDDescription0x15 (21)Copy a directory (from a source to a destination)0x16 (22)Move a file (from a source to a destination)0x17 (23)Remove a file or a directory0x18 (24)Search a file for a given pattern (Note: we are unsure about the exact behavior of this command)0x19 (25)Write a buffer to a file0x1A (26)Read a file0x1B (27)Create a processThe result of the commands is exfiltrated back to the attacker using DNS requests, as detailed above. The only difference is that 11 is replaced by 12 in the domain name, as shown in this example: xdGltZW91dAx.12.1.1.cid. In this case, the plugin sent the message timeout to the C&C server.MoustachedBouncer is a skilled threat actor targeting foreign diplomats in Belarus. It uses quite advanced techniques for C&C communications including network interception at the ISP level for the Disco implant, emails for the NightClub implant, and DNS in one of the NightClub plugins.The main takeaway is that organizations in foreign countries where the internet cannot be trusted should use an end-to-end encrypted VPN tunnel to a trusted location for all their internet traffic in order to circumvent any network inspection devices.\n\n\n\nSHA-1\n\n\nFilename\n\n\nDetection\n\n\nDescription\n\n\n\n\n02790DC4B276DFBB26C714F29D19E53129BB6186\n\n\nindex.html\n\n\nJS/TrojanDownloader.Agent.YJJ\n\n\nFake Windows update webpage.\n\n\n\n\n6EFF58EDF7AC0FC60F0B8F7E22CFE243566E2A13\n\n\njdrop.js\n\n\nJS/TrojanDownloader.Agent.YJJ\n\n\nJavaScript code that triggers the download prompt of the fake Windows update.\n\n\n\n\nE65EB4467DDB1C99B09AE87BA0A964C36BAB4C30\n\n\nMicrosoftUpdate845255.exe\n\n\nWinGo/Agent.ET\n\n\nDisco dropper.\n\n\n\n\n3A9B699A25257CBD0476CB1239FF9B25810305FE\n\n\ndriverpackUpdate.exe\n\n\nWinGo/Runner.B\n\n\nDisco plugin. Executes PowerShell scripts.\n\n\n\n\n19E3D06FBE276D4AAEA25ABC36CC40EA88435630\n\n\nDPU.exe\n\n\nWinGo/Runner.C\n\n\nDisco plugin. Executes PowerShell scripts.\n\n\n\n\n52BE04C420795B0D9C7CD1A4ACBF8D5953FAFD16\n\n\nsdrive.exe\n\n\nWin64/Exploit.CVE-2021-1732.I\n\n\nDisco plugin. LPE exploit for CVE-2021-1732.\n\n\n\n\n0241A01D4B03BD360DD09165B59B63AC2CECEAFB\n\n\nnod32update.exe\n\n\nWinGo/Agent.EV\n\n\nDisco plugin. Reverse proxy based on revsocks.\n\n\n\n\nA01F1A9336C83FFE1B13410C93C1B04E15E2996C\n\n\naact.exe\n\n\nWinGo/Spy.Agent.W\n\n\nDisco plugin. Takes screenshots.\n\n\n\n\nC2AA90B441391ADEFAA3A841AA8CE777D6EC7E18\n\n\nofficetelemetry.exe\n\n\nWinGo/Agent.BT\n\n\nDisco plugin. Reverse proxy based on revsocks. \n\n\n\n\nC5B2323EAE5E01A6019931CE35FF7623DF7346BA\n\n\noracleTelemetry.exe\n\n\nWinGo/Spy.Agent.W\n\n\nDisco plugin packed with Themida. Takes screenshots. \n\n\n\n\nC46CB98D0CECCB83EC7DE070B3FA7AFEE7F41189\n\n\noutlooksync.exe\n\n\nWinGo/Spy.Agent.W\n\n\nDisco plugin. Takes screenshots. \n\n\n\n\nA3AE82B19FEE2756D6354E85A094F1A4598314AB\n\n\nkb4480959_EdgeUpdate.exe\n\n\nMSIL/TrojanDropper.Agent.FKQ\n\n\nDisco .NET dropper.\n\n\n\n\n4F1CECF6D05571AE35ED00AC02D5E8E0F878A984\n\n\nWinSrcNT.exe\n\n\nWin32/Nightclub.B\n\n\nNightClub plugin used by Disco. Steals recent files. \n\n\n\n\n0DAEA89F91A55F46D33C294CFE84EF06CE22E393\n\n\nIt11.exe\n\n\nWin32/Nightclub.B\n\n\nNightClub plugin used by Disco. Steals recent files.\n\n\n\n\n11CF38D971534D9B619581CEDC19319962F3B996\n\n\nIt3.exe\n\n\nWin32/Nightclub.B\n\n\nNightClub plugin used by Disco. Makes raw dumps of removable drives.\n\n\n\n\nF92FE4DD679903F75ADE64DC8A20D46DFBD3B277\n\n\nmetamn.dll\n\n\nWin64/Nightclub.B\n\n\nNightClub (2017 version).\n\n\n\n\n6999730D0715606D14ACD19329AF0685B8AD0299\n\n\net2z7q0FREZ.cr\n\n\nWin64/Nightclub.B\n\n\nNightClub plugin. Keylogger.\n\n\n\n\n6E729E84C7672F048ED8AE847F20A0219E917FA3\n\n\nsTUlsWa1.cr\n\n\nWin64/Nightclub.A\n\n\nNightClub plugin.  File stealer.\n\n\n\n\n0401EE7F3BC384734BF7E352C4C4BC372840C30D\n\n\nEsetUpdate-0117583943.exe\n\n\nWin32/Nightclub.C\n\n\nNightClub dropper.\n\n\n\n\n5B55250CC0DA407201B5F042322CFDBF56041632\n\n\ncreh.dll\n\n\nWin32/Nightclub.C\n\n\nNightClub (2014).\n\n\n\n\nD14D9118335C9BF6633CB2A41023486DACBEB052\n\n\nsvhvost.exe\n\n\nWin32/Nightclub.D\n\n\nOrchestrator (NightClub).\n\n\n\n\nE6DE72516C1D4338D7E45E028340B54DCDC7A8AC\n\n\nschvost.exe\n\n\nWin32/Nightclub.D\n\n\nModule agent (NightClub).\n\n\n\n\n3AD77281640E7BA754E9B203C8B6ABFD3F6A7BDD\n\n\nnullnat.ini\n\n\nWin32/Nightclub.D\n\n\nBackdoor with DNS tunneling (NightClub plugin).\n\n\n\n\n142FF0770BC6E3D077FBB64D6F23499D9DEB9093\n\n\nsoccix.ini\n\n\nWin32/Nightclub.D\n\n\nKeylogger (NightClub plugin).\n\n\n\n\nFE9527277C06D7F986161291CE7854EE79788CB8\n\n\noreonion.ini\n\n\nWin32/Nightclub.D\n\n\nScreenshotter (NightClub plugin).\n\n\n\n\n92115E21E565440B1A26ECC20D2552A214155669\n\n\nsvhvost.exe\n\n\nWin32/Nightclub.D\n\n\nOrchestrator (NightClub).\n\n\n\n\nDE0B38E12C0AF0FD63A67B03DD1F8C1BF7FA6128\n\n\nschvost.exe\n\n\nWin32/Nightclub.D\n\n\nModule agent (NightClub).\n\n\n\n\nD2B715A72BBA307CC9BF7690439D34F62EDF1324\n\n\nsysleg.ini\n\n\nWin32/Nightclub.D\n\n\nRecords audio (NightClub plugin).\n\n\n\n\nDF8DED42F9B7DE1F439AEC50F9C2A13CD5EB1DB6\n\n\noreonion.ini\n\n\nWin32/Nightclub.D\n\n\nTakes screenshots (NightClub plugin).\n\n\n\nSHA-1FilenameDetectionDescription02790DC4B276DFBB26C714F29D19E53129BB6186index.htmlJS/TrojanDownloader.Agent.YJJFake Windows update webpage.6EFF58EDF7AC0FC60F0B8F7E22CFE243566E2A13jdrop.jsJS/TrojanDownloader.Agent.YJJJavaScript code that triggers the download prompt of the fake Windows update.E65EB4467DDB1C99B09AE87BA0A964C36BAB4C30MicrosoftUpdate845255.exeWinGo/Agent.ETDisco dropper.3A9B699A25257CBD0476CB1239FF9B25810305FEdriverpackUpdate.exeWinGo/Runner.BDisco plugin. Executes PowerShell scripts.19E3D06FBE276D4AAEA25ABC36CC40EA88435630DPU.exeWinGo/Runner.CDisco plugin. Executes PowerShell scripts.52BE04C420795B0D9C7CD1A4ACBF8D5953FAFD16sdrive.exeWin64/Exploit.CVE-2021-1732.IDisco plugin. LPE exploit for CVE-2021-1732.0241A01D4B03BD360DD09165B59B63AC2CECEAFBnod32update.exeWinGo/Agent.EVDisco plugin. Reverse proxy based on revsocks.A01F1A9336C83FFE1B13410C93C1B04E15E2996Caact.exeWinGo/Spy.Agent.WDisco plugin. Takes screenshots.C2AA90B441391ADEFAA3A841AA8CE777D6EC7E18officetelemetry.exeWinGo/Agent.BTDisco plugin. Reverse proxy based on revsocks. C5B2323EAE5E01A6019931CE35FF7623DF7346BAoracleTelemetry.exeWinGo/Spy.Agent.WDisco plugin packed with Themida. Takes screenshots. C46CB98D0CECCB83EC7DE070B3FA7AFEE7F41189outlooksync.exeWinGo/Spy.Agent.WDisco plugin. Takes screenshots. A3AE82B19FEE2756D6354E85A094F1A4598314ABkb4480959_EdgeUpdate.exeMSIL/TrojanDropper.Agent.FKQDisco .NET dropper.4F1CECF6D05571AE35ED00AC02D5E8E0F878A984WinSrcNT.exeWin32/Nightclub.BNightClub plugin used by Disco. Steals recent files. 0DAEA89F91A55F46D33C294CFE84EF06CE22E393It11.exeWin32/Nightclub.BNightClub plugin used by Disco. Steals recent files.11CF38D971534D9B619581CEDC19319962F3B996It3.exeWin32/Nightclub.BNightClub plugin used by Disco. Makes raw dumps of removable drives.F92FE4DD679903F75ADE64DC8A20D46DFBD3B277metamn.dllWin64/Nightclub.BNightClub (2017 version).6999730D0715606D14ACD19329AF0685B8AD0299et2z7q0FREZ.crWin64/Nightclub.BNightClub plugin. Keylogger.6E729E84C7672F048ED8AE847F20A0219E917FA3sTUlsWa1.crWin64/Nightclub.ANightClub plugin.  File stealer.0401EE7F3BC384734BF7E352C4C4BC372840C30DEsetUpdate-0117583943.exeWin32/Nightclub.CNightClub dropper.5B55250CC0DA407201B5F042322CFDBF56041632creh.dllWin32/Nightclub.CNightClub (2014).D14D9118335C9BF6633CB2A41023486DACBEB052svhvost.exeWin32/Nightclub.DOrchestrator (NightClub).E6DE72516C1D4338D7E45E028340B54DCDC7A8ACschvost.exeWin32/Nightclub.DModule agent (NightClub).3AD77281640E7BA754E9B203C8B6ABFD3F6A7BDDnullnat.iniWin32/Nightclub.DBackdoor with DNS tunneling (NightClub plugin).142FF0770BC6E3D077FBB64D6F23499D9DEB9093soccix.iniWin32/Nightclub.DKeylogger (NightClub plugin).FE9527277C06D7F986161291CE7854EE79788CB8oreonion.iniWin32/Nightclub.DScreenshotter (NightClub plugin).92115E21E565440B1A26ECC20D2552A214155669svhvost.exeWin32/Nightclub.DOrchestrator (NightClub).DE0B38E12C0AF0FD63A67B03DD1F8C1BF7FA6128schvost.exeWin32/Nightclub.DModule agent (NightClub).D2B715A72BBA307CC9BF7690439D34F62EDF1324sysleg.iniWin32/Nightclub.DRecords audio (NightClub plugin).DF8DED42F9B7DE1F439AEC50F9C2A13CD5EB1DB6oreonion.iniWin32/Nightclub.DTakes screenshots (NightClub plugin).\n\n\n\nIP\n\n\nDomain\n\n\nFirst seen\n\n\nComment\n\n\n\n\n185.87.148[.]86\n\n\ncentrocspupdate[.]com\n\n\nNovember 3, 2021\n\n\nSuspected NightClub C&C server.\n\n\n\n\n185.87.151[.]130\n\n\nocsp-atomsecure[.]com\n\n\nNovember 11, 2021\n\n\nSuspected NightClub C&C server.\n\n\n\n\n45.136.199[.]67\n\n\nsecurityocspdev[.]com\n\n\nJuly 5, 2022\n\n\nNightClub C&C server.\n\n\n\n\n45.136.199[.]129\n\n\ndervasopssec[.]com\n\n\nOctober 12, 2022\n\n\nSuspected NightClub C&C server.\n\n\n\nIPDomainFirst seenComment185.87.148[.]86centrocspupdate[.]comNovember 3, 2021Suspected NightClub C&C server.185.87.151[.]130ocsp-atomsecure[.]comNovember 11, 2021Suspected NightClub C&C server.45.136.199[.]67securityocspdev[.]comJuly 5, 2022NightClub C&C server.45.136.199[.]129dervasopssec[.]comOctober 12, 2022Suspected NightClub C&C server.Note: These domains are used in a context where DNS queries are intercepted before reaching the internet. They do not resolve outside the context of the AitM attack.windows.network.troubleshooter[.]comupdates.microsoft[.]com Note: These IP addresses are used in a context where traffic to them is intercepted before reaching the internet. These internet-routable IP addresses are not malicious outside the context of the AitM attack.24.9.51[.]9435.214.56[.]238.9.8[.]7852.3.8[.]2559.6.8[.]25209.19.37[.]184Email addressesfhtgbbwi@mail[.]runvjfnvjfnjf@mail[.]ruglen.morriss75@seznam[.]czSunyaF@seznam[.]czTacticIDNameDescriptionReconnaissanceGather Victim Network Information: IP AddressesMoustachedBouncer operators have collected IP addresses, or address blocks, of their targets in order to modify network traffic for just those addresses.Initial AccessDrive-by CompromiseDisco is delivered via a fake Windows Update website.ExecutionUser Execution: Malicious FileDisco needs to be manually executed by the victim.PersistenceScheduled Task/Job: Scheduled TaskDisco persists as a scheduled task that downloads an executable from a “fake” SMB share every minute.Create or Modify System Process: Windows ServiceNightClub persists as a ServiceDll of a service named WmdmPmSp.Privilege EscalationExploitation for Privilege EscalationDisco has a plugin to exploit the CVE-2021-1732 local privilege escalation vulnerability.Defense EvasionDeobfuscate/Decode Files or InformationSince 2020, NightClub has used an external configuration file encrypted with RSA.CollectionData from Local SystemNightClub steals recent files from the local system.Data from Removable MediaNightClub steals files from the local system.Input Capture: KeyloggingNightClub has a plugin to record keystrokes.Screen CaptureNightClub and Disco each have a plugin to take screenshots.Audio CaptureNightClub has a plugin to record audio.Command and ControlApplication Layer Protocol: File Transfer ProtocolsDisco communicates via the SMB protocol.Application Layer Protocol: Mail ProtocolsNightClub communicates via the SMTP protocol.Application Layer Protocol: DNSOne of the NightClub plugins is a backdoor that communicates via DNS.Data Encoding: Standard EncodingNightClub encodes files, attached to email, in base64.Data Encoding: Non-Standard EncodingNightClub encodes commands and responses sent via its DNS C&C channel with a modified form of base64.Encrypted Channel: Symmetric CryptographyNightClub receives plugins in email attachments, encrypted using AES-CBC.Adversary-in-the-MiddleMoustachedBouncer has performed AitM at the ISP level to redirect its targets to a fake Windows Update page. It has also done AitM on the SMB protocol to deliver malicious files from “fake” servers.ExfiltrationExfiltration Over C2 ChannelNightClub and Disco exfiltrate data over the C&C channel (SMTP, SMB, and DNS).ImpactData Manipulation: Transmitted Data ManipulationMoustachedBouncer has modified the HTTP traffic from specific IP addresses at the ISP level in order to redirect its targets to a fake Windows Update page.\n      Sign up for our newsletters\n    ESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-BaltistanESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-Baltistan • ESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its graveESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its grave • ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023 • \n            Award-winning news, views, and insight from the ESET security community\n          "
   }
]