[
   {
      "time": "2023-11-01",
      "title": "\r\n\tArid Viper Campaign Targets Arabic-Speaking Users - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistCybersecurity experts at Cisco Talos have exposed the latest operations of the espionage-driven Arid Viper advanced persistent threat (APT) group. The new campaign, active since April 2022, has been targeting Arabic-speaking Android users.According to an advisory published earlier today, the modus operandi of Arid Viper involves the deployment of customized mobile malware in the Android Package (APK) format.One of the key mysteries surrounding the Arid Viper campaign is the possible connection between the threat actor and the Israel-Hamas conflict. However, it’s essential to note that there’s no concrete evidence either confirming or denying such a link. Cisco Talos said they conducted thorough due diligence, collaborating closely with law enforcement agencies, before making their findings public.From a technical standpoint, one intriguing facet of this operation is the striking resemblance between Arid Viper’s mobile malware and a legitimate dating application called Skipped. The malware shares a similar name and even utilizes the same project on the Firebase application development platform.The connection raises questions about whether Arid Viper has affiliations with the dating app’s developers or if they’ve unlawfully gained access to the shared project.To lure unsuspecting users into downloading their malicious mobile software, Arid Viper operatives distribute links masquerading as legitimate dating app updates. These links deploy malware onto the victims’ devices.The Android malware boasts several features, including the ability to turn off security notifications, pilfer sensitive information and inject additional malicious applications into the compromised devices."
   },
   {
      "time": "2023-11-01",
      "title": "Dozens of countries will pledge to stop paying ransomware gangs",
      "text": " An alliance of 40 countries will sign a pledge during the third annual International Counter-Ransomware Initiative summit in Washington, D.C., to stop paying ransoms demanded by cybercriminal groups.Addressing reporters on Monday, Anne Neuberger, the White House's Deputy National Security Adviser for Cyber and Emerging Technology, implied this initiative is in response to record ransomware risks worldwide, with the U.S. being the target of approximately 46% of these incidents.\"Ransomware is an issue that knows no borders. And as long as there's money flowing to ransomware criminals … the problem will continue to grow,\" Neuberger told reporters on Monday.While representatives from 48 countries, the European Union, and Interpol will attend this week's Counter-Ransomware Initiative summit, not all have confirmed that they will sign this week's anti-ransomware statement, according to Neuberger.Geographically, North America experienced most of these attacks at 50%, followed by Europe at 30%, and Asia ranked third with 9%."
   },
   {
      "time": "2023-11-01",
      "title": "British Library knocked offline by weekend cyberattack",
      "text": " The British Library has been hit by a major IT outage affecting its website and many of its services following a \"cyber incident\" that impacted its systems on Saturday, October 28.The ongoing outage also affects other services, including our phone lines and onsite library services in London and Yorkshire.The British Library's facilities, including Reading Rooms for personal study, are still operational, and collection items requested on or before October 26 are accessible onsite.\"The British Library is experiencing a major technology outage, as a result of a cyber incident. This is affecting online systems and services, our website, and onsite services including our Reading Rooms,\" a spokesperson told BleepingComputer.\"We are investigating the incident with the support of the National Cyber Security Centre (NCSC) and cybersecurity specialists.\"The spokesperson didn't say if personal or financial information belonging to customers or employees was accessed or stolen during the incident.The library has also yet to provide details on the nature of the attack and how the malicious actors breached its systems. The British Library website was still offline due to the cyberattack when the article was published. The British Library added that while there is limited manual ordering of collection items in London through printed catalogs in St Pancras, there is no access to digital collections or the digital catalog, and exhibition tickets can only be bought in person using cash.The library says its collection includes more than 150 million items stored on 625 km of shelves, with 3 million added yearly as it receives copies of every publication produced in the UK and Ireland.Over 11 million learners visit the library's website annually, while more than 16,000 people use its collections daily (onsite and online)."
   },
   {
      "time": "2023-11-01",
      "title": "Samsung Galaxy gets new Auto Blocker anti-malware feature",
      "text": " Samsung has unveiled a new security feature called 'Auto Blocker' as part of the One UI 6 update, offering enhanced malware protection on Galaxy devices.This is a measure to protect users from social engineering attacks that convince them to download and install APKs that infect them with malware or spyware.Users who need to install APKs sourced from unofficial sources will still be able to do it, as Auto Blocker is not active by default.A second feature of Auto Blocker is the ability to perform app security checks powered by McAfee to identify potential malware. Unfortunately, this feature is not currently available on U.S. carrier models.Auto Blocker also blocks unauthorized commands and software installations via the USB port, safeguarding users when they charge their devices at public stations.Initially protecting against zero-click attacks in just Google and Samsung messaging apps, it now also covers Messenger, Telegram, KakaoTalk, and WhatsApp.Auto Blocker and the updated Message Guard are available on Samsung Galaxy devices that run the latest One UI release, version 6.For now, only the Galaxy S23, S23+, and S23 Ultra have received the update, but the following devices are listed as eligible and should receive One UI 6 soon:Users of compatible devices can activate the protection feature through Settings > Security and Privacy> Auto Blocker.Users needing strong security on their mobile devices shouldn't solely rely on built-in protection features but also use a third-party mobile security solution from a trustworthy vendor."
   },
   {
      "time": "2023-11-01",
      "title": "Avast confirms it tagged Google app as malware on Android phones",
      "text": " Czech cybersecurity company Avast confirmed that its antivirus SDK has been flagging a Google Android app as malware on Huawei, Vivo, and Honor smartphones since Saturday.On affected devices, users were warned to immediately uninstall the Google app because it could secretly send SMS messages, download and install other apps, or steal their sensitive information.Others saw a different alert, telling them that the Google app was a trojan that could provide remote access to their device and allow attackers to install malware and steal the users' data.\"This security notification was not triggered by Google Play Protect and appears to be from a device that is not Play Protect certified and does not have access to officially download Google's core apps from Play,\" a Google spokesperson told BleepingComputer.\"We recommend contacting the device manufacturer for further information. Google Play is the only app store where you can officially download Google's core apps for Android.\"BleepingComputer also reached out to Huawei and Vivo, but we are yet to receive a response from the Chinese smartphone makers.While Google couldn't pinpoint the security service or app that was triggering the false positive, Avast confirmed on Tuesday that its Android antivirus SDK was the one that mistakenly tagged the Google Quick Search Box app launcher as malware.Avast said Huawei's Optimizer app showed the malware alerts on Huawei devices but didn't provide any details regarding affected Honor and Vivo devices.\"This SDK delivers the antivirus component of Huawei's Optimizer app, a device management application that also provides clean-up and performance features.\"The cybersecurity firm added that the issue only affected users outside China and was addressed on Monday, October 30.\"The issue affected Huawei customers outside of China only, and a small number of Honor and Vivo customers. A fix was implemented on October 30th which fully resolved the issue,\" Avast said."
   },
   {
      "time": "2023-11-01",
      "title": "Massive cybercrime URL shortening service uncovered via DNS data",
      "text": " An actor that security researchers call Prolific Puma has been providing link shortening services to cybercriminals for at least four years while keeping a sufficiently low profile to operate undetected.In less than a month, Prolific Puma has registered thousands of domains, many on the U.S. top-level domain (usTLD), to help with the delivery of phishing, scams, and malware.Using specialized DNS detectors, they were able to track the malicious network as it evolved and abused the usTLD to facilitate crime on the internet.Because of the nature of link shortening services, Infoblox could track the short links but not the final landing page, despite detecting a large number of interconnected domains exhibiting suspicious behavior.Some of the short links from Prolific Puma led directly to the final destination but others pointed to multiple redirects, even other shortened links, before getting to the landing page.Infoblox says that there were also cases where accessing the short link took the user to a CAPTCHA challenge, likely to protect from automated scans.Because of this inconsistency in what Prolific Puma’s short links loaded next, the researchers believe that multiple actors are using the service.The delivery method for these links also varies and includes social media and advertisements but evidence points to text messages as the main channel.The size of the Prolific Puma operation as uncovered by Infoblox is impressive. The actor registered up to 75,000 unique domain names since April 2022.Looking at the unique domains in the actor’s network, the researchers saw at the beginning of the year a peak of close to 800 domains of up to four characters created in a single day.Prolific Puma domains are spread across 13 TLDs. Since May this year, though, the actor used the usTLD for more than half of the total domains created, the daily average being 43.Since mid-October, the researchers noticed closed to 2,000 domains in the usTLD indicating Prolific Puma activity that are behind private registration protection.It is worth mentioning that private registrations is not permitted in the .US namespace under the current policy and the registrant is required to provide accurate and true information.Furthermore, registrars have an obligation to not offer private domain registrations to .US domain name registrants.Typically, Prolific Puma domains are alphanumeric, pseudo-random, and vary in size, three or four-character ones being the most common. However, the researchers observed domains as long as seven characters.In the last three years, the actor used hosting mainly from NameSilo, a cheap internet domain registrar that is often abused by cybercriminals, that offers an API for bulk registration.To avoid scrutiny and detection, Prolific Puma ages its domains by leaving them inactive or parked for a several weeks. During this period, the actor makes a few DNS queries to gain reputation.When ready for use, the actor transfers the domains to a bulletproof hosting provider, paying in Bitcoin cryptocurrency for a virtual private server with service with a dedicated IP address.Infoblox found that some of these domains are abandoned after a period but the DNS record still points to the dedicated IP.The researchers believe that Prolific Puma only provides the short link service and does not control the landing pages but do not exclude the possibility that the same actor runs the entire operation.Below is an example of how Prolific Puma's service is used in a campaign with a phishing page asking for credentials and a payment, to ultimately deliver a malicious browser plugin.According to Infoblox, the actor does not advertise its shortening service on underground markets but it is the largest and most dynamic. Using tens of thousands of domain names registered across multiple registrars enables them to fly under the radar.Infoblox was able to uncover the massive operation through algorithms that flag suspicious or malicious domains. Through passive DNS query logs, newly queried, registered, or configured domains are assessed and flagged as suspicious or malicious if they meet the criteria for associating them with a DNS threat actor.Uncovering Prolific Puma started with automated analytics, which reveled a few related domains. When the company deployed algorithms for RDGA discovery earlier this year, domains used were identified in groups. Another algorithm correlated the domain clusters and attributed them to a single DNS threat actor."
   },
   {
      "time": "2023-11-01",
      "title": "Flipper Zero Bluetooth spam attacks ported to new Android app",
      "text": " Recent Flipper Zero Bluetooth spam attacks have now been ported to an Android app, allowing a much larger number of devices to implement these annoying spam alerts.The project is still in early development, but BleepingComputer's tests confirmed that it works as advertised.Specifically, the app can broadcast connection requests with set time intervals as frequent as 1 second, targeting 'Fast Pair' on Android or 'Swift Pair' on Windows.One thing to note is that even though the Android API allows setting the transmission (TX) power level, developers have limited control over the actual data being broadcasted in relation to the TX power level.This constraint by the Android SDK can result in poor reception from the target devices, which is not a problem in Flipper Zero, which can achieve a more extended and precise range when connecting to other devices.In our tests, we found that some broadcasts were caught by the target only if the Android device generating them was as close as a few centimeters. In contrast, in other cases, notifications were generated from several meters away.An interesting side-effect we noticed is that Bluetooth-connected devices like mice and keyboards can become unresponsive during spam broadcasts. This is another way of creating disruptive \"denial of service\" attacks on a target.For now, the app stands as a demonstration of a possibility rather than a severe threat to users, but knowing how to turn off these notifications in the event you're targeted is good.On Android, head to Settings → Google → Nearby Share, and turn the toggle on Show notification to the \"Off\" position.On Windows, open Settings, select 'Bluetooth & devices' from the menu on the left, then click on 'Devices,' scroll down to 'Device settings,' and turn the 'Show notifications to connect using Swift Pair' toggle to the 'Off' position.We recommend against testing the 'Bluetooth-LE-Spam' app on your main device for reasons of security, as BleepingComputer cannot provide any guarantees that the project is safe."
   },
   {
      "time": "2023-11-01",
      "title": "Canada bans WeChat and Kaspersky products on govt devices",
      "text": " Canada has banned the use of Kaspersky security products and Tencent's WeChat app on mobile devices used by government employees, citing network and national security concerns.This ban comes as Canada fears that the two companies secretly funnel sensitive information to Russian and Chinese intelligence services.Mobile devices, such as smartphones and tablets, are frequently transported in and out of the workspace, making covert data siphoning harder to monitor.\"The Chief Information Officer of Canada determined that WeChat and Kaspersky suite of applications present an unacceptable level of risk to privacy and security.\"\"On a mobile device, the WeChat and Kaspersky applications data collection methods provide considerable access to the device's contents.\"\"While the risks of using these applications are clear, we have no evidence that government information has been compromised.\"The ban will take effect starting on October 30, 2023, which is when all WeChat and Kaspersky software must have been removed from government-issued mobile devices.After that date, the state will impose blocks that prevent the downloading of these apps, ensuring that the software will not be re-introduced on the devices.Kaspersky's says Canada's decision comes without consulting with them on the alleged security concerns, which, according to them, aren't based on factual evidence from a technical evaluation of their products but on political grounds.The security products vendor believes the Canadian government banned its products in \"response to the geopolitical climate,\" rejecting all the allegations as entirely unfounded."
   },
   {
      "time": "2023-11-01",
      "title": "Atlassian warns of critical Confluence flaw leading to data loss",
      "text": " Australian software company Atlassian warned admins to immediately patch Internet-exposed Confluence instances against a critical security flaw that could lead to data loss following successful exploitation.Described as an improper authorization vulnerability affecting all versions of Confluence Data Center and Confluence Server software, the bug is tracked as CVE-2023-22518 and puts publicly accessible instances at critical risk.While threat actors could use the flaw to destroy data on affected servers, the bug doesn't impact confidentiality as it can't be exploited to exfiltrate instance data. Atlassian Cloud sites accessed via an atlassian.net domain are also unaffected by this vulnerability.\"There are no reports of active exploitation at this time; however, customers must take immediate action to protect their instances.\"The company fixed the critical CVE-2023-22518 vulnerability in Confluence Data Center and Server versions 7.19.16, 8.3.4, 8.4.4, 8.5.3, and 8.6.1.\"Instances accessible to the public internet, including those with user authentication, should be restricted from external network access until you can patch,\" the company said.\"Due to the ease of exploitation, CISA, FBI, and MS-ISAC expect to see widespread exploitation of unpatched Confluence instances in government and private networks,\" the joint advisory warned."
   },
   {
      "time": "2023-11-01",
      "title": "Malicious NuGet packages abuse MSBuild to install malware",
      "text": " A new NuGet typosquatting campaign pushes malicious packages that abuse Visual Studio's MSBuild integration to execute code and install malware stealthily.NuGet is an open-source package manager and software distribution system, enabling developers to download and include ready-to-run .NET libraries for their projects.Threat actors who target software distribution systems like npm and PyPI have recently shown interest in NuGet, which predominantly targets Windows users and has become very popular among software developers.Some of the packages seen in this campaign include:The novel element in this campaign is that instead of using the standard approach of incorporating downloaders in the install scripts, these packages leverage NuGet's MSBuild integration for code execution.NuGet's MSBuild integrations is a feature introduced in NuGet v2.5 with the goals of supporting native projects, automating the build and testing process, and giving developers the ability to define custom actions and resolve dependencies.When NuGet installs a package containing a '\\build' folder, it automatically adds an MSBuild <Import> element to the project, referencing the .targets and .props files in that folder. The build process uses these files to set configurations, properties, or custom tasks.In the case spotted by ReversingLabs, the malicious code is hidden inside the <packageID>.targets file in the \"build\" directory as a <Code> property that implements the functionality of PowerShell scripts used in previous versions of the packages.Upon execution, the code fetches an executable from an external address and runs it in a new process.This technique was first introduced by a security researcher in 2019 to illustrate how the MSBuild process can be abused to run code when NuGet packages are installed.\"First, the string artifact in the first line of the file, 'IAmRootDemo' led us to the root of this execution technique,\" explains ReversingLab's Karlo Zanki in a report shared with BleepingComputer.However, this is the first documented case of threat actors leveraging this feature in malicious NuGet packages.ReversingLabs reports that the NuGet packages they spotted, which have been removed, were part of an ongoing campaign that started in August 2023.However, it didn't abuse MSBuild integrations until mid-October.Earlier versions utilized PowerShell scripts ('init.ps1') to fetch the malware payload from a GitHub repository.This indicates that the attackers continually refine their techniques to make the attacks stealthier.ReversingLabs reports that the threat actors immediately attempted to upload new packages after previous ones were removed, showing intent to continue the campaign."
   },
   {
      "time": "2023-11-01",
      "title": "FastViewer Variant Merged with FastSpy and disguised as a Legitimate Mobile Application | by S2W | S2W BLOG | Oct, 2023 | Medium",
      "text": " S2W BLOG--ListenShareAuthor: Youngjae Shin, Sebin Lee | BLKSMTHLast Modified : Oct 30, 2023— The package name, app name, icon, and some features are identical to the legitimate app.— FastSpy is based on AndroSpy, an Android open-source written in Xamarin.In the past, the FastViewer malware only executed malicious behavior when a specially created document created by the attacker was loaded. If the first 4 bytes of the file have the value “EDC%”, the malicious code is executed, downloads the FastSpy malware from the C&C server, and dynamically loads it.At the time, we traced and analyzed the C&C server used by the FastViewer and FastSpy malware, and confirmed the link between the malware and the Kimsuky group. Recently, through our threat hunting, we further identified a variant of FastViewer with some changes in functionality, and we would like to describe our analysis.FastViewer impersonated a Korean Hangul Word Processor (HWP) file viewer program called Hancom Office last year, but the latest iteration of FastViewer disguises itself as a legitimate app unrelated to file viewers. Below is a list of the apps that FastViewer has impersonated so far. In addition to this, we have also seen FastViewer trying to disguise itself as a Google Authenticator, anti-virus, or payment service app.The FastViewer we analyzed last year downloaded an additional malicious app based on the open-source project AndroSpy called FastSpy to execute commands, and in the case of the FastViewer we identified this time, some of the features of FastSpy were merged.In addition, previously, the FastViewer disguised as a viewer file was configured to execute the malicious behavior only when the first 4 bytes of the file (EDC%) were loaded, but the latest version does not seem to have adopted the above feature in that this feature is not called. Also, since they are no longer using FastSpy and have integrated some of its features into FastViewer, it is assumed that they have removed the document triggering process since they are using a common app theme.From the servers identified as being operated by the Kimsuky group, we secured 21 APK files that appear to have been created by the attackers. After categorizing the files, a total of 6 package names were used and 5 themes were identified. Based on the saved filenames, it appears that they have been preparing for this campaign since at least July 8, 2023.The 144.76.109[.]61 server operated by the attacker at the time was directory listed, allowing us to see all of the files uploaded to it, which further confirmed that the AsyncRAT malware was uploaded on the server.After analyzing the malicious apps, we found that the latest version of FastViewer used the same package name, app name, and app icon as the legitimate app. In the past, the package name and app icon were partially different from the legitimate app, but this time it was implemented the same as the legitimate app, making it difficult to distinguish the malicious app from the app.In addition, fields such as Target SDK and main activity information in the AndroidManifest.xml were tampered with, and permissions, broadcast receivers, and services were added for malicious behavior.FastViewer variant calls a service if a specific permission is granted, or executed by a receiver at boot time. When the malware is launched, the added or tampered main activity checks if the battery optimization permission is granted to the app and if not, it requests permission from the user. If the battery optimization permission is granted, the malicious behavior is performed by calling the malicious service.In addition, when the device reboots or a boot-related event occurs after the app is installed, the broadcast receiver added during the repackaging executes the malicious service. When the malware is invoked by receiving a boot event, it does not check for battery optimization permissions, unlike the main activity case. If the app has additional permissions to read SMS and access all files, it will execute normal update-related activities.2. Information theftThe main purpose of the FastViewer variant is to steal information from the infected device. Once the malicious service is triggered by the aforementioned conditions, the malicious code implemented inside is executed repeatedly at a set cycle. (Default value is 5 minutes) It then sends the infected device’s information in plain text, prefixed with the string “Kur-” to identify the infected device. This format of string is recognized by the same characteristics as FastViewer, FastSpy, and AndroSpy in the past. After transmission, it receives commands from the C&C server and performs malicious actions corresponding to those commands.3. Command and ControlThe FastViewer variant communicates with the C&C server repeatedly for the time specified in the Interval value of the setting value as described above. At this time, it reads the setting.txt file stored for each infected device from the C&C server, which contains a list of configuration values.For command and control, it refers to the above data to determine whether to perform malicious behavior. Depending on the value of the received command, it is determined whether to perform SMS stealing, resetting the malicious behavior execution cycle, file list stealing, and file data stealing.In the case of file list/data stealing commands, the value for the command must be set to 0 to be executed, but the default settings are set to 1 and 2, respectively, so it works only by updating the configuration value.4. PermissionsThe permissions required by FastViewer variants to perform malicious behaviors are as follows. The permissions requested from the user include “READ_SMS” to steal text messages, “POST_NOTIFICATIONS” to generate notifications, access to external storage/all files to steal files or file data after communication, and battery optimization mode to prevent the app from entering Doze Mode.5. Association with Old FastViewerThe past FastViewer and FastSpy feature an XOR operation with a decryption key of 2 bytes in size to decrypt the encrypted string. The variant of FastViewer also uses this feature, which is the biggest similarity to the old one, except for the Turkish language variable due to AndroSpy.Furthermore, the PDF decryption method, the name of the class that performs the C&C communication, the endpoint when communicating with the C&C, the commands received from the C&C, and the command separators received are also the same as the old FastViewer.PersistenceDiscoveryCollectionCommand and ControlExfiltration----S2W BLOGS2W is specializing in cybersecurity data analysis for cyber threat intelligence.S2WinS2W BLOG--S2WinS2W BLOG--S2WinS2W BLOG--S2WinS2W BLOG--1XIT--2Sandeep VishwakarmainInfoSec Write-ups--1Bitcoin.cominBitcoin.com--Techjournalist--FrostinSystem Weakness--3Ignacio de Gregorio--192HelpStatusAboutCareersBlogPrivacyTermsText to speechTeams"
   }
]