[
   {
      "time": "2022-11-18",
      "title": "Phishing kit impersonates well-known brands to target US shoppers",
      "text": " A sophisticated phishing kit has been targeting North Americans since mid-September, using lures focused on holidays like Labor Day and Halloween.The kit uses multiple evasion detection techniques and incorporates several mechanisms to keep non-victims away from its phishing pages.According to Akamai, whose security researchers discovered the campaign, one of the most interesting features of the kit is a token-based system that ensures each victim is redirected to a unique phishing page URL.The campaign spotted by Akamai started in September 2022 and continued throughout October, preying on online shoppers looking for \"holiday specials.\"The central theme of the phishing emails sent to prospective victims is a chance to win a prize from a reputable brand.The links in the email don't raise any alarms as they lead to the phishing site after a series of redirections, while URL shorteners conceal most URLs.Additionally, the attackers abuse legitimate cloud services like Google, AWS, and Azure, abusing their good reputation to bypass protection mechanisms.Everyone visiting the phishing site wins the promised prize after completing a short survey. In addition, a five-minute timer ensures those taking the survey are infused with a feeling of urgency.Some impersonated brands include sporting goods firm Dick's, high-end luggage maker Tumi, Delta Airlines, and the wholesale clubs, Sam's Club and Costco.To increase the campaign's effectiveness, the phishing actors include fake user testimonials showcasing the received prizes.After \"winning\" the prize, the victim is requested to cover the shipping costs for receiving the prize, for which they need to enter their payment card details.Of course, there is no prize to be shipped, and the credit card details are stolen by the threat actors to be used for online purchases.Akamai says roughly 89% of users landing on phishing domains are from the United States and Canada.Depending on their exact location, the redirection takes them to a different phishing site impersonating locally available brands.Each phishing email contains a link to a landing page with an anchor (#) usually used to direct a visitor to a specific part of the linked-to page.In this phishing campaign, the anchor tag represents a token used by JavaScript on the phishing landing to reconstruct a URL to which the target will be redirected.\"In the context of a phishing scam, the value placed after the HTML anchor might be ignored or overlooked when scanned by security products that are verifying whether it is malicious or not.\"\"This value will also be missed if viewed by a traffic inspection tool.\"Akamai shared the following image showing how the phishing link anchor is used to create a redirection link.Security products and network traffic inspection tools overlook this token, so it doesn't introduce risks for the phishing actors.Instead, it helps keep unwanted traffic, researchers, analysts, and random visitors away from the phishing landing pages.Those without a valid token, and browser redirections that don't use JavaScript for their rendering, will fail to access the phishing site.Apart from filtering non-victims, the tokens can also be used for victim-specific tracking, campaign performance measurement, and more.In summary, the kit combines almost all known techniques for effectiveness and detection avoidance, making it a potent threat to North Americans.With the Black Friday and Christmas shopping season approaching, consumers should be extra vigilant when they receive messages about promotions and special offers."
   },
   {
      "time": "2022-11-18",
      "title": "Iranian APT Actors Breach US Government Network",
      "text": " An unpatched VMware Horizon server allowed an Iranian government-sponsored APT group to use the Log4Shell vulnerability to not only breach the US Federal Civilian Executive Branch (FCEB) systems, but also deploy XMRing cryptominer malware for good measure.FCEB is the arm of the federal government that includes the Executive Office of the President, Cabinet Secretaries, and other executive branch departments.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-11-18",
      "title": "Palo Alto to Acquire Israeli Software Supply Chain Startup - SecurityWeek",
      "text": " Hi, what are you looking for?Cybersecurity powerhouse Palo Alto Networks on Thursday announced plans to spend $195 million in cash to acquire Israeli startup Cider Security, a deal that adds software supply chain security capabilities to its Prisma Cloud platform.ByFlipboardRedditWhatsappWhatsappEmailRyan Naraine is Editor-at-Large at SecurityWeek and host of the popular Security Conversations podcast series. He is a security community engagement expert who has built programs at major global brands, including Intel Corp., Bishop Fox and GReAT. Ryan is a founding-director of the Security Tinkerers non-profit, an advisor to early-stage entrepreneurs, and a regular speaker at security conferences around the world.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailCycode, a startup that provides solutions for protecting software source code, emerged from stealth mode on Tuesday with $4.6 million in seed funding.Less than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...The changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.The cryptopocalypse is the point at which quantum computing becomes powerful enough to use Shor’s algorithm to crack PKI encryption.Zero trust is not a replacement for identity and access management (IAM), but is the extension of IAM principles from people to everyone and...A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The CRYSTALS-Kyber public-key encryption and key encapsulation mechanism recommended by NIST for post-quantum cryptography has been broken using AI combined with side channel attacks.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-11-18",
      "title": "FBI: Hive ransomware extorted $100M from over 1,300 victims",
      "text": " The Federal Bureau of Investigation (FBI) said today that the notorious Hive ransomware gang has successfully extorted roughly $100 million from over a thousand companies since June 2021.To add insult to injury, the FBI says that the Hive gang will deploy additional ransomware payloads on the networks of victims who refuse to pay the ransom.\"As of November 2022, Hive ransomware actors have victimized over 1,300 companies worldwide, receiving approximately US$100 million in ransom payments, according to FBI information,\" the FBI revealed.\"Hive actors have been known to reinfect—with either Hive ransomware or another ransomware variant—the networks of victim organizations who have restored their network without making a ransom payment.\"The list of victims includes organizations from a wide range of industries and critical infrastructure sectors such as government facilities, communications, and information technology, with a focus on Healthcare and Public Health (HPH) entities.Today's advisory was issued to share Hive indicators of compromise (IOCs) and tactics, techniques, and procedures (TTPs) discovered by the FBI while investigating Hive ransomware attacks.The end goal is to help defenders detect malicious activity associated with Hive affiliates and reduce or eliminate the impact of such incidents.While submissions to the ID Ransomware platform don't include all Hive ransomware attacks, victims have submitted more than 850 samples since the start of the year, many of them pushed following a huge spike of activity between late March and mid-April.While the three federal agencies behind the advisory do not encourage paying the ransoms as it will most likely encourage other threat actors to join the ransomware onslaught, victims are urged to report Hive attacks to their local FBI field office or to CISA at report@cisa.gov regardless of whether they pay the ransom or not.This will help law enforcement collect critical information needed to keep track of the ransomware operation's activity, prevent additional attacks, or hold the attackers accountable for their actions."
   },
   {
      "time": "2022-11-18",
      "title": "Spacecraft Vulnerable to Failure, Thanks to Aerospace Networking Bug",
      "text": " Imagine: A mission to redirect an asteroid using a team of astronauts goes wrong, when a malicious device onboard the spacecraft interferes with its ability to dock with a robotic spacecraft — causing the crewed capsule to veer off course, spinning into space.Such a mission is still in the planning stages, but the simulated attack demonstrates the danger of a recently discovered vulnerability in the networking protocol used for securely sharing critical messages in software for spacecraft, airplanes, and critical infrastructure. That's according to researchers from the University of Michigan and NASA, who said the protocol, known as time-triggered ethernet (TTE), reduces the cost of implementing networks for critical infrastructure devices by allowing multiple devices to use the same network without affecting one another.The experiments showed that it's practical for a simple device using electromagnetic interference to break the isolation that is the cornerstone of the TTE protocol.\"We wanted to determine what the impact would be in a real system,\" Baris Kasikci, an assistant professor of computer science and engineering at University of Michigan, said in a statement. \"If someone executed this attack in a real spaceflight mission, what would the damage be?\" Time-triggered networks are tightly synchronized using a global schedule that is loaded into the devices when the network is created, specifying when data frames are expected to be sent and received. The networks typically have low latency and jitter, measures of network delay and variability in bandwidth.By identifying the IP address of another device on the network — the target — an attacker can determine the critical traffic marker through brute force. The networks allow devices on the same network to communicate with each other with the right critical traffic markers. Using the markers, an attacker could create a protocol control frame that holds data, a technique also known as packet-in-packet attack.\"We evaluated PCSPOOF on an avionics testbed for a real spaceflight mission,\" the researchers said. \"Our results show that PCSPOOF can threaten mission success and safety from a single BE device, such as those used in an onboard research experiment developed by a university.\"Modern TTE networks often do not verify parts of the data packets sent through local subnets, which makes PCSPOOF attacks more achievable. During an attack, researchers gathered information from the targeted TTE network to create a special packet, known as a protocol control frame (PCF), and then injected that frame into the network while creating electromagnetic interference to undermine the switch's ability to control routing.As far as defending against such an attack, organizations can replace any copper Ethernet cables with fiber optic, thus eliminating the impact of electromagnetic interference. In addition, the network could be modified to prevent malicious synchronization-control messages from accessing the same devices as legitimate messages.So far, affected organizations have committed to making the changes, according to Andrew Loveless, a UM doctoral student in computer science and engineering, and subject matter expert at NASA's Johnson Space Center. The researchers notified NASA, the European Space Agency, Northrop Grumman Space Systems, and Airbus Defense and Space — organizations which use TTE in critical systems. \"To our knowledge, there is not a current threat to anyone’s safety because of this attack,\" Loveless says. \"We have been very encouraged by the response we have seen from industry and government.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-11-18",
      "title": "DEV-0569 finds new ways to deliver Royal ransomware, various payloads | Microsoft Security Blog",
      "text": " April 2023 update – Microsoft Threat Intelligence has shifted to a new threat actor naming taxonomy aligned around the theme of weather. DEV-0569 is now tracked as Storm-0569. Recent activity from the threat actor that Microsoft tracks as DEV-0569, known to distribute various payloads, has led to the deployment of the Royal ransomware, which first emerged in September 2022 and is being distributed by multiple threat actors. Observed DEV-0569 attacks show a pattern of continuous innovation, with regular incorporation of new discovery techniques, defense evasion, and various post-compromise payloads, alongside increasing ransomware facilitation.DEV-0569 notably relies on malvertising, phishing links that point to a malware downloader posing as software installers or updates embedded in spam emails, fake forum pages, and blog comments. In the past few months, Microsoft security researchers observed the following tweaks in the group’s delivery methods:These methods allow the group to potentially reach more targets and ultimately achieve their goal of deploying various post-compromise payloads. DEV-0569 activity uses signed binaries and delivers encrypted malware payloads. The group, also known to rely heavily on defense evasion techniques, has continued to use the open-source tool Nsudo to attempt disabling antivirus solutions in recent campaigns.In this blog we share details of DEV-0569’s tactics, techniques, and procedures (TTPs) and observed behavior in recent campaigns, which show that DEV-0569 will likely continue leveraging malvertising and phishing for initial access. We also share preventive measures that organizations can adopt to thwart DEV-0569’s delivery methods involving malicious links and phishing emails using solutions like Microsoft Defender SmartScreen and Microsoft Defender for Office 365, and to reduce the impact of the group’s follow-on activities. Microsoft Defender for Endpoint detects the DEV-0569 behavior discussed in this blog, including the code signing certificates in use and the attempts to disable Microsoft Defender Antivirus.Microsoft uses DEV-#### designations as a temporary name given to an unknown, emerging, or developing cluster of threat activity, allowing Microsoft to track it as a unique set of information until we can reach high confidence about the origin or identity of the actor behind the activity. Once it meets defined criteria, a DEV group is converted to a named actor.DEV-0569 has multiple methods for delivery of their initial payload. In some cases, DEV-0569 payloads are delivered via phishing campaigns run by other malicious actors that offer delivery of malware payloads as a service.From August to October 2022, Microsoft observed DEV-0569 activity where BATLOADER, delivered via malicious links in phishing emails, posed as legitimate installers for numerous applications like TeamViewer, Adobe Flash Player, Zoom, and AnyDesk. BATLOADER was hosted on attacker-created domains posing as legitimate software download sites (anydeskos[.]com, for example) and on legitimate repositories like GitHub and OneDrive. Microsoft takes down verified malicious content from these repositories as they are found or reported.Figure 1. DEV-0569 activity seen in September 2022, where the landing site hosted BATLOADER posing as a TeamViewer installerAside from using installer files, Microsoft has also observed the use of file formats like Virtual Hard Disk (VHD) impersonating legitimate software for first-stage payloads. These VHDs also contain malicious scripts that lead to the download of DEV-0569’s malware payloads.DEV-0569 has used varied infection chains using PowerShell and batch scripts that ultimately led to the download of malware payloads like information stealers or a legitimate remote management tool used for persistence on the network. The management tool can also be an access point for the staging and spread of ransomware.DEV-0569 also continues to tamper with antivirus products. In September and October 2022, Microsoft saw activity where DEV-0569 used the open-source NSudo tool to attempt disabling antivirus solutions.   Figure 2. High-level view of observed DEV-0569 infection chains between August to October 2022In this campaign, DEV-0569 sent a message to targets using the contact form on these targets’ websites, posing as a national financial authority. When a contacted target responds via email, DEV-0569 replied with a message that contained a link to BATLOADER. Microsoft Defender for Office 365 detects the spoofing behavior as well as the malicious links in these emails.The malicious links in the contact forms led to BATLOADER malware hosted on abused web services like GitHub and OneDrive. The installers launched a PowerShell script that issued multiple commands, including downloading a NirCmd command-line utility provided by freeware developer NirSoft:If successful, the command allows the attacker to elevate from local admin to SYSTEM rights, similar to executing a scheduled task as SYSTEM.Microsoft identified instances involving DEV-0569 infection chains that ultimately facilitated human-operated ransomware attacks distributing Royal ransomware. Based on tactics observed by Microsoft, ransomware attackers likely gained access to compromised networks via a BATLOADER-delivered Cobalt Strike Beacon implant.In late October 2022, Microsoft researchers identified a DEV-0569 malvertising campaign leveraging Google Ads that point to the legitimate traffic distribution system (TDS) Keitaro, which provides capabilities to customize advertising campaigns via tracking ad traffic and user- or device-based filtering. Microsoft observed that the TDS redirects the user to a legitimate download site, or under certain conditions, to the malicious BATLOADER download site. Microsoft reported this abuse to Google for awareness and consideration for action.Using Keitaro, DEV-0569 can use traffic filtering provided by Keitaro to deliver their payloads to specified IP ranges and targets. This traffic filtering can also aid DEV-0569 in avoiding IP ranges of known security sandboxing solutions.Defenders can also apply the following mitigations to reduce the impact of this threat:Microsoft Defender Antivirus detects threat components as the following malware:NSudo activity is detected by the tamper protection capability as:Alerts with the following titles in the security center can indicate threat activity on your network:While the following alerts might indicate activity associated with this threat, they could also be triggered by unrelated threat activity:\n\t\t\tMicrosoft has been tracking activity related to the financially motivated threat actor Octo Tempest, whose evolving campaigns represent a growing concern for many organizations across multiple industries.\t\t\n\t\t\tUser containment is a unique and innovative defense mechanism that stops human-operated attacks in their tracks. We’ve added user containment to the automatic attack disruption capability in Microsoft Defender for Endpoint. User containment is automatically triggered by high-fidelity signals and limits attackers’ ability to move laterally within a network regardless of the compromised account’s Active Directory state or privilege level.\t\t\n\t\t\tThe threat actor that Microsoft tracks as Storm-0324 is a financially motivated group known to gain initial access using email-based initial infection vectors and then hand off access to compromised networks to other threat actors. These handoffs frequently lead to ransomware deployment. Beginning in July 2023, Storm-0324 was observed distributing payloads using an open-source tool […]\t\t\n\t\t\tMicrosoft Defender is our toolset for prevention and mitigation of data exfiltration and ransomware attacks. Microsoft Purview data security offers important mitigations as well and should be used as part of a defense-in-depth strategy.\t\tMicrosoft is a leader in cybersecurity, and we embrace our responsibility to make the world a safer place."
   },
   {
      "time": "2022-11-18",
      "title": "High Severity Vulnerabilities Reported in F5 BIG-IP and BIG-IQ Devices",
      "text": " Multiple security vulnerabilities have been disclosed in F5 BIG-IP and BIG-IQ devices that, if successfully exploited, to completely compromise affected systems.The two high-severity issues, which were reported to F5 on August 18, 2022, are as follows -However, it's worth noting that such an exploit requires an administrator with an active session to visit a hostile website.While F5 has made no mention of any of the vulnerabilities being exploited in attacks, it's recommended that users apply the necessary \"engineering hotfix\" released by the company to mitigate potential risks.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-18",
      "title": "U.S. charges Russian suspects with operating Z-Library e-Book site",
      "text": " Anton Napolsky (33) and Valeriia Ermakova (27), two Russian nationals, were charged with intellectual property crimes linked to Z-Library, a pirate online eBook repository.The defendants were arrested on November 3, 2022, in Argentina by the country's authorities at the request of U.S. law enforcement.Z-Library was one of the world's largest public and free-to-access written content repositories, containing 11 million books and 84 million articles in a massive 220 TB database.Of the two defendants, Napolsky is burdened by evidence, based on records obtained from Google and Amazon, that he was in control of Z-Library.\"The defendants are alleged to have operated a website for over a decade whose central purpose was providing stolen intellectual property, in violation of copyright laws,\" said FBI Assistant Director-in-Charge Driscoll.Z-Library started as a volunteer-run project with no commercial direction. However, at some point, it started offering paid memberships in exchange for premium features.This means that the platform had financial income from its operation, generated at the expense of work authors and publishers.The defendants profited illegally off work they stole, often uploading works within mere hours of publication, and in the process victimized authors, publishers, and booksellers. — U.S. Attorney Breon PeaceZ-Library was on the receiving end of multiple geo-blocking orders because of disregarding copyright ownership, distribution, and intellectual property rights.However, those regional blocks could be bypassed by using specific tools like VPNs or accessing the platform via one of the multiple alternative domains it operated.Interestingly, Z-Library's Tor site remains available at the time of writing, indicating how challenging it is to track hosting providers and servers keeping onion sites online.Currently, the two defendants are presumed innocent until the trial, a date for which has not been determined in the U.S. DoJ announcement."
   },
   {
      "time": "2022-11-18",
      "title": "FBI-Wanted Leader of the Notorious Zeus Botnet Gang Arrested in Geneva",
      "text": " A Ukrainian national who has been wanted by the U.S for over a decade has been arrested by Swiss authorities for his role in a notorious cybercriminal ring that stole millions of dollars from victims' bank accounts using malware called Zeus.Vyacheslav Igorevich Penchukov, who went by online pseu­do­nyms \"tank\" and \"father,\" is alleged to have been involved in the day-to-day operations of the group. He was apprehended in Geneva on October 23, 2022, and is pending extradition to the U.S.More importantly, machines infected by the \"endlessly adaptable\" malware could be folded into a botnet whose power can be harnessed to carry out distributed denial-of-service (DDoS) attacks.All the defendants have been accused of conspiracy to participate in racketeering activity, conspiracy to commit computer fraud and identity theft, aggravated identity theft, and multiple counts of bank fraud.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-18",
      "title": "North Korean Hackers Targeting Europe and Latin America with Updated DTrack Backdoor",
      "text": " Hackers tied to the North Korean government have been observed using an updated version of a backdoor known as Dtrack targeting a wide range of industries in Germany, Brazil, India, Italy, Mexico, Switzerland, Saudi Arabia, Turkey, and the U.S.The victimology patterns indicate an expansion to Europe and Latin America. Sectors targeted by the malware are education, chemical manufacturing, governmental research centers and policy institutes, IT service providers, utility providers, and telecommunication firms.\"The Dtrack backdoor continues to be used actively by the Lazarus group,\" the researchers concluded. \"Modifications in the way the malware is packed show that Lazarus still sees Dtrack as an important asset.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]