[
   {
      "time": "2022-10-20",
      "title": "Microsoft Customer Data Exposed by Misconfigured Server",
      "text": " The exposed information included names, email addresses, email content, company name, phone numbers, and files \"relating to business between a customer and Microsoft or an authorized Microsoft partner,\" the company said. The endpoint has already been secured to require authentication, and affected customers have been notified.\"This misconfiguration resulted in the potential for unauthenticated access to some business transaction data corresponding to interactions between Microsoft and prospective customers, such as the planning or potential implementation and provisioning of Microsoft services,\" Microsoft said, noting that there is no indication that customer accounts or systems had been compromised.Microsoft learned of the misconfiguration on Sept. 24 from a research team at SOCRadar.Microsoft said SOCRadar \"greatly exaggerated the scope of this issue\" and did not account for duplicate records in its estimate of affected entities. Microsoft also said SOCRadar's decision to release a search tool to look through the files \"is not in the best interest of ensuring customer privacy or security and potentially exposing them to unnecessary risk.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-10-20",
      "title": "Democracies are having a reckoning with mercenary spyware",
      "text": " Off-the-shelf spyware has long been associated with abuses by autocratic regimes, but in recent years it’s democracies who are reckoning with the their own potential abuse of such surveillance tools. Sophisticated digital surveillance tools were once only available to a handful of government intelligence operations. But mercenary software-as-a-service operations like Pegasus, from Israeli firm NSO Group, have made such powers accessible to practically any government willing to pay.And many have been, including regimes who appear to have used it as a tool of digital oppression. “What we've seen in recent years is that actually it may not just be autocrats and dictators” who seek these services, John Scott-Railton, a senior researcher at the University of Toronto’s Citizen Lab, told The Record. “Clearly the temptation to use this spyware is very great even in democracies — it’s an irresistible temptation.”The spyware allows attackers to target victims' smartphones — which are now often treasure troves of information about all aspects of our lives and contain microphones and cameras that can be used for intimate surveillance. “I think we haven't seen the last of these cases,” Scott-Railton said. “It's pretty clear that Mexico, again, has a Pegasus problem and it's unfortunate that the state is choosing an approach of distraction.”But as lawmakers around the world learn more about how such tools have already been used, they’re still grappling with how to respond. However, the committee has limited investigatory powers and the global scale of the issue complicates building a legal framework to effectively prevent future abuse of such tools. Meanwhile, victims of abusive deployment of spyware currently lack meaningful options of redress — something that must change, according to Rand Hammoud, surveillance campaigner at digital human rights organization Access Now. “Those who have been spied upon must be able to get redress from both the governments who do the illegal spying and the companies that knowingly provide them with the specific tools to do so,” said Hammoud. “Both parties must be able to provide adequate compensation or other forms of effective redress.”Reports of abuse involving Pegasus in Mexico emerged years before the Pegasus Project was published — and are still coming.“Even in the face of global scrutiny, domestic outcry, and a new administration that pledged to never use spyware, the targeting of journalists and human rights defenders with Pegasus spyware continued in Mexico,” Citizen Lab reported. On October 14, the Twitter account for the government of Mexico also tweeted an apparent attempt at damage control, highlighting that Citizen Lab found no specific technical forensic link between SEDENA and Pegasus in the recent report. Scott-Railton clapped back — citing records indicating the Mexican Army contracted with firms that appear to be proxies for Pegasus service.“In this case, evidence has been presented to the judicial authority indicating that the NSO Group company was illegally selling the ‘PEGASUS’ system while, at the same time, using it on its own to deliver the information to other people,” the statement, translated from Spanish, said. Scott-Railton sees three potential options, given the Mexican government’s response to the report: President López Obrador knows Pegasus is being deployed and is denying it; it’s being deployed and he doesn’t know it; or victims were targeted by another party — which still represents a national security threat for Mexico. NSO Group has long said, including in sworn testimony, it only sells its product to governments. (The company did not respond to a request for comment for this story.)This week’s announcement from Basave, the Mexican opposition lawmaker whose device was infected, suggests political motivation behind the spying. He is close to a potential 2024 presidential candidate, Luis Donaldo Colosio Riojas, and a member of the Chamber of Deputies, the lower house of Mexico’s federal legislature. Mexico is far from alone in dealing with NSO Group controversy. Congress has continued to investigate spyware like Pegasus in hearings this year and the Biden administration remains engaged on the issue.\"These are really concerning, troubling cases and none of them seem to be anywhere near resolved,” Scott-Railton told The Record. The scope of the issues is vast, but not always easy to access. The committee is expected to make recommendations based on its findings — and many human rights observers are hoping it stakes out a strong anti-spyware position, such as a full ban, that can help reset regional and international practices. “What is absolutely clear is that the abuses have far outpaced the oversight and may have far outpaced the rule of law and that has to be rectified,” Scott-Railton told The Record. He and others who have long warned about the risks posed by tools like Pegasus see momentum building.  According to Hammoud, many of the apparent abuses already violate international and local norms around human rights. “The tide has turned for the spyware industry and the world is realizing that no entity can fully be trusted to employ this technology while upholding human rights under international law.”Andrea Peterson (they/them) is a longtime cybersecurity journalist who cut their teeth covering technology policy at ThinkProgress (RIP) and The Washington Post before doing deep-dive public records investigations at the Project on Government Oversight and American Oversight.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-20",
      "title": "Brazilian police announce arrest of alleged Lapsus$ member",
      "text": " Little information was shared about the suspect but police implied they are prepared to charge the person with crimes related to operating a criminal organization, invasion of computer devices, technological disturbances and more. “It was also found the practice of corruption of minors, a crime provided for in the Statute of Children and Adolescents, and money laundering, according to Law No. 9,613/1998,” police said. While Operation Dark Cloud began in August, the group has been under investigation since December, when the cloud environment of the Ministry of Health was initially attacked.“At the time, the attackers deleted files, data and instances from the attacked folder, even leading to the compromise of the website Conectusus.saude.gov.br, responsible for the National Vaccination Certificate,” the Federal Police explained. “After the attack, when trying to access the Ministry of Health website (www.saude.gov.br), users found a message stating that system data had been copied and deleted and was in the hands of the invading group.”Police added that the group has attacked multiple companies in Brazil as well as others across the U.S. and Europe. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-10-20",
      "title": "New York fines EyeMed $4.5 million for 2020 email hack, data breach | SC Media",
      "text": "  The state’s investigation into the insurer found “EyeMed’s lack of compliant cybersecurity risk assessment to evaluate and address the risks to its information systems and non-public information stored on its networks left EyeMed vulnerable to threat actors, including the threat actor who initiated the cyber event,” according to the report.The settlement was announced as part of New York’s Department of Financial Services’ cybersecurity regulation that mandates a set of responsible security standards for businesses. Drawn into effect in March 2017, it “served as a model for other regulators,” including the FTC, multiple states, and other security models. The law includes standards for industry compliance, consumer data protection, cybersecurity controls, and timely reporting of cybersecurity events. The DFS investigation into EyeMed found multiple violations of these requirements.“It is critically important that consumers’ non-public information is kept safe from potential criminal activity,” Superintendent of Financial Services Adrienne A. Harris said in the release. “This settlement demonstrates DFS’s ongoing commitment to protecting consumers while ensuring the safety and soundness of financial institutions from cyber threats.”DFS launched an investigation into EyeMed following its breach notification in December 2020 that reported an email hack first discovered five months earlier. A threat actor used the access to a single employee email account to send phishing emails to contacts within the address book.First, EyeMed did not disclose that the attacker actually sent at least 2,000 phishing emails from the compromised account during the dwell time. The emails impersonated proposal requests that aimed to dupe victims into sharing their credentials.Further, the IT team received inquiries from clients and detected the suspicious transmissions on July 1. While EyeMed previously reported the account access was blocked and secured on the same day it was discovered, the previous investigation found the hack began a week before it was discovered.In total, the data of 2.1 million current and former vision benefits members of multiple insurance clients was compromised by the incident.The data included vision and health insurance account and identification numbers, Medicaid or Medicare numbers, driver’s licenses, government IDs, and birth or marriage certificates. Some members saw their Social Security numbers, financial data, diagnoses, health conditions, treatments, and other sensitive data.The findings of the DFS investigation into EyeMed found deeper security failings than previously disclosed.The audit revealed that EyeMed had violated the DFS’s cybersecurity regulation by failing to implement multi-factor authentication within its email environment. The state regulation requires MFA to be used for any users “accessing a covered entity’s internal network from an external network.”“At the time of the cyber event, EyeMed was in the process of rolling out MFA for its email environment, but did not yet have MFA implemented for the mailbox, as required by the cybersecurity regulation,” according to the report.In addition, EyeMed transitioned its email system to Microsoft Office 365 18 months before the hack. Although the regulation went into effect on March 1, 2018, the MFA implementation did not begin until March 2020, two years later. The O365 accessed the internal networks during the time MFA was not fully implemented. The MFA project was not completed until September 2020.DFS found that “the delay in MFA implementation left EyeMed’s information systems and its consumers’ non-public information vulnerable to threat actors.”Further, the investigation found the insurer failed to limit user access privileges. In fact, nine employees were allowed to share login credentials to the email account behind the weeklong hack.EyeMed also failed to implement sufficient data retention and disposal processes required by DFS. Namely, the hacked account contained “over six years’ worth of consumer non-public information, including that of minors.” To DFS, “had these controls been in place, the July 1, 2020, cybersecurity event could have been prevented or been limited in scope.\"DFS also found EyeMed hadn’t conducted an adequate risk assessment between 2018 and 2021, which would have identified the access privilege and data disposal risks tied to its email accounts.Notably, had EyeMed conducted the risk assessment it could have avoided several of the violations found by DFC, including the requirement to leverage an adequate risk assessment to then build an effective cybersecurity program able to “address information security, access controls and identity management, and customer data privacy.”The finding also suggests that after discovering the email hack and conducting its investigation over the course of five months in 2020, EyeMed still didn’t perform a risk assessment for more than a year after the incident. A risk assessment is not only a core requirement of DFS, it’s also mandated by The Health Insurance Portability and Accountability Act.The report shows “to date, EyeMed has not conducted a risk assessment that complies with the requirements of the cybersecurity regulation.” Although the insurer has a third-party vendor conduct “periodic audits” of its IT controls and “enterprise risk management reviews,” it does not meet the regulatory standards. What’s more, these vendor assessments did not cover the email system where the hack occurred.DFS added that “as a result, EyeMed’s cybersecurity certifications for the calendar years 2018 through 2021 were improper.”Lastly, EyeMed was also found to have violated the DFS requirement to annually certify compliance with the cybersecurity regulation.The multi-million dollar settlement also requires EyeMed to “undertake significant remedial measures to better secure its data.” The insurance carrier must take on a comprehensive cybersecurity risk assessment, then develop a plan to address any risks identified during its audit. DFS will then review and approve the plan.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Canadian officials say the contractors the government uses to relocate members of its government employees were breached.SecurityWeek reports that Morgan Stanley has been imposed a $6.5 million fine for its failure to properly remove unencrypted data from decommissioned devices that may have exposed millions of customers' sensitive information.Canada had information from an undisclosed number of current and former government employees, including those in the Canadian Armed Forces and Royal Canadian Mounted Police, exposed following data breaches impacting its contractors Brookfield Global Relocation Services and SIRVA Worldwide Relocation & Moving Services, according to SecurityAffairs.On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2022-10-20",
      "title": "Microsoft announces enterprise DDoS protection for SMBs",
      "text": " Microsoft announced today the availability of Azure DDoS IP Protection in public preview, a new and fully managed DDoS Protection pay-per-protected IP model tailored to small and midsize businesses (SMBs).To a great extent, it provides the same capabilities as DDoS Network Protection (previously known as DDoS Protection Standard), which is designed to help large enterprises and organizations to defend significantly larger resource deployments.Essential capabilities bundled with this new SKU include L3/L4 automatic attack detection and mitigation, metrics and alerts, mitigation flow logs and policies tuned to customer applications.The new SKU comes with Azure Firewall Manager, Microsoft Sentinel, and Microsoft Defender for Cloud integration.Unlike the enterprise offering, DDoS IP Protection does not have support for DDoS rapid response support, cost protection, and discounts on WAF.\"SMB customers who have a few public IP addresses to protect will benefit from this cost-effective DDoS protection option.\"As further highlighted by Dahan, the list of DDoS IP Protection key features includes:You can configure the SKU in the Azure Preview Portal as part of the Azure DDoS Protection configuration workflow."
   },
   {
      "time": "2022-10-20",
      "title": "Hackers use new stealthy PowerShell backdoor to target 60+ victims",
      "text": " A previously undetected and undocumented PowerShell backdoor is being actively used by a threat actor who has targeted at least 69 entities.Based on its features, the malware is designed for cyberespionage, mainly engaging in data exfiltration from the compromised system.When first detected, the PowerShell backdoor was not seen as malicious by any vendors on the VirusTotal scanning service.The attack begins with the arrival of a phishing email with an attached malicious document named \"Apply Form.docm.\" Based on the file contents and metadata, it is likely themed after a LinkedIn-based job application.The document contains malicious macros that drop and execute an 'updater.vbs' script that creates a scheduled task to impersonate a routine Windows update. The VBS script then executes two PowerShell scripts, \"Script.ps1\" and \"Temp.ps1,\" both of which are stored inside the malicious document in obfuscated form.When SafeBreach first discovered the scripts, none of the antivirus vendors on VirusTotal detected the PowerShell scripts as malicious.\"Script.ps1\" connects to the attacker's command and control servers (C2), sends a victim ID to the operators, and then awaits a command received in AES-256 CBC encrypted form.Based on the ID count, SafeBreach analysts concluded that the threat actor's C2 had logged 69 IDs before them, which is likely the approximate number of breached computers.The \"Temp.ps1\" script decodes the command in the response, executes it, and then encrypts and uploads the result via a POST request to the C2.SafeBreach took advantage of the predictable victim IDing and created a script that could decrypt the commands sent to each of them.The analysts found that two-thirds of the commands were to exfiltrate data, with the others used for user enumerations, file listings, removal of files and accounts, and RDP client enumerations.This PowerShell backdoor is a characteristic example of unknown stealthy threats used in attacks on government, corporate, and private user systems.Defenders need not only to be informed about the known or emerging threats but also to account for unknown vectors that may be capable of bypassing security measures and AV scans.While some AV engines can heuristically detect malicious behavior in the PowerShell scripts, threat actors constantly evolve their code to bypass these detections.The best way to achieve this is by applying security updates as quickly as possible, limiting remote access to endpoints, following the least privilege principle, and monitoring network traffic regularly.Update 10/21/22: We previously called the script \"undectable,\" when we should have used undetected."
   },
   {
      "time": "2022-10-20",
      "title": "Microsoft Azure SFX bug let hackers hijack Service Fabric clusters",
      "text": " Attackers could exploit a now-patched spoofing vulnerability in Service Fabric Explorer to gain admin privileges and hijack Azure Service Fabric clusters.Service Fabric Explorer (SFX), an open-source tool that can be used as a hosted solution or as a desktop app, allows Azure admins to manage and inspect nodes and cloud applications in Azure Service Fabric clusters.\"We found that a Deployer type user with a single permission to 'Create new Applications' via the dashboard, can use this single permission to create a malicious application name and abuse the Administrator permissions to perform various calls and actions,\" Orca Security explained.\"This includes performing a Cluster Node reset, which erases all customized settings such as passwords and security configurations, allowing an attacker to create new passwords and gain full Administrator permissions.\"Orca Security reported the vulnerability to the Microsoft Security Response Center (MSRC) on August 11 and Microsoft issued security updates to address the flaw during this month's Patch Tuesday on October 11.Microsoft says FabriXss exploits can only be used in attacks targeting older, unsupported versions of Service Fabric Explorer (SFXv1), with the current default SFX web client (SFXv2) not being vulnerable to attacks.\"The issue requires an attacker to already have code deployment and execution privileges in the Service Fabric cluster and for the target to use the vulnerable web client (SFXv1).\"According to Microsoft, an upcoming Service Fabric release will also remove SFXv1 and the option to switch to it."
   },
   {
      "time": "2022-10-20",
      "title": "Warning to iPhone and Android Users: 400 Apps Could Leak Data to Hackers - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2022-10-20",
      "title": "iDealwine suffers a data breach - Help Net Security",
      "text": " Popular international fine wine online retailer iDealwine has suffered a data breach during the past weekend, and has yet to reveal the number of customers affected.Its e-shop is still offline, showing a brief explanatory message, and the firm has informed all potentially affected customers about the cyberattack via email (also via the company blog).iDealwine is an e-merchant based in France, with offices in Hong Kong and London. It specializes in online auctions and fixed-price sales of fine wine, and provides information about news and trends in the wine industry.The company revealed it has contacted experts to deal with the issue, as well as the data privacy regulators in France and UK. It has informed its customers that their name, address, telephone number and email address may have been compromised. Customers’ credit card/bank information has not been compromised, since it’s not stored on company servers. According to the notification, customers’ passwords, which are encrypted, have also not been compromised, although the company still urges clients to change them and beware of unexpected emails and unsolicited phone calls – “especially if they claim to come from iDealwine or its partners”.“Do not open emails or attachments if you have any doubts about their source, and do not click on any links you are unsure of. Please contact us if you have any doubts or questions, our team is fully mobilised to assist you,“ the company added.UPDATE (October 20, 2022, 07:55 a.m. ET):iDealwine has declined to offer a comment or information about the data breach.The company has not disclosed the number of affected customers, but believes the risk for the clients is low since the attackers did not have access to data such as passports, credit card details, driver’s licenses, or passwords."
   },
   {
      "time": "2022-10-20",
      "title": "CISA Warns of Critical Flaws Affecting Industrial Appliances from Advantech and Hitachi",
      "text": " This consists of three weaknesses in the R-SeeNet monitoring solution, successful exploitation of which \"could result in an unauthorized attacker remotely deleting files on the system or allowing remote code execution.\"The list of issues, which affect R-SeeNet Versions 2.4.17 and prior, is as follows -The 29 vulnerabilities, collectively assigned a CVSS score of 8.2, stem from security holes in open source software components such as OpenSSL, LibSSL, libxml2, and GRUB2 bootloader. Users are recommended to update to APM Edge version 4.0 to remediate the bugs.According to OT cybersecurity and asset monitoring company SynSaber, 681 ICS product vulnerabilities were reported via CISA in the first half of 2022, out of which 152 are rated Critical, 289 are rated High, 205 are rated Medium, and 35 are rated Low in Severity.What's more, 54 of the Critical/High-rated CVEs have no patch or any mitigation available from the vendors, accounting for 13% of the total reported flaws and remaining \"forever-day vulnerabilities.\"Discover how application detection, response, and automated behavior modeling can revolutionize your defense against insider threats.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]