[
   {
      "time": "2022-11-24",
      "title": "BMC Firmware Vulnerabilities Expose OT, IoT Devices to Remote Attacks - SecurityWeek",
      "text": " Hi, what are you looking for?Researchers at industrial cybersecurity firm Nozomi Networks have discovered more than a dozen vulnerabilities in baseboard management controller (BMC) firmware.ByFlipboardRedditWhatsappWhatsappEmailEduard Kovacs (@EduardKovacs) is a managing editor at SecurityWeek. He worked as a high school IT teacher for two years before starting a career in journalism as Softpedia’s security news reporter. Eduard holds a bachelor’s degree in industrial informatics and a master’s degree in computer techniques applied in electrical engineering.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join security experts as they discuss ZTNA’s untapped potential to both reduce cyber risk and empower the business.Join Microsoft and Finite State for a webinar that will introduce a new strategy for securing the software supply chain. FlipboardRedditWhatsappWhatsappEmailLess than a week after announcing that it would suspended service indefinitely due to a conflict with an (at the time) unnamed security researcher...OpenAI has confirmed a ChatGPT data breach on the same day a security firm reported seeing the use of a component affected by an...The supply chain threat is directly linked to attack surface management, but the supply chain must be known and understood before it can be...A group of seven security researchers have discovered numerous vulnerabilities in vehicles from 16 car makers, including bugs that allowed them to control car...A researcher at IOActive discovered that home security systems from SimpliSafe are plagued by a vulnerability that allows tech savvy burglars to remotely disable...Patch Tuesday: Microsoft warns vulnerability (CVE-2023-23397) could lead to exploitation before an email is viewed in the Preview Pane.Patch Tuesday: Microsoft calls attention to a series of zero-day remote code execution attacks hitting its Office productivity suite.The latest Chrome update brings patches for eight vulnerabilities, including seven reported by external researchers.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   },
   {
      "time": "2022-11-24",
      "title": "Bahamut cybermercenary group targets Android users with fake VPN apps",
      "text": " \n      Award-winning news, views, and insight from the ESET security community\n    \n        Award-winning news, views, and insight from the ESET security community\n      ESET ResearchMalicious apps used in this active campaign exfiltrate contacts, SMS messages, recorded phone calls, and even chat messages from apps such as Signal, Viber, and Telegram\n23 Nov 2022\n • \n, \n11 min. read\nESET researchers have identified an active campaign targeting Android users, conducted by the Bahamut APT group. This campaign has been active since January 2022 and malicious apps are distributed through a fake SecureVPN website that provides only Android apps to download. Note that although the malware employed throughout this campaign uses the name SecureVPN, it has no association whatsoever with the legitimate, multiplatform SecureVPN software and service.\nKey points of this blogpost:\n\nThe app used has at different times been a trojanized version of one of two legitimate VPN apps, SoftVPN or OpenVPN, which have been repackaged with Bahamut spyware code that the Bahamut group has used in the past.\nWe were able to identify at least eight versions of these maliciously patched apps with code changes and updates being made available through the distribution website, which might mean that the campaign is well maintained.\nThe main purpose of the app modifications is to extract sensitive user data and actively spy on victims’ messaging apps.\nWe believe that targets are carefully chosen, since once the Bahamut spyware is launched, it requests an activation key before the VPN and spyware functionality can be enabled. Both the activation key and website link are likely sent to targeted users.\nWe do not know the initial distribution vector (email, social media, messaging apps, SMS, etc.).\n\nThe malware is able to exfiltrate sensitive data such as contacts, SMS messages, call logs, device location, and recorded phone calls. It can also actively spy on chat messages exchanged through very popular messaging apps including Signal, Viber, WhatsApp, Telegram, and Facebook Messenger; the data exfiltration is done via the keylogging functionality of the malware, which misuses accessibility services. The campaign appears to be highly targeted, as we see no instances in our telemetry data.The Bahamut APT group typically targets entities and individuals in the Middle East and South Asia with spearphishing messages and fake applications as the initial attack vector. Bahamut specializes in cyberespionage, and we believe that its goal is to steal sensitive information from its victims. Bahamut is also referred to as a mercenary group offering hack-for-hire services to a wide range of clients. The name was given to this threat actor, which appears to be a master in phishing, by the Bellingcat investigative journalism group. Bellingcat named the group after the enormous fish floating in the vast Arabian Sea mentioned in the Book of Imaginary Beings written by Jorge Luis Borges. Bahamut is frequently described in Arabic mythology as an unimaginably enormous fish.The group has been the subject of several publications in recent years, including:The initial fake SecureVPN app we analyzed was uploaded to VirusTotal on 2022-03-17, from an IP address that geolocates to Singapore, along with a link to a fake website that triggered one of our YARA rules.The malicious Android application used in this campaign was delivered via the website thesecurevpn[.]com (see Figure 1), which uses the name – but none of the content or styling – of the legitimate SecureVPN service (at the domain securevpn.com).Figure 1. Fake SecureVPN website provides a trojanized app to download Figure 2. Free website template used to create the distribution website for the fake VPN appthesecurevpn[.]com was registered on 2022-01-27; however, the time of initial distribution of the fake SecureVPN app is unknown. The malicious app is provided directly from the website and has never been available at the Google Play store.Figure 3. Class name comparison between the earlier malicious SecureChat package (left) and fake SecureVPN package (right)Comparing Figure 4 and Figure 5, you can see the similarities in SQL queries in the earlier SecureChat malware, attributed to Bahamut, and the fake SecureVPN malware.Figure 4. The SQL queries used in malicious code from the earlier SecureChat campaignFigure 5. The SQL queries used in malicious code in the fake SecureVPN campaignAs such, we believe that the fake SecureVPN application is linked to the Bahamut group.Since the distribution website has been online, there have been at least eight versions of the Bahamut spyware available for download. These versions were created by the threat actor, where the fake application name was followed by the version number. We were able to pull the following versions from the server, where we believe the version with the lowest version suffix was provided to potential victims in the past, while more recently higher version numbers (secureVPN_104.apk, SecureVPN_105.apk, SecureVPN_106.apk, SecureVPN_107.apk, SecureVPN_108.apk, SecureVPN_109.apk, SecureVPN_1010.apk, secureVPN_1010b.apk) have been used.We divide these versions into two branches, since Bahamut’s malicious code was placed into two different legitimate VPN apps.Figure 6. Fake SecureVPN v1.0.4 with malicious code included into SoftVPN as parent applicationFigure 7. Fake SecureVPN v1.0.9 (SecureVPN_109) with malicious code included into OpenVPN as its parent application even though the hardcoded VERSION_NAME (1.0.0) wasn’t changed between versionsBesides the split in these two branches, where the same malicious code is implanted into two different VPN apps, other fake SecureVPN version updates contained only minor code changes or fixes, with nothing significant considering its overall functionality.The reason why the threat actor switched from patching SoftVPN to OpenVPN as its parent app is not clear; however, we suspect that the reason might be that the legitimate SoftVPN app stopped working or being maintained and was no longer able to create VPN connections – as confirmed by our testing of the latest SoftVPN app from Google Play. This could be a reason for Bahamut to switch to using OpenVPN, since potential victims might uninstall a non-working VPN app from their devices. Changing one parent app to another likely required more time, resources, and effort to successfully implement by the threat actor.Malicious code packaged with the OpenVPN app was implemented a layer above the VPN code. That malicious code implements spyware functionality that requests an activation key and then checks the supplied key against the attacker’s C&C server. If the key is successfully entered, the server will return a token that is necessary for successful communication between the Bahamut spyware and its C&C server. If the key is not correct, neither Bahamut spyware nor VPN functionality will be enabled. Unfortunately, without the activation key, dynamic malware analysis sandboxes might not flag it as a malicious app.In Figure 8 you can see an initial activation key request and in Figure 9 the network traffic behind such a request and the response from the C&C server.Figure 8. Fake SecureVPN requests activation key before enabling VPN and spyware functionsFigure 9. Fake SecureVPN activation request and its C&C server’s responseThe campaigns using the fake SecureVPN app try to keep a low profile, since the website URL is most likely delivered to potential victims with an activation key, which is not provided on the website. Unfortunately, we were not able to obtain a working key.The activation key layer does not belong to the original OpenVPN functionality, and we do not recognize it as code from any other legitimate app. We believe it was developed by Bahamut, since it also communicates with their C&C server.If the Bahamut spyware is enabled, then it can be remotely controlled by Bahamut operators and can exfiltrate various sensitive device data such as:Figure 10. Fake SecureVPN request to manually enable Accessibility servicesAll exfiltrated data is stored in a local database and then sent to the C&C server. The Bahamut spyware functionality includes the ability to update the app by receiving a link to a new version from the C&C server.The mobile campaign operated by the Bahamut APT group is still active; it uses the same method of distributing its Android spyware apps via websites that impersonate or masquerade as legitimate services, as has been seen in the past. Further, the spyware code, and hence its functionality, is the same as in previous campaigns, including collecting data to be exfiltrated in a local database before sending it to the operators’ server, a tactic rarely seen in mobile cyberespionage apps.It appears that this campaign has maintained a low profile, as we see no instances in our telemetry data. This is probably achieved through highly targeted distribution, where along with a link to the Bahamut spyware, the potential victim is supplied an activation key, which is required to enable the malware’s spying functionality.\n\n\nSHA-1\nPackage name\nESET detection name\nDescription\n\n\n\n\n3144B187EDF4309263FF0BCFD02C6542704145B1\ncom.openvpn.secure\nAndroid/Spy.Bahamut.M\nOpenVPN app repackaged with Bahamut spyware code.\n\n\n2FBDC11613A065AFBBF36A66E8F17C0D802F8347\ncom.openvpn.secure\nAndroid/Spy.Bahamut.M\nOpenVPN app repackaged with Bahamut spyware code.\n\n\n2E40F7FD49FA8538879F90A85300247FBF2F8F67\ncom.secure.vpn\nAndroid/Spy.Bahamut.M\nSoftVPN app repackaged with Bahamut spyware code.\n\n\n1A9371B8AEAD5BA7D309AEBE4BFFB86B23E38229\ncom.secure.vpn\nAndroid/Spy.Bahamut.M\nSoftVPN app repackaged with Bahamut spyware code.\n\n\n976CC12B71805F4E8E49DCA232E95E00432C1778\ncom.secure.vpn\nAndroid/Spy.Bahamut.M\nSoftVPN app repackaged with Bahamut spyware code.\n\n\nB54FFF5A7F0A279040A4499D5AABCE41EA1840FB\ncom.secure.vpn\nAndroid/Spy.Bahamut.M\nSoftVPN app repackaged with Bahamut spyware code.\n\n\nC74B006BADBB3844843609DD5811AB2CEF16D63B\ncom.secure.vpn\nAndroid/Spy.Bahamut.M\nSoftVPN app repackaged with Bahamut spyware code.\n\n\n4F05482E93825E6A40AF3DFE45F6226A044D8635\ncom.openvpn.secure\nAndroid/Spy.Bahamut.M\nOpenVPN app repackaged with Bahamut spyware code.\n\n\n79BD0BDFDC3645531C6285C3EB7C24CD0D6B0FAF\ncom.openvpn.secure\nAndroid/Spy.Bahamut.M\nOpenVPN app repackaged with Bahamut spyware code.\n\n\n7C49C8A34D1D032606A5E9CDDEBB33AAC86CE4A6\ncom.openvpn.secure\nAndroid/Spy.Bahamut.M\nOpenVPN app repackaged with Bahamut spyware code.\n\n\n\n\n\nIP\nDomain\nFirst seen\nDetails\n\n\n\n\n104.21.10[.]79\nft8hua063okwfdcu21pw[.]de\n2022-03-20\nC&C server\n\n\n172.67.185[.]54\nthesecurevpn[.]com\n2022-02-23\nDistribution website\n\n\n\n      Sign up for our newsletters\n    ESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-BaltistanESET ResearchUnlucky Kamran: Android malware spying on Urdu-speaking residents of Gilgit-Baltistan • ESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its graveESET ResearchWho killed Mozi? Finally putting the IoT zombie botnet in its grave • ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023ESET Research, Threat ReportsESET APT Activity Report Q2–Q3 2023 • \n            Award-winning news, views, and insight from the ESET security community\n          "
   },
   {
      "time": "2022-11-24",
      "title": "IBM: RansomExx becomes latest ransomware group to create Rust variant",
      "text": " The RansomExx ransomware group has become the latest gang to create a variant in the Rust programming language, according to IBM Security X-Force Threat researchers.Charlotte Hammond, a malware reverse engineer for IBM Security X-Force, told The Record the development was important because antivirus detection rates tend to be lower for Rust compiled malware, making it easier to slip past defenses. “While switching languages may sound like a minor thing, it’s not a trivial exercise. They’re not just making an update to their existing code base; they’re recreating it from scratch in a completely new language with a completely different syntax and set of libraries. It’s likely to be a language that their developers are less familiar with too, which will also add to the time and effort required,” she said.“In cases like this one, the group already have an existing and well-established piece of ransomware, yet they have decided that the benefits of the switch are worth the effort.”The new sample is still only detected by 14 out of the 60+ AV providers represented in the platform, the researchers found.The developers behind RansomExx also created the PyXie malware, Vatet loader, and Defray ransomware strains, IBM explained.The new variant, named RansomExx2, is built to run on the Linux operating system but IBM noted that the group typically creates versions for Windows as well. Emsisoft ransomware expert Brett Callow said many other ransomware groups are using Rust, and IBM added that many other ransomware groups have created their own Rust variants, including high profile gangs like BlackCat, Hive, and Zeon.“The Rust programming language has been steadily increasing in popularity among malware developers over the course of the past year, thanks to its cross-platform support and low AV detection rates,” the researchers said.“Like the Go programming language, which has experienced a similar surge in usage by threat actors over the past few years, Rust’s compilation process also results in more complex binaries that can be more time-consuming to analyze for reverse engineers.”Hammond added that the lower antivirus detection rates are the main reason most groups turn to languages like Rust, explaining that every additional target that they can successfully execute the ransomware on, without it being detected and quarantined by AV, represents another possible source of income.The lower AV detection rates for Rust binaries can likely be explained by the language being much less commonly used, so AV vendors will have fewer signatures for it, and less available samples to train their detection applications with, Hammond explained“If the Rust language continues to be adopted by malware developers, then this will eventually change as AV vendors will start increasing their abilities to detect it, and so its advantages compared to other languages will lessen. At that point we may see malware developers shift and start to experiment with different languages instead,” she said.“It’s for this reason as well that it’s important to highlight these language changes when they arise. Raising awareness of the fact that more groups are adopting a new language will hopefully encourage security teams to research the matter and ensure they have the capabilities to detect and defend against it.”Recorded Future ransomware expert Allan Liska said two years ago, there were a lot of stories about ransomware groups switching to Golang, or new ransomware being developed in that language. Liska said that trend did not last for unknown reason but noted that many have switched to Rust as the programming language of choice for ransomware groups.“Ransomware is software and like any software it has to be updated regularly. Ransomware groups switch to whatever platforms are going to help them be successful and one advantage of Rust is that it makes the ransomware harder to detect (by AV products), for now,” he said. “The security industry will catch up shortly and it becomes a cat and mouse game where the ransomware groups develop new methods to evade detection and AV and EDR vendors develop new and better detections.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-24",
      "title": "Ducktail Cyberattackers Add WhatsApp to Facebook Business Attack Chain",
      "text": " A financially motivated threat actor targeting individuals and organizations on Facebook's Ads and Business platform has resumed operations after a brief hiatus, with a new bag of tricks for hijacking accounts and profiting from them.The Vietnam-based threat campaign, dubbed Ducktail, has been active since at least May 2021 and has affected users with Facebook business accounts in the United States and more than three dozen other countries. Security researchers from WithSecure (formerly F-Secure) who are tracking Ducktail have assessed that the threat actor's primary goal is to push out ads fraudulently via Facebook business accounts to which they manage to gain control.\"We believe the Ducktail operation uses hijacked business account access purely to make money by pushing out fraudulent ads,\" says Mohammad Kazem Hassan Nejad, a researcher at WithSecure Intelligence. In situations where the threat actor gains access to the finance editor role on a compromised Facebook business account, they also have the ability to modify business credit card information and financial details, such as transactions, invoices, account spending, and payment methods, Nejad says. This would allow the threat actor to add other businesses to the credit card and monthly invoices, and use the linked payment methods to run ads.\"The hijacked business could therefore be used for purposes such as advertising, fraud, or even to spread disinformation,\" Nejad says. \"The threat actor could also use their newfound access to blackmail a company by locking them out of their own page.\"The tactic of Ducktail's operators is to first identify organizations that have a Facebook Business or Ads account and then target individuals within those companies whom they perceive as having high-level access to the account. Individuals the group has typically targeted include people with managerial roles or roles in digital marketing, digital media, and human resources. The attack chain starts with the threat actor sending the targeted individual a spear-phishing lure via LinkedIn or WhatsApp. Users who fall for the lure end up having Ducktail's information stealer installed on their system. The malware can carry out multiple functions, including extracting all stored browser cookies and Facebook session cookies from the victim machine, specific registry data, Facebook security tokens, and Facebook account information. The malware steals a wide range of information on all businesses associated with the Facebook account, including name, verification stats, ad spending limits, roles, invite link, client ID, ad account permissions, permitted tasks, and access status. The malware collects similar information on any ad accounts associated with the compromised Facebook account.The information stealer can \"steal information from the victim's Facebook account and hijack any Facebook Business account to which the victim has sufficient access by adding attacker-controlled email addresses into the business account with administrator privileges and finance editor roles,\" Nejad says.  Adding an email address to a Facebook Business account prompts Facebook to send a link via email to that address — which, in this case, is controlled by the attacker. The threat actor uses that link to gain access to the account, according to WithSecure.Threat actors with admin access to a victim's Facebook account can do a lot of damage, including taking full control of the business account; viewing and modifying settings, people, and account details; and even deleting the business profile outright, Nejad says. When a targeted victim might not have sufficient access to allow the malware to add the threat actor’s email addresses, the threat has actor relied on the information exfiltrated from the victims’ machines and Facebook accounts to impersonate them.Nejad says that prior versions of Ducktail's information stealer contained a hard-coded list of email addresses to use for hijacking business accounts. \"However, with the recent campaign, we observed the threat actor removing this functionality and relying entirely on fetching email addresses directly from its command-and-control channel (C2),\" hosted on Telegram, the researcher says. Upon launch, the malware establishes a connection to the C2 and waits for a duration of time to receive a list of attacker-controlled email addresses in order to proceed, he adds.The report lists several steps that organization can take to mitigate exposure to Ducktail-like attack campaigns, beginning with raising awareness of spear-phishing scams targeting users with access to Facebook business accounts. Organizations should also enforce application whitelisting to prevent unknown executables from running, ensure that all managed or personal devices used with company Facebook accounts have basic hygiene and protection in place, and use private browsing to authenticate each work session when accessing Facebook Business accounts.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2022-11-24",
      "title": "Ukraine and Moldova suffer internet disruptions after Russian missile strikes",
      "text": " Internet connectivity was disrupted in Ukraine and neighboring Moldova after dozens of Russian missiles hit Ukrainian cities on Wednesday, causing massive power outages across the country.The energy infrastructure in urban areas has been hit hardest, leading to worse internet access in cities than elsewhere. For example, the entire city of Lviv in the west of Ukraine was without electricity for at least several hours during the day.More than half of Moldova was also left without electricity, including its capital Chisinau and the breakaway Russian-backed region of Transnistria, according to Moldova’s deputy prime minister Andrei Spinu. The country’s President Maia Sandu said that Moldova “can't trust a regime” that leaves it “in the dark and cold.”Russia fired a total of 70 missiles and five drones at Ukraine on Wednesday, killing five people and injuring 35. The attack came shortly after the European Parliament recognized Russia as a state sponsor of terrorism.Due to emergency blackouts, thousands of Ukrainians do not have water supply, heating, and access to the broadband internet. Mobile internet works with interruptions because telecom operators cannot handle the traffic.Local authorities also plan to introduce free WiFi hotspots throughout Ukraine, where people can access the internet and charge their devices if power outages last several days.To restore communication in the cities where Russia destroyed much of the internet infrastructure, Ukrainian telecom providers use Starlink satellite internet terminals, supplied by the U.S. company SpaceX. Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-24",
      "title": "Meta links U.S. military with covert Facebook influence operation",
      "text": " Meta has removed several accounts on Facebook and Instagram associated with the U.S. military, saying they were used as part of covert influence operations targeting the Middle East and Russia.Meta says it removed 39 Facebook accounts, 26 Instagram accounts, 16 Facebook Pages, and two Facebook groups for violating its 'coordinated inauthentic behavior' policy.The most successful of these Facebook pages had 22,000 followers; the more extensive group counted 400 members, while one of the banned Instagram accounts had 12,000 followers.The disinformation network operated in clusters that promoted specific topics corresponding to audience interest from the mentioned countries.The posters pretended to be locals in those countries, using fake photos generated by GAN (generative adversarial network) tools to evade exposure by reverse image searches.Notably, some of the banned Pages used their own unique logos and visual style and linked to matching accounts on YouTube, Twitter, Vkontakte, and dedicated websites.A giveaway that these were fake accounts was that they were posting during U.S. business hours and not in the time zones of the countries they were supposedly based in.The people behind these clusters posted in Arabic, Farsi, and Russia to praise the U.S. military and raise terrorism concerns in regions of particular interest.The fake accounts used $2,500 in advertising on Facebook to ensure their disinformation content would reach more users.In many cases, the campaigns criticized Iran, China, and Russia, focusing on the Russian invasion of Ukraine, China's oppression of the Uyghur people, the two country's support of the Taliban regime in Afghanistan, and Iran's influence in the Middle East.Previously, in September 2022, Facebook removed disinformation networks from China and Russia, with the latter using a staggering 1,633 fake accounts and 703 Pages."
   },
   {
      "time": "2022-11-24",
      "title": "Fake MSI Afterburner targets Windows gamers with miners, info-stealers",
      "text": " Windows gamers and power users are being targeted by fake MSI Afterburner download portals to infect users with cryptocurrency miners and the RedLine information-stealing malware.The MSI Afterburner is a GPU utility that allows you to configure overclocking, create fan profiles, perform video capturing, and monitor your installed graphics cards' temperature and CPU utilization.While created by MSI, the utility can be used by users of almost all graphics cards, leading to its use by millions of gamers worldwide who tweak settings to improve game performance, make their GPUs more silent, and achieve lower temperatures.However, the tool's popularity has also made it a good target for threat actors, who are looking to target Windows users with powerful GPUs that can be hijacked for cryptocurrency mining.The campaign used domains that could trick users into thinking they were visiting the legitimate MSI website and which are easier to promote using BlackSEO. Some of the domains spotted by Cyble are listed below:In other cases, the domains did not resemble the MSI brand and were likely promoted via direct messages, forums, and social media posts. Examples include:When the fake MSI Afterburner setup file (MSIAfterburnerSetup.msi) is executed, the legitimate Afterburner program will be installed. However, the installer will also quietly drop and run the RedLine information-stealing malware and an XMR miner in the compromised device.The miner is installed through a 64-bit Python executable named 'browser_assistant.exe' in the local Program Files directory, which injects a shell into the process created by the installer.This shellcode retrieves the XMR miner from a GitHub repository and injects it directly into memory in the explorer.exe process. Since the miner never touches the disk, the chances of being detected by security products are minimized.The miner connects to its mining pool using a hardcoded username and password and then collects and exfiltrates basic system data to the threat actors.One of the arguments the XMR miner uses is 'CPU max threads' set to 20, topping most modern CPU thread count, so it's set to capture all available power.The miner is set to mine only after 60 minutes since the CPU has entered idling, meaning that the infected computer is not running any resource-intensive tasks and is most likely left unattended.Also, it uses the \"-cinit-stealth-targets\" argument, which is an option to pause mining activity and clear GPU memory when specific programs listed under \"stealth targets\" are launched.These could be process monitors, antivirus tools, hardware resource viewers, and other tools that help the victim spot the malicious process.In this case, the Windows applications from which the miner attempts to hide are Taskmgr.exe, ProcessHacker.exe, perfmon.exe, procexp.exe, and procexp64.exe.While the miner is quietly hijacking your computer's resources to mine Monero, RedLine has already run in the background stealing your passwords, cookies, browser information, and, potentially, any cryptocurrency wallets.Unfortunately, almost all of this fake MSI Afterburner campaign's components have poor antivirus software detection.To stay safe from miners and malware, download tools directly from official sites rather than sites shared in forums, social media, or direct messages."
   },
   {
      "time": "2022-11-24",
      "title": "Pro-Russian hacktivists take down EU Parliament site in DDoS attack",
      "text": " The website of the European Parliament has been taken down following a DDoS (Distributed Denial of Service) attack claimed by Anonymous Russia, part of the pro-Russian hacktivist group Killnet.The Director General for Communication and Spokesperson of the European Parliament, Jaume Dauch, also stated after the website went down that the outage was caused by an ongoing DDoS attack.\"This traffic is related to a DDOS attack (Distributed Denial of Service) event. EP teams are working to resolve this issue as quickly as possible.\"​The attack came after the European Parliament recognized Russia as a state sponsor of terrorism and MEPs called for further international isolation of Russia.The resolution was adopted on Wednesday following recent developments in Russia's war of aggression against Ukraine.\"MEPs also want diplomatic ties with Russia to be reduced, EU contacts with official Russian representatives to be kept to the absolute minimum and Russian state-affiliated institutions in the EU spreading propaganda around the world to be closed and banned.\"Notable examples of airport websites taken down following their attack include the Los Angeles International Airport (LAX), which was intermittently offline, and the Hartsfield-Jackson Atlanta International Airport (ATL), a large U.S. air traffic hub."
   },
   {
      "time": "2022-11-24",
      "title": "Facebook attributes fake social media campaign targeting Middle East to US military",
      "text": " Facebook said it removed 39 Facebook accounts, 16 Pages, two Groups and 26 accounts on Instagram for violating their rules around “coordinated inauthentic behavior” — a term they use to describe fictitious social media campaigns typically carried out by governments.The campaign specifically focused on Afghanistan, Algeria, Iran, Iraq, Kazakhstan, Kyrgyzstan, Russia, Somalia, Syria, Tajikistan, Uzbekistan and Yemen.Facebook noted that they were not the only social media site that the campaign targeted. They also found fake accounts on Twitter, YouTube, Telegram, VKontakte, Odnoklassniki and others. “Although the people behind this operation attempted to conceal their identities and coordination, our investigation found links to individuals associated with the US military.”Meta said the posts generally covered “sports and culture in a particular country; cooperation with the United States, including military cooperation; and criticism of Iran, China, or Russia.”One source told the newspaper that some of the campaign was attributed to U.S. Central Command and that it mostly involved anti-Russia propaganda dispersed during the summer. Many of the posts warned of potential spillover effects from Russia’s invasion of Ukraine on several central Asian countries. A Defense Department spokesperson said they are aware of the report. \"At this time, we do not have any further comments on the report or potential actions that may be taken by the Department as a result of the report,\" the spokesperson said. Other posts were critical of Iran and contained outlandish claims about organ removals that one defense official told The Washington Post would be a violation of the Pentagon’s “doctrine and training practices.”Meta noted that the campaigns, although pretending to come from locals in the countries they targeted, operated during U.S. business hours.“The majority of this operation’s posts had little to no engagement from authentic communities. The people behind this activity posted primarily in Arabic, Farsi and Russian about news and current events, including terrorism concerns and praise of the US military, as well as content about the COVID-19 pandemic — some of which we removed for violating our misinformation policy,” Meta said. “This operation also shared posts criticizing Iran, China and Russia, including Russia’s invasion of Ukraine, China’s treatment of the Uyghur people, Iran’s influence in the Middle East, and the support of the Taliban regime in Afghanistan by Russia and China.” In total, Meta found that about 22,000 accounts followed one or more of these pages, about 400 joined at least one of the Groups and around 12,000 accounts followed one or more of the Instagram accounts.The campaigns spent about $2,500 in ads on Facebook, paid in both U.S. dollars and British pounds. The report also includes mentions of actions taken in September to remove similarly inauthentic campaigns from Russia and China.Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-24",
      "title": "Nighthawk Likely to Become Hackers' New Post-Exploitation Tool After Cobalt Strike",
      "text": " A nascent and legitimate penetration testing framework known as Nighthawk is likely to gain threat actors' attention for its Cobalt Strike-like capabilities.Enterprise security firm Proofpoint said it detected the use of the software in mid-September 2022 by a red team with a number of test emails sent using generic subject lines such as \"Just checking in\" and \"Hope this works2.\"According to the Sunnyvale-based company, the aforementioned email messages contained booby-trapped URLs, which, when clicked, redirected the recipients to an ISO image file containing the Nighthawk loader.The obfuscated loader comes with the encrypted Nighthawk payload, a C++-based DLL that uses an elaborate set of features to counter detection and fly under the radar.Of particular note are mechanisms that can prevent endpoint detection solutions from being alerted about newly loaded DLLs in the current process and evade process memory scans by implementing a self-encryption mode.\"Nighthawk is a mature and advanced commercial C2 framework for lawful red team operations that is specifically built for detection evasion, and it does this well,\" Rausch said.\"Historic adoption of tools like Brute Ratel by advanced adversaries, including those aligned with state interests and engaging in espionage, provides a template for possible future threat landscape developments.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   }
]