[
   {
      "time": "2022-08-30",
      "title": "FBI: Hackers increasingly exploit DeFi bugs to steal cryptocurrency",
      "text": " The U.S. Federal Bureau of Investigation (FBI) is warning investors that cybercriminals are increasingly exploiting security vulnerabilities in Decentralized Finance (DeFi) platforms to steal cryptocurrency.\"The FBI has observed cyber criminals exploiting vulnerabilities in the smart contracts governing DeFi platforms to steal investors' cryptocurrency,\" the federal law enforcement agency said.\"The FBI encourages investors who suspect cyber criminals have stolen their DeFi investments to contact the FBI via the Internet Crime Complaint Center or their local FBI field office.\"The public service announcement, published on the FBI's Internet Crime Complaint Center (IC3) today, adds that out of roughly $1.3 billion in cryptocurrency stolen between January and March 2022, snatched almost 97 percent of it from DeFi platforms.Per FBI's calculations, this amounts to a significant increase from 72 percent in 2021 and approximately 30 percent in 2020, respectively.Attackers have used various methods to hack and steal cryptocurrency from DeFi platforms, including initiating flash loans that trigger exploits in the platforms' smart contracts and exploiting signature verification flaws in their token bridge to withdraw all investments.The agency has also observed cybercriminals manipulating crypto price pairs by exploiting chains of vulnerabilities, including the DeFi platforms' use of a single price oracle and then conducting leveraged trades to bypass slippage checks.The FBI recommends investors take precautions before making an investment decision, such as to:In most incidents, the attackers rely on exploiting security vulnerabilities in their code or a security breach on the platform, allowing them to siphon cryptocurrency to addresses under their control.\"Investors should make their own investment decisions based on their financial objectives and financial resources and, if in any doubt, should seek advice from a licensed financial adviser.\""
   },
   {
      "time": "2022-08-30",
      "title": "FTC sues data broker for selling sensitive location info",
      "text": " Among the information it sells is precise geolocation information associated with a unique marketing ID that can be used to reveal visits to sensitive locations, such as places of worship and healthcare providers, according to the FTC. Such data can also be relatively easily tied back to an individual by observing patterns, such as regular sleep and work locations. “Where consumers seek out health care, receive counseling, or celebrate their faith is private information that shouldn’t be sold to the highest bidder,” Samuel Levine, Director of the FTC’s Bureau of Consumer Protection said in a press release announcing the suit, which was filed in the United States District Court for the District of Idaho. “The FTC is taking Kochava to court to protect people’s privacy and halt the sale of their sensitive geolocation information.”Kochava’s legal representation did not immediately respond to a request for comment about the suit. The company charges clients $25,000 for access to its location feed, and until recent months offered free samples, per the complaint. Andrea Peterson (they/them) is a longtime cybersecurity journalist who cut their teeth covering technology policy at ThinkProgress (RIP) and The Washington Post before doing deep-dive public records investigations at the Project on Government Oversight and American Oversight.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-30",
      "title": "Nelnet Servicing breach exposes data of 2.5M student loan accounts",
      "text": " Data for over 2.5 million individuals with student loans from Oklahoma Student Loan Authority (OSLA) and EdFinancial was exposed after hackers breached the systems of technology services provider Nelnet Servicing.Technology services from Nelnet Servicing, including a web portal, are used by OSLA and EdFinancial to give online access students taking out a loan access to their loan accounts.Sometime in June, unidentified intruders compromised Nelnet Servicing and stayed on  its systems until July 22. The hackers compromised the company's network likely after exploiting a vulnerability.About 2,501,324 individuals have been impacted by  the breach.Although Nelnet states it blocked the cyberattack as soon as the breach was detected, a subsequent investigation that was completed on August 17, 2022, determined that certain student loan account registration information might have been accessed.The exposed information includes the following:The letters clarify that no financial account numbers or any form of payment information were exposed due to the security incident.EdFinancial also underlines that not all its clients are hosted by Nelnet Servicing, so not all students that took a loan through them are impacted by the data breach.Threat actors with access to the aforementioned information may engage in phishing attacks, social engineering, impersonation, and various scamming schemes. As the topic of loans is particularly sensitive, the risk of exposure is amplified.Both EdFinancial and OSLA offer impacted individuals free access to a 24-month identity theft protection service through Experian, with instructions on how to enroll enclosed in the letters.“We encourage you to remain vigilant against incidents of identity theft and fraud over the next 24 months, by reviewing your account statements and monitoring your free credit reports for suspicious activity and to detect errors,” reads to notice sent to affected borrowers.It is recommended that recipients of the notices take immediate action to protect themselves from fraud by enrolling in Experian’s IdentityWorks service and remaining vigilant against all incoming communication.Monitoring bank account statements and requesting a credit report is also advisable. Finally, placing a credit freeze should be considered for high-risk cases. Instructions on how to do that are included in the distributed notices."
   },
   {
      "time": "2022-08-30",
      "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms | Threatpost",
      "text": " Share this article:Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.Targeted attacks on Twilio and Cloudflare employees are tied to a massive phishing campaign that resulted in 9,931 accounts at over 130 organizations being compromised. The campaigns are tied to focused abuse of identity and access management firm Okta, which gained the threat actors the 0ktapus moniker, by researchers.Impacted were 114 US-based firms, with additional victims of sprinkled across 68 additional countries.Roberto Martinez, senior threat intelligence analyst at Group-IB, said the scope of the attacks is still an unknown. “The 0ktapus campaign has been incredibly successful, and the full scale of it may not be known for some time,” he said.The 0ktapus attackers are believed to have begun their campaign by targeting telecommunications companies in hopes of winning access to potential targets’ phone numbers.While unsure exactly how threat actors obtained a list of phone numbers used in MFA-related attacks, one theory researchers posit is that 0ktapus attackers began their campaign targeting telecommunications companies.“[A]ccording to the compromised data analyzed by Group-IB, the threat actors started their attacks by targeting mobile operators and telecommunications companies and could have collected the numbers from those initial attacks,” researchers wrote.Next, attackers sent phishing links to targets via text messages. Those links led to webpages mimicking the Okta authentication page used by the target’s employer. Victims were then asked to submit Okta identity credentials in addition to a multi-factor authentication (MFA) codes employees used to secure their logins.In a possible related incident, within hours of Group-IB publishing its report late last week, the firm DoorDash revealed it was targeted in an attack with all the hallmarks of an 0ktapus-style attack.In the course of its campaign, the attacker compromised 5,441 MFA codes, Group-IB reported.“Security measures such as MFA can appear secure… but it is clear that attackers can overcome them with relatively simple tools,” researchers wrote.“This is yet another phishing attack showing how easy it is for adversaries to bypass supposedly secure multifactor authentication,” Roger Grimes, data-driven defense evangelist at KnowBe4, wrote in a statement via email. “It simply does no good to move users from easily phish-able passwords to easily phish-able MFA. It’s a lot of hard work, resources, time, and money, not to get any benefit.”“Whatever MFA someone uses,” Grimes advised, “the user should be taught about the common types of attacks that are committed against their form of MFA, how to recognize those attacks, and how to respond. We do the same when we tell users to pick passwords but don’t when we tell them to use supposedly more secure MFA.” Share this article:Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk. Separate fixes to macOS and iOS patch respective flaws in the kernel and WebKit that can allow threat actors to take over devices and are under attack.Infosec Insider content is written by a trusted community of Threatpost cybersecurity subject matter experts. Each contribution has a goal of bringing a unique voice to important cybersecurity topics. Content strives to be of the highest quality, objective and non-commercial.Sponsored Content is paid for by an advertiser. Sponsored content is written and edited by members of our sponsor community. This content creates an opportunity for a sponsor to provide insight and commentary from their point-of-view directly to the Threatpost audience. The Threatpost editorial team does not participate in the writing or editing of Sponsored Content."
   },
   {
      "time": "2022-08-30",
      "title": "Turkish malware used to infect machines in 11 countries through fake Google Translate links",
      "text": " Turkish-speaking hackers are spreading crypto-mining malware through free software download sites, including one offering a fake Google Translate desktop app, according to new research.Maya Horowitz, vice president of research at Check Point, said her team found a popular website offering imitations of PC applications, including Google Desktop, which include a cryptocurrency miner. The malware hijacks a device's processor and forces it to verify transactions of currency like Bitcoin.  “The malicious tools can be used by anyone. They can be found by a simple web search, downloaded from a link, and installation is a simple double-click. We know that the tools are built by a Turkish-speaking developer,” Horowitz said. “Currently, the threat we identified was unknowingly installing a cryptocurrency miner, which steals computer resources and leverages them for the attacker to monetize on.” As Horowitz explained, one of the links that leads to a download of the malware is easily found through Google when users search “Google Translate Desktop download.”The programs have a delayed mechanism that deploys the malware after several days or weeks while also deleting any trace of the original installation, which “allowed the campaign to successfully operate under the radar for years,” the report said. “The malware is first executed almost a month after the Nitrokod program was installed,\" researchers wrote. \"The infection chain continued after a long delay using a scheduled task mechanism, giving the attackers time to clear the evidence.” Once the malware is finally downloaded, it connects to a command and control server and starts mining for cryptocurrency. Horowitz added that the perpetrator can easily choose to alter the final payload of the attack, changing it from a crypto-miner to, say, a ransomware or banking Trojan. According to Check Point, the software developer Nitrokod has been active since 2019, offering popular applications that do not have official desktop versions. Many of Nitrokod's programs can be found on free software sites like Softpedia and Uptodown.One of the most popular programs on Nitrokod is the Google Translate desktop application. Google has never released a desktop application for Google Translate, which makes the corrupted Nitrokod version one of the first links that shows up. Check Point discovered that most of the programs on the platform are easily created using a Chromium-based tool that allows an application to be built directly from a web page, like Google Translate, thus saving Nitrokod authors from devoting time on building functional programs.Some of the programs have been downloaded more than 100,000 times. “What’s most interesting to me is the fact that the malicious software is so popular, yet went under the radar for so long,” she said. “We blocked the threat for Check Point customers, and are publishing this report so that others can be protected as well.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-08-30",
      "title": "Leading library services firm Baker & Taylor hit by ransomware",
      "text": " Baker & Taylor, which describes itself as the world's largest distributor of books to libraries worldwide, today confirmed it's still working on restoring systems after being hit by ransomware more than a week ago.\"As an update, the source of the disruption is a ransomware attack launched against our network over the weekend, which we have been working to remediate ever since,\" Baker & Taylor said in a statement.\"Cyber-attacks are an increasing threat to all companies, and unfortunately, we, like others fell victim to a hacker's attack. Our IT team and outside experts are working nonstop to restore our systems.\"\"We will continue to provide updates and look forward to returning to normal operations as quickly as possible.\"Currently, there is no information on what ransomware group or affiliate is behind the attack.Still, based on the company's statement that it's working on restoring affected servers, it's safe to say that Baker & Taylor will not pay the ransom demand.Baker & Taylor is a privately held company founded over 190 years ago and a leading library content and software supplier in the United States and around the globe.Based in Charlotte, North Carolina, it currently provides services to more than 5,000 public and academic libraries.A Baker & Taylor spokesperson was not immediately available for comment when contacted by BleepingComputer earlier today."
   },
   {
      "time": "2022-08-30",
      "title": "Pirate sites ban in Austria took down Cloudflare CDNs by mistake",
      "text": " Excessive and indiscriminate blocking is underway in Austria, with internet service providers (ISPs) complying to a court order to block pirate sites causing significant collateral damage.The problem arising from this measure is that the bans also extended to specific IP addresses belonging to Cloudflare servers that support many other sites that do not violate copyright laws.According to the same outlet, Cloudflare has confirmed the problem and has notified affected customers.At the moment, the list of banned addresses has been revised and the IPs listed above are no longer part of it.BleepingComputer has contacted both Cloudflare and the intellectual property protection firm for a comment on the matter, and we will update this story as soon as we receive a response.Meanwhile, tech-savvy Austrian users have found that using VPN tools helps circumvent the blocks, but this solution isn’t suitable for all users, and in most cases it comes with a price tag."
   },
   {
      "time": "2022-08-30",
      "title": "US govt sues Kochava for selling sensitive geolocation data",
      "text": " The U.S. Federal Trade Commission (FTC) announced today that it filed a lawsuit against Idaho-based location data broker Kochava for selling sensitive and precise geolocation data (in meters) collected from hundreds of millions of mobile devices.As the consumer protection watchdog said, Kochava's clients could use this data to identify and keep track of mobile users' movements to and from various locations such as reproductive health, mental care, and addiction recovery facilities or shelters for domestic violence survivors or the homeless.The company provides access to consumers' location data through a data feed its clients can access via online data marketplaces after paying for a $25,000 subscription (a free sample dataset was also available until June 2022, containing info collected over the previous seven days).The data broker also claimed that its location data feed \"delivers raw latitude/longitude data with volumes around 94B+ geo transactions per month, 125 million monthly active users, and 35 million daily active users, on average observing more than 90 daily transactions per device.\"\"In fact, the data broker has touted identifying households as one of the possible uses of its data in some marketing materials.\"The FTC's lawsuit seeks to halt Kochava's sale of sensitive geolocation data and require the company to delete the sensitive geolocation information it has collected.\"\"Where consumers seek out health care, receive counseling, or celebrate their faith is private information that shouldn't be sold to the highest bidder,\" added Samuel Levine, Director of the FTC's Bureau of Consumer Protection.\"The FTC is taking Kochava to court to protect people's privacy and halt the sale of their sensitive geolocation information.\"Update: Added more info on Kochava's lawsuit against the FTC."
   },
   {
      "time": "2022-08-30",
      "title": "Montenegro says Russian cyberattacks threaten key state functions",
      "text": " Members of the government in Montenegro are stating that the country is being hit with sophisticated and persistent cyberattacks that threaten the country’s essential infrastructure.Targets include electricity and water supply systems, transportation services, online portals that citizens use to access various state services, and more.Already, several power plants have switched to manual operations, while the state-managed IT infrastructure has been taken offline to contain the effect of the attacks.At the time of writing, the official website of the government of Montenegro is unreachable.Montenegro's Minister of Public Administration, Marash Dukaj, posted on Twitter on August 26 to warn about a new wave of organized cyberattacks against various state bodies.“Although certain services are currently temporarily disabled for security reasons, the security of the accounts of citizens and business entities and their data is not in any way endangered,” stated Dukaj (translated).In response to this situation, the U.S. Embassy in Montenegro has issued a security alert to warn American citizens in the country about the risks that arise from these cyberattacks.The attack may include disruptions to the public utility, transportation (including border crossings and airport), and telecommunication sectors.The embassy advises limited movement and travel, reviewing personal security plans, ensuring that all travel documents are valid, and monitoring local media for updates.The polarization problem in the country was also fueled by the current government’s decision to support sanctions on Russia, causing an outcry from some demographic groups and now even attacks from outside."
   },
   {
      "time": "2022-08-30",
      "title": "Malicious Plugins Found on 25,000 WordPress Websites: Study - SecurityWeek",
      "text": " Hi, what are you looking for?Researchers at Georgia Institute of Technology have identified malicious plugins on tens of thousands of WordPress websites.ByFlipboardRedditWhatsappWhatsappEmailIonut Arghire is an international correspondent for SecurityWeek.Subscribe to the SecurityWeek Email Briefing to stay informed on the latest threats, trends, and technology, along with insightful columns from industry experts.Join us as we delve into the transformative potential of AI, predictive ChatGPT-like tools and automation to detect and defend against cyberattacks.As cybersecurity breaches and incidents escalate, the cyber insurance ecosystem is undergoing rapid and transformational change. FlipboardRedditWhatsappWhatsappEmailThe changing nature of what we still generally call ransomware will continue through 2023, driven by three primary conditions.A recently disclosed vBulletin vulnerability, which had a zero-day status for roughly two days last week, was exploited in a hacker attack targeting the...The NSA and FBI warn that a Chinese state-sponsored APT called BlackTech is hacking into network edge devices and using firmware implants to silently...No one combatting cybercrime knows everything, but everyone in the battle has some intelligence to contribute to the larger knowledge base.Virtualization technology giant VMware on Tuesday shipped urgent updates to fix a trio of security problems in multiple software products, including a virtual machine...Unpatched and unprotected VMware ESXi servers worldwide have been targeted in a ransomware attack exploiting a vulnerability patched in 2021.The recent ransomware attack targeting Rackspace was conducted by a cybercrime group named Play using a new exploitation method, the cloud company revealed this...Threat actors are increasingly abusing Microsoft OneNote documents to deliver malware in both targeted and spray-and-pray campaigns.Got a confidential news tip? We want to hear from you.Reach a large audience of enterprise cybersecurity professionals Subscribe to the SecurityWeek Daily Briefing and get the latest content delivered to your inbox.Copyright © 2023 SecurityWeek ®, a Wired Business Media Publication. All Rights Reserved. \n\n"
   }
]