[
   {
      "time": "2022-11-21",
      "title": "QBot Phishing Exploits Windows Control Panel EXE to Infect Devices - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " DLL hijacking is an attack method used by threat actors to take advantage of the way Windows loads dynamic link libraries (DLLs). During the launch of a Windows executable, it will look for any DLL dependencies present in the Windows search path. The program would instead load a malicious DLL and infect the computer if a threat actor creates a malicious DLL with the same name as one of the program's necessary DLLs and retained it in the same folder as the executable. QBot, also known as Qakbot, is a Windows malware that was initially a banking trojan but later emerged as a full-featured malware dropper. The malware is also utilized by renowned ransomware gangs like Black Basta, Egregor, and Prolock in order to gain initial access to corporate networks. In July, security researcher ProxyLife found that threat actors were using the Windows 7 Calculator's DLL hijacking vulnerability, in order to spread the QBot malware. Meanwhile this week, ProxyLife reported that the threat actors have switched to utilizing a DLL hijacking flaw in the Windows10 Control Panel executable, namely control.exe. Abusing the Windows Control Panel:  In a phishing campaign witnessed by ProxyLife, the hackers used stolen reply- chain emails to distribute an HTML file attachment, which downloads a password-protected ZIP archive consisting an ISO file inside. The HTML file, named similar to 'RNP_[number]_[number].html, displays an image personating Google Drive and a password for a ZIP archive that is downloaded automatically. This ZIP archive consists of an ISO disk image that, when double-clicked will automatically be displayed in a new drive letter in Windows10 and later. This ISO file contains a Windows Shortcut (.LNK) file, a ‘control.exe’ (Windows 10 Control Panel) executable, and two DLL files named edputil.dll (used for DLL hijack) and msoffice32.dll (QBot malware). The Windows shortcut (.LNK) included in the ISO uses an icon that attempts to make it look like a genuine folder. The shortcut, however, opens the Windows 10 Control Panel executable, control.exe, which is kept in the ISO file, when a user tries to open this fabricated folder. The genuine edputil.dll DLL, which is placed in the C:WindowsSystem32 folder, will automatically be loaded when control.exe is opened. It does not, however, look for the DLL in specific folders and will load any DLL with the same name that is put in the same folder as the program control.exe. As the hackers are bundling a malicious edputil.dil DLL in the same folder as control.exe, instead the fraudulent DLL will be loaded by the users. Once the malicious edputil.dll DLL is loaded, it infects the device with the QBot malware (msoffice32.dll) using the regsvr32.exe msoffice32.dll command.Security software may not recognize QBot as malicious if it is installed using a trustworthy tool, such as the Windows 10 Control Panel, allowing the malware to avoid detection. QBot will now covertly run in the background, accessing and stealing emails to use them later for the phishing attacks and install additional payloads like Brute Ratel or Cobalt Strike, that are post-exploitations toolkits that hackers use to acquire remote access to corporate networks. This remote access further leads to corporate data theft and ransomware attacks.\n your nameYour Emailyour message"
   },
   {
      "time": "2022-11-21",
      "title": "New ransomware encrypts files, then steals your Discord account",
      "text": " The new 'AXLocker' ransomware family is not only encrypting victims' files and demanding a ransom payment but also stealing the Discord accounts of infected users.When a user logs into Discord with their credentials, the platform sends back a user authentication token saved on the computer. This token can then be used to log in as the user or to issue API requests that retrieve information about the associated account.Threat actors commonly attempt to steal these tokens because they enable them to take over accounts or, even worse, abuse them for further malicious attacks.As Discord has become the community of choice for NFT platforms and cryptocurrency groups, stealing a moderator token or other verified community member could allow threat actors to conduct scams and steal funds.As ransomware, there is nothing particularly sophisticated about the malware or the threat actors who use it.When executed, the ransomware will target certain file extensions and exclude specific folders, as shown in the image below.When encrypting a file, AXLocker uses the AES algorithm, but it does not append a filename extension on the encrypted files, so they appear with their normal names.Next, AXLocker sends a victim ID, system details, data stored in browsers, and Discord tokens to the threat actors' Discord channel using a webhook URL.To steal the Discord token, AxLocker will scan the following directories for and extract tokens using regular expressions:Eventually, victims are served a pop-up window containing the ransom note, informing them that their data was encrypted and how they contact the threat actor to purchase a decryptor.Victims are given 48 hours to contact the attackers with their victim ID, but the ransom amount isn't mentioned in the note.While this ransomware clearly targets consumers rather than the enterprise, it could still pose a significant threat to large communities.Therefore, if you find that AxLocker encrypted your computer, you should immediately change your Discord password, as it will invalidate the token stolen by the ransomware.While this may not help recover your files, it will prevent further compromise of your accounts, data, and the communities you are involved in."
   },
   {
      "time": "2022-11-21",
      "title": "Indian Government Publishes Draft of Digital Personal Data Protection Bill 2022",
      "text": " The Indian government on Friday released a draft version of the much-awaited data protection regulation, making it the fourth such effort since it was first proposed in July 2018.The draft is open for public consultation until December 17, 2022.India has over 760 million active internet users, necessitating that data generated and used by online platforms are subject to privacy rules to prevent abuse and increase accountability and trust.The legislation, in its current form, requires companies (i.e., data processors) to follow sufficient security safeguards to protect user information, alert users in the event of a data breach, and stop retaining users' data should individuals opt to delete their accounts.A failure to take steps to prevent data breaches can incur companies a financial penalty of up to ₹250 crores ($30.6 million). So does a failure on the part of entities to notify users of the breach, effectively taking the total fines to ₹500 crores ($61.3 million).Users of internet services, for their part, can request companies to share the categories of personal data that have been given out to other third parties, not to mention ask for their data to be erased or updated in cases where such information is deemed \"inaccurate or misleading.\"Furthermore, the draft imposes data minimization requirements as well as additional guardrails companies have to adopt in order to prevent unauthorized collection or processing of personal data.What's also notable is that the legislation no longer mandates data localization, allowing tech giants to transfer personal data outside of Indian geographical borders to specific countries and territories.Lastly, the new measure seeks to establish a Data Protection Board, a government-appointed body that will oversee the core of compliance efforts.That said, the central (aka federal) government is exempted from the provisions of the act \"in the interests of sovereignty and integrity of India, security of the State, friendly relations with foreign States, maintenance of public order or preventing incitement to any cognizable offense relating to any of these.\"These sweeping clauses, in the absence of any data protection mechanism, could grant the government broad powers and effectively facilitate mass surveillance.The latest development comes after a previous version of the law, introduced in December 2021, was rescinded in August 2022 following dozens of amendments and recommendations.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-21",
      "title": "Atlassian fixes critical command injection bug in Bitbucket Server",
      "text": " Atlassian has released updates to address critical-severity updates in its centralized identity management platform, Crowd Server and Data Center, and in Bitbucket Server and Data Center, the company's solution for Git repository management.Both security vulnerabilities received a severity rating of 9 out of 10 (calculated by Atlassian) and affect multiple versions of the products.Rated critical, the issue in Crowd Server and Data Center is tracked as CVE-2022-43782 and is a misconfiguration that allows an attacker to bypass password checks when authenticating as the Crowd app and to call privileged API endpoints.The issue was introduced in version 3.0 of the product and does not affect upgrades from previous versions, like 2.9.1.Atlassian explains that exploitation is possible under certain conditions. One of them is a changed Remote Address configuration to include an allowed IP address, a deviation from the default setting (none).The issue impacts Crowd versions 3.0.0 to 3.7.2, 4.0.0 to 4.4.3, and 5.0.0 to 5.0.2. Crowd 5.0.3 and 4.4.4 are not affected.Atlassian will not fix the flaw in version 3.0.0 of the product because it reached end of life and support.The security advisory provides detailed instructions for administrators to check if an instance has been compromised and the steps to follow in such cases.The flaw affecting Bitbucket Server and Data Center was introduced in version 7.0 of the product and is identified as CVE-2022-43781. It is a command injection vulnerability that lets an attacker with permission to control their username to gain code execution on the target system under certain conditions.All versions from 7.0 to 7.21 are affected regardless of their configuration as well as versions 8.0 through 8.4 where the \"mesh.enabled\" function is disabled under \"bitbucket.properties.\"CVE-2022-43781 does not affect instances running PostgreSQL and those hosted by Atlassian (accessed via a bitbucket.org domain).The versions that fix the problem are:Users unable to upgrade to the fixed versions should disable \"Public Signup\", which would require the attacker to authenticate using valid credentials, which reduces the risk of exploitation."
   },
   {
      "time": "2022-11-21",
      "title": "LodaRAT Malware Resurfaces with New Variants Employing Updated Functionalities",
      "text": " The LodaRAT malware has resurfaced with new variants that are being deployed in conjunction with other sophisticated malware, such as RedLine Stealer and Neshta.The latest findings from Cisco Talos documents the altered variants of LodaRAT that have been detected in the wild with updated functionality, chiefly enabling it to proliferate to every attached removable storage device and detect running antivirus processes.The revamped implementation is also considered ineffective in that it searches for an explicit list of 30 different process names associated with different cybersecurity vendors, meaning a solution that's not included in the search criteria will not be detected.Also included in this list are discontinued security software such as Prevx, ByteHero, and Norman Virus Control, suggesting that this may be an attempt on the part of the threat actor to flag systems or virtual machines running older versions of Windows.An analysis of the captured artifacts further reveals the removal of non-functional code and the use of string obfuscation using a more efficient method.\"Over the course of LodaRAT's lifetime, the implant has gone through numerous changes and continues to evolve,\" Neal said. \"While some of these changes appear to be purely for an increase in speed and efficiency, or reduction in file size, some changes make Loda a more capable malware.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2022-11-21",
      "title": "Phishing attacks targeting Middle East countries double ahead of World Cup: report",
      "text": " Many of the emails purport to come from the FIFA help desk or ticketing office while some impersonate specific team managers and departments. Others claim to be notifications about bans implemented by FIFA, or spoof Snoonu, the official food delivery partner of the World Cup. Trellix researchers said the campaigns leverage customized web pages that appeared very genuine and a variety of malwares were included in the attacks.The goals of the cyberattacks include financial fraud, credential harvesting, data exfiltration, surveillance, and damage to a country or organization’s reputation.Trellix provided a range of samples of the emails their researchers were seeing on a daily basis. One email impersonates David Firisua, the team manager for Auckland City FC, seeking confirmation of a payment made to FIFA. Many of the emails contain hyperlinks which take people to spoofed brand pages or phishing sites. Some of the emails pretend to be legal notices regarding unpaid fees to FIFA.John Fokker, Head of Threat Intelligence & Principal Engineer at Trellix, told The Record that they anticipate these attacks to continue through January 2023. “In this instance, we found the attention to the details incorporated into the malicious URLs and customized web pages to be notable, allowing cybercriminals to successfully impersonate league staff and team managers,” he explained. Trellix said the top five malware families it found targeting Middle Eastern countries right now included Qakbot, Emotet, Formbook, Remcos and QuadAgent.The goal of most of the malware strains is to steal confidential data or information, credentials or gain remote control of a device. Jeremy Fuchs, cybersecurity research analyst at Avanan, confirmed that they have also seen an influx of phishing emails related to the World Cup in a variety of different languages. \"One common thread is related to betting on the World Cup, trying to entice end-users to wager. Instead, the email and resulting link steals credentials,\" he said. Daniel Clemens, CEO of cybersecurity firm ShadowDragon, told The Record that the cyber threat of the World Cup is not much different than those associated with any global event, like the Olympics. “There is always a rise in phishing and activity related to these events. Holding the World Cup in Qatar has been a hot-button political issue since its announcement. The event offers more fodder and content for spammers and phishers,” he said.But he noted that there are several other threats facing those attending or watching the event, including overreach by the Qatar government through mandatory apps downloaded by attendees. “You wouldn’t give a stranger the keys to your house but phone apps can unknowingly harvest detailed, personal information about those who use them,” said Keeper Security CEO Darren Guccione.“It’s particularly concerning when a nation state is collecting unauthorized information through an app, or worse yet, remotely accessing a device.”Joseph Carson, chief security scientist and Advisory CISO at Delinea, told The Record that during all major events, such as the upcoming World Cup in Qatar, they always see a major increase in cybercrime targeting unsuspecting fans and followers. Many fake, fraudulent websites, apps or emails that appear official will come loaded with an abundance of scams and these scams can result in stealing the victims credentials, passwords, credit card information, infecting their computer or smartphone with malicious software or even ransomware, Carson explained. These can lead the unknowing victim to spread malware to family and friends, losing sensitive data or a major financial impact.  The report notes that large international sporting events are also attractive targets for financially motivated cybercriminals. “Tournament-related phishing attacks use various lures such as so-called ticket giveaways, free streaming services to watch games, fake betting websites, and tournament-adjacent items like visas and travel, hotel, and restaurant bookings,” the researchers said. “Other cybercriminal threats include, but are not limited to: fake mobile applications around the event that can distribute malware and harvest user data; sales on dark web markets and shops for counterfeit tickets and compromised credentials; and as above, ransomware attacks that would likely seek to opportunistically target victims based on accessibility, opportunity, and factors such as the ability to pay large ransom amounts.”Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2022-11-21",
      "title": "Researchers secretly helped decrypt Zeppelin ransomware for 2 years",
      "text": " Security researchers found vulnerabilities in the encryption mechanism of the Zeppelin ransomware and exploited them to create a working decryptor they used since 2020 to help victim companies recover files without paying the attackers.The developer of the decryption tool is Unit221b, a cybersecurity consulting company based in New Jersey, who had a technical report ready in February 2020 but delayed its publishing to keep the threat actor in the dark about the vulnerabilities in their file-encrypting malware.Unit221b was motivated to crack Zeppelin after seeing that the ransomware operators hit charity organizations, nonprofits, and even homeless shelters.The cybersecurity consulting firm spotted potentially exploitable flaws in Zeppelin after reading an analysis of the malware from Blackberry Cylance in December 2019.The researchers noticed that Zeppelin used an ephemeral RSA-512 key to encrypt the AES key that locked access to encrypted data.The AES key was stored in the footer of each encrypted file, so if the RSA-512 key was cracked, the files could be decrypted without paying the attacker.Unit221b found that this public key remained in the registry of the infected system for roughly five minutes after the data encryption completed.Retrieving the key was possible by doing registry carving on the raw file system, the registry.exe memory dumps, and directly on the NTUSER.Dat in the \"/User/[user_account]/\" directory.The resulting data is obfuscated with RC4, and after lifting that layer, Unit221b was left with one layer of RSA-2048 encryption.To overcome this final obstacle, Unit221b used a total of 800 central processing units (CPUs) in 20 servers, each with 40 CPUs, that factored smaller parts of the key.After six hours, the key had been cracked, and the analysts could work their way back to retrieve the AES key from the file footer.Unit221b’s founder Lance James told BleepingComputer they decided to make all details public due to the Zeppelin ransomware victim influx dropping significantly in the recent months.James said the decryption tool should work even for recent Zeppelin versions and is available to victims upon request.Callow also noted that data recovery experts have been exploiting Zeppelin’s encryption vulnerability since mid-2020.As for the possibility of Emsisoft releasing a public decryptor for the strain, the analyst told us the high cost of computing power to recover the keys does not make this a good candidate for a free tool that a company could use.Zeppelin (aka ‘Buran’) is a Delphi-based ransomware strain of Russian origin that emerged in the wild in late 2019 as a semi-private project operating in small-circle partnerships.The ransomware project extorted victims for an average of $50,000 and featured a robust AES-256-CBC encryption.This strange tactic created multiple victim IDs and files with multiple encryption layers, requiring several decryption keys and a lot of trial and error to restore the data even after paying the ransom."
   },
   {
      "time": "2022-11-21",
      "title": "US charges BEC suspects with targeting federal health care programs",
      "text": " The U.S. Department of Justice (DOJ) has charged ten defendants for their alleged involvement in business email compromise (BEC) schemes targeting numerous victims across the country, including U.S. federal funding programs like Medicare and Medicaid.In total, the losses resulting from their attacks amount to more than $11,1 million, stolen by tricking the victims into redirecting bank transfers into the fraudsters' accounts.To trick the targets into believing the payments were made to legitimate accounts, US DOJ says the attackers spoofed the email addresses of hospitals to request public and private health insurance programs to switch to new bank accounts (controlled by co-conspirators) to send payments for medical services.\"Unwittingly, five state Medicaid programs, two Medicare Administrative Contractors, and two private health insurers allegedly were deceived into making payments to the defendants and their co-conspirators instead of depositing the reimbursement payments into bank accounts belonging to the hospitals,\" DOJ said in a press release on Friday.\"The defendants and their co-conspirators allegedly laundered the proceeds fraudulently obtained from these health care benefit plans and from other victims by, among other things, withdrawing large amounts of cash, layering them through other accounts they or their co-conspirators opened in the names of false and stolen identities and shell companies, transferring them overseas, and purchasing luxury goods and exotic automobiles.\"US DOJ unsealed charges also linked to money laundering and wire fraud schemes against the defendants in multiple states:Their schemes allegedly caused more than $4.7 million in losses to Medicare, Medicaid, and U.S. private health insurers and over $6.4 million in losses to U.S. federal government agencies, private companies, and individuals.\"These subjects utilized complex financial schemes, such as BECs and money laundering, to defraud and undermine health care systems across the United States.\"Between June 2016 and July 2019, the FBI's Internet Crime Complaint Center received complaints regarding over 241,000 domestic and international incidents, with a total exposed dollar loss of more than $43.3 billion.While such crooks commonly target businesses, they also attack individuals if they consider the payout worth it. Unfortunately, as the FBI revealed, their success rate is also very high because they generally impersonate someone the target trusts, like business partners or company executives."
   },
   {
      "time": "2022-11-21",
      "title": "Cyberattack Targets US Hospital in Texas - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   }
]