[
   {
      "time": "2023-02-24",
      "title": "çææè·SideCopyç»ç»éå¯¹å°åº¦æ¿åºçAPTæ»å» - çæ",
      "text": " 2023-02-22      è¿æ¥ï¼çæå¨èææ¥å¹³å°æè·å°ä¸èµ·éå¯¹å°åº¦æ¿åºé¨é¨åèµ·çAPTæ»å»äºä»¶ï¼éè¿åæåç°æ­¤æ¬¡äºä»¶çæ»å»èçä¼¼SideCopyç»ç»ãè¯¥ç»ç»éè¿éé±¼é®ä»¶ç­æ¹å¼å°è¯±é¥µææ¡£åéç»åå®³èï¼å©ç¨ååµçè¿æ§æ¨é©¬ReverseRATæ¥è¾¾å°ä¿¡æ¯çªåãè¿ç¨æ§å¶çç®çãç®åï¼çæESMé²çæ¯ç»ç«¯å®å¨é²æ¤ç³»ç»å·²å¯æ£æµå¹¶æ¥æè¯¥ç±»è¿æ§æ¨é©¬ï¼å¹¿å¤§ç¨æ·å¯ä½¿ç¨è¯¥äº§åååçæ¯å±å®³ãçæå®å¨ä¸å®¶ä»ç»ï¼å¨æ­¤æ¬¡æ»å»äºä»¶ä¸­ï¼æªè·çè¯±é¥µææ¡£åä¸ºCyber Advisory 2023.docmï¼å¶ä¼ªè£æå®å¨æºææä¾ç»å°åº¦æ¿åºé¨é¨çå®å¨ç ç©¶æ¥åï¼æ¥åä¸»é¢ä¸ºãAndroidç³»ç»çå¨èåé¢é²æªæ½ãï¼ä»¥éé±¼é®ä»¶ç­æ¹å¼è¿è¡ä¼ æ­ï¼ç±äºéå¯¹æ¿åºé¨é¨ï¼åæ¶åå°å®å¨é¢åï¼å æ­¤æå·è¯±ææ§åéè½æ§ï¼è®©äººé¾ä»¥é²èãä¸æ¦æåå®³èç¹å»äºè¯¥ææ¡£ï¼å°±ä¼å¯å¨å¶ä¸­ååµçå®ä»£ç ï¼ä¸è½½å¹¶è¿è¡å­å¨äºè¿ç¨æå¡å¨ä¸çè¿æ§æ¨é©¬ãå¾ï¼è¯±é¥µææ¡£çæéè¿åæåç°ï¼è¯¥è¿æ§æ¨é©¬åä¸ºReverseRATï¼çä¼¼ç±å·´åºæ¯å¦çæ»å»èå¼åä½¿ç¨ï¼ä¸SideCopyç»ç»å·æéå¸¸å¯åçå³ç³»ï¼åæ¶å°æ¬æ¬¡æ»å»è¡å¨ææé¾ä¸SideCopyç»ç»è¿å¾ææé¾å¯¹æ¯åæï¼åç°ç¸ä¼¼åº¦æå¤§ï¼å æ­¤å¤å®æ­¤æ¬¡æ»å»è¡å¨çä¸»å¯¼èä¸ºSideCopyç»ç»ãå¾ï¼æ»å»æµç¨æ®æï¼SideCopyç»ç»çä¼¼æ¥èªäºå·´åºæ¯å¦ï¼è³å°ä»2019å¹´å°±å¼å§è¿è¡ç½ç»æ»å»æ´»å¨ï¼ä¸»è¦éå¯¹åäºå½å®¶ï¼ç¹å«æ¯å°åº¦åé¿å¯æ±çæ¿åºé¨é¨ãç±äºè¯¥ç»ç»çæ»å»æ¹å¼è¯å¾æ¨¡ä»¿SideWinderï¼çä¼¼æ¥èªå°åº¦çæ»å»ç»ç»ï¼ä¸­æååå°¾èï¼ç»ç»ï¼æå¾åSideCopyãç±äºAPTæ»å»æçéå¯¹æ§å¼ºãç»ç»ä¸¥å¯ãæç»­æ¶é´é¿ãé«éè½æ§åé´æ¥æ»å»çæ¾èç¹å¾ï¼ä¸ç®æ é½æ¯å·æéå¤§ä¿¡æ¯èµäº§ï¼å¦å½å®¶åäºãææ¥ãæç¥é¨é¨åå½±åå½è®¡æ°ççè¡ä¸ï¼å æ­¤å½åç¸å³æ¿åºæºæåä¼ä¸åä½å¡å¿è¦å¼èµ·éè§ï¼å å¼ºé²å¾¡æªæ½ï¼åå°ä»¥ä¸å ç¹ï¼ä¸æå¼æªç¥æ¥æºçå¯ççæä»¶åé®ä»¶ï¼é²æ­¢ç¤¾ä¼å·¥ç¨å­¦åéé±¼æ»å»ãç½å³å®å¨äº§åå¯å©ç¨å¨èææ¥è¿½æº¯å¨èè¡ä¸ºè½¨è¿¹ï¼å¸®å©ç¨æ·è¿è¡å¨èè¡ä¸ºåæãå®ä½å¨èæºåç®çï¼è¿½æº¯æ»å»çææ®µåè·¯å¾ï¼ä»æºå¤´è§£å³ç½ç»å¨èï¼æå¤§èå´ååç°è¢«æ»å»çèç¹ï¼å¸®å©ä¼ä¸æ´å¿«ååºåå¤çãææ¯è½¯ä»¶å¯æ¦æªæ¶æææ¡£åæ¨é©¬çæ¯ï¼å¦æç¨æ·ä¸å°å¿ä¸è½½äºæ¶ææä»¶ï¼ææ¯è½¯ä»¶å¯æ¦æªæ¥æï¼é»æ­¢çæ¯è¿è¡ï¼ä¿æ¤ç¨æ·çç»ç«¯å®å¨ãå¾ï¼çæESMé²çæ¯ç»ç«¯å®å¨é²æ¤ç³»ç»å¯æ¥æç¸åºè¿æ§æ¨é©¬è®¸å¤æ¶æè½¯ä»¶ç»å¸¸ä½¿ç¨å·²ç¥çç³»ç»æ¼æ´ãè½¯ä»¶æ¼æ´æ¥è¿è¡ä¼ æ­ï¼åæ¶å®è£è¡¥ä¸å°ææåå°æ¼æ´æ»å»å¸¦æ¥çå½±åã"
   },
   {
      "time": "2023-02-24",
      "title": "Russian covert influence operations have become ‘low-quality,’ says Meta",
      "text": " Since the beginning of the war in Ukraine, Russia’s covert influence operations on Facebook and Instagram have shied away from building convincing brands or personas, Meta announced on Thursday.Instead these operations are trying to escape the social media giant’s detection efforts by creating “a large number of low-quality accounts all at once, in the hope that at least a few might survive,” the company explained in its quarterly threat report.The activity has become less like “the stealthy and deceptive Russian influence operations we’ve disrupted in the past,” said the company, and now bears “a closer resemblance to a spammers’ playbook.”Meta said that the operators’ spam-like approach to influence operations was providing “low overall return on their activity.”The company said that the operations had a “uniquely aggressive persistence” suggesting that they “appeared to hastily respond to the state’s military actions with no time to build credibility and influence in promoting pro-Russia narratives” and “were likely paid to keep running these efforts … no matter how low the quality or impact of their work.”More traditional propaganda from Russian state-controlled media is on the wane, Meta’s threat report said, because those outlets have been banned from running ads and any posts that link to their content receive warning labels.Meta said this has had a “substantial drop” in the activity of these pages and people’s engagement with that content, despite “infrequent” attempts to evade the company’s bans and transparency requirements.“Although they are still active on our platforms, a number of Russian state-controlled media have shared posts urging followers to find them on other services instead,” the report said, suggesting the enforcement action is working.The company also said it took down 5,374 accounts and 12 groups on Facebook, as well as 100 accounts on Instagram, that were connected to a network operated by employees of the Serbian Progressive Party — the country’s ruling party — targeting domestic audiences.This network, which “ran across the internet and targeted social media services including Facebook, Instagram, Twitter, YouTube, in addition to local news media to create a perspective of widespread and authentic grassroots support for Serbian President Alexander Vučić.”It was unlike traditional troll farms, which operate in a single location or set of offices, and instead relied on individuals coordinating their efforts from across Serbia.The people behind the activity used fake accounts — some of which Meta said it detected and disabled automatically — to manipulate content by making it appear more popular than it really was, alongside posting original memes criticizing Serbian opposition figures.Meta said it was able to tie the operation to the Serbian Progressive Party, a group of employees known as its Internet Team, and state employees from around Serbia, following a tip from Twitter.The company’s threat report also announced the takedown of a network based in Cuba targeting people in that country as well as the Cuban diaspora abroad. The company’s investigation “found links to the Cuban government and its various entities,” Meta said.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-24",
      "title": "Pirated Final Cut Pro for macOS Offers Stealth Malware Delivery",
      "text": " People using pirated versions of Apple's Final Cut Pro video editing software may have gotten more than they bargained for when they downloaded the software from the many illicit torrents through which it is available.For the past several months at least, an unknown threat actor has used a pirated version of the macOS software to deliver the XMRig cryptocurrency mining tool on systems belonging to people who downloaded the app.Researchers from Jamf who recently spotted the operation have been unable to determine how many users might have installed the weaponized software on their system and currently have XMRig running on them, but the level of sharing of the software suggests it could be hundreds.Jaron Bradley, macOS detections expert at Jamf, says his company spotted over 400 seeders — or users who have the complete app — making it available via torrent to those who want it. The security vendor found that the individual who originally uploaded the weaponized version of Final Cut Pro for torrent sharing is someone with a multiyear track record of uploading pirated macOS software with the same cryptominer. Software in which the threat actor had previously sneaked the malware into includes pirated macOS versions of Logic Pro and Adobe Photoshop.\"Given the relatively high number of seeders and [the fact] that the malware author has been motivated enough to continuously update and upload the malware over the course of three and a half years, we suspect it has a fairly wide reach,\" Bradley says.\"The malware author never reaches out to a website located anywhere except within the i2p network,\" Bradley says. \"All attacker tooling is downloaded over the anonymous i2p network and mined currency is sent to the attackers' wallet over i2p as well.\"With the pirated version of Final Cut Pro that Jamf discovered, the threat actor had modified the main binary so when a user double clicks the application bundle the main executable is a malware dropper. The dropper is responsible for carrying out all further malicious activity on the system including launching the cryptominer in the background and then displaying the pirated application to the user, Bradley says.As noted, one of the most notable differences between the latest version of the malware and previous versions is its increased stealth — but this has been a pattern. The earliest version — bundled into pirated macOS software back in 2019 — was the least stealthy and mined cryptocurrency all the time whether the user was at the computer or not. This made it easy to spot. A later iteration of the malware got sneakier; it would only start mining cryptocurrency when the user opened a pirated software program. \"This made it harder for users to detect the malware's activity, but it would keep mining until the user logged out or restarted the computer. Additionally, the authors started using a technique called base 64 encoding to hide suspicious strings of code associated with the malware, making it harder for antivirus programs to detect,\" Bradley says.He tells Dark Reading that with the latest version, the malware changes the process name to look identical to system processes. \"This makes it difficult for the user to distinguish the malware processes from native ones when viewing a process listing using a command-line tool.One feature that has remained consistent through the different versions of the malware is its constant monitoring of the \"Activity Monitor\" application. Users can often open the app to troubleshoot problems with their computers and in doing so could end up detecting the malware. So, \"once the malware detects that the user has opened the Activity Monitor, it immediately stops all its processes to avoid detection.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-24",
      "title": "Microsoft urges Exchange admins to remove some antivirus exclusions",
      "text": " As the company explained, exclusions targeting the Temporary ASP.NET Files and Inetsrv folders and the PowerShell and w3wp processes are not required since they're no longer affecting stability or performance.However, admins should make a point out of scanning these locations and processes because they're often abused in attacks to deploy malware.\"We've validated that removing these processes and folders doesn't affect performance or stability when using Microsoft Defender on Exchange Server 2019 running the latest Exchange Server updates.\"You can also safely remove these exclusions from servers running Exchange Server 2016 and Exchange Server 2013 but you should monitor them and be ready to mitigate any issues that might come up.The list of folder and process exclusions that should be removed from file-level antivirus scanners includes:To defend against attacks using similar tactics, you should always keep your Exchange servers up to date, use anti-malware and security solutions, restrict access to IIS virtual directories, prioritize alerts, and regularly inspect config files and bin folders for suspicious files."
   },
   {
      "time": "2023-02-24",
      "title": "Clasiopa: New Group Targets Materials Research | Symantec Enterprise Blogs",
      "text": " A hitherto unknown attack group has been observed targeting a materials research organization in Asia. The group, which Symantec calls Clasiopa, is characterized by a distinct toolset, which includes one piece of custom malware (Backdoor.Atharvan). At present, there is no firm evidence on where Clasiopa is based or whom it acts on behalf.The infection vector used by Clasiopa is unknown, although there is some evidence to suggest that the attackers gain access through brute force attacks on public facing servers.Aside from the distinct toolset used, there were a number of attack hallmarks observed:There is some evidence to suggest that the attackers used two legitimate software packages. One compromised computer was running Agile DGS and Agile FD servers, software developed by Jiangsu. These packages are used for document security and protection in transit. Malicious files were dropped into a folder named “dgs” and one of the backdoors used was renamed from atharvan.exe to agile_update.exe. It is unclear if these software packages are being injected into or installed by the attackers.HCL Domino (formerly IBM Domino) was also run on a compromised machine in close proximity to the execution of backdoors, although it is unclear if this was a coincidence or not. However, both the Domino and Agile software appear to be using old certificates and the Agile servers use old vulnerable libraries.Atharvan is so-named because when the malware is run, it creates a mutex named: \"SAPTARISHI-ATHARVAN-101\" to ensure that only one copy is running.It will then contact a hardcoded C&C server. The hardcoded C&C addresses seen in one of the samples analyzed to date was for Amazon AWS South Korea (Seoul) region, which is not a common location for C&C infrastructure.The C&C communications are formatted as HTTP POST requests where the Host header is hardcoded as \"update.microsoft.com\", e.g.:POST /update.php HTTP/1.1User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/84.0.4147.105 Safari/537.36 Edg/84.0.522.52Host: update.microsoft.comContent-type: application/x-www-form-urlencodedContent-length: 46id=Atharvan&code=101&cid=H^[REDACTED]&time=5The request body includes the following parameters:When encrypting the \"msg\" value, the malware uses the following encryption algorithm:def encrypt(plaintext):    return bytes([((2 - byte) & 0xff) for byte in plaintext])The malware uses its own simplistic HTTP parser to extract the body from the server response. The extracted body is decrypted using the following algorithm:def decrypt(ciphertext):    return bytes([((2 - byte) & 0xff) for byte in ciphertext])When fetching commands, the malware expects the decrypted body to contain a sequence of strings separated by the \"\\x1A\" character.The first byte of each string specifies the command to execute and the remaining bytes are interpreted as command parameters.When configuring a communication schedule, the command parameters specify the times and days for the communication attempts. Several different times can be specified, with the hour and minute of the day encoded.The days are interpreted as:This scheduled communication configuration is another unusual feature of the malware and is not commonly seen in malware of this kind.In addition to this, one of the passwords used by the attackers for a ZIP archive was “iloveindea1998^_^”.While these details could suggest that the group is based in India, it is also quite likely that the information was planted as false flags, with the password in particular seeming to be an overly obvious clue.If an IOC is malicious and the file available to us, Symantec Endpoint products will detect and block that file.5b74b2176b8914b0c4e6215baab9e96d1e9a773803105cf50dac0427fac79c1b – Backdoor.Atharvan8aa6612c95c7cef49709596da43a0f8354f14d8c08128c4cb9b1f37e548f083b – Backdoor.Atharvan95f76a95adcfdd91cb626278006c164dcc46009f61f706426b135cdcfa9598e3 – Lilith940ab006769745b19de5e927d344c4a4f29cae08e716ee0b77115f5f2a2e3328 – Lilith38f0f2d658e09c57fc78698482f2f638843eb53412d860fb3a99bb6f51025b07 – Lilithc94c42177d4f9385b02684777a059660ea36ce6b070c2dba367bf8da484ee275 – Thumbsenderf93ddb2377e02b0673aac6d540a558f9e47e611ab6e345a39fd9b1ba9f37cd22 – Custom Proxy Tool3aae54592fe902be0ca1ab29afe5980be3f96888230d5842e93b3ca230f8d18d – Backdoor0550e1731a6aa2546683617bd33311326e7b511a52968d24648ea231da55b7e5 – Backdoor8023b2c1ad92e6c5fec308cfafae3710a5c47b1e3a732257b69c0acf37cb435b – Hacktool1569074db4680a9da6687fb79d33160a72d1e20f605e661cc679eaa7ab96a2cd – HacktoolThe Threat Hunter Team is a group of security experts within Symantec whose mission is to investigate targeted attacks, drive enhanced protection in Symantec products, and offer analysis that helps customers respond to attacks.We encourage you to share your thoughts on your favorite social platform."
   },
   {
      "time": "2023-02-24",
      "title": "Popular IBM file transfer tool vulnerable to cyberattacks, CISA says",
      "text": " The IBM Aspera Faspex file transfer tool used by dozens of large organizations and businesses has a serious bug that malicious hackers are actively exploiting, according to the Cybersecurity and Infrastructure Security Agency (CISA). The agency said the IBM vulnerability poses “significant risks to the federal enterprise.” CISA directs its alerts at the federal government, but they often apply widely to the private sector as well.For any company transferring large datasets — like genomics and biomedical research, media production, military signals intelligence, or financial services — Aspera was likely the go-to solution for many years, Broomhead explained. Broomhead added that the vulnerability is easy to exploit and allows a remote attacker to take actions on a system without having to get around network authentication processes.Nucleus Security’s Ryan Cribelar said the tool is used by large companies to transfer large files or large data sets quickly and securely over long distances. “It is used by all sorts of industries from finance to healthcare to government. It is a popular IBM product, so you can assume a large customer base purely from how long the product has been around, and the fact that shops usually use multiple IBM products if they are using one,” he said. The bug is enticing to attackers for at least two reasons, Cribelar said.\"It might live on a device that doesn't get as consistent scanning coverage as other devices, and the maintaining of the device — and who is responsible — could easily get lost over time as vulnerability management programs change in-house,\" he said. \"These two factors can allow for the vulnerability to have a longer lifetime on the device.\"Cribelar added that the vulnerable software is typically found in the outer perimeter of networks, making it a valuable portal for hackers to gain persistence in a victim's system without the likelihood of being discovered quickly. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-24",
      "title": "Hydrochasma Threat Group Bombards Targets With Slew of Commodity Malware, Tools",
      "text": " \"While Symantec researchers didn't observe data being exfiltrated from victim machines, some of the tools deployed by Hydrochasma do allow for remote access and could potentially be used to exfiltrate data,\" researchers wrote.Judging by its tools and tactics, the group's chief motive appears to be achieving persistent access to victim machines without being detected, \"as well as an effort to escalate privileges and spread laterally across victim networks,\" they noted.Indeed, the lack of custom malware lends itself to this motive, Brigid O Gorman, senior intelligence analyst with Symantec Threat Hunter team, tells Dark Reading.\"The group's reliance on living-off-the-land and publicly available tools is notable,\" she says. \"This may tell us a number of things about the group, including a desire to stay under the radar and make attribution of their activity more difficult.\"Researchers first were alerted to concerning activity on the victim's network when they noticed the presence of SoftEther VPN, a free, open source, and cross-platform VPN software often used by attackers.In this case, the first sign of suspicious activity that researchers found on victim machines was a lure document with a file name in the organization's native language that appeared to be an email attachment for a freight company \"product specification,\" they said. Researchers also found a lure that mimicked a resume for a \"development engineer.\"Once Hydrochasma gains access to a machine, attackers drop a Fast Reverse Proxy, a tool that can expose a local server protected by a network address translation (NAT) or firewall to the Internet. That in turn drops a legitimate Microsoft Edge update file. That's followed up by another file that's actually a publicly available tool called Meterpreter — which is part of the Metasploit framework — that can be used for remote access, researchers said.In fact, in the campaign that researchers observed, the group bombarded the victim organization with what seemed like everything but the kitchen sink in a flurry of publicly available tools aimed to guarantee its presence and persistence on the network.\"It is relatively unusual to see an attack group using only open source malware in an attack chain, so this did make Hydrochasma's activity stand out to us,\" O Gorman notes.Other tools being wielded by Hydrochasma in the attack included: Gogo scanning tool, an automated scanning engine; Process Dumper, which allows attackers to dump domain passwords; AlliN scanning tool, which can be used for lateral penetration of the intranet; and Fscan, a publicly available hacktool that can scan for open ports and more.Their assault on the victim network didn't stop there, however; additional tools that researchers observed being used in the attack included: Procdump, for monitoring an application for CPU spikes and generating crash dumps; BrowserGhost, which can grab passwords from a browser; the tunneling tool Gost proxy; Ntlmrelay for intercepting validated authentication requests to access network services; and HackBrowserData, an open source tool that can decrypt browser data.Symantec included both file and network indicators of compromise in its blog post to help organizations identify if they're being targeted by Hydrochasma.The extensive use of dual-use and living-off-the-land tools by the group highlights the need for organizations to have a comprehensive security solution to detect suspicious behavior on network machines, as well as stop malware, O Gorman says: \"Organizations should adopt a defense in-depth strategy, using multiple detection, protection, and hardening technologies to mitigate risk at each point of a potential attack chain,\" she tells Dark Reading. \"Organizations should also be aware of and monitor the use of dual-use tools inside their network.\"In general, Symantec also advises implementing proper audit and control of administrative account usage, as well as the creation of profiles of usage for admin tools, \"as many of these tools are used by attackers to move laterally undetected through a network,\" O Gorman adds.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-24",
      "title": "FTC: Americans lost $8.8 billion to fraud in 2022 after 30% surge",
      "text": " The U.S. Federal Trade Commission (FTC) revealed today that Americans lost almost $8.8 billion to various types of scams in 2022, following a significant surge of over 30% more lost to fraud compared to the previous year.In 2021, Americans also reported losses of more than $5.8 billion to fraud, another massive increase of over 70% compared to 2020.The FTC said on Thursday that 2.4 million consumers have reported losing money to scammers, most of them falling victim to imposter scams and online shopping scams throughout the last year.The top five fraud categories also include scam reports involving prizes, sweepstakes, and lotteries, investments, and business and job opportunities.\"The second highest reported loss amount came from imposter scams, with losses of $2.6 billion reported, up from $2.4 billion in 2021.\"​The FTC added 5.1 million consumer reports to its Consumer Sentinel Network (Sentinel) secure online database in 2022, with over 1.1 million reports of identity theft filed through the FTC's IdentityTheft.gov website.Unfortunately, these stats likely reflect just a fraction of the actual harm inflicted by romance scammers, given that most frauds are never reported.You can report fraud attempts at ReportFraud.ftc.gov and file an identity theft report at IdentityTheft.gov.Once included in the Sentinel database, your report will be available to roughly 2,800 federal, state, local, and international law enforcement professionals.Each report can help investigators find the fraudsters and make it easier to discover trends and educate the public."
   },
   {
      "time": "2023-02-24",
      "title": "Forsage DeFi platform founders indicted for $340 million scam",
      "text": " A Federal grand jury in the District of Oregon has indicted four Russian nationals founders of Forsage decentralized finance (DeFi) cryptocurrency investment platform for allegedly running a global Ponzi and pyramid scheme that raised $340 million.Forsage was promoted as a \"smart contract system\" that automatically distributes income to investors based on an algorithm, not requiring manual withdrawal requests.The project promised 100% transparency, complete decentralization, peer-to-peer transactions, no owner/admin, no chance of scams or sudden shutdown, and no company or third party involved.However, the reality couldn't be farther from that, as most Forsage investors soon found out that they were making no profit and, in many cases, lost all their investments.The defendants, Vladimir Okhotnikov, Olena Oblamska, Mikhail Sergeev, and Sergey Maskalov, face charges of running aggressive false advertisements on social media, pushing misleading investment and business opportunities related to Forsage to aspiring investors.Instead of a legitimate investment system, the defendants coded and deployed smart contracts on Forsage that essentially systematized a combination of Ponzi and pyramid schemes on the Ethereum, Binance Smart Chain, and Tron blockchains.Using blockchain forensic analysis, it was confirmed that over 80% of Forsage investors received less ETH than they had invested through Forsage. About half of all investors didn't get anything at all.Court documents show that the platform's founders used malicious code to direct large portions of the investor funds outside Forsage and into cryptocurrency wallets they controlled.This contradicted Forsage's promises to investors, including that \"100% of the income goes directly and transparently to the members of the project with zero risk.\"If the four defendants are found guilty of the alleged crimes, they face a maximum prison sentence of 20 years each.It is worth noting that Forsage’s website and social media channels are still online, claiming that the platform has distributed over $2.3 billion to over 2 million investors (Twitter data), or $1.5 billion to 2.7 million investors (website data)."
   },
   {
      "time": "2023-02-24",
      "title": "Ukraine says Russian hackers backdoored govt websites in 2021",
      "text": " The Computer Emergency Response Team of Ukraine (CERT-UA) says Russian state hackers have breached multiple government websites this week using backdoors planted as far back as December 2021. CERT-UA spotted the attacks after discovering a web shell on Thursday morning on one of the hacked websites that the threat actors (tracked as UAC-0056, Ember Bear, or Lorec53) used to install additional malware.This web shell was created in December 2021 and was used to deploy CredPump, HoaxPen, and HoaxApe backdoors one year ago, in February 2022, according to CERT-UA.The threat actors also used the GOST (Go Simple Tunnel) and the Ngrok tools during the early stages of their attack to deploy the HoaxPen backdoor.\"Presently, in the framework of the United Response Team under the National Cybersecurity Coordination Center, experts from the SSSCIP, the Security Service of Ukraine and the Cyber Police are working together to isolate and investigate the cyber incident.SSSCIP added that the incident had not caused \"essential system failures or disruptions\" that would affect the operation of Ukrainian public authorities.However, its operators are also suspected of orchestrating attacks against North American and Western European organizations."
   },
   {
      "time": "2023-02-24",
      "title": "Wiper Malware Surges Ahead, Spiking 53% in 3 Months",
      "text": " The increased use of disk wipers in cyberattacks that began with Russia's invasion of Ukraine early last year has continued unabated, and the malware has transformed into a potent threat for organizations in the region and elsewhere.Researchers at Fortinet recently analyzed attack data from the second half of 2022 and observed a startling 53% increase in threat actor use of disk wipers between the third and fourth quarters of the year. The trajectory suggests there will be no slowing down any time soon, the security vendor said.Russia-based advanced persistent threat (APT) groups — working in support of the country's military objectives in Ukraine — accounted for a lot of the initial surge in wiper use and continued activity last year. However, Fortinet's data shows that others, including financially motivated cybercriminals, hacktivist groups, and other individuals fueled the increase as well, especially toward the end of 2022.Leading up to last year, wiper activity tended to be almost nonexistent, according to Geri Revay, security researcher with Fortinet's FortiGuard Labs. But since the conflict between Russia and Ukraine started, threat actor use of the malware has exploded, he says. \"In 2022 alone we saw 16 different families targeted at 25 countries around the world,\" Revay says. \"In the second half of the year, we also started seeing a new breed of wipers, with some even open source and on GitHub, making it much more readily available for advanced persistent cybercrime campaigns,\" he says.Currently, the main motivation for the use of wiper malware appears to be focused around cyberwar and hacktivism, Revay says. But that doesn't mean threat actors won't use it in other ways, like using wipers to sabotage systems or to destroy evidence of a cybercrime.\"Most of the wiper attacks were targeting Ukrainian organizations in 2022, but that could easily have a spillover effect on other countries,\" Revay says. As an example, he points to one incident where an attack that targeted a Ukrainian satellite communication provider ended up taking 5,800 German wind turbines offline.In terms of how to prepare and how to respond to a wiper attack, \"it is very similar to a ransomware incident,\" Revay tells Dark Reading. \"If the ransom is not paid, which is the recommended approach, a ransomware can be also considered a wiper, because without the decryption key the encrypted data is as good as lost.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-23",
      "title": "Post-quantum algorithm vulnerable to side channel attacks, researchers | SC Media",
      "text": "  Such attacks avoid directly targeting a system or hardware’s defenses, instead leveraging traces of the physical signals they emit (such as supply current, execution time or electromagnetic emissions) to extract secrets.More recently, the advent of deep learning-based side channel analysis has made such attacks particularly relevant for breaking encryption systems and recovering secret keys. Apart from improving the effectiveness of some attacks, it has also allowed for attacks on true random number generators and physical unclonable functions, as well as non-differential message and secret key recovery attacks on post-quantum encryption algorithms. “Deep learning based side-channel attacks can overcome conventional countermeasures such as masking, shuffling, random delays insertion, constant-weight encoding, code polymorphism, and randomized clock,” wrote researchers Elena Dubrova, Kalle Ngo and Joel Gärtner.Encryption algorithms rely on a technique known as “masking” to prevent leakage of actionable emissions and defend against side channel attacks. Using a newly developed training method for neural networks, the researchers discovered a way to extract message bits for high-order masked implementations with the probability above 99%. They also developed a new message recovery method that manipulates ciphertexts to increase the leakage of message bits, improving the rate of message recovery and eventually extracting the algorithm’s secret key.There are different orders of complexity for this type of masking, and previous experiments have found a way to execute successful side channel attacks against algorithms with third-order masked software implementations. The method developed by KTH was successful in breaking CRYSTALS-Kyber using fifth-order implementations.“To the best of our knowledge, no side-channel attack on a higher than the third order masked implementation of any LWE/LWR PKE/KEM scheme has been demonstrated until now. The presented approach is not specific for CRYSTALS-Kyber and can potentially be applied to other LWE/LWR PKE/KEM schemes,” the authors wrote.CRYSTALS-Kyber is one of four post-quantum algorithms selected by NIST after a rigorous, multi-year vetting process to develop next generation encryption standards. While the other three are meant for digital signature and identity verification, CRYSTALS-Kyber is the only general purpose algorithm selected thus far.However, Dustin Moody, a mathematician in NIST’s computer security division, told SC Media that while the agency welcomes the new research, he does not believe it represents a fatal flaw in CRYSTALS-Kyber and said NIST currently has no plans to replace or deprioritize the algorithm.Often, encryption schemes can be tweaked or altered to account for a newly discovered flaw, or experts can develop countermeasures that prevent the kind of leakage that could be used in a side channel attack. Moody said that while “a side channel attack can fatally kill an algorithm, with this particular paper, we don’t feel it does that in any way.”“On this particular implementation of Kyber, we can use this [method] to break it under the circumstances in the experiment that they’re running. So it breaks a particular implementation that they’re working with, but it didn’t break the algorithm in general,” he said, later adding “It doesn’t say anything about the security of the algorithm itself. It didn’t exploit some flaw or design weakness to show that you’ll be able to attack it more generally.”Those thoughts were echoed by Ali El Kaafarani, CEO of PQShield, which makes and sells quantum-resistant technologies. The paper appears to highlight a valid side channel attack method, but not one necessarily specific to CRYSTALS-Kyber, and it doesn't unearth any new, fundamental weaknesses in the algorithm or its underlying mathematics.“It's important to understand the difference between an algorithm and its potentially many different implementations. Any algorithm can and will inevitably have many non-secure/broken implementations, this doesn’t mean that the algorithm itself is broken, otherwise people wouldn’t still be using RSA/ECC now,\" El Kaafarani said.Still, such adjustments do come with real tradeoffs. The algorithms selected by NIST were done in part based on their efficiency. Every new protection added to account for side channel leakage slows down its performance.“For CRYSTALS-Kyber…we asked the cryptographic community to do a lot of work here, and in the second and third rounds of our process, research seemed to show that to protect Kyber pretty well, it would be about twice as slow when you added on lots of countermeasures to protect it from side channel attacks,” said Moody.Derek is a senior editor and reporter at SC Media, where he has spent the past three years providing award-winning coverage of cybersecurity news across the public and private sectors. Prior to that, he was a senior reporter covering cybersecurity policy at Federal Computer Week. Derek has a bachelor’s degree in print journalism from Hofstra University in New York and a master’s degree in public policy from George Mason University in Virginia.The new PCI DSS standard puts more focus on application security, with more tools, testing and documentation required of developers.We need to develop our own talent, find ways to protect IP, and play the long game on AI against the Chinese and other tech adversaries – we can’t do it with EOs and more regulations. The Biden AI EO lacks depth – the industry needs to get more involved, and NIST must offer some strong guidance.On-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-23",
      "title": "New class of Apple bugs found in iOS, MacOS | SC Media",
      "text": "  New vulnerabilities in Apple’s macOS and iOS allow attackers to siphon a targeted user’s call history, calendar, address book and photos. The bugs signal bad news to Apple, according to researchers, who say they represent a new class of bugs within Apple’s security posture.The vulnerabilities “represent a significant breach of the security model of macOS and iOS, which relies on individual applications having fine-grained access to the subset of resources they need and querying higher privileged services to get anything else,” wrote Austin Emmitt, senior vulnerability researcherwith Trellix, in the report.In short, the “large new class of bugs” allow an attacker to “bypass code signing” protections that validate applications running on an iOS or macOS device are safe. Once bypassed, the un-signed code would not signal any red flag security warnings and execute — leading to escalation of privileges and sandbox escape conditions on both macOS and iOS devices. “Since the first version of iOS on the original iPhone, Apple has enforced careful restrictions on the software that can run on their mobile devices. Only applications that were cryptographically signed by a developer certificate trusted by Apple could be executed,” Emmitt wrote.These restrictions prevented malicious software from running on devices. What Trellix discovered were holes in Apple’s security approach that allows an attacker to run a malicious program, despite the code-signing requirements that identify the code’s origin, legitimacy and typically trustworthiness.The Apple vulnerabilities (CVE-2023-23531 and CVE-2023-23530) range in severity from medium to high, and are classified as privilege escalation bugs. While both bugs are serious, to exploit either vulnerability would require an adversary to already have compromised the targeted device. Apple issued patches for both with the release of its macOS 13.2 and iOS 16.3 software updates.The ForcedEntry bug was a two-stage attack. The first stage was sending the victim a PDF disguised as an image (GIF). The second stage abused Apple’s iOS sandbox component, allowing the code to “escape” and impact other system components.Trellix research focused on an Apple code filtering security tool for its sandbox called NSPredicate that was key to the ForceEntry attack chain. Emmitt said he examined the NSPredicateVisitor function, viewed as “Apple's primary mitigator of danger,” which led to the Trellix discovery. Despite an Apple patch to prevent the abuse of NSPredicate (in the context of Pegasus), Trellix found a way to bypass Apple’s mitigation efforts.As Patrick Wardle, creator of the Mac security website and tool suite Objective-See noted on Twitter, “Apple’s fixes [for the past FORCEDENTRY disclosure] were wholly useless.”The Trellix technical description of abusing weaknesses in Apple’s security approach center around Apple’s patch of NSPredicate.One example of the new class of bugs is tied to Apple’s use of a root-level process called CoreDuet, which collects data about behavior on the device. “An attacker with code execution in a process with the proper entitlements, such as Messages or Safari, can send a malicious NSPredicate and execute code with the privileges of this process,” Emmitt wrote.Additional flaws were found in OSLogService and an NSPredicate vulnerability in UIKitCore on the iPad, which could allow an attacker to access any app with no entitlements or read syslog data, respectively. In one scenario, an actor could set malicious scene activation rules to achieve code execution inside of SpringBoard and even wipe the device.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.Ukraine had experienced a less than a day-long power outage in October 2022 following an attack by Russian state-sponsored hacking operation Sandworm targeted at an electrical substation amid the ongoing Russia-Ukraine war, marking the first cyberattack-related power interruption in the country since 2017, CyberScoop reports.Attacks deployed by Iranian state-backed threat operation MuddyWater against Israel saw the utilization of the new MuddyC2Go command-and-control framework, which replaced the PhonyC2 custom platform following the exposure of its source code, reports The Hacker News.Israel had its technology, logistics, and transportation industries targeted by Iranian advanced persistent threat operation Charming Kitten, also known as APT35 and Imperial Kitten, last month amid its ongoing war with Palestinian militant group Hamas, according to The Record, a news site by cybersecurity firm Recorded Future.On-Demand EventOn-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-23",
      "title": "Dutch intelligence: Many cyberattacks by Russia are not yet public knowledge",
      "text": " Many of Russia’s cyber operations against Ukraine and NATO members during the past year have not yet become public knowledge, according to a joint report published this week by two Dutch intelligence services.The fact that “the pace of Russian cyber operations is fast” is a big factor, the report said. And the nature of many targeted institutions — such as military and diplomatic agencies — leads to secrecy about their vulnerabilities.“Before and during the war, Russian intelligence and security services engaged in widespread digital espionage, sabotage and influencing against Ukraine and NATO allies,” says the report, which describes the full-blown invasion of Ukraine a year ago this week as “a turning point in history.”Russia’s target selection has been “very broad” the agencies said, meaning that even Ukrainian organizations that are not playing a “direct role in the course of the war or political decision-making” are being hacked.The joint report relays the findings of the intelligence agencies — collected through “sensitive operations using human and technical resources” — about the threat posed by the Russian state conducting cyberattacks on various institutions, physical sabotage on maritime infrastructure, and information operations.Russian threat, Western responseThe impact of “continued Russian attack attempts” in cyberspace has been “limited” thanks to Ukrainian and Western digital defenses, the joint report said, adding that Russia has “found it difficult to synchronize cyber operations with other military operations, such as airstrikes.”The largest part of Russian cyber operations were espionage activities aimed at accessing “military, diplomatic and economic information from both Ukraine and NATO allies,” said the intelligence agencies. The targets include tactical intelligence, such as the locations of military equipment and personnel.NATO members who are providing military support to Ukraine also are common targets of Russian intelligence. The joint report said that the “Dutch armed forces, ministries and embassies have also been the target of (unsuccessful) cyber espionage attempts in the past year.”“Moscow regularly attempts to digitally sabotage Ukrainian vital infrastructure and carries out constant wiper malware attacks. The sustained and very high pressure that Russia exerts with this requires constant vigilance from Ukrainian and Western defenders,” said the joint report.Despite this, “large-scale disruption has so far failed to materialize and the impact of cyber sabotage is dwarfed by the impact of physical military operations.”“The potential of cyber operations cannot be fully exploited by Russia,” the intelligence agencies added, without providing too much of an explanation. But the report said “most Russian digital attack attempts are detected prematurely or remedied quickly, thanks to far-reaching Ukrainian monitoring, detection and response measures. Ukraine receives significant help from, for example, Western intelligence services and companies.”The two agencies warned that the Ukrainian defense was “not guaranteed” and “can probably only be sustained as long as Western support remains as intensive and adaptive as the cyber operations of the Russian intelligence services.”Physical sabotage threatThe Dutch infrastructure in the North Sea includes internet cables, gas pipelines and wind farms, which the intelligence agencies warned “can be vulnerable to sabotage,” the report said. Russian ships also have been covertly mapping the Netherlands’ maritime infrastructure “and undertaking activities that indicate espionage and preparatory acts for disruption and sabotage.”For example, a Russian ship was detected at an offshore windfarm, according to the MIVD's chief, Gen. Jan Swillens. Dutch coast guard ships escorted the vessel out of the North Sea, said Swillens, who added that the Russian reconnaissance of the North Sea energy system is something the MIVD hadn't seen before.The report did not mention the suspected sabotage of the Nord Stream 1 and Nord Stream 2 natural gas pipelines, which run through the Baltic Sea.However the agencies added it was “conceivable” that Russia could seek to cause a similar physical threat to “other vital sectors, such as drinking water and energy supply, is also conceivable, as long as such attacks can be carried out covertly.”Information operationsRussia’s intelligence services “have succeeded several times in temporarily taking control of Ukrainian media broadcasts and broadcasting Russian messages,” said the report. “Subsequently, the systems of these media were digitally sabotaged.”Other incidents, such as malware aimed at disrupting Ukraine’s power supply, “are probably mainly aimed at undermining Ukrainian morale” rather than achieving a military objective, the Dutch agencies said.“To hide their involvement in covertly spreading disinformation and propaganda through digital channels, Russian intelligence services employ many techniques they also use for cyber operations,” the intelligence services warned.They added that in the case of the information operations troops within the Russian military intelligence service (GRU), it was “even partly the same units that are responsible for both cyber operations and covert influence.”Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-23",
      "title": "Shipping companies, medical laboratories in Asia targeted in espionage campaign",
      "text": " Several shipping companies and medical laboratories in an unspecified Asian country have been targeted in an ongoing espionage campaign that began in October, according to researchers from from Symantec.The hackers behind the campaign — which the researchers named Hydrochasma — have no ties to any group Symantec has researched before. The company is not publicly identifying the target nation, Brigid O Gorman, senior intelligence analyst with the Symantec Threat Hunter Team, told The Record.The researchers do not know where Hydrochasma is based, but O Gorman said the group has specifically gone after companies related to COVID-19 treatments and vaccines. “The actors did not use any custom malware, relying exclusively and extensively on publicly available and living-off-the-land tools,” she said. Using those tactics \"can help make an attack stealthier, while also making attribution more difficult.\"In its report, Symantec explained that the most likely motivation behind the campaign is intelligence gathering and potentially data exfiltration. The initial infection likely began with a phishing email because researchers found two lure documents in a victim organization’s native language related to shipping information, as well as an engineering resume. From those malicious files on one machine, the hackers were able to deploy several tools that allowed them to move around the victim’s network and expose local servers so that they could be taken over. Researchers found dozens of tools on the network that allowed for scanning, data exfiltration, remote connections and more. “The tools deployed by Hydrochasma indicate a desire to achieve persistent and stealthy access to victim machines, as well as an effort to escalate privileges and spread laterally across victim networks,” the researchers said. “While Symantec researchers didn’t observe data being exfiltrated from victim machines, some of the tools deployed by Hydrochasma do allow for remote access and could potentially be used to exfiltrate data,\" the researchers said. \"The sectors targeted also point towards the motivation behind this attack being intelligence gathering.” Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-23",
      "title": "Scammers Mimic ChatGPT to Steal Business Credentials",
      "text": " Scammers are capitalizing on the runaway popularity of and interest in ChatGPT, the natural language processing AI — impersonating it in order to infect victims with a Trojan malware called Fobo, in order to steal login credentials for business accounts.According to the report, this blatant scam has already spread to Africa, the Americas, Asia, and Europe.The researchers at Kaspersky have observed grifters running social media accounts that either impersonate the OpenAI/ChatGPT brand directly or pretend to be communities for fans of the program.Sometimes, the accounts post neutral content relating to ChatGPT, with a malicious link at the bottom. Other times, according to the blog post, they post \"fake credentials for the pre-created accounts that are said to provide access to ChatGPT. To motivate potential users even further, the attackers say that each account already has US $50 on its balance, which can be spent on using the chatbot.\"The real program has an entirely optional subscription plan but is otherwise free to use for the general public.Unwitting social media users who follow the malicious links in these posts land on a ChatGPT homepage, which is like for like with the real thing in almost every way.Clicking the \"download\" button — suspicious in itself, as ChatGPT has no desktop client — triggers the installation of an executable file.\"If this archive is unpacked and the executable file run,\" according to Kaspersky researchers, \"then, depending on the version of Windows, the user sees either a message saying installation failed for some reason, or no message at all — at which point the process seems to end.\"Behind the scenes, however, a Trojan horse has been unleashed. The Trojan looks for login credentials for apps like Google, Facebook, and TikTok, stored in the victim's browser. But in particular, Kaspersky explained, it's looking for usernames and passwords for business accounts.With employee usernames and passwords, the attackers could possibly perform more significant follow-on attacks against enterprises.\"On finding a business account in one of these services,\" the researchers explained, \"it tries to get additional information, such as how much money was spent on advertising from the account and what its current balance is.\"To avoid engaging with a malicious fake, though, Kaspersky recommended avoiding \"offers\" like those from this story, utilizing security software, and not clicking on links — better to go through a search engine or type the URL straight into your browser.As of this writing, Kaspersky has not responded to a direct request for comment by Dark Reading. So, in substitute, we asked the ChatGPT bot to provide insight on the matter. It had this to say:\"In conclusion, the rise of hackers impersonating ChatGPT to steal login credentials is a serious threat that should not be underestimated. The implications of such attacks are far-reaching and potentially devastating for individuals, organizations, and even entire industries. As technology continues to evolve, we can expect these types of attacks to become more sophisticated and difficult to detect. It is, therefore, imperative that individuals and organizations take proactive measures to protect themselves, such as regularly changing passwords, enabling two-factor authentication, and staying vigilant for signs of phishing attacks. Only by working together and taking these steps can we hope to mitigate the risks posed by hackers impersonating ChatGPT and other forms of cybercrime in the future.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-23",
      "title": "New S1deload Stealer malware hijacks Youtube, Facebook accounts",
      "text": " An ongoing malware campaign targets YouTube and Facebook users, infecting their computers with a new information stealer that will hijack their social media accounts and use their devices to mine for cryptocurrency.Victims are tricked into infecting themselves using social engineering and comments on FaceBook pages that push archives with adult themes (e.g., AlbumGirlSexy.zip, HDSexyGirl.zip, SexyGirlAlbum.zip, and more).If the user downloads one of the linked archives, they will instead get an executable signed with a valid Western Digital digital signature and a malicious DLL (WDSync.dll) containing the final payload.​Once installed on victims' devices, S1deload Stealer can be instructed by its operators to perform one of several tasks after connecting to the command-and-control (C2) server.As Bitdefender discovered, it can download and run additional components, including a headless Chrome web browser that runs in the background and emulates human behavior to artificially boost view counts on YouTube videos and Facebook posts.On other systems, it can also deploy a stealer that decrypts and exfiltrates saved credentials and cookies from the victim's browser and the Login Data SQLite database or a cryptojacker that will mine BEAM cryptocurrency.If it manages to steal a Facebook account, the malware will also attempt to estimate its actual value by leveraging the Facebook Graph API to find out if the victim is the admin of a Facebook page or group, if it pays for ads, or is linked to a business manager account.\"The stealer component we observed in the wild steals the saved credentials from the victim's browser, exfiltrating them to the malware author's server,\" Ács added.\"The malware author uses the newly obtained credentials to spam on social media and infect more machines, creating a feedback loop.\"​To avoid getting infected and having your social media accounts hijacked, you should never run executables from unknown sources and always keep your anti-malware software up to date.Unlike S1deload Stealer, the Stealc malware is distributed via fake cracked software, a highly popular tactic also used to push other info stealers like Vidar, Redline, Raccoon, and Mars."
   },
   {
      "time": "2023-02-23",
      "title": "Hackers use fake ChatGPT apps to push Windows, Android malware",
      "text": " Threat actors are exploiting the popularity of OpenAI's ChatGPT chatbot to distribute malware for Windows and Android, or direct unsuspecting vitims to phishing pages.ChatGPT gained immense traction since its launch in November 2022, becoming the most rapidly growing consumer application in modern history with more then100 million users by January 2023.This massive popularity and rapid growth forced OpenAI to throttle the use of the tool and launched a $20/month paid tier (ChatGPT Plus) for individuals who want to use the chatbot with no availability restrictions.The move created conditions for threat actors to take advantage of the tool's popularity by promising uninterrupted and free-of-charge access to premium ChatGPT. The offers are false and the goal is to lure users into installing malware or to provide account credentials.Security researcher Dominic Alvieri was among the first to notice one such example using the domain \"chat-gpt-pc.online\" to infect visitors with the Redline info-stealing malware under the guise of a download for a ChatGPT Windows desktop client.That website was promoted by a Facebook page that used official ChatGPT logos to trick users into getting redirected to the malicious site.Cyble discovered \"chatgpt-go.online\" which distributes malware that steals clipboard contents and the Aurora stealer.Additionally, \"chat-gpt-pc[.]online\" delivered the Lumma stealer in Cyble's tests. Another domain, \"openai-pc-pro[.]online,\" drops an unknown malware family.In addition to the above, Cyble discovered a credit card stealing page at \"pay.chatgptftw.com\" that supposedly offers visitors a payment portal to purchase ChatGPT Plus.When it comes to fake apps, Cyble says it discovered over 50 malicious applications that use the ChatGPT's icon and a similar name, all of them being fake and attempting to harmful activities on users' devices.Two examples highlighted in the report are 'chatGPT1,' which is an SMS billing fraud app, and 'AI Photo,' which contains the Spynote malware, which can steal call logs, contact lists, SMS, and files from the device.ChatGPT is exclusively an online-based tool available only at \"chat.openai.com\" and does not offer any mobile or desktop apps for any operating systems at the moment.Any other apps or sites claiming to be ChatGPT are fakes attempting to scam or infect with malware and should be considered at least suspicious and users should avoid them."
   },
   {
      "time": "2023-02-23",
      "title": "Hackers now exploit critical Fortinet bug to backdoor servers",
      "text": " Threat actors are targeting Internet-exposed Fortinet appliances with exploits targeting CVE-2022-39952, an unauthenticated file path manipulation vulnerability in the FortiNAC webserver that can be abused for remote command execution.Fortinet disclosed the vulnerability in a security advisory on Thursday, saying the bug affects multiple versions of its FortiNAC network access control solution and allows attackers to execute unauthorized code or commands following successful exploitation.Since Fortinet has not provided mitigation guidance or workarounds, updating is the only way to thwart attack attempts.Attackers have already begun targeting unpatched FortiNAC appliances with CVE-2022-39952 exploits, as first discovered by security researchers at the Shadowserver Foundation on Tuesday.\"We are seeing Fortinet FortiNAC CVE-2022-39952 exploitation attempts from multiple IPs in our honeypot sensors,\" Shadowserver's Piotr Kijewski said.CronUp security researcher Germán Fernández revealed in a report that they're \"observing massive exploitation of Fortinet FortiNAC devices via the CVE-2022-39952 vulnerability.\"\"This vulnerability is critical and key in the Cybersecurity ecosystem, since in the first instance, it could allow initial access to the corporate network,\" Fernández said.Malicious activity observed while analyzing these ongoing attacks matches Horizon3's PoC exploit capabilities, with CronUp seeing threat actors using corn jobs to open reverse shells to attackers' IP addresses.Update February 23, 12:45 EST: According to CronUp, attackers have now started to also install fortii.jsp and shell.jsp web shells in the bsc/campusMgr/ui/ROOT/ folder on compromised FortiNAC devices."
   },
   {
      "time": "2023-02-23",
      "title": "Russia blames hackers as commercial radio stations broadcast fake air strike warnings",
      "text": " Commercial radio stations across Russia on Wednesday morning broadcast warnings about air raids and missile strikes. The Ministry of Emergency Situations said the broadcasts were the “result of a hacker attack.”A statement from the Ministry of Emergency Situations said: “This morning in some regions, listeners on the air of radio stations could hear an alarm signal and a text message asking them to go to the shelter.”The ministry said that as a result of the breach affecting the unnamed satellite, “an unauthorized tie-in is going on the air,” and stressed that the alarm signals “do not correspond to reality.” The statement did not mention Ukraine.Authorities in Russian districts had to issue public statements to deny the threat of a missile strike. The governments of the Belgorod and Voronezh regions said that they presumed that the attack was conducted “from the Ukrainian side.”The authorities in Voronezh described the incident as “a provocation of accomplices of the Kyiv regime and is not true. The situation in the region is under control and without incident.”Oleg Shakirov, a foreign policy researcher based in Moscow, has posted several videos to Twitter of the broadcast alert as initially shared by Telegram users.It is not known who is to blame for the incident. The Russian government has repeatedly attempted to emphasize the danger that the Russian state and people face as a result of what it calls the special operation in Ukraine.Last month several Pantsir-S1 mobile anti-aircraft systems were installed on the roofs of buildings in central Moscow, almost 1,000 km north of the frontlines in eastern Ukraine. Although there have been reports that Ukrainian forces have conducted operations against the Russian military inside of Russian territory, Ukraine does not possess weapons capable of striking Moscow.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-23",
      "title": "Attackers Use a Poisoned Google Search to Target Chinese-speaking Individuals - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " your nameYour Emailyour message"
   },
   {
      "time": "2023-02-22",
      "title": "Moldova, facing cyberattacks as part of alleged Russian coup plan, asks for Western support",
      "text": " Maia Sandu, the pro-European president of Moldova who last week warned of an active Russian plot to overthrow her country’s government, told the Munich Security Conference on Saturday that she needed a range of support from other European nations to defend the integrity of her state.President Sandu said Russia was “waging hybrid war against Moldova” including through “propaganda and disinformation” alongside “multiple cyberattacks” and “multiple false bomb alerts.” These actions are intended to undermine social cohesion, provoke protests and allow external saboteurs to launch a coup, she said.Speaking on a panel about “partnering up for European Security” — alongside NATO Secretary General Jens Stoltenberg, Finland’s President Sauli Niinisto, and Denmark’s Prime Minister Mette Frederiksen — Sandu described months of Russian aggressions against her country.“In the fall they tried to use the energy crisis, hoping that we’ll not be able to pay the very high prices for gas and electricity. When they saw that the government managed to find the money, Gazprom cut gas supply by 60% hoping that we will not find alternative sources, and that the paid protests would overthrow the legally elected government.”She further described these plans on Saturday by saying Russia “might try to bring people from outside the country to organize this violent protest and then to force the authorities into negotiations on snap parliamentary elections.”“All of this is meant to destabilize the society and to use the difficult economic situation that we face because of Russia’s war in Ukraine to bring people into the streets and then to change the government, and to bring a pro-Russian government that it could use also against Ukraine,” she said.Denmark’s Frederiksen praised the Moldovan leader: “Maia, you really are a brave European president. Moldova is a small, is a poor, and a fragile European country. You can be next in line, when we’re talking about Russia. And you’re standing up — you as a person — for democracy, rule of law, and anti-corruption.”President Sandu called on Frederiksen and his European peers to support Moldova in its time of crisis. “Because of the internal threats of the hybrid war, we need support to develop our strategic intelligence capabilities, to deal with cyberthreats, we need support to modernize our border security and control, we need support for special intervention focus capabilities.”“This is a very big issue… it’s probably now the most damaging element for our society and our democracy,” said Sandu.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-22",
      "title": "LockBit gang takes credit for attack on water utility in Portugal",
      "text": " Águas e Energia do Porto said on February 8 it had been hit with a cyberattack, with its security team able to limit the damage. Public water supply and sanitation were not affected by the attack. The LockBit group added the company to its leak site on February 18, according to cybersecurity expert Dominic Alvieri. LockBit gave the utility until March 7 to pay a ransom, threatening to publish stolen information from Águas e Energia do Porto systems if the deadline passed without payment.The utility is owned by the city and is one of the largest Portuguese water supply and wastewater sanitation companies, serving approximately half a million people.The company was still able to process customer requests at in-person service desks, and it urged people to get virtual service tickets that could be obtained instead of standing in line. Águas e Energia do Porto said it contacted both the Portuguese National Cybersecurity Center and the Judiciary Police for assistance with the situation. The utility did not respond to requests for comment about an update on the situation. In addition to managing the water supply and wastewater, the company drains Porto's rainwater, controls about 85 kilometers of water lines, manages the city's waterfront, and more.Water utilities are also frequent targets for ransomware gangs because of the personal customer information, financial data and residence information the companies typically hold. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-22",
      "title": "Activision confirms data breach exposing employee and game info",
      "text": " Activision has confirmed that it suffered a data breach in early December 2022 after hackers gained access to the company's internal systems by tricking an employee with an SMS phishing text.The video game maker says that the incident has not compromised game source code or player details.\"On December 4, 2022, our information security team swiftly addressed an SMS phishing attempt and quickly resolved it. Following a thorough investigation, we determined that no sensitive employee data, game code, or player data was accessed,\" a company spokesperson told BleepingComputer.However, security research group vx-underground says that the threat actor \"exfiltrated sensitive work place documents\" along with the content release schedule until November 17, 2023.Screenshots shared by the researchers show that the hackers had gained access to the Slack account of an Activision employee on December 2 and tried to trick other employees into clicking malicious links.Moreover, the publication claims that the hacked employee was from the Human Resources department and had access to swaths of sensitive employee details.Since the breach occurred in December 2022, some information obtained by Activision is likely to appear outdated now.BleepingComputer had no access to the leaked data but we learned that that the game information shared online was based on marketing materials and the development environment was not affected by the breach."
   },
   {
      "time": "2023-02-22",
      "title": "Researchers Create an AI Cyber Defender That Reacts to Attackers",
      "text": " Tech News and AnalysisA newly created artificial intelligence (AI) system based on deep reinforcement learning (DRL) can react to attackers in a simulated environment and block 95% of cyberattacks before they escalate.That's according to the researchers from the Department of Energy's Pacific Northwest National Laboratory (PNNL) who built an abstract simulation of the digital conflict between attackers and defenders in a network and trained four different DRL neural networks to maximize rewards based on preventing compromises and minimizing network disruption.The successful training of the AI system on the simplified attack environment demonstrates that defensive responses to attacks in real time could be handled by an AI model, says Samrat Chatterjee, a data scientist who presented the team's work at last week's annual meeting of the Association for the Advancement of Artificial Intelligence in Washington, DC.\"You don't want to move into more complex architectures if you cannot even show the promise of these techniques,\" he says. \"We wanted to first demonstrate that we can actually train a DRL successfully and show some good testing outcomes before moving forward.\"Yet creating an AI system capable of proactive defense continues to be an aspirational, rather than practical, goal. While a variety of hurdles remain for researchers, the PNNL research shows that an AI defender could be possible in the future.The goals of the attacker agents are to move through the seven steps of the attack chain, from initial access to execution, from persistence to command and control, and from collection to impact.For the attacker, adapting their tactics to the state of the environment and the defender's current actions can be complex, says PNNL's Chatterjee.\"The adversary has to navigate their way from an initial recon state all the way to some exfiltration or impact state,\" he says. \"We're not trying to create a kind of model to stop an adversary before they get inside the environment — we assume that the system is already compromised.\"The researchers used four approaches to neural networks based on reinforcement learning (RL), which is an ML approach that emulates the reward system of the human brain. A neural network learns by strengthening or weakening certain parameters for individual neurons to reward better solutions, as measured by a score indicating how well the system performs.RL essentially allows the computer to create a good, but not perfect, approach to the problem at hand, says Mahantesh Halappanavar, a PNNL researcher and an author of the paper.\"Without using any reinforcement learning, we could still do it, but it would be a really big problem that will not have enough time to actually come up with any good mechanism,\" he says. \"Our research ... gives us this mechanism where deep reinforcement learning is sort of mimicking some of the human behavior itself, to some extent, and it can explore this very vast space very efficiently.\"Among the many problems that remain to be solved is getting RL and deep neural networks to explain the factors that influenced their decisions — an area of research called explainable reinforcement learning (XRL).In addition, the robustness of the AI algorithms and finding efficient ways of training the neural networks are both problems that need to be solved, says PNNL's Chatterjee.\"Creating a product — that was not the main motivation for this research,\" he says. \"This was more about scientific experimentation and algorithmic discovery.\"Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-22",
      "title": "Coinbase Crypto Exchange Ensnared in 'Oktapus'-Related Smishing Attack",
      "text": " One of the employees who was targeted responded to an attacker's SMS and gave up credentials to the corporate system; the person then received a follow-up phone call attempting to gain access after initial attempts to log in were blocked by MFA security. Coinbase's Computer Security Incident Response Team (CSIRT) responded within 10 minutes of the attack to shut it down, preventing a far more serious incident, the company said.The situation once again demonstrates how human error remains a key factor in the success of cyberattacks, and the risk that increasingly sophisticated social engineering campaigns pose to the enterprise, Jeff Lunglhofer, Coinbase's CISO, noted in the blog post.While \"situations like this are never easy to talk about,\" Coinbase revealed and detailed the attack in the interest of transparency, as well as to help other organizations understand the potential risks from smishing in order to protect themselves from similar incidents, he said.\"They are embarrassing for the employee, they are frustrating for cybersecurity professionals, and they are frustrating for management,\" Lunglhofer wrote. \"But as a community we need to be more open about issues like this.\"Coinbase is a cryptocurrency exchange with more than 1,200 employees worldwide and more than 108 million verified users, making it an attractive target for financially motivated threat actors, Lunglhofer said.The recent attack occurred on Sunday, Feb. 5, when the mobile phones of several Coinbase employees received SMS messages indicating that they needed \"to urgently log in\" to their Coinbase accounts via a link \"to receive an important message,\" according to the post.While most of the targeted employees ignored the message, one didn't, clicking on the link and eventually providing threat actors with their username and password. Attackers then proceeded to log in to the Coinbase system using the legitimate employee credentials, but couldn't provide the correct MFA credentials and thus was blocked from access.Twenty minutes after the initial SMS message, the phone of the compromised employee rang. On the line was the attacker, claiming to be from Coinbase corporate IT and in need of the employee's help. The employee once again believed the request was legitimate and followed attacker instructions, logging in to the Coinbase system and responding to what became increasingly suspicious requests from the attacker.The employee's actions gave up \"some limited contact information\" for Coinbase employees — including names, email addresses, and some phone numbers — but did not expose any customer info or other sensitive data, nor did the attackers gain the ability to steal Coinbase crypto, the company said.Eventually, Coinbase's CSIRT intervened and reached out to the smishing victim to ask about unusual behavior and usage patterns associated with their account, and the employee terminated communication with the attacker, he wrote. CSIRT then suspended the employee's account access and launched an investigation.In this case, the cleanup after the attack was \"relatively quick,\" Lunglhofer said. However, the incident provides useful takeaways as to why sophisticated, socially engineered phishing attacks are still so successful even though they've been occurring since the emergence of the mainstream Internet, and the fact that there's broad awareness of them.One important point to note is that even the savviest cyber-aware person can be fooled by a clever, socially engineered attack because of humans' natural tendency to want to \"get along\" and \"be part of the team,\" Lunglhofer noted. \"Under the right circumstances nearly anyone can be a victim,\" he wrote.Coinbase provided a list of the attackers' tactics, techniques, and procedures (TTPs) to help enterprises prevent attacks or recognize suspicious login attempts on the corporate system. In particular, login attempts to corporate applications from third-party VPN services should be flagged as suspicious, as they may be using stolen credentials, cookies, or other session tokens, Lunglhofer observed.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-22",
      "title": "Israel's Top Tech University Targeted by DarkBit Ransomware",
      "text": " Israel's top technology school, Technion Israel Institute of Technology (IIT), is the victim of a ransomware attack by the DarkBit hacker group, which has demanded an 80-Bitcoin payout (around $1.7 million at press time) in a ransom note laden with anti-Israel sentiments.\"That might suggest DarkBit maintained the initial access to the victim's network sometime before that, while the implant was compiled a few hours before the attack materialized,\" says Dmitry Bestuzhev, a threat researcher at BlackBerry.BlackBit also warned IIT that if the organization did not pay the ransom within 48 hours, the amount would jump 30%.The extent of the damage, the origin of the breach, and the initial infection vector have not been publicly released.The Golang-based ransomware possesses several notable features, such as the ability to accept command-line arguments and function independently. Its default mode involves encrypting the victim's device by utilizing AES-256, impacting numerous file types. Additionally, it employs the method of multithreading to ensure quicker and more effective encryption.Bestuzhev tells Dark Reading that based on the ransom note, and threat actor's Twitter account and Telegram profile, the main motivator for the attack is geopolitical rather than financial.An additional motivator — revenge — was indicated through a DarkBit tweet and the text of the ransom note, which alludes to the possibility that a vengeful former tech employee may be leveraging insider knowledge of tooling and software to carry out the attacks.\"A kindly advice to the hight-tech [sic] companies: From now on, be more careful when you decide to fire your employees, specially [sic] the geek ones. #DarkBit,\" the tweet stated.Bestuzhev says that targeting a university creates noise, and since geopolitics is the agenda, the goal is to spread the message.\"With many students and associates who can't study and work, it serves as a message amplifier,\" he says. \"From the attacker's perspective, it's a great target to reach as many people as possible.\"Melissa Bischoping, director of endpoint security research at Tanium, agrees this attack touches on multiple motivations — political hacktivism, revenge, and financial gain.\"Whoever is behind DarkBit has included comments in their ransom notes about their stances on political regimes as well as comments regarding layoffs and terminations of technical employees,\" she says. \"It remains to be seen if this is an entirely new group or an offshoot of a previous gang.\"\"Ransomware operators are not concerned with remaining undetected,\" Bischoping says. \"In fact, it's quite the opposite — they want to send a message, cause damage, and get paid.\"She explains that universities can be popular targets because they often have understaffed IT departments and many endpoints to manage and secure, leaving multiple openings for a compromise.\"It wasn't a random attack, as DarkBit's social media as well as their ransom note indicate clear political stances and motives against the Israeli government and its associated organizations,\" she adds.Darren Guccione, CEO and co-founder at Keeper Security, says it's inadvisable to assume a threat actor’s only motivations behind a ransomware attack, or any other type of malware offensive, are the ones that seem obvious or are spelled out by the threat actors themselves.\"While ransomware is typically used to get paid, it could also be nothing more than a smoke screen or bonus payday as the threat actors work to compromise a target’s system or IT infrastructure in other ways,\" he says.\"No matter the threat actor’s apparent or true motivations behind this attack, a full investigation must be done to evaluate the scope of the cyberattack and remediate the damage,\" Guccione says.As with all ransomware attacks, he advises against paying the ransom to deter future attacks of a similar nature.\"Organizations should also consider implementing a zero-trust, zero-knowledge architecture to mitigate the damage of any future cyberattack,\" Guccione says.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-22",
      "title": "Ukrainian hackers claim disruption of Russian TV websites during Putin speech",
      "text": " At least two Russian media websites went down during a live broadcast of President Vladimir Putin's address to Russia's elite on Tuesday.The website of the Russian state-owned broadcaster VGTRK said it was down due to “technical works,” and the website of the live-streaming platform Smotrim was not loading at all. In a nearly two-hour speech delivered to the Russian parliament, state officials, military commanders and soldiers, Putin vowed to continue Russia’s yearlong war in Ukraine and accused the West of launching an economic war against Russia.The IT Army is a crowdsourced group of Ukrainian tech specialists founded in the early days of the war to conduct distributed denial-of-service attacks on Russian websites. DDoS incidents tend to disrupt websites but generally do not cause lasting damage.This is not the first time Russian state television has become a target of pro-Ukrainian hackers.Pro-Kremlin hackers are also following a similar playbook. In July, two radio stations owned by one of Ukraine’s largest broadcasters were hacked to spread fake messages that President Volodymyr Zelensky was hospitalized and in critical condition.In June, hackers attacked the Ukrainian streaming service Oll.tv and replaced the broadcast of a football match between Ukraine and Wales with Russian propaganda.Daryna Antoniuk\nis a freelance reporter for Recorded Future News based in Ukraine. She writes about cybersecurity startups, cyberattacks in Eastern Europe and the state of the cyberwar between Ukraine and Russia. She previously was a tech reporter for Forbes Ukraine. Her work has also been published at Sifted, The Kyiv Independent and The Kyiv Post.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-22",
      "title": "Civil liberties groups call for EU-wide ban on spyware",
      "text": " An association of civil liberties and human rights organizations across Europe has called for a European parliamentary inquiry to recommend that spyware is banned throughout the EU.“No safeguard can mitigate the human rights violations [spyware tools] entail. Therefore, we strongly encourage the PEGA Committee to call for a ban on spyware technologies,” the association argued.It also doesn’t have the same powers that most other parliaments provide to official inquiries, as it has complained. For instance, PEGA cannot compel witnesses to deliver evidence, as in other parliamentary systems, nor can it or its members bring a legislative motion to Parliament to change a law that has already been passed.However, EDRi said it believed PEGA must go farther than its recommendations and “must call for an EU-wide ban on spyware.”Sophie in ’t Veld, the Dutch MEP who served as the rapporteur, complained that no meaningful action was being taken by EU institutions to tackle the abuses highlighted in her report.A number of the controversial tools have been linked to state-sponsored killings and human rights abuses around the globe, despite the software developers’ claims that they are only used for law enforcement purposes.Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-22",
      "title": "Novel Spy Group Targets Telecoms in 'Precision-Targeted' Cyberattacks",
      "text": " A previously unknown threat actor is targeting telecommunications companies in the Middle East in what appears to be a cyber-espionage campaign similar to many that have hit telecom organizations in multiple countries in recent years.Researchers from SentinelOne who spotted the new campaign said they're tracking it as WIP26, a designation the company uses for activity it has not been able to attribute to any specific cyberattack group.\"The WIP26 activity is a relevant example of threat actors continuously innovating their TTPs [tactics, techniques and procedures] in an attempt to stay stealthy and circumvent defenses,\" the company said.The attacks that SentinelOne observed usually began with WhatsApp messages directed at specific individuals within target telecom companies in the Middle East. The messages contained a link to an archive file in Dropbox that purported to contain documents on poverty-related topics pertinent to the region. But in reality, it also included a malware loader. Users tricked into clicking on the link ended up having two backdoors installed on their devices. SentinelOne found one of them, tracked as CMD365, using a Microsoft 365 Mail client as its C2, and the second backdoor, dubbed CMDEmber, using a Google Firebase instance for the same purpose.The security vendor described WIP26 as using the backdoors to conduct reconnaissance, elevate privileges, deploy addition malware — and to steal the user's private browser data, information on high-value systems on the victim's network, and other data. SentinelOne assessed that a lot of the data that both backdoors have been collecting from victim systems and network suggest the attacker is prepping for a future attack. \"The initial intrusion vector we observed involved precision targeting,\" SentinelOne said. \"Further, the targeting of telecommunication providers in the Middle East suggests the motive behind this activity is espionage-related.\"More often though, cyberespionage and surveillance have been primary motivations for attacks on telecommunications providers. Security vendors have reported several campaigns where advanced persistent threat groups from countries like China, Turkey, and Iran have broken into a communication provider's network so they could spy on individuals and groups of interest to their respective governments.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-21",
      "title": "Interlab 인터랩 | Cyber Threat Report: RambleOn Android Malware",
      "text": " Author : Ovi Liber, Threat Researcher @ InterlabPublishing Date : 2022/12/30Freedom of media and journalism is essential to enable democratic, free, and participative societies. However, as cyberthreats with political motivation targeting journalists grows while nature of journalists’ work involves in receiving and opening random files and links in the name of receiving tips from unknown sources, the importance of digital safety for journalists are ever imminent.On December 7th, a journalist received a message over WeChat messenger application asking to talk privately about a sensitive topic. The both parties discuss messaging over a secure application and the sender suggests talking over an application called “Fizzle messenger” and proceeds to send a copy of the APK to lure a journalist to install. The application “Fizzle messenger” acts as a first stage of the malware, a loader, performing various checks on the Android device to serve a payload. The served payload that provides malicious methods that can be called from a C2, exfiltrates sensitive data to cloud storage and downloads a secondary payload. The secondary payload exfiltrates further data, registers services for continual exfiltration and provides C2 mechanisms via Google’s Firebase Cloud Messaging.This threat report contains a breakdown of the functionality of this malware and we have shared sample hashes at the end of the report. The malware has multiple stages, payloads and exfiltrates data from the Android device continually. Below, we describe in simple steps how the malware executes and compromises its victims.  Figure 1 Diagram of malware flowAs discussed in the introduction, the victim received a direct message over WeChat. The message relates to the sender discussing potential sensitive information and both parties discuss communicating over a more secure messaging app. The original sender, suggests to talk on an application called “Fizzle”, proceeding to send a copy of the file with the filename “1_Fizzle.apk” and suggests the victim to install the application. At the time of writing, the application was only determined as malicious by one vendor, however this only flagged for a PUA signature. Figure 1 VirusTotal scan results of Fizzle messaging appThe application itself works functionally as a messaging app, prompting the user to create an account link from another device..Figure 2 Screenshot of the Fizzle Application home pageUpon initial inspection of the application, we can first see that it has many permissions in its manifest that are dangerous in certain contexts. However, since this application is a messaging application, all of these permissions could be deemed as something necessary for its functionality. Many of these permissions can be seen in widely used legitimate messaging applications. Due to this, a user may not think this application is malicious.Figure 3 Fizzle messaging app permissionsWhen the application runs, the process itself spawns as “ch.seme”; during analysis, we identified one file that contained payload delivery functionality. Located at “ch.seme.services.LogUService”, the class contains dynamic Dex class loading via module “dalvik.system.DexClassLoader”. The malicious app uses the “DexClassLoader” to dynamically load a Dex file from a cloud storage endpoint (either pCloud or Yandex) and execute. The application loads the Dex, which has a process name “com.personal.info” and class name “plugin”.Figure 4 Screenshot of ch.seme.LogUService’s usage of DexClassLoaderThe “LogUService” class contains multiple methods that provide capability to download the first payload from one of two endpoints located at cloud storage services, pCloud and Yandex. These cloud storage services are called via OAuth API calls using hard coded access tokens within the application. Figure 5 Screenshot of the ch.seme.services.LogUService’s openConnection() usage to download the first stage payloadDepending on what configuration options are set in the “ch.seme.services.Constants.cloud” variable, the method determines which endpoint is used to serve the payload to the victim. If the variable is set to “P”, the class uses the pCloud endpoint, if not, it uses Yandex.Figure 6 Screenshot of the ch.seme.services.LogUService cloud storage if statementThe “LogUService” described is launched during application load through “onStart()” within the “HomeActivity” class. Figure 7 Screenshot of service launch within ch.seme.client.HomeActivityThe service is also checked for when the application is resumed by the user.Figure 8 Screenshot of the onResume() method within ch.seme.client.HomeActivityThis usage of “DexClassLoader” to dynamically load a Dex file “com.personal.info” from one of two cloud storage endpoints, provides the application functionality to execute first payload on the victim’s device. When the “LogUService” service is launched, the Dex file downloaded from either pCloud or Yandex, to the directory “/data/user/0/ch.seme/files/.temp/”. During our analysis, we were served the payload described below; for simplicity, we have categorised its functionality in the table shown. However, it should be noted that in our sample analysed, not all of this functionality was being used by the payload, as there are many methods that appear to be unutilised.The first payload’s primary functionality sits within the class located at “com.personal.info.plugin”. Figure 9 Class structure of first payloadThis “plugin” class, contains various methods that can be called by the C2 and data uploaded back to the cloud storage account:However, the primary function of the payload is to provide functions to be called by the C2 and for the initial loader to call “LogState”. When “LogState” is called by the loader, this calls “updateState”, which then runs a method named “UpdateCmd()”. This method, downloads the second payload, which we will cover in the next section, titled ‘Stage 3: The second payload & C2 client – com.data.WeCoin’.Figure 10 Screenshot of both LogState and UpdateState methods within the first payloadIt then calls the method “sendData”, which exfiltrates messaging data from the phone, encrypts the files and uploads back to the cloud storage C2s. Figure 11 Screenshot of sendData exfiltration function within first payloadTo command and control the first two stages of the malware, the operators of RambleOn use authentication tokens to both pCloud and Yandex cloud service providers. In the sample we analysed, the malware was using pCloud. When the loader application starts, the application registers the device for Pushy.me notifications using the Android SDK. Then proceeding to run the “LogUService”, which downloads the first payload from pCloud or Yandex. It then writes the Dex file to the following directory and filename: /data/user/0/ch.seme/files/.temp/plugin4.0.dex. The “LogUService” then uses the DexClassLoader to load the Dex file class “plugin” and execute method “LogState”.Figure 12 Screenshot of LogUService DexClassLoader utilisationThis method, contained within the first payload, proceeds to gather information about the device, exfiltrate all SMS, MMS, call logs, audio and media and then finally calls “sendToServer()” method to upload files back to the cloud storage service. Figure 13 Screenshot of sendToServer() method contained within first payloadTo receive commands to initiate payload delivery. The registration of the device to Pushy.me allows push message to be sent to the device, much like Firebase Cloud Messaging. Figure 14 Screenshot of the RegisterForPushNotificationsAsync method called on application startWe see that the “com.seme.services.PushReceiver” is set with intent filter designated for the  Pushy.me notifications, in addition to the “LogUService” class. Providing the class with file receiver functionality. Figure 15 Screenshot of Application Manifest file showing application file receiversIt is within the “PushReceiver” class, upon receiving a push message, the Default Shared Preferences XML file is modified with content relevant to the cloud storage C2 mechanism. It then proceeds to initialise the “LogUService” service, loading the payload and calling the method within the payload required by the operator. Figure 16 Screenshot of PushReceiver classAs shown in the relevant examples throughout this report, the running of the “LogUService” ensures the application will periodically reach out to the cloud provider to download the first payload. Figure 17 Screenshot of Burp Suite network proxy traffic from the applicationThis is also ensured by the “LogJobService” class being ran as a service by the application.Figure 18 Screenshot of Application Manifest showing service ch.seme.services.LogJobServiceThe class ensures the “LogUService” continually runs in order to keep consistent communication & data exfiltration back to the command-and-control cloud service. Figure 19 Screenshot of ch.seme.services.LogJobServiceAs explained in the previous section. The initial loader, in this case, the “Fizzle” application, calls “LogState” within the first payload Dex file. The “LogState” method calls “updateState”, which then calls a method named “UpdateCmd()”. The method, again reaches out to the cloud storage accounts via OAuth API and pulls a second payload down to the device using access tokens. This second payload, is an APK that gets installed to the device named “com.data.WeCoin”. Figure 20 Screenshot of first payload initiating the second payloadThis method, then proceeds to load the APK’s service which include additional C2 functionally back to the operator. This APK provides C2 functionality to interact with the first payload Dex file. In order for it to function correctly, the method checks that it can still access the Dex file. If it isn’t there, it will redownload the payload. Figure 21 updateCmd() function second payload service runs & payload checksFigure 22 Screenshot of the MyFirebaseMessagingService class implementationThe payload itself then registers many services contained within the APK which perform DexClassLoading operations to the secondary payload stored on the device. These services can then be run continuously via the C2. These include: Figure 23 Services contained in the second payloadBelow, provides an example of the “sendJobService” class which allows the C2 to trigger a data exfiltration event. Figure 24 Screenshot of sendJobService class contained in the second payloadOver the last year, Interlab has been working with human rights activists and journalists to document and index digital threats. Building a database of these threats, allow us to provide correlation between events based on categorised elements within each individual attack. To support this, we use the Diamond model to facilitate correlations for attribution. The diamond model relies upon indexing elements of an attack based on four categories: Adversary attributes (source email, handles, phone numbers, network assets etc), infrastructure (IP addresses, domain names, email addresses etc), victimology (modus operandi, targeted individual or organisational, personas, network assets, email addresses etc), capabilities (malware, exploits, hack tools, stolen certificates etc).During our analysis of RambleOn, we found very little data points within our dataset that support clear and direct attribution for this event. However, there are multiple aspects that should be noted that can enrich further attribution in the future: We believe that raising these points allows for a pragmatic approach to the potentiality of attribution by other researchers going forward.  Interlab is a non-profit organization based in Seoul with mission to create resilient digital safety net for freedom of citizens, providing free digital security consultations, trainings, incident response support and research of cyber threat toward civic society.For any inquiries regarding on this report, please reach us through contact@interlab.or.krInterlab, Nonprofit Association\n(Korean Identification Number : 603-82-75631)G407, 115, Wangsimni-ro, Seongdong-gu, Seoul, Republic of Koreacontact@interlab.or.kr"
   },
   {
      "time": "2023-02-21",
      "title": "Earth Kitsune Delivers New WhiskerSpy Backdoor via Watering Hole Attack",
      "text": " BusinessImprove your risk posture with attack surface managementSecurity that enables business outcomesGain visibility and meet business needs with securityConnect with confidence from anywhere, on any deviceSecure users and key operations throughout your environmentMove faster than your adversaries with powerful purpose-built XDR, attack surface risk management, and zero trust capabilitiesMaximize effectiveness with proactive risk reduction and managed servicesUnderstand your attack surface, assess your risk in real time, and adjust policies across network, workloads, and devices from a single consoleDrive business value with measurable cybersecurity outcomesSee more, act fasterEvolve your security to mitigate threats quickly and effectivelyEnsure code runs only as intendedGain visibility and control with security designed for cloud environmentsProtect patient data, devices, and networks while meeting regulationsProtecting your factory environments – from traditional devices to state-of-the-art infrastructuresICS/OT Security for the oil and gas utility industryICS/OT Security for the electric utilityBridge threat protection and cyber risk managementOperationalize a zero trust strategyStop adversaries faster with a broader perspective and better context to hunt, detect, investigate, and respond to threats from a single platformDefend the endpoint through every stage of an attackOptimized prevention, detection, and response for endpoints, servers, and cloud workloadsThe most trusted cloud security platform for developers, security teams, and businessesLeverage complete visibility and rapid remediationSimplify security for your cloud-native applications with advanced container image scanning, policy-based admission control, and container runtime protectionSecurity for cloud file/object storage services leveraging cloud-native application architecturesAdvanced cloud-native network security detection, protection, and cyber threat disruption for your single and multi-cloud environments.Visibility and monitoring of open source vulnerabilities for SecOpsAs your organization continues to move data and apps to the cloud and transform your IT infrastructure, mitigating risk without slowing down the business is critical.Expand the power of XDR with network detection and responseProtect against known, unknown, and undisclosed vulnerabilities in your networkDetect and respond to targeted attacks moving inbound, outbound, and laterallyRedefine trust and secure digital transformation with continuous risk assessmentsStop phishing, malware, ransomware, fraud, and targeted attacks from infiltrating your enterpriseOn-premises and cloud protection against malware, malicious applications, and other mobile threatsKeep ahead of the latest threats and protect your critical data with ongoing threat prevention and analysisStop threats with comprehensive, set-it-and-forget-it protectionAugment security teams with 24/7/365 managed detection, response, and supportAugment threat detection with expertly managed detection and response (MDR) for email, endpoints, servers, cloud workloads, and networksOur trusted experts are on call whether you're experiencing a breach or looking to proactively improve your IR plansStop breaches with the best response and detection technology on the market and reduce clients’ downtime and claim costsGrow your business and protect your customers with the best-in-class complete, multilayered securityDeliver modern security operations services with our industry-leading XDRPartner with a leading expert in cybersecurity, leverage proven solutions designed for MSPsAdd market-leading security to your cloud service offerings – no matter which platform you useIncrease revenue with industry-leading securityDiscover the possibilitiesWe work with the best to help you optimize performance and valueContent has been added to your FolioAPT & Targeted AttacksWe discovered a new backdoor which we have attributed to the advanced persistent threat actor known as Earth Kitsune, which we have covered before. Since 2019, Earth Kitsune has been distributing variants of self-developed backdoors to targets, primarily individuals who are interested in North Korea.By: Joseph C Chen, Jaromir Horejsi\n\t\t\n\t\t\tFebruary 17, 2023\nRead time:  ( words)\n\tSave to FolioAt the end of 2022, we discovered that the website of a pro-North Korean organization was compromised and modified to distribute malware. When a targeted visitor tries to watch videos on the website, a malicious script injected by the attacker displays a message prompt notifying the victims with a video codec error to entice them to download and install a trojanized codec installer. The installer was patched to load a previously unseen backdoor, that we dubbed “WhiskerSpy.” In addition, we also found the threat actor adopting an interesting persistence technique that abuses Google Chrome’s native messaging host.In this blog post, we are going to reveal the infection chain and technical details of the WhiskerSpy backdoor employed by Earth Kitsune.At the end of 2022, we noticed that a pro-North Korean website had a malicious script injected in their video pages. The script showed a popup window with a fake error message, designed to entice victims to install a malicious package disguised as an Advanced Video Codec - AVC1.The webpages were configured to deliver the malicious script only to visitors from a list of targeted IP addresses (visitors that did not have these IP addresses would not receive the malicious payload). This configuration makes the attack difficult to discover. Fortunately, we managed to find a text file on the threat actor’s server containing a regular expression matching the targeted IP addresses. These include:The IP addresses in Shenyang and Nagoya are likely to be their real targets. However, we found the targeted IP addresses in Brazil mostly belonged to a commercial VPN service. We believe that the threat actor used this VPN service to test the deployment of their watering hole attacks. It also provided us with an opportunity to verify the watering hole attack by using the same VPN service to successfully receive the malicious script.The website loads a malicious JavaScript (popup.js) with the following redirection code:The entry point of the patched installer is changed to immediately jump to the shellcode. The shellcode is encrypted with a simple key (XOR 0x01).After decryption, the shellcode runs several PowerShell commands to download additional stages of malware. These files are executable files with a few hundred bytes from the beginning XORed with   one-byte key.It then restores the original entry point (15 bytes in total) to ensure that the original installer runs as expected.This contains the path \\microsoft\\onedrive\\vcruntime140.dll, which is the location where another downloaded file (bg.jpg) gets dropped under the name vcruntime140.dll.This is a patched version of vcruntime140.dll (Microsoft C Runtime library). In this instance, the function memset was patched, as seen in Figures 10 and 11. The return from function (retn) was replaced with a jump to overlay (in the newly adde .odata section), where an injected code reads bytes from the overlay, XORs them with a 1-byte key and injects the embedded payload into the werfautl.exe process. The shellcode in the overlay is a loader of the main backdoor.This is an installer package that contains Installer.exe (a Google Chrome extension installer), NativeApp.exe (a native messaging host) and Chrome extension files (background.js, manifest.json, and icon.png).The format of the message is as follows: xx xx xx xx {“cmd”:””,”data”:””}, where xx xx xx xx is length of the message in bytes.  The “cmd” key must contain one of the implemented command values (execute, load, and inject), while the “data” key may contain additional parameters like path and the program to be executed.The following are examples of valid JSON messages:{\"cmd\":\"execute\",\"data\":[\"c:\\\\windows\\\\system32\\\\notepad.exe\"]}{\"cmd\":\"load\",\"data\":[\"c:\\\\temp\\\\hello-world-x64.dll\",\"MessageBoxThread\"]}{\"cmd\":\"inject\",\"data\":[\"\"]}powershell Get-Content .\\cmd.bin -raw | NativeApp.exeIn the current implementation, the inject command has no parameters. Instead, it connects to the hardcoded URL address http://<delivery server>/help[.]jpg, downloads, decodes and runs the main payload, which is a backdoor.This is a shellcode that loads another embedded executable —  the main backdoor payload which we named WhiskerSpy.WhiskerSpy uses elliptic-curve cryptography (ECC) to exchange encryption keys between the client and server. The following are the implemented backdoor commands:There is one more value shown in Figure 16 (brown color) which represents the hardcoded server’s public key.C&C communication begins by registering the machine ID (function number = 3; POST request with “l<machineID>*”).The uploading of the 64-byte file with the x-coordinate of the client public key and the encrypted AES key follows (function number = 1; POST request with “l<machineID><sessionID>”.WhiskerSpy then periodically requests the C&C server for any tasks it should perform (function number = 2; POST request with “h<machineID>*”.WhiskerSpy implements standard functions. While analyzing the code, we noticed a few status codes designed to report the state of the task, with the first words (two bytes) of the received message being the command ID. Note that, in the case of the command packet, the magic value is the same for all commands: it is found before the command ID and is not displayed in Table 2. In the case of  the alive packet, the first word (2 bytes) of the magic value is used as the command ID, therefore the 0x70D value can be found in the table.Older versions of WhiskerSpy are 32-bit executables and implement only subsets of the previously mentioned functions ( 1-5,8,0x70D are the same, 6 = exit process; 7 = drop file to temp and execute it). The remaining functions are missing.The communication is not via HTTP protocol, but via FTP protocol. This means that the FTP name and password must be hardcoded in the binary to enable communication. This approach leaks the current number of victims as l<machineID><sessionID> and h<machineID> files that are visible to anyone who knows the login credentials.The FTP version of the backdoor also checks for the presence of the debugger. If present, the status code „HELO>“ is sent to the C&C server.This threat is very interesting from a technical perspective. It patches the legitimate installers to hide its activities, uses lesser-known hashing algorithms to compute machine IDs and session IDs and employs ECC to protect encryption keys. In addition, the presented methods of persistence are also quite unique and rare. This shows that Earth Kitsune are proficient with their technical abilities and are continuously evolving their tools, tactics, and procedures TTPs.Joseph C ChenThreat ResearcherJaromir HorejsiThreat ResearcherTry our services free for 30 daysSelect a country / regionCopyright ©2023 Trend Micro Incorporated. All rights reserved"
   },
   {
      "time": "2023-02-21",
      "title": "HardBit ransomware wants insurance details to set the perfect price",
      "text": " A ransomware threat called HardBit has moved to version 2.0 and its operators are trying to negotiate a ransom payment that would be covered by the victim's insurance company.Specifically, the threat actor tries to convince the victim that it is in their interest to disclose all insurance details so they can adjust their demands so the insurer would cover all costs.Unlike most ransomware operations, HardBit does not feature a data leak site, although its operators claim to steal victim data and threaten to leak it unless a ransom is paid.As a ransomware strain, HardBit 2.0 features some capabilities to lower the victim's security, like modifying the Registry to disable Windows Defender's real-time behavioral monitoring, process scanning, and on-access file protections.The malware also targets 86 processes for termination, to make sensitive files available for encryption. It establish persistence by adding itself to the \"Startup\" folder, and deletes the Volume Shadow copies to make data recovery more difficult.An interesting element concerning the encryption phase is that instead of writing encrypted data to file copies and deleting the originals like many strains do, HardBit 2.0 opens the files and overwrites their content with encrypted data.This approach makes it harder for experts to recover the original files and makes the encryption slightly faster.Like other ransomware strains, the note that HardBit 2.0 drops on the victim's system does not inform of the amount the hackers want in exchange for the decryption key. Victims get 48 hours to contact the attacker over an open-source encrypted peer-to-peer communications messaging app.The threat actor advises the victims not to work with intermediaries, since this would only drive up the total cost, but to contact them directly for negotiations.For companies that have insurance for cyberattacks, the hackers have a more elaborate set of instructions and urge them to disclose the insurance amount for successful dialogue.Even more, the hackers make it look like sharing the insurance details is beneficial to the victim, painting the insurer as the bad guy that stands in the way of recovering their data.The threat actors say that insurers never negotiate with ransomware actors with their client's interests in mind, so they make ludicrous counter-offers to their demands just to derail the negotiations and refuse to pay.\"To avoid all this and get the money on the insurance, be sure to inform us anonymously about the availability and terms of the insurance coverage, it benefits both you and us, but it does not benefit the insurance company,\" HardBit operators say in a note to victims.The attackers say that if they know the exact insurance amount, they would know exactly how much to ask so the insurer is forced to cover the demand.Of course, victims are also typically contractually limited not to disclose insurance details to the attackers, and doing so risks losing any chance of the insurer covering the damages. This is why the hackers insist on these details to be shared privately.Regardless of their offer, ransomware operators' goal is to get paid and they would say anything to get the money. The reality is that they cannot be trusted.Refusing to pay the ransom and reporting the incident to law enforcement along with having a consistent backup strategy are the only ways to fight this type of threat and bring it to an end."
   },
   {
      "time": "2023-02-21",
      "title": "Franco-Israeli gang behind EUR 38 million CEO fraud busted | Europol",
      "text": " "
   },
   {
      "time": "2023-02-21",
      "title": "New Stealc malware emerges with a wide set of stealing capabilities",
      "text": " A new information stealer called Stealc has emerged on the dark web gaining traction due to aggressive promotion of stealing capabilities and similarities with malware of the same kind like Vidar, Raccoon, Mars, and Redline.Security researchers at cyber threat intelligence company SEKOIA spotted the new strain in January and noticed it started to gain tractionin early February.Stealc has been advertised on hacking forums by a user called “Plymouth,” who presented the malware as a piece of malware with extensive data-stealing capabilities and an easy-to-use administration panel.According to the advertiser, apart from the typical targeting of web browser data, extensions, and cryptocurrency wallets, Stealc also has a customizable file grabber that can be set to target whatever file types the operator wishes to steal.After the initial post, Plymouth started to promote the malware on other hacking forums and on private Telegram channels, offering test samples to potential customers.The seller also set up a Telegram channel dedicated to publishing Stealc’s new version changelogs, the most recent being v1.3.0, released on February 11, 2023. The malware is actively developed, and a new version appears on the channel every week.Plymouth also said that Stealc was not developed from scratch but instead relied on Vidar, Raccoon, Mars and Redline stealers.One commonality the researchers found between Stealc and Vidar, Raccoon and Mars infostealers is that they all download legitimate third-party DLLs (e.g. sqlite3.dll, nss3.dll) to help with pilfering sensitive data.The researchers discovered more than 40 C2 servers for Stealc and several dozens of samples in the wild, indicating that the new malware has attracted the interest of the cybercriminal community. This popularity may be accounted by the fact that customers with access to the administration panel can generate new stealer samples, which increase the chances of the malware leaking to a broader audience.Despite the poor business model, SEKOIA believes that Stealc represents a significant threat as it could be adopted by less technical cybercriminals.Stealc has added new features since its first release in January, including a system to randomize C2 URLs, a better logs (stolen files) searching and sorting system, and an exclusion for victims in Ukraine.The features that SEKOIA could verify by analyzing the captured sample are the following:SEKOIA's curent report does not include all the data obtained from reverse engineering Stealc but provides an overview of the main steps of its execution.When deployed, the malware deobfuscates its strings and performs anti-analysis checks to ensure it doesn’t run in a virtual environment or sandbox.Next, it dynamically loads WinAPI functions and initiates communication with the C2 server, sending the victim’s hardware identifier and build name in the first message, and receiving a configuration in response.Stealc then collects data from the targeted browsers, extensions, and apps, and also executes its custom file grabber if active, and finally exfiltrates everything to the C2. Once this step is over, the malware removes itself and the downloaded DLL files from the compromised host to wipe the traces of the infection.One distribution method the researchers observed is via YouTube videos describing how to install cracked software and linking to a download website.The researchers say that the software download embeds the Stealc info stealer. Once the installer is executed, the malware begins its routine and communicates with its server.Considering the observed distribution method, users are recommended to steer away from installing pirated software and download products only from the official developer's website."
   },
   {
      "time": "2023-02-21",
      "title": "RailYatri: 31 Million Users Affected On Indian Ticketing Platform",
      "text": " Although the RailYatri attack occurred in December 2022, the stolen data was only recently made public on a well-known hacker forum. In addition to exposing personal information, the RailYatri hack revealed the locations of millions of travelers throughout India.Email addresses, complete names, genders, phone numbers, and locations are among the data that has been hacked, putting millions of people at risk of identity theft, phishing scams, and other online crimes.A hacker and criminal site called Breachforums emerged as a rival to the well-known and now-seized Raidforums and can confirm that the database has been exposed there.Sen informed RailYatri of the problem and pointed out that the server belonged to them; at first, they disputed ownership. Later, the business said it was just test data. The server had about 37 million entries in total, including internal production logs and over 700,000 logs at that time.Only when the Indian Computer Emergency Response Team (CERT-In) intervened in 2020 was Railyatri able to safeguard its data; two years later, on February 16, 2023, hackers shook the business with yet another security breach because of a new leak.“Back in 2020, when I contacted Railyatri, they never reacted or reached out to me, but once I contacted Cert-In, the server got shut down.” Anurag continued, “I have reported numerous data leaks in India; the main problem I observed is that these corporations are not receiving fines because India does not have a GDPR-like statute.According to Anurag, the most recent data leak could have been prevented “if the organization had put in place suitable cybersecurity procedures from the beginning.”It is recommended that all users change their passwords frequently and turn on two-factor authentication for added security. Users have also been encouraged to keep an eye on their credit card and bank statements for any strange activity.A threat actor posing as RailYatri on BreachForums released a database of more than 30 million users on February 16. With the most recent hack at the e-booking services website RailYatri, Indian Railways’ cybersecurity practices are once again being questioned.Concern and criticism are flying after it was discovered that over 30 million user records connected to the train ticketing platform were being traded on the dark web. According to the post, the Indian Railway Catering and Tourism Corporation (IRCTC)-approved travel booking app experienced a data breach in December of last year, during which the personal information of 31 million users was stolen.2020 Cybersecurity Landscape: 100+ Experts’ PredictionsCyber Security Predictions 2021: Experts’ ResponsesExperts’ Responses: Cyber Security Predictions 2023Celebrating Data Privacy Day – 28th January 2023Data Privacy Protection Day (Thursday 28th) – Experts Comments“Cybersecurity Awareness Month’s new evergreen theme \"Secure Our World” is…“Avoid storing data on personal devices: A crucial but often overlooked…“I recommend a new nuance to passwords that isn’t often…“In my role overseeing cloud environments and incident response, I'm…“​​Cybersecurity Awareness Month serves as a reminder to confront the…Information Security Buzz (aka ISBuzz News) is an independent resource that provides the experts comments, analysis and opinion on the latest Information Security news and topics "
   },
   {
      "time": "2023-02-21",
      "title": "\r\n\tSamsung Launches Message Guard to Protect Users From Cyber-Threats - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistSamsung has released a new smartphone feature designed to protect user devices from threats disguised as image attachments.Called “Message Guard,” the new capability is currently compatible with the Samsung Messages app as well as with Messages by Google.From a technical standpoint, Message Guard acts as an advanced sandbox layer that isolates image files from the rest of the device.“This prevents malicious code from accessing your phone’s files or interacting with its operating system,” the company explained. “Samsung Message Guard checks the file bit by bit and processes it in a controlled environment to ensure it cannot infect the rest of your device.”If the file is deemed harmless, it is then allowed to be accessed normally by the user. If not, it is disposed of.“Samsung Message Guard automatically neutralizes any potential threat hiding in image files before they have a chance to do you any harm. It also runs silently and largely invisibly in the background and does not need to be activated by the user,” the company wrote.“So where previously you could be endangered without doing anything, now you are protected from zero-click exploits without lifting a finger.”The Samsung Message Guard feature is currently being rolled out on Galaxy S23 series devices. The company confirmed it would bring the new feature to other smartphones and tablets supporting One UI 5.1 or higher later this year."
   },
   {
      "time": "2023-02-21",
      "title": "BEC Attacks: Google Translate Utilized to Scam Organizations in Any Language - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": " BEC attacks entail posing as a senior executive or business partner and convincing a corporate target to wire large quantities of cash to a bank account under the attacker's control. Successfully launching the international variant of this cyberattack generally requires a lot of time and effort. The target must be sufficiently researched to make phishing lures plausible. Moreover, native speakers must be hired to translate frauds into other languages. Yet this is all changing as threat actors use free online technologies that reduce some of the need for manual work. Midnight Hedgehog and Mandarin Capybara are two BEC groups that best represent the trend, according to a research from Abnormal Security published this week. Both use Google Translate, which enables threat actors to quickly create convincing phishing lures in practically any language. Moreover, researchers in the study also cautioned that tools such as commercial business marketing services are aiding the success of less-resourced and less-sophisticated BEC attacks. They are mostly used by sales and marketing teams to find \"leads,\" making it simple to locate the best targets regardless of their region. The fact that BEC attacks are already lucrative, causing $2.4 billion in damages in 2021 alone, according to the FBI's Crime Report, and the number of BEC attacks is constantly increasing, is bad news for defenders. Volumes are now likely to increase as some of the cost associated with performing them has been eliminated. Crane Hassold, director of threat intelligence of Abnormal Security in a report noted that Midnight Hedgehog has been since January 2021 and specialises in impersonating CEOs. Danish, Dutch, Estonian, French, German, Hungarian, Italian, Norwegian, Polish, Spanish, and Swedish are among the 11 languages that the company has so far identified in two significant phishing emails from the organization. The emails are lacking the simple mistakes that consumers are conditioned to look out for and regard as suspicious thanks to Google Translate's effectiveness. \"We've taught our users to look for spelling mistakes and grammatical errors to better identify when they may have received an attack[…]When these are not present, there are fewer alarm bells to alert native speakers that something isn't right,\" the report said. Apparently, Midnight Hedgehog has requested payments ranging from $17,000 to $45,000. Mandarin Capybara, the second BEC threat organization mentioned in the report, sends emails posing as communications from business executives but with a twist: Paychecks are transferred to a controlled account via direct deposit by contacting payroll. Abnormal Security has noted that Mandarin Capybara targets businesses all over the world with phishing lures in Dutch, English, French, German, Italian, Polish, Portuguese, Spanish, and Swedish. However, unlike Midnight Hedgehog, which the report claimed sticks to non-English-speaking victims in Europe, Mandarin Capybara also targets businesses outside of Europe with phishing emails aimed at English speakers in the US and Australia. In some instances, they utilized the same tactics of fraudulent email accounts to distribute emails in multiple languages.The reason why BEC campaigns are still in trend among threat actors is simply how they operate, where their victims receive these messages, deeming them legitimate, and act upon instructions they think are coming from their ‘boss,’ especially when the emails are written with correct grammar and spelling and the sender's signature style. \"As email marketing and translation tools become more accurate, effective, and accessible, we'll likely continue to see hackers exploiting them to scam companies with increasing success,\" said Hassold. It is that organizations put procedures in place to make sure that large financial transactions are not approved by only one person and that people should be trained to be on the lookout for payment fraud attacks in addition to deploying appropriate cybersecurity tools to help catch BEC attacks. \"It's important that organizations use email defenses that look for threats in a more holistic matter to be able to prevent more sophisticated BEC attacks. Defenses that simply rely on static or 'known bad' indicators will have a hard time detecting these attacks, which is why tools that leverage behavioral analytics are better equipped to spot more advanced BEC threats,\" concludes Hassold.    your nameYour Emailyour message"
   },
   {
      "time": "2023-02-21",
      "title": "Evaluation by Chainalysis Declare 2022 to be \"The Year of Crypto Thefts\" - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2023-02-21",
      "title": "\r\n\tFrebniis Malware Exploits Microsoft IIS Feature - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistCybersecurity researchers have discovered a new malware that leverages a legitimate feature of Microsoft’s Internet Information Services (IIS) to install a backdoor in targeted systems.“The technique used by Frebniis involves injecting malicious code into the memory of a [dynamic link library] DLL file [...] related to an IIS feature used to troubleshoot and analyze failed web page requests,” reads the technical write-up.At a basic level, IIS is a web server running on Windows systems to serve requested HTML pages or files. These servers can accept requests from remote client computers and then return the appropriate response.According to the security researchers, exploiting this tool enabled the malware to stealthily monitor all HTTP requests while also automatically recognizing specially formatted HTTP requests sent by the attacker.“These requests allow remote code execution [RCE] and proxying to internal systems in a stealthy manner,” reads the advisory. “No files or suspicious processes will be running on the system, making Frebniis a relatively unique and rare type of HTTP backdoor seen in the wild.”The Symantec team clarified that to use this technique, an attacker would need to gain access to the Windows system running the IIS server by some other means. In the attack described in the advisory, the security researchers wrote that it was unclear how this access was achieved."
   },
   {
      "time": "2023-02-21",
      "title": "Coinbase cyberattack targeted employees with fake SMS alert",
      "text": " Coinbase cryptocurrency exchange platform has disclosed that an unknown threat actor stole the login credentials of one of its employees in an attempt to gain remote access to the company's systems.As a result of the intrusion the attacker obtained some contact information belonging to multiple Coinbase employees, the company said, adding that customer funds and data remained unaffected.Coinbase has shared the findings of their investigation to help other companies identify the threat actor's tactics, techniques, and procedure (TTPs) and set up appropriate defenses.The attacker targeted several Coinbase engineers on Sunday, February 5 with SMS alerts urging them to log into their company accounts to read an important message.While most employees ignored the messages, one of them fell for the trick and followed the link to a phishing page. After entering their credentials, they were thanked and prompted to disregard the message.In the next phase, the attacker tried to log into Coinbase's internal systems using the stolen credential but failed because access was protected with multi-factor authentication (MFA).Roughly 20 minutes later, the attacker moved to another strategy. They called the employee claiming to be from the Coinbase IT team and directed the victim to log into their workstation and follow some instructions.Coinbase's CSIRT detected the unusual activity within 10 minutes since the start of the attack and contacted the victim to inquire about unusual recent activities from their account. The employee then realized something was wrong and terminated communications with the attacker.Coinbase has shared some of the observed TTPs that other companies could use to identify a similar attack and defend against it: According to cybersecurity company Group-IB, the threat actor stole almost 1,000 corporate access logins by sending phishing links over SMS to company employees.Employees of companies that manage digital assets and have a strong online presence are bound to be targeted by social engineering actors at some point.Adopting a multi-layered defense can make an attack sufficiently challenging for most threat actors to give up. Implementing MFA protection and the use of physical security tokens can help protect both consumer and corporate accounts."
   },
   {
      "time": "2023-02-21",
      "title": "Samsung adds zero-click attack protection to Galaxy devices",
      "text": " Samsung has developed a new security system called Samsung Message Guard to help Galaxy smartphone users keep safe from the so-called “zero-click” exploits that use malicious image files.The Korean tech giant says its new security system will be able to detect these threats when they reach the device as a message and to stop them before they do any damage.Zero-click exploits are sophisticated threats that leverage a vulnerability without requiring any interaction with the user.Typically, attacks relying on zero-click exploits involve sending the target a message or file with malicious code to trigger a vulnerability on the device that gives the attacker access without the victim even opening the message or file.Samsung Message Guard is an isolated virtual space on the smartphone that acts as a temporary hosting location for newly arrived image files in PNG, JPG/JPEG, GIF, ICO, WEBP, BMP, and WBMP formats.The system checks the files to determine if they hide malicious code. If so, they are locked in quarantine mode and blocked from accessing or interacting with the underlying operating system.“It also runs silently and largely invisibly in the background and does not need to be activated by the user” - SamsungThe new security system is added to Samsung’s multiple existing protection layers, most notably Samsung Knox, which can offer real-time threat detection and protection against malware.Samsung Message Guard is available immediately for Galaxy S23, released on Friday, and it will gradually roll out to other Galaxy devices running One UI 5.1 or higher later in 2023."
   },
   {
      "time": "2023-02-21",
      "title": "Google Reveals Alarming Surge in Russian Cyber Attacks Against Ukraine",
      "text": " Russia's cyber attacks against Ukraine surged by 250% in 2022 when compared to two years ago, Google's Threat Analysis Group (TAG) and Mandiant disclosed in a new joint report.As many as six unique wiper strains – including WhisperGate, HermeticWiper, IsaacWiper, CaddyWiper, Industroyer2, and SDelete – have been deployed against Ukrainian networks, suggesting a willingness on the part of Russian threat actors to forgo persistent access.\"Russian government-backed attackers have engaged in an aggressive, multi-pronged effort to gain a decisive wartime advantage in cyberspace, often with mixed results,\" TAG's Shane Huntley noted.The uptick in the intensity and frequency of the operations aside, the invasion has also been accompanied by the Kremlin engaging in covert and overt information operations designed to shape public perception with the goal of undermining the Ukrainian government, fracturing international support for Ukraine, and maintaining domestic support for Russia.\"GRU-sponsored actors have used their access to steal sensitive information and release it to the public to further a narrative, or use that same access to conduct destructive cyber attacks or information operations campaigns,\" the tech giant said.\"It is clear cyber will continue to play an integral role in future armed conflict, supplementing traditional forms of warfare,\" Huntley said.\"Despite Russia's conventional military setbacks and its failure to substantively advance its agenda through cyber operations, Russia maintains its intent to bring Ukraine under Russian control,\" it added, while also highlighting its \"burgeoning military cooperation with Iran and North Korea.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-02-20",
      "title": "WIP26 Espionage | Threat Actors Abuse Cloud Infrastructure in Targeted Telco Attacks - SentinelOne",
      "text": " By Aleksandar Milenkoski, Collin Farr, and Joey Chen, in collaboration with QGroupThe WIP26 activity is initiated by precision targeting of employees through WhatsApp messages that contain Dropbox links to a malware loader. Tricking employees into downloading and executing the loader ultimately leads to the deployment of backdoors that leverage Microsoft 365 Mail and Google Firebase instances as C2 servers. We refer to these backdoors as CMD365 and CMDEmber, respectively. The main functionality of CMD365 and CMDEmber is to execute attacker-provided system commands using the Windows command interpreter.The use of public Cloud infrastructure for C2 purposes is an attempt to make malicious C2 network traffic look legitimate and therefore make detection harder for defenders. The CMD365 and CMDEmber samples we observed masquerade as utility software, such as a PDF editor or browser, and as software that conducts update operations. The masquerading attempt involves the use of filenames, application icons, and digital signatures that indicate existing software vendors.This report provides details on the WIP26 threat activity and further context around the use of CMD365 and CMDEmber.The PDFelement.exe malware loader has an invalid digital signature that indicates the vendor of the PDFelement application – Wondershare.The loader deploys the CMD365 backdoor, a .NET executable named Update.exe, and creates a scheduled task named MicrosoftUpdatesA that executes CMD365 at system startup for persistence.The main functionality of CMD365 is to execute commands from a C2 hosted on a Microsoft 365 Mail instance. This capability was used to conduct a variety of activities, such as reconnaissance, privilege escalation, staging of additional malware, and data exfiltration.The exfiltrated data included users’ private browser data and reconnaissance information on particular high-value hosts in the victim’s network. This is a typical precursor to the subsequent targeting of these hosts. The data exfiltration was orchestrated through the execution of PowerShell commands to transport key data to Microsoft Azure instances. The threat actor behind WIP26 used the Windows Azure website socialmsdnmicrosoft.azurewebsites[.]net as a malware hosting site and akam.azurewebsites[.]net as a data exfiltration site.The figure below gives an overview of the Cloud infrastructure the threat actor behind WIP26 used for initial infection and as C2 servers, and exfiltration and malware hosting sites. We informed Google, Microsoft, and Dropbox about the abuse of their infrastructure.The core feature of CMD365 is to execute attacker-provided system commands as standard input to an instance of the Windows command interpreter.CMD365 issues an HTTP POST request to login.microsoftonline[.]com to authenticate itself to a Microsoft 365 Mail inbox using valid credentials that are hardcoded in the malware. The malware then receives an OAuth Bearer access token that it uses in the further interaction with Microsoft 365.CMD365 then creates an inbox folder with a name that is unique for each infected machine. The name is a combination of the physical address of the main active network interface on the machine, the machine’s computer name, and the name of the user in whose context the malware executes. CMD365 collects this information when it starts executing.CMD365 polls the inbox folder for C2 commands by querying for emails whose subjects start with the keyword Input. These emails contain C2 input intended for processing by CMD365 on infected machines.The C2 server and CMD365 exchange encrypted and Base64-encoded data. For data encryption and decryption, the malware uses the AES key Xc4u7x!A%D*G-KaPdSr56tp2s5v8y/B? (in string format) and an empty initialization vector (IV).As with CMD365, the core feature of CMDEmber is to execute system commands using the Windows command interpreter.When executed, CMDEmber connects to the Firebase instance https://gmall-52fb5-default-rtdb.asia-southeast1.firebasedatabase[.]app/ or https://go0gle-service-default-rtdb.firebaseio[.]com, and then exfiltrates information about the infected machine. The exfiltrated data includes some of the information that the CMDEmber collects – the computer name, the bitness, name, and ID of the CMDEmber process, the name of the user in whose context CMDEmber executes, and the IPv4 and physical addresses of all operational network interfaces on the infected machine.CMDEmber uses the MD5 hash of the Triple DES key Mgirdhgi256HIKnuefsdf!dfgsdfkjsrht (in string format) to encrypt and decrypt the Base64 data exchanged with the C2.CMDEmber sends and receives data from the C2 server by issuing HTTP POST and GET requests, respectively. The URL paths of these requests contain a unique identifier of each infected machine, which is a combination of the ID and bitness of the CMDEmber process, and the physical addresses of the operational network interfaces at the victim machine.After exfiltrating information about the infected machine, CMDEmber polls the Firebase instance for C2 commands by issuing HTTP GET requests that include the identifier of the infected machine.The data that the C2 server and CMDEmber exchange is in JSON format. The Firebase C2 server stores exchanged data with all infected machines in a JSON-formatted file such that the nodes are the unique identifiers of the machines:We assess it is likely this activity is espionage-related. We track this activity as WIP26 – the Work-In-Progress (WIPxx) designation is used for unattributed activity clusters.The initial intrusion vector we observed involved precision targeting: The threat actor sent WhatsApp messages to targets with download links to backdoor malware. Further, the targeting of telecommunication providers in the Middle East suggests the motive behind this activity is espionage-related. Communication providers are frequent targets of espionage activity due to the sensitive data they hold. Finally, evidence suggests that once they established a foothold, the threat actor targeted users’ private information and specific networked hosts of high value.The threat actor behind WIP26 activity appears to have made some OPSEC errors. For example, the JSON file where the Google Firebase C2 server stores data exchanged with machines infected by CMDEmber is publicly accessible at the time of writing, providing further insights into the WIP26 activity.The use of public Cloud infrastructure by APT groups is not unheard of. These threat actors continue to innovate in order to stay stealthy. This includes leveraging public Cloud infrastructure for C2 purposes to blend in and make the detection of C2 traffic harder for defenders.The WIP26 activity is a relevant example of threat actors continuously innovating their TTPs in an attempt to stay stealthy and circumvent defenses. The use of public Cloud infrastructure for malware hosting, data exfiltration, and C2 purposes aims at making malicious traffic look legitimate. This gives attackers the opportunity to conduct their activities unnoticed. We hope that this report helps to emphasize this tactic in the continuous effort to identify threat groups engaged in targeting critical industries.SentinelLabs continues to track the WIP26 threat cluster to provide further insight into its evolution, future activity, and attribution.Get notified when we post new content.Thanks! Keep an eye out for new content!In the era of interconnectivity, when markets, geographies, and jurisdictions merge in the melting pot of the digital domain, the perils of the threat ecosystem become unparalleled. Crimeware families achieve an unparalleled level of technical sophistication, APT groups are competing in fully-fledged cyber warfare, while once decentralized and scattered threat actors are forming adamant alliances of operating as elite corporate espionage teams.Get notified when we post new content.Thanks! Keep an eye out for new content!"
   },
   {
      "time": "2023-02-20",
      "title": "Operation Silent Watch: Desktop Surveillance in Azerbaijan and Armenia - Check Point Research",
      "text": " Key findings:In this report, we provide a full technical analysis of the OxtaRAT as well as its capabilities and evolution over the years. We also discuss the tactics, techniques and procedures (TTPs) of the threat actors, complete with an overview of their activity throughout the years.The Republic of Artsakh, also known as the Nagorno-Karabakh Republic, is a breakaway region in the South Caucasus with a majority ethnic Armenian population but is recognized internationally as part of Azerbaijan. It is a de facto enclave within Azerbaijan, with the only land route to Armenia through the Lachin corridor, which has been under the control of Russian peacekeepers since the end of the Second Nagorno-Karabakh War in 2020.The situation in Artsakh is tense, with frequent ceasefire violations and sporadic outbreaks of violence. For more than two decades, this unresolved highly militarized ethno-nationalist territorial conflict continues to be a source of tension between Armenia and Azerbaijan.A malicious file named Israeli_NGO_thanks_Artsakh_bank_for_the_support_of.scr was submitted to VirusTotal (VT) on November 29, 2022, from an IP address located in Yerevan, Armenia.It is a self-extracting archive that masquerades as a PDF file and bears a PDF icon. Upon execution, it drops to the Temp folder of the infected device and executes a self-extracting cab called Alexander_Lapshin.EXE. This in turn drops multiple additional files and executes one of them – the exec.bat script. In its deobfuscated form, this script is very short:Alexander Lapshin, a Russian-Israeli travel blogger, journalist, and human rights activist, was detained in Belarus in 2016 and extradited to Azerbaijan. He was sentenced to 3 years in prison for illegally crossing the internationally recognized borders of Azerbaijan, without authorization from the Azerbaijani authorities, in 2011 and 2012 while visiting Nagorno-Karabakh from Armenia. Nine months into his detention, in September 2017, Lapshin was attacked in a solitary confinement cell of a Baku pre-trial detention center. The attack was publicly declared by Azerbaijani officials to be a suicide attempt. Afterward, he was pardoned by the Azerbaijani President and deported to Israel.As we mentioned previously, AutoIT.exe is used to run code from an image called icon.png. This is a polyglot malware, combining valid JPEG and AutoIT A3X file formats:AutoIT is a legitimate tool that is used by many IT administrators to automate tasks but is frequently abused by threat actors. In this case, the actors use a fully functional backdoor containing approximately 20,000 lines of obfuscated AutoIt code:The backdoor, which we call OxtaRAT, contains a variety of capabilities typically associated with espionage activity. It contains commands that allow the attackers to:The backdoor starts by first setting up its base folder, moving the icon.png file there, and adding a persistence mechanism to run it every 2 minutes with AutoIt3.exe via a scheduled task named WallPaperChangeApp. It also creates a working folder to store the results and logs of each command execution and sets hidden and system attributes for both base and working folders to conceal them from being easily discovered and arouse suspicion. It also downloads the legitimate curl executable and DLL, which are later used for some types of C&C communication.The C&C server for this sample is edupoliceam[.]info, a lookalike for the domain of the Police Education Complex of Police of the Republic of Armenia.Next, the malware enters the main infinite loop, where in each step it performs the following actions:Most of the capabilities require additional files, mostly legitimate, to be downloaded during the malware execution from the path on the server /requirement/up/bin/:The only next-stage tool that wasn’t available on the server, was AppCrashCollector.exe, whose download and execution are triggered by the implant command. We assume that this is the payload that the actors attempt to hide from researchers and deliver to important targets only after additional checks are performed on the infected machine.The communication between the malware and its C&C server is based on clear text commands, the arguments for each command are separated by the “|” sign.The full list of commands supported by the backdoor:For the commands that require output, the final command line that was executed and its output are written to the working directory to the file with Random(1, 815782) & \"-command-.txt\" name.Although not widely discussed, previous versions of the OxtaRAT backdoor were used in earlier attacks against Azerbaijani political and human rights activists – or, when the targets were not disclosed publicly, their lures referenced Azerbaijan-Armenia tensions around Artsakh. The older versions of OxtaRAT have significantly less functionality than the new variant but contain similar code and names for most of the commands and the same C&C communication pattern.In August 2021, another sample was observed, this time submitted to VirusTotal from Armenia. The file called REPORT_ON_THE_AZERBAIJANI_MILLITARY_AGRESSION (Final Updated 2021).scr also bears the PDF icon, and when executed, presents the victim with the following PDF lure:In the background, it downloads the main malware from the C&C server https://www.filecloudservices.xyz/wp-comment.php and saves it as PhoneAppService.Exe. The code of this version implements the same string obfuscation as the newest version:In the background, it downloaded from the C&C server https://smartappsfoursix[.]xyz/wp-feed.php and run another version of OxtaRAT. This is a more advanced version, compared to the 2021 attacks, with many additional commands added (29 in total):The version from June 2021 was capable only of downloading and exfiltrating files, executing the binaries and AutoIT code, and recording data from the desktop and web camera. In contrast, the version observed in February 2022 is a more powerful malware with a lot of additional features. The actors added capabilities to improve local file enumeration (list files on the desktop, search for specific files), collect data about the compromised system, work with zip files, and, most importantly, improved the ways they can access and control the infected machine by adding commands to install TightVNC or the PHP web server.The first change that the actors implemented in their latest attack is in the infection chain. Previously, the initial .SCR files, masquerading as Word or PDF documents, served only as downloaders. They sent a request to WordPress-like URLs on the C&C server (wp-feed.php, wp-comment.php, etc) and then executed the main malware received from the attackers’ server. In the latest campaign, the .SCR file already contains the OxtaRAT backdoor, as a polyglot file. This saves the actors from needing to make additional requests for binaries to the C&C server and attracting unnecessary attention, as well as hides the main malware from being easily discovered on the infected machine, as it looks like a regular image and bypasses type-specific protections.  The actors added an additional measure to protect their infrastructure, geofencing the C&C domains that store the auxiliary tools and additional payloads. This is a technique currently used by many experienced threat actors to make sure that the proper execution flow is not triggered by sandboxes or researchers, but only on the targeted machines. In this case, the actors limited their operations to Armenian IP addresses.Since the previous publicly disclosed version, OxtaRAT was updated with 10 additional commands introducing new functionality. Most of the new features aim to improve the ways to steal the victim’s data. For example, they implemented the listdir command to recursively enumerate the files in a specified folder, collecting additional data such as the last modified date and size. The previously existing command massdownload, which is used to exfiltrate files of predefined types, was also updated with a few new file extensions (marked in bold):\"*.mdb;*.accdb;*.rdo;*.ora;*.accda;*.accdr;*.accdt;*.ppt;*.avi;*.pptx;*.odt;*.pdf;*.txt;*.msf;*.docx;*.xml;*.doc;*.rtf;*.jpg;*.jpeg;*.png;*.xls;*.xlsx;*.rdp;*.zip;*.rar;*.sql;*.sqlite;*.php;*.avi;*.mp4;*.tar;*.tar.gz;*.7z;*.bz2;*.tar.bz2\"As can be seen from this snippet, the actors are now interested in additional file types related to Oracle and Microsoft Access databases. This is an interesting development, as it indicates they may be broadening their targets to include corporate networks or specific individuals, as common private computers rarely contain personal files in DB formats.The actors also implemented “advanced” mass-download commands such as the massdownload2 and massdownload2list that allow the actors to enumerate and exfiltrate specified filetypes more conveniently. In addition, they implemented functions to work with RAR archives (installrar, rarit, unrarit) which, along with the clear benefits of uploading the auxiliary tools inside RAR archives to the infected machines, enable the actors to archive all the files of their interest to the multi-volume RAR archive. The default list of extensions provided in the code of the rarit exfiltration function shows a focus on documents, pictures, archives, and databases:Another interesting feature included in the most recent version is the speedtest command which invokes Speedtest CLI, a dedicated tool to test the speed and performance of an internet connection. As the malware is not only capable of collecting a large quantity of files but also recording video from a web camera and screen, it can produce significantly large outputs with gigabytes of data. Therefore, for the sake of OPSEC, to hide the extensive data exfiltration the actors likely needed a way to control and estimate the upload all of the collected information to their servers.The last feature added to the data collection mechanism is a proclist command, which uses WMIC to retrieve the command line for each of the processes. This feature might be used for evasion purposes, so the actors can make sure they are running in an actual environment as opposed to a sandbox, as well as to learn more about the software configurations running on the victim’s machine.One of the unexpected features that we found during this investigation is the portscan tool, which is included only in the newer version of the backdoor. The port scanner, pscclient.exe, is an Auto-IT based non-obfuscated TCP Connect tool that can scan a specified range of IP addresses and a range of ports. The default range of ports configured in the tool includes both well-known and non-standard ports:OxtaRAT, which previously had mostly local recon and surveillance capabilities, can now be used as a pivot for active reconnaissance of other devices. This may indicate that the threat actors are preparing to extend their main attack vector, which is currently social engineering, to infrastructure-based attacks. It also might be a sign that the actors are moving from targeting individuals to targeting more complex or corporate environments.Our search for domains with similar characteristics to edupoliceam[.]info led to more active domains: filesindrive[.]info, mediacloud[.]space and avvpassport[.]info. All the domains are registered with NameCheap. While filesindrive[.]info and mediacloud[.]space, similar to filecloudservices[.]xyz used in back in 2021, have a generic reference to cloud file storages, the domain avvpassport[.]info is more specific, and it masquerades as the Passport and Visa Office of the Republic of Armenia. Both of these domains, edupoliceam[.]info and avvpassport[.]info, were created on September 23, 2022, and were likely also used for other attacks on Armenian targets.At the beginning of our investigation, all of these domains used Cloudflare services to hide their IP addresses. Due to their configuration, by looking for IP addresses with the same behavior, we identified 38.242.197[.]156 as likely their real IP address. While we were completing the investigation and notifying the relevant parties, Cloudflare blocked these domains as malicious, and they all started to publicly resolve to their real IP address 38.242.197[.]156.Even though we couldn’t find any infrastructure overlap with our campaign (considering a gap of a few years and public exposure of previous attacks), there is a significant overlap in major TTPs:Although it is tricky to compare the code of tools with different functionality (keylogger compared to a full-blown surveillance tool), there are a few high-level overlaps in the coding style of these tools:Based on these similarities in TTPs, code and targeting, we can conclude with medium confidence that both cases involve the same threat actors. We can also speculate that the missing “implant” in OxtaRAT that we were unable to access might be a keylogger; not only is it an important functionality missing from OxtaRAT’s multi-functional surveillance arsenal, but also the actors might take extra measures to avoid revealing it to anyone except the targets, possibly to avoid attribution based on already uncovered information.In this article, we describe the latest attack and the evolution of the tools in the campaigns against Armenian targets, as well as Azerbaijani activists and dissidents. All the details indicate that the underlying threat actors have been maintaining the development of Auto-IT based malware for the last seven years, and are using it in surveillance campaigns whose targets are consistent with Azerbaijani interests.Check Point products provide the following coverage against this threat:Subscribe for cpr blogs, news and more© 1994- Check Point Software Technologies LTD. All rights reserved.First Name\nLast Name\nCountry—Please choose an option—ChinaIndiaUnited StatesIndonesiaBrazilPakistanNigeriaBangladeshRussiaJapanMexicoPhilippinesVietnamEthiopiaEgyptGermanyIranTurkeyDemocratic Republic of the CongoThailandFranceUnited KingdomItalyBurmaSouth AfricaSouth KoreaColombiaSpainUkraineTanzaniaKenyaArgentinaAlgeriaPolandSudanUgandaCanadaIraqMoroccoPeruUzbekistanSaudi ArabiaMalaysiaVenezuelaNepalAfghanistanYemenNorth KoreaGhanaMozambiqueTaiwanAustraliaIvory CoastSyriaMadagascarAngolaCameroonSri LankaRomaniaBurkina FasoNigerKazakhstanNetherlandsChileMalawiEcuadorGuatemalaMaliCambodiaSenegalZambiaZimbabweChadSouth SudanBelgiumCubaTunisiaGuineaGreecePortugalRwandaCzech RepublicSomaliaHaitiBeninBurundiBoliviaHungarySwedenBelarusDominican RepublicAzerbaijanHondurasAustriaUnited Arab EmiratesIsraelSwitzerlandTajikistanBulgariaHong Kong (China)SerbiaPapua New GuineaParaguayLaosJordanEl SalvadorEritreaLibyaTogoSierra LeoneNicaraguaKyrgyzstanDenmarkFinlandSlovakiaSingaporeTurkmenistanNorwayLebanonCosta RicaCentral African RepublicIrelandGeorgiaNew ZealandRepublic of the CongoPalestineLiberiaCroatiaOmanBosnia and HerzegovinaPuerto RicoKuwaitMoldovMauritaniaPanamaUruguayArmeniaLithuaniaAlbaniaMongoliaJamaicaNamibiaLesothoQatarMacedoniaSloveniaBotswanaLatviaGambiaKosovoGuinea-BissauGabonEquatorial GuineaTrinidad and TobagoEstoniaMauritiusSwazilandBahrainTimor-LesteDjiboutiCyprusFijiReunion (France)GuyanaComorosBhutanMontenegroMacau (China)Solomon IslandsWestern SaharaLuxembourgSurinameCape VerdeMaltaGuadeloupe (France)Martinique (France)BruneiBahamasIcelandMaldivesBelizeBarbadosFrench Polynesia (France)VanuatuNew Caledonia (France)French Guiana (France)Mayotte (France)SamoaSao Tom and PrincipeSaint LuciaGuam (USA)Curacao (Netherlands)Saint Vincent and the GrenadinesKiribatiUnited States Virgin Islands (USA)GrenadaTongaAruba (Netherlands)Federated States of MicronesiaJersey (UK)SeychellesAntigua and BarbudaIsle of Man (UK)AndorraDominicaBermuda (UK)Guernsey (UK)Greenland (Denmark)Marshall IslandsAmerican Samoa (USA)Cayman Islands (UK)Saint Kitts and NevisNorthern Mariana Islands (USA)Faroe Islands (Denmark)Sint Maarten (Netherlands)Saint Martin (France)LiechtensteinMonacoSan MarinoTurks and Caicos Islands (UK)Gibraltar (UK)British Virgin Islands (UK)Aland Islands (Finland)Caribbean Netherlands (Netherlands)PalauCook Islands (NZ)Anguilla (UK)Wallis and Futuna (France)TuvaluNauruSaint Barthelemy (France)Saint Pierre and Miquelon (France)Montserrat (UK)Saint Helena, Ascension and Tristan da Cunha (UK)Svalbard and Jan Mayen (Norway)Falkland Islands (UK)Norfolk Island (Australia)Christmas Island (Australia)Niue (NZ)Tokelau (NZ)Vatican CityCocos (Keeling) Islands (Australia)Pitcairn Islands (UK)\nEmail\n\nBFSI uses cookies on this site. We use cookies to enable faster and easier experience for you. By continuing to visit this website you agree to our use of cookies."
   },
   {
      "time": "2023-02-20",
      "title": "Atlassian confirms breach of third-party app resulted in leak of employee data | SC Media",
      "text": "  Screenshot of message from SiegedSec hacking group claiming to have hacked Atlassian. A subsequent investigation determined the data was stolen through a compromise Atlassian employee’s account on the third party workplace collaboration app Envoy. (Image credit: Check Polnt Research)Note: This story and headline have been updated on 2/16/2023 and 2/17/2023 following new information and statements from both Atlassian and Envoy.Australian software company Atlassian confirmed that employee data has been leaked on the web through an account they use on a third-party application. While independent researchers at cybersecurity firm Check Point have backed up claims that the data does not appear to have come from Atlassian's systems, the makers behind the app say an Atlassian employee's compromised credentials are to blame.In a statement sent to SC Media, an Atlassian spokesperson said the leak appears to have originated via their acount with Envoy, which makes and sells workplace collaboration software.“On February 15, 2023 we learned that data from Envoy, a third-party app that Atlassian uses to coordinate in-office resources, was compromised and published. Atlassian product and customer data is not accessible via the Envoy app and therefore not at risk,” the spokesperson told SC Media. “The safety of Atlassians is our priority, and we worked quickly to enhance physical security across our offices globally. We are actively investigating this incident and will continue to provide updates to employees as we learn more.” After SC Media reached out to Envoy for comment, a spokesperson sent a statement saying the company is not aware of any evidence that their systems were breached, claiming their own research indicates the incident stemmed from a compromise of an Atlassian employee's credentials.\"We’re investigating this right now and are not aware of any compromise to our systems. Our initial research shows that a hacker gained access to an Atlassian employee's valid credentials to pivot and access the Atlassian employee directory and office floor plans held within Envoy’s app,\" the spokesperson wrote.In an update Friday, an Envoy representative told SC Media they found log evidence of requests confirming that hackers obtained valid user credentials from an Atlassian employee account and used that access to download the affected data from Envoy’s app. The representative also claimed no other customer data was stolen.An Atlassian's representative also reached out to confirm that the leak began with compromised credentials.\"We learned the hacking group compromised Atlassian data from the Envoy app using an Atlassian employee’s credentials that had been mistakenly posted in a public repository by the employee. As such, the hacking group had access to data visible via the employee account which included the published office floor plans and public Envoy profiles of other Atlassian employees and contractors,\" the spokesperson wrote. \"The compromised employee’s account was promptly disabled early in the investigation which was proven effective in eliminating any further threat to Atlassian’s Envoy data. Atlassian product and customer data is not accessible via the Envoy app and therefore not at risk.\"Earlier this week, a hacking group calling itself “SiegedSec” began posting on Telegram that they had compromised Atlassian's network and leaked employee data in a Valentine’s Day-themed note, claiming to have obtained email addresses, phone numbers, and names of employees as well as “a lot more!”“SiegedSec is here to announce we have hacked the software company Atlassian,” the hackers wrote, according to a screenshot obtained by SC Media. “This company worth $44 billion has been pwned by the furry hackers uwu…We are leaking thousands of employee records as well as a few building floorplans. These employee records contain email addresses, phone numbers, names and lots more!”However, independent researchers corroborated some of Atlassian’s claims, including their core contention that the data leaked online does not appear to have been taken directly from Atlassian systems.Check Point researchers told SC Media the files and blueprints involved are consistent with the type of third-party data that Envoy would have stored and were stamped with Envoy’s logo. Lending further credence to the idea, despite claiming to have hacked directly into Atlassian’s systems, SiegedSec did not leak any other types of data.The data leaked does not appear to be particularly valuable, and researchers at Check Point said it's not clear whether SiegedSec's motivations are financial, self-promotional or simply to cause chaos.Derek is a senior editor and reporter at SC Media, where he has spent the past three years providing award-winning coverage of cybersecurity news across the public and private sectors. Prior to that, he was a senior reporter covering cybersecurity policy at Federal Computer Week. Derek has a bachelor’s degree in print journalism from Hofstra University in New York and a master’s degree in public policy from George Mason University in Virginia.Okta had 4,961 current and former employees' data, including names, health insurance plan numbers, and Social Security numbers, compromised following a breach at its third-party vendor Rightway Healthcare, reports The Register.Threat actors using private keys and passphrases from LastPass databases stolen in cyberattacks last August and December were reported by ZachXBT and MetaMask developer Taylor Monahan to have been able to exfiltrate $4.4 million worth of cryptocurrency on Oct. 25, BleepingComputer reports.The three companies claim no sensitive customer data was lost despite being targeted after the breach of the identity and access management firm.On-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-20",
      "title": "Mirai botnet variant V3G4 targeting 13 unpatched IoT vulnerabilities | SC Media",
      "text": "  Unit 42 researchers have observed threat actors leveraging a Mirai botnet variant called V3G4 in three campaigns targeting 13 unpatched vulnerabilities found in a range of IoT devices to propagate. A successful exploit could lead to remote code execution.The researchers examined these campaigns from July to December 2022 and found that, upon exploit, “the wget and curl utilities automatically executed to download Mirai client samples from malware infrastructure and then executed the downloaded bot clients.”“V3G4 inherits its most significant feature from the original Mirai variant — a data section with embedded default login credentials for the scanner and brute force purposes,” according to researchers. “Like the original Mirai, it also encrypts all credentials with XOR key 0x37.”Mirai is a well-known threat, known for evolving its tactics to exploit devices to its control and for expanding its botnet. Researchers have previously noted the variant leveraged effective brute forcing tactics and propagation techniques — highly effective for botnet operators. The threat actors behind Mirai were most recently observed exploiting a known critical vulnerability, CVE-2022-46169, found in the Cacti device monitoring tool. The attacks aimed to deliver Mirai malware and a PERL-based IRC botnet. Successful exploits spurred the launch of a host-based reverse shell.In the attempts observed by the researchers, the attacks used the known vulnerabilities to spread the V3G4 variant and targeted “exposed servers and networking devices running Linux.”Further, V3G4 will then initialize the table of telnet/SSH login credentials in the scanner function, before spreading through brute forcing network devices that leverage weak username and password combinations.Before the botnet client establishes a connection with the C2 server, the malware will first initialize all DDoS attack functions (shown in Figure 9). Once the client establishes a connection with the C2 server, the threat actor can issue commands to the client to launch DDoS attacks.The IoT devices targeted in these campaigns included FreePBX Elastix, Gitorious, FRITZ!Box Webcam, Mitel AWC, Geutebruck IP Cameras, Webmin, Spree Commerce, FLIR Thermal Camera, DrayTek Vigor, Airspan AirSpot, Atlassian Confluence, and C-Data Web Management System. The research contains links to the original CVE disclosures.The CVEs date as far back as 2012 and 2014, but also include several vulnerabilities reported in the last year. But all of the security bugs successfully targeted in these campaigns were left unpatched by the entity.What’s more, these vulnerabilities have a lower attack complexity than observed with previously observed botnet variants, but still manage to “maintain a critical security impact” able to enable remote code execution. As such, the researchers are urging entities to patch or apply the software update if possible.Researchers determined the campaigns were levied by the same threat actors. Forensic evidence revealed the use of the same hardcoded command and control (C2) domains, nearly identical malware shell script downloaders, and the same XOR decryption key used in each campaign.The samples also showed the same “stop list,” or the “list of target processes that the botnet client searches for and terminates,” as well as nearly identical functions in each.The tactics used in these campaigns aren’t new for Mirai, which is well known for its tactics that co-opt IoT devices for launching DDoS attacks. A spike in Mirai activity in February 2022 corresponded with the disclosure of Spring4Shell, a zero-day campaign on the Java web application framework, Spring Core.The voice of healthcare cybersecurity and policy for SC Media, CyberRisk Alliance, driving industry-specific coverage of what matters most to healthcare and continuing to build relationships with industry stakeholders.It’s clear iLeakage presents itself as a major flaw with no known mitigation and it’s a real problem for iOS devices – here are some ideas on how to respond. Malware distribution on Android devices has been facilitated by the new SecuriDropper dropper-as-a-service operation by evading Android 13's \"Restricted Settings\" functionality to breach \"Accessibility Services,\" BleepingComputer reports.Jamf says North Korean subgroup of the financially motivated Lazarus Group targets specific users the threat actors believe have access to cryptocurrency.   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-20",
      "title": "Threat Analysts Identity an Incredibly Sneaky Windows Backdoor - CySecurity News - Latest Information Security and Hacking Incidents",
      "text": "  your nameYour Emailyour message"
   },
   {
      "time": "2023-02-20",
      "title": "Inglis Retires as National Cyber Director Ahead of Biden's Cybersecurity EO",
      "text": " The first-ever National Cyber Director for the US, Chris Inglis, has stepped down from his post, announcing that he's leaving the public sector behind after nearly 30 years working at federal agencies. There are two notable advancements in the draft: implementing a set of mandatory regulations, and instituting a \"hack-back\" policy. Regarding the latter, the EO is expected to green-light the use of the full brunt of the US cyber arsenal to either retaliate for or preempt cyber incursions by threat groups (and nation-states) against US interests and assets, including private-sector companies.Copyright © 2023 Informa PLC Informa UK Limited is a company registered in England and Wales with company number 1072954 whose registered office is 5 Howick Place, London, SW1P 1WG."
   },
   {
      "time": "2023-02-20",
      "title": "Fortinet Issues Patches for 40 Flaws Affecting FortiWeb, FortiOS, FortiNAC, and FortiProxy",
      "text": " Two of the 40 flaws are rated Critical, 15 are rated High, 22 are rated Medium, and one is rated Low in severity.Top of the list is a severe bug residing in the FortiNAC network access control solution (CVE-2022-39952, CVSS score: 9.8) that could lead to arbitrary code execution.The products impacted by the vulnerability are as follows -CVE-2021-42756 affects the below versions of FortiWeb, with fixes available in versions FortiWeb 6.0.8, 6.1.3, 6.2.7, 6.3.17, and 7.0.0 -Both the flaws were internally discovered and reported by its product security team, Fortinet said. Interestingly, CVE-2021-42756 also appears to have been identified in 2021 but not publicly disclosed until now.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-02-20",
      "title": "BEC groups launch executive impersonation attacks in at least 13 languages | SC Media",
      "text": "  The two groups Abnormal Security identified are Midnight Hedgehog, which traffics in payment fraud, and Mandarin Capybara, a group that executes payroll diversion attacks. The two groups combined have launched BEC campaigns in Danish, Dutch, Estonian, French, German, Hungarian, Italian, Norwegian, Polish, Portuguese, Spanish, and Swedish.“These attacks demonstrate that BEC is a global issue and not just an English-only phenomenon,” said Crane Hassold, director of threat intelligence at Abnormal Security. “Our findings also show how cybercriminals are always looking to exploit various tools, such as Google Translate, to expand their potential victim population. This is why it’s so important for organizations to protect themselves with inbound defenses that look at potential threats holistically and leverage behavioral analytics to protect employees against these more dynamic, sophisticated threats.”  As someone living in Quebec, a French-speaking province in a country where English is more prevalent, I have personally noticed an increase in phishing and BEC using French, said Guillaume Ross, Deputy CISO at JupiterOne.“Believing you are safer on the internet because you are less of a target than English-speaking internet users is wrong, and becoming more wrong,” said Ross. “The same is true for organizations serving a large percentage of customers in other languages. As with many tools that democratize access to consuming or producing content, it’s impossible to reap the benefits without the potential negatives that come with them.”Patrick Harr, chief executive officer at SlashNext, added that BECs have always been perpetrated globally in multiple languages.“Therefore, it’s extremely critical to have technology that can detect BEC attacks in multiple languages that not only leverages relationship graph technology, but generative AI to understand relationship abnormalities and predict the intent of these specialized attacks,” said Harr.Four high-severity Microsoft Exchange flaws reported by Trend Micro's Zero Day Initiative were noted by Microsoft to have been addressed or not need immediate servicing as required authentication would significantly reduce their odds of being exploited, SecurityWeek reports.The Register reports that U.S. insurance and advisory services provider Hilb Group had 81,539 individuals' personal data compromised following a breach of employee email accounts earlier this year.SiliconAngle reports that more threat actors have launched increasingly sophisticated cyberattacks aimed at streaming platforms since the Hollywood actors and writers' strike commenced in July.Tue Nov 19   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-20",
      "title": "High-severity DLP flaw impacts Trellix for Windows | SC Media",
      "text": "  Leading data loss prevention (DLP) vendor Trellix is urging customers to patch a high-severity flaw that allows local attackers to bypass restrictions and exfiltrate sensitive data they wouldn’t otherwise have access to.While NIST rates the bug as high, Trellix believes the flaw poses less of a threat, rating it “medium severity”. The primary reasoning for the Trellix rating is that the vulnerability is only exploitable during the installation of the product. Mike Parkin, senior technical engineer at Vulcan Cyber, said while he believed the exploitation of the bug was unlikely, urged organizations that utilize DLP to prioritize installing the patch. “I don't want to over-state the issue, but it's not a zero-risk vulnerability,” he said.“In the very rare circumstances where this vulnerability could be exploited, it could effectively bypass DLP protections and let an attacker export valuable data,” he said.Trellix, formed last year out of McAfee Enterprise and FireEye, owns nearly a 12% market share of the $1.8 billion DLP products market and does business with some 40,000 business and government customers.Phil Neray, vice president of cyber defense strategy at CardinalOps, confirmed the fix is not as straightforward as IT staff would hope. Neray, who walked SC Media through the Trellix documentation Monday, said it looked like admins would have to upgrade multiple appliances and add certificates as well.The new PCI DSS standard puts more focus on application security, with more tools, testing and documentation required of developers.After exploiting MOVEit, GoAnywhere and PaperCut vulnerabilities the prolific Clop ransomware gang pivots and targets a SysAid zero-day server bug.Atlassian has confirmed exploitation of an already addressed Confluence Data Center and Server flaw, tracked as CVE-2023-22518, to facilitate ransomware deployment after a Rapid7 report observed related infections with the Cerber ransomware, which is long believed to be defunct, reports The Record, a news site by cybersecurity firm Recorded Future.Tue Oct 22On-Demand EventOn-Demand Event   \n        Copyright © 2023 CyberRisk Alliance, LLC All Rights Reserved.\n        This material may not be published, broadcast, rewritten or redistributed\n        in any form without prior authorization.\n      "
   },
   {
      "time": "2023-02-20",
      "title": "Belgium launches nationwide safe harbor for ethical hackers | The Daily Swig",
      "text": " Prototype pollutionPrototype pollution project yields another Parse Server RCEBug Bounty RadarThe latest programs for February 2023All Day DevOpsAppSec engineer keynote says Log4j revealed lessons were not learned from the Equifax breachInfosec beginner?A rough guide to launching a career in cybersecurityCybersecurity conferencesA schedule of events in 2022 and beyondNew legal protections for security researchers could be the strongest of any EU countryUPDATED Belgium has become the first European country to adopt a national, comprehensive safe harbor framework for ethical hackers, according to the country’s cybersecurity agency.The framework applies regardless of whether vulnerable technologies are owned by private or public sector organizations.Hackers need not notify the CCB where an organization already has a VDP, but may choose to do so if the vulnerability affects other organizations without VDPs, or “if difficulties arise” with disclosure and remediation.In common with most VDPs and bug bounty programs, offensive techniques such as phishing, social engineering, and brute force attacks “may be considered as disproportionate and/or unnecessary actions”.However, according to Valéry Vander Geeten, legal officer at the CCB, Belgium’s policy is the most comprehensive yet.He told The Daily Swig that the Netherlands indicates “that the Public prosecutor Office will not prosecute ethical hackers”, France and Slovakia fall short of “full legal protection”, and that Lithuania’s legal safe harbor is “limited to critical infrastructure”.He also emphasized that it protects vulnerability reporters regardless of whether they work for the organization whose technology is affected.Numerous other EU member states are developing, or planning to develop, similar nationwide protections for hackers.“I do hope that legislation like this will have the ‘GDPR’-effect that will effectively force companies to adopt this,” Inti De Ceukelaire, head of hackers at Belgium-based bug bounty platform Intigriti, told The Daily Swig.“Paradoxically, most security researchers are now delivering value and improvements to companies that want to listen and are already on board with the latest security trends, such as a VDP.“Applying that to companies that are completely new to this will have interesting results, I believe. In the Netherlands, where they have similar legislation, a hacker that goes by the name Victor Gevers (0xDUDE) on Twitter has already reported 5,000 vulnerabilities under this.”This article was updated on February 16 to clarify certain terms and terminology of the CVDPBurp SuiteVulnerabilitiesCustomersCompanyInsights© 2023 PortSwigger Ltd."
   },
   {
      "time": "2023-02-20",
      "title": "Russian cybersecurity expert convicted of charges in $90M hack-to-trade case | CyberScoop",
      "text": " \n\nFebruary 14, 2023\n\nA Russian national accused of hacking into two U.S. firms that prepare filings for publicly traded companies, and then trading on information before it was public, was found guilty by a federal jury in Boston Tuesday.“We are disappointed but respect the jury’s verdict,” Maksim Nemtsev, Klyushin’s attorney, told CyberScoop. “We intend to appeal the various issues including the admissibility of prejudicial statistical evidence, as well as the novel theories of stock fraud and venue that have never before been reviewed or adopted by the First Circuit or the Supreme Court.”Yermakov and the other defendants — Nikolai Rumiantcev, Mikhail Irzak and Igor Sladkov — were never arrested.M-13 offers a variety of services including penetration testing, advanced persistent threat (APT) emulation, consulting, social media monitoring and cybersecurity audits, according to the company’s website. The company also claims its products are used by “the Presidential Administration of the Russian Federation, the Government of the Russian Federation,” other government agencies and private companies.In a statement issued shortly after the jury’s decision, United States Attorney Rachael s. Rollins said: “This case demonstrates the Department of Justice’s commitment to protecting our financial markets and computer networks by aggressively pursuing those who seek to profit unfairly through intrusive cyber-attacks.”She added: “My office and our law enforcement partners will continue our work to identify, prosecute and hold accountable criminals like Klyushin regardless of where they reside or the manner in which they try to conceal their illegal activities. Cybercriminals be warned: we will use every tool at our disposal to track you down and you will end up as a defendant in a courtroom.”"
   },
   {
      "time": "2023-02-17",
      "title": "Frebniis: New Malware Abuses Microsoft IIS Feature to Establish Backdoor | Symantec Enterprise Blogs",
      "text": " The malware, dubbed Frebniis (Backdoor.Frebniis), was used by a currently unknown threat actor against targets in Taiwan.The technique used by Frebniis involves injecting malicious code into the memory of a DLL file (iisfreb.dll) related to an IIS feature used to troubleshoot and analyze failed web page requests. This allows the malware to stealthily monitor all HTTP requests and recognize specially formatted HTTP requests sent by the attacker, allowing for remote code execution. In order to use this technique, an attacker needs to gain access to the Windows system running the IIS server by some other means. In this particular case, it is unclear how this access was achieved.IIS is a general-purpose web server that runs on Windows systems to serve requested HTML pages or files. An IIS web server accepts requests from remote client computers and returns the appropriate response. IIS has a feature known as Failed Request Event Buffering (FREB) that collects data and details about requests, such as originating IP address and port, HTTP headers with cookies, etc.A feature called Failed Request Tracing can be used to troubleshoot IIS failed requests. Failed Request Tracing buffers the trace events for a request and flushes them to disk if the request meets the definition of “fail” set by the user. Failed request tracing can, for example, be used to learn why requests are returning a specific HTTP status code (401 or 404, etc.), or why a request is taking too long to process, or is not responding.Frebniis ensures Failed Request Tracing is enabled and then accesses w3wp.exe (IIS) process memory, obtaining the address of where the Failed Request Event Buffering code (iisfreb.dll) is loaded.  With this code start address, Frebniis searches from there for a function pointer table to hijack code execution.The authors of Frebniis have determined that a particular function pointer within iisfreb.dll is called by iiscore.dll whenever any HTTP request is made to IIS from a web client. This function normally checks if the content of the HTTP request matches the Failed Request Tracing rules. Frebniis hijacks this function by injecting its own malicious code into IIS process memory and then replacing this function pointer with the address of its own malicious code. This hijack point allows Frebniis to stealthily receive and inspect every HTTP request to the IIS server before returning to the original function.The Frebniis malicious injected code parses all received HTTP POST requests for /logon.aspx or /default.aspx along with a parameter password set to ‘7ux4398!’. If the password matches, Frebniis decrypts and executes a section of the injected code, which is .NET executable code consisting of the main backdoor functionality. No executables are saved to disk in this process, keeping the backdoor completely stealthy.The .NET code provides proxying functionality and remote code execution controlled by a provided second HTTP parameter that is a Base64 encoded string.To enable the proxy, the encoded string is Base64 decoded and then decrypted (xor 0x08), with the first character representing a proxy command followed by expected parameters. The proxy is used to send and receive Base64 encoded data from other computer systems. This allows the attackers to communicate with internal resources that may normally be blocked from the internet via the compromised IIS server.The .NET backdoor code also supports remote execution. If an HTTP call to logon.aspx or default.aspx is received without the password parameter, but with the Base64 string, the Base64 string is assumed to be C# code that will be executed straight in memory. The Base64 string is decoded and then decrypted (xor 0x08) and is expected to be an XML document with the C# code to be executed in the ‘/doc’ node under the ‘data’ attribute (E.g. <doc data=C# code>).  The C# code is extracted and executed. This allows Frebniis to stealthily execute arbitrary code on the system.By hijacking and modifying IIS web server code, Frebniis is able to intercept the regular flow of HTTP request handling and look for specially formatted HTTP requests. These requests allow remote code execution and proxying to internal systems in a stealthy manner. No files or suspicious processes will be running on the system, making Frebniis a relatively unique and rare type of HTTP backdoor seen in the wild.If an IOC is malicious and the file available to us, Symantec Endpoint products will detect and block that file.6464f9a5da26aa53fb2221255e908fd4da8edf0633f94051beee74a14b9b001c – Backdoor.Frebniisb81c177c440e84635f22dc97b0411de93a24a983a41af676ffbbb4439487aaef – Backdoor.FrebniisThe Threat Hunter Team is a group of security experts within Symantec whose mission is to investigate targeted attacks, drive enhanced protection in Symantec products, and offer analysis that helps customers respond to attacks.We encourage you to share your thoughts on your favorite social platform."
   },
   {
      "time": "2023-02-17",
      "title": "New Mirai malware variant infects Linux devices to build DDoS botnet",
      "text": " A new Mirai botnet variant tracked as ‘V3G4’ targets 13 vulnerabilities in Linux-based servers and IoT devices to use in DDoS (distributed denial of service) attacks.The malware spreads by brute-forcing weak or default telnet/SSH credentials and exploiting hardcoded flaws to perform remote code execution on the target devices. Once a device is breached, the malware infects the device and recruits it into its botnet swarm.Unit 42 believes all three attack waves originate from the same threat actor because the hardcoded C2 domains contain the same string, the shell script downloads are similar, and the botnet clients used in all attacks feature identical functions.V3G4 attacks begin with the exploitation of one of the following 13 vulnerabilities:After compromising the target device, a Mirai-based payload is dropped on the system and attempts to connect to the hardcoded C2 address.The botnet also attempts to terminate a set of processes from a hardcoded list, which includes other competing botnet malware families.A characteristic that differentiates V3G4 from most Mirai variants is that it uses four different XOR encryption keys instead of just one, making reverse engineering the malware’s code and decoding its functions more challenging.When spreading to other devices, the botnet uses a telnet/SSH brute-forcer that tries to connect using default or weak credentials. Unit 42 noticed earlier malware variants used both telnet/SSH brute-forcing and vulnerability exploitation for spreading, while later samples did not use the scanner.Finally, compromised devices are issued DDoS commands directly from the C2, including TCP, UDP, SYN, and HTTP flooding methods.V3G4 likely sells DDoS services to clients who want to cause service disruption to specific websites or online services.However, this variant has not been tied to a particular service at this time.As always, the best way to protect your devices from Mirai-like infections is to change the default password and install the latest security updates."
   },
   {
      "time": "2023-02-17",
      "title": "Espionage malware targeted telecoms in Middle East using Microsoft, Google, Dropbox tools",
      "text": " An espionage campaign targeting telecommunications providers across the Middle East hid its activities through a range of popular tools from Microsoft, Google and Dropbox, according to a report released Thursday.Researchers at cybersecurity company SentinelOne named the campaign “WIP26” — work in progress — because they were unable to attribute it to any actor or country.Microsoft Azure and Dropbox instances were used to hold stolen data and host malware that abused Microsoft 365 Mail and Google Firebase services.“The WIP26 activity is initiated by precision targeting of employees through WhatsApp messages that contain Dropbox links to a malware loader,” the researchers said. “Tricking employees into downloading and executing the loader ultimately leads to the deployment of backdoors that leverage Microsoft 365 Mail and Google Firebase instances” as command-and-control servers for the malware.The WhatsApp messages contained Dropbox links that had files about poverty-related issues in Afghanistan. The backdoors — code used to break into systems — masqueraded as PDF editors, browsers or other software. One of the backdoors that came with the Dropbox files — CMD365 — was used for “reconnaissance, privilege escalation, staging of additional malware, and data exfiltration” according to SentinelOne. “The exfiltrated data included users’ private browser data and reconnaissance information on particular high-value hosts in the victim’s network. This is a typical precursor to the subsequent targeting of these hosts,” they added. SentinelOne said it notified Microsoft, Google and Dropbox about the campaign and explained that telecoms are frequent targets for espionage because they carry troves of sensitive information.They also allow hackers to target the private information of specific users and gain specific data on networks of high value. The company worked on the report with German security firm QGroup and said the perpetrators of the campaign made several mistakes that gave researchers insight into their work, including an exposed JSON file that is still publicly accessible. Part of why government-backed hackers use public cloud infrastructure is so that their activity blends into the typical traffic seen by network defenders. Jonathan Greig is a Breaking News Reporter at Recorded Future News. Jonathan has worked across the globe as a journalist since 2014. Before moving back to New York City, he worked for news outlets in South Africa, Jordan and Cambodia. He previously covered cybersecurity at ZDNet and TechRepublic.© Copyright 2023 | The Record from Recorded Future News"
   },
   {
      "time": "2023-02-17",
      "title": "Microsoft Exchange ProxyShell flaws exploited in new crypto-mining attack",
      "text": " A new malware dubbed 'ProxyShellMiner' exploits the Microsoft Exchange ProxyShell vulnerabilities to deploy cryptocurrency miners throughout a Windows domain to generate profit for the attackers.ProxyShell is the name of three Exchange vulnerabilities discovered and fixed by Microsoft in 2021. When chained together, the vulnerabilities allow unauthenticated, remote code execution, letting attackers take complete control of the Exchange server and pivot to other parts of the organization's network.In attacks seen by Morphisec, the threat actors exploit the ProxyShell flaws tracked as CVE-2021-34473 and CVE-2021-34523 to gain initial access to the organization's network.Next, the threat actors drop a .NET malware payload into the NETLOGON folder of the domain controller to ensure that all devices on the network run the malware.For the malware to activate, it requires a command line parameter that also dubs as a password for the XMRig miner component.\"Then, it uses a C# compiler CSC.exe with \"InMemory\" compile parameters to execute the next embedded code modules.\"In the next phase, the malware downloads a file named \"DC_DLL\" and performs .NET reflection to extract arguments for the task scheduler, XML, and the XMRig key. The DLL file is utilized for the decryption of additional files.A second downloader establishes persistence on the infected system by creating a scheduled task that is configured to run upon the user's login. Finally, the second loader is downloaded from a remote resource, along with four other files.That file decides which browser of those installed on the compromised system will be used for injecting the miner into its memory space, using a technique known as \"process hollowing.\" After that, it picks a random mining pool from a hardcoded list, and the mining activity begins.The final step in the attack chain is to create a firewall rule that blocks all outgoing traffic, which applies to all Windows Firewall profiles.The purpose of this is to make it less likely for defenders to detect infection markers or receive any alerts about a potential compromise from the breached system.To evade security tools that monitor process runtime behavior, the malware waits at least 30 seconds after the browser's hollowing before creating the firewall rule. Possibly, the miner continues to communicate with its mining pool via a backdoor that isn't monitored by security tools.Morphisec warns that the impact of the malware goes beyond causing service outages, degrading server performance, and overheating computers.Once the attackers have gained a foothold in the network, they can do anything from backdoor deployment to code execution.To address the risk of ProxyShellMiner infections, Morphisec advises all admins to apply available security updates and use comprehensive and multi-faceted threat detection and defense strategies."
   },
   {
      "time": "2023-02-17",
      "title": "Scandinavian Airlines says cyberattack caused passenger data leak",
      "text": " Scandinavian Airlines (SAS) has posted a notice warning passengers that a recent multi-hour outage of its website and mobile app was caused by a cyberattack that also exposed customer data.The cyberattack caused some form of a malfunction on the airline's online system, causing passenger data to become visible to other passengers. This data includes contact details, previous and upcoming flights, as well the last four digits of the credit card number.The airline, which operates a fleet size of 131 aircraft and flies people to 168 destinations, says the risk of this exposure is minimal, as the leaked financial information is only partial and cannot be easily exploited. Also, it clarifies that no passport details have been exposed.However, full names and contact information is enough to allow threat actors and scammers to perform targeted phishing attacks if they accessed the exposed data during the attack.\"We always cooperate with the national CAA (Civil Aviation Agency), police, and security police when security matters are concerned – irrespective of the issue in question,\" concludes the SAS statement.\"We are monitoring the situation closely and continue the work to analyze and evaluate the attack and related consequences, as well as take preventive measures.\"The threat actors state they attacked SAS due to an event that took place in front of the Turkish embassy in Stockholm, Sweden, on January 21, 2023, where a far-right nationalist group burnt a copy of the Holy Quran in protest to Turkey's objections over Sweden's NATO membership bid.This act has drawn condemnation from Muslims worldwide, Sudan included. SAS being the flagship carrier of Sweden (and also Denmark and Norway) became a target for hacktivists seeking to express their condemnation.The same group of actors hit SVT earlier this week, forcing Sweden's national public television broadcaster into a temporary outage. "
   },
   {
      "time": "2023-02-17",
      "title": "\r\n\tHackers Leverage PayPal to Send Malicious Invoices - Infosecurity Magazine\r\n",
      "text": " Freelance JournalistThreat actors have been leveraging the online payments system PayPal to send malicious invoices directly to users through the platform.The phishing email seen as part of the malicious campaign warned users that there had been fraud on the account and threatened a fine of $699.99 should the victim not take action.However, Avanan marketing content manager Jeremy Fuchs wrote that the body of the email could alert some cautious users that the email was not authentic.“First, the grammar and spelling is all over the place. Second, the phone number they list is not related to PayPal.”At the same time, Fuchs said some users may still decide to call the phone number to get more information about the email.“The general goal is to call the number or follow up for more details. If you call that number, now they have your cell phone number and can use it for more attacks. And it’s another chance to scam you on the phone.”According to the Avanan team, the perks of using PayPal for threat actors are several, including the ability to send many invoices at a time and make them professional-looking.“Beyond that, the email comes directly from PayPal. The email itself is not malicious–there are countless legitimate invoices sent via PayPal every day. An email coming from service@paypal.com will pass all SPF, DKIM and DMARC checks.”To guard against attacks like this, Avanan recommends security teams research phone numbers found in emails before calling them. They should also implement advanced methods to ascertain whether an email is clean and encourage a culture of transparency for users to ask for help from IT if necessary."
   },
   {
      "time": "2023-02-17",
      "title": "Researchers Link SideWinder Group to Dozens of Targeted Attacks in Multiple Countries",
      "text": " The prolific SideWinder group has been attributed as the nation-state actor behind attempted attacks against 61 entities in Afghanistan, Bhutan, Myanmar, Nepal, and Sri Lanka between June and November 2021.Of the 61 potential targets compiled by Group-IB, 29 of them are located in Nepal, 13 in Afghanistan, 10 in Myanmar, six in Sri Lanka, and one is based out of Bhutan.Typical attack chains mounted by the adversary start with spear-phishing emails containing an attachment or a booby-trapped URL that directs the victims to an intermediary payload that's used to drop the final-stage malware.SideWinder is also said to have added a slate of new tools to its operation, including a remote access trojan and an information stealer written in Python that's capable of exfiltrating sensitive data stored in a victim's computer via Telegram.\"Advanced attackers have started preferring Telegram over traditional command and control servers due to its convenience,\" Group-IB said.The Singapore-headquartered company further said it uncovered evidence tying the actor to a 2020 attack aimed at the Maldivian government, in addition to establishing infrastructure and tactical overlaps between SideWinder, Baby Elephant, and DoNot Team.\"This information suggests that state-sponsored threat actors are happy to borrow tools from one another and adjust them for their needs,\" Group-IB said.The ability of the threat actor to continuously refine its toolset based on its evolving priorities makes it a particularly dangerous actor operating in the espionage area.\"The group obviously has considerable financial resources and is most likely state-sponsored, given the fact that SideWinder has been able to be active for so long, develop new tools, and maintain a fairly large network infrastructure.\"Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-02-17",
      "title": "Researchers Hijack Popular NPM Package with Millions of Downloads",
      "text": " A popular npm package with more than 3.5 million weekly downloads has been found vulnerable to an account takeover attack.While npm's security protections limit users to have only one active email address per account, the Israeli firm said it was able to reset the GitHub password using the recovered domain.The attack, in a nutshell, grants a threat actor access to the package's associated GitHub account, effectively making it possible to publish trojanized versions to the npm registry that can be weaponized to conduct supply chain attacks at scale.This is achieved by taking advantage of a GitHub Action that's configured in the repository to automatically publish the packages when new code changes are pushed.\"Even though the maintainer's npm user account is properly configured with [two-factor authentication], this automation token bypasses it,\" Bogdan Kortnov, co-founder and CTO of Illustria, said.Illustria did not disclose the name of the module, but noted that it reached out to its maintainer, who has since taken steps to secure the account.Join us for our webinar to learn how to tackle challenges, launch a program, and choose the right solution.Join the conversation to learn how to combat Zenbleed and Kubernetes attacks.Sign up for free and start receiving your daily dose of cybersecurity news, insights and tips."
   },
   {
      "time": "2023-02-17",
      "title": "Burton Snowboards cancels online orders after 'cyber incident'",
      "text": " Burton Snowboards, a leading snowboard manufacturing company, has canceled all online orders today following what it describes as a \"cyber incident.\"\"We are currently experiencing a system outage due to a recent cyber incident and are unable to process online orders at this time,\" the snowboarding brand says in a prominent alert on its website.In a separate statement, Burton said that it's currently investigating the incident with the help of outside experts to establish its impact.While the company is working on restoring business operations that were impacted, orders are no longer being processed.\"We are also making every effort to get our operations back up and running, but unfortunately are not able to process orders at this time.\"​The company did not provide details on the nature of this \"cyber incident\" but will likely update its statement once the ongoing investigation is concluded.A Burton Snowboards spokesperson was unavailable for comment when contacted by BleepingComputer today.Founded in 1977 by Jake Burton Carpenter, Burton is now one of the most well-known snowboard brands and its products are sold in thousands of stores worldwide.Burton's headquarters are in Burlington, Vermont, but it also has offices in Australia, Austria, Canada, California, China, and Japan."
   },
   {
      "time": "2023-02-17",
      "title": "Biden’s national cyber strategy to move risk from end users to technology producers",
      "text": " The Biden administration’s long-awaited national cyber strategy calls for “fundamental shifts” in how the U.S. will protect itself in cyberspace, a senior official told the Munich Cyber Security Conference on Thursday.Kemba Walden, the acting national cyber director, said the new strategy will entail a move to lift the “responsibility for cybersecurity risks… off of end users and put it on to producers.” It would also entail shifting the burden from state governments to the federal level. Walden said the plan would “hopefully” be published soon but cautioned that “the strategy is only as good as the implementation plan.” She characterized it as “forward-leaning and quite bold.”“We’ve been playing whack-a-mole for a long time. We’ve been allowing the adversary in a lot of ways to set our agenda. This is our opportunity now to get in front of that,” she said. “And then what do you do with that residual risk? We have to incentivize long-term strategic investment. That means ensuring that the technology, the people, and the process remain resilient, remain reliable, and remain safe.”Alexander Martin is the UK Editor for Recorded Future News. He was previously a technology reporter for Sky News and is also a fellow at the European Cyber Conflict Research Initiative.© Copyright 2023 | The Record from Recorded Future News"
   }
]